[
    {
        "ch": 111,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 111,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 383,
                "topic": "Abu Lahab: <i>‘Abdul-‘Uzza</i>",
                "verses": null
            },
            {
                "id": 11177,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6"
            },
            {
                "id": 11609,
                "topic": "Moral Traits: calling nicknames",
                "verses": "49:12"
            },
            {
                "id": 13827,
                "topic": "Perish",
                "verses": "3:120, 4:89, 4:144, 7:100, 7:156, 7:171, 8:43, 9:120, 11:61, 11:96, 11:116, 12:86, 17:103, 18:36, 20:17, 20:62, 20:82, 21:19, 28:89, 40:79, 40:86, 92:12"
            },
            {
                "id": 14504,
                "topic": "Prophecies in the Holy Qur’an: about: wars, earthquakes",
                "verses": "22:2-3, 18:48, 55:32, 69:2-4, 101:2-10"
            },
            {
                "id": 15445,
                "topic": "Relatives: <i>Aqrabun</i>",
                "verses": "4:2, 2:84, 2:178, 2:181, 2:216, 4:9, 4:12, 4:24, 4:37, 13:24, 16:91, 17:27, 30:39, 33:7, 40:9"
            },
            {
                "id": 16006,
                "topic": "Safa wa Marwah",
                "verses": "2:159, 2:197, 2:204, 26:215, 37:103"
            },
            {
                "id": 18594,
                "topic": "West",
                "verses": "2:116, 2:143, 2:178, 2:259, 18:87, 26:29, 28:45, 55:18, 70:41, 73:10"
            }
        ],
        "ar": "تَبَّتۡ یَدَاۤ  اَبِیۡ  لَہَبٍ وَّ  تَبَّ ؕ﴿۲﴾ ",
        "ur": "ابو لَہب کے دونوں ہاتھ ہلاک ہوئے اور وہ بھی ہلاک ہوگیا۔",
        "v5": {
            "text": "[b]Perish the two hands of Abu Lahab, and perish he![4863]",
            "notes": [
                {
                    "ref": "b",
                    "note": "108:4."
                },
                {
                    "ref": "4863",
                    "note": "<p><strong>Important Words:</strong></p><p>یدان (two hands), is the dual form of ید which among other things means, power, influence; assistance, help, protection; troops, host, army; possession; wealth (Lane). See also 5:65, &amp; 38:46.</p><p>تب (perish) means, he suffered loss; he became lost; he perished; he died. تباب , تبیب and تب (<i>tabbun</i>) are all infinitive nouns meaning, loss; death; destruction; perdition. They say تباله i.e. may he perish; may perdition be his lot. تبت یدہ also means, may he perish (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>ابولھب (Father of Flame) was the nick name of ‘Abdul-‘Uzza, the Holy Prophet’s uncle and his inveterate enemy and persecutor. He was so called either because his complexion and hair were ruddy or because he had a fiery temper. The <i>Surah</i> recalls an incident during the early preachings of the Holy Prophet. On being informed by God to call together his relatives and to deliver to them the Divine Message the Holy Prophet stood on the Mount Safa and called the different Meccan tribes by name—the tribes of Lawwi, Murra, Kilab and Qussayy, and his near relatives, and told them that he was God’s Messenger, and that if they did not accept his Message and did not give up their evil ways, Divine punishment would overtake them. The Holy Prophet had hardly finished his speech, when Abu Lahab stood up and said, تبالک ألھذا جمعتنا ھذا الیوم i.e. ruin seize thee, is it for this that thou hast called us together (Bukhari).</p><p>The sobriquet \"Father of Flame\" may either refer to the Holy Prophet’s uncle or to any hot tempered enemy of Islam or better still it may apply to the western powers of the latter days who own and control atomic and nuclear weapons—one group of them repudiating God altogether, and the other denying His Unity but both being equally opposed to Islam. In this sense \"the two hands\" would signify these two groups.</p><p>The verse purports to say that all endeavours and machinations of the enemies of Islam, particularly of the two groups of western powers and their satellites, would utterly fail and all their nefarious designs would recoil on their own heads; they would burn with rage at seeing Islam progressing, and their own wealth, power and possessions (أید) perishing before their very eyes.</p>"
                }
            ]
        }
    },
    {
        "ch": 111,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 383,
                "topic": "Abu Lahab: <i>‘Abdul-‘Uzza</i>",
                "verses": null
            },
            {
                "id": 18548,
                "topic": "Wealth: avails naught",
                "verses": "104:3-5, 3:11, 3:15, 26:89, 34:35-38, 58:18, 69:29, 92:12, 102:2-9"
            },
            {
                "id": 18594,
                "topic": "West",
                "verses": "2:116, 2:143, 2:178, 2:259, 18:87, 26:29, 28:45, 55:18, 70:41, 73:10"
            }
        ],
        "ar": "مَاۤ  اَغۡنٰی عَنۡہُ  مَالُہٗ  وَ  مَا کَسَبَ ؕ﴿۳﴾",
        "ur": "اُس کے کچھ کام نہ آیا اُس کا مال اور جو کچھ اُس نے کمایا۔",
        "v5": {
            "text": "[a]His wealth and what he has earned shall avail him not.[4864]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:11; 58:18."
                },
                {
                    "ref": "4864",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse appropriately may also apply to the wealthy western powers who have great material resources at their disposal. The words \"his wealth\" may mean the wealth produced in their own countries, and \"what he has earned\" may signify the riches they have earned by exploiting weaker nations and despoiling them of their natural resources.</p>"
                }
            ]
        }
    },
    {
        "ch": 111,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 383,
                "topic": "Abu Lahab: <i>‘Abdul-‘Uzza</i>",
                "verses": null
            },
            {
                "id": 5815,
                "topic": "Day of Reckoning: <i>Yaumul-Hisab</i>",
                "verses": "38:17, 14:42, 38:27, 38:54, 39:25, 39:60, 40:28, 46:21, 58:19, 78:4, 80:37, 83:6"
            },
            {
                "id": 7613,
                "topic": "Fire: <i>An-Nar</i>: of Hell",
                "verses": "52:14, 2:25, 2:40, 2:81, 2:82, 2:127, 2:168, 2:175-176, 2:202, 2:218, 2:222, 2:258, 3:11, 3:17, 3:25, 3:103, 3:117, 3:132, 3:152, 3:186, 3:192-193, 4:15, 4:31, 5:30, 7:37, 7:39, 8:15, 9:17, 10:9, 11:17, 13:6, 14:31, 16:63, 18:30, 21:40, 22:20, 23:105, 24:58, 28:42, 29:26, 66:7"
            },
            {
                "id": 8824,
                "topic": "Hell: <i>Jahannam</i>: fuel and fire of",
                "verses": "19:69, 2:25, 2:168, 3:11, 4:57, 5:38, 7:42, 14:51, 17:98, 18:30, 21:99, 25:12-13, 32:21, 39:17, 40:47, 66:7, 74:29-30, 74:27-30, 74:32, 77:33-34, 87:13, 88:4-5, 92:15, 101:11-12, 104:6-8"
            },
            {
                "id": 14479,
                "topic": "Prophecies in the Holy Qur’an: about: latter days",
                "verses": "81:2-19, 16:9, 17:105, 36:42-43, 61:10, 77:11-12, 82:2-5, 84:2-5, 99:2-9"
            },
            {
                "id": 18594,
                "topic": "West",
                "verses": "2:116, 2:143, 2:178, 2:259, 18:87, 26:29, 28:45, 55:18, 70:41, 73:10"
            }
        ],
        "ar": "سَیَصۡلٰی نَارًا ذَاتَ  لَہَبٍ ۚ﴿ۖ۴﴾ ",
        "ur": "وہ ضرور ایک بھڑکتی ہوئی آگ میں داخل ہوگا۔",
        "v5": {
            "text": "Soon shall he burn in a flaming fire;[4865]",
            "notes": [
                {
                    "ref": "4865",
                    "note": "<p><strong>Commentary:</strong></p><p>The expression أبولھب may also mean, one who invents something which produces fire and flames, or one who is himself consumed in the flames of fire. In this sense, the verse may be interpreted as predicting the destruction of the two major political Blocs of the latter days by their own fire-producing weapons, such as atom bombs and other nuclear weapons. The verse also shows that the day of reckoning for these nations is not far off. It seems to have already arrived.</p>"
                }
            ]
        }
    },
    {
        "ch": 111,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 383,
                "topic": "Abu Lahab: <i>‘Abdul-‘Uzza</i>",
                "verses": null
            },
            {
                "id": 12894,
                "topic": "Nations",
                "verses": "11:102, 2:245, 2:262, 2:270, 3:27-28, 3:140, 7:35, 10:25, 17:17, 21:97, 21:105, 23:81, 29:21, 29:25, 31:30, 35:10, 36:69, 38:54, 83:2-6, 90:14-18, 103:2-4"
            },
            {
                "id": 15955,
                "topic": "Rope: <i>Habl</i>",
                "verses": "3:104, 3:113, 7:41, 22:16, 50:17, 111:6"
            },
            {
                "id": 16922,
                "topic": "Slander",
                "verses": "24:20, 24:5-10, 24:15, 24:22, 24:27, 104:2"
            },
            {
                "id": 18594,
                "topic": "West",
                "verses": "2:116, 2:143, 2:178, 2:259, 18:87, 26:29, 28:45, 55:18, 70:41, 73:10"
            }
        ],
        "ar": "وَّ  امۡرَاَتُہٗ ؕ حَمَّالَۃَ  الۡحَطَبِ ۚ﴿۵﴾ ",
        "ur": "اور اُس کی عورت بھی، اس حال میں کہ وہ بہت ایندھن اٹھائے ہوئے ہوگی۔",
        "v5": {
            "text": "And his wife the carrier of the firewood.[4865A]",
            "notes": [
                {
                    "ref": "4865A",
                    "note": "<p><strong>Commentary:</strong></p><p>حمالة الحطب (the carrier of firewood). حطب is inf. noun from حطب (<i>hataba</i>) which means, he collected firewood, حطب به means he slandered him. They say ھو یحمل الحطب بین الناس i.e. he goes about spreading calumny or slander among the people (Lane &amp; Aqrab).</p><p>امرأته (his wife) is syn. with زوج which among other things means, an associate, a comrade, wife (Lane).</p><p><strong>Commentary:</strong></p><p>The reference in the verse seems to be to Abu Lahab’s wife, Ummi Jamil who strewed the Holy Prophet’s path with thorns and went about spreading calumnies against him. The verse may also apply to people in Western democracies or in the Communist bloc who spread calumnies and false accusations against Islam and urge their leaders to break its power. The verse may also signify that these nations would be constantly engaged in manufacturing weapons for their own destruction.</p>"
                }
            ]
        }
    }
]
