[
    {
        "ch": 66,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[4277]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                },
                {
                    "ref": "4277",
                    "note": "<p><strong>Commentary:</strong></p><p>See 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 8945,
                "topic": "Honey: <i>‘Asl</i>",
                "verses": "16:70, 2:58, 47:16"
            },
            {
                "id": 10407,
                "topic": "Lawful: <i>Halal</i>",
                "verses": "2:169, 2:174, 2:188, 2:276, 4:24-25, 5:2, 5:5-6, 5:88, 5:89, 5:97, 6:119-120, 8:70, 10:60, 16:115, 16:117"
            },
            {
                "id": 11027,
                "topic": "Mariah Qibtiyah(ra)",
                "verses": null
            },
            {
                "id": 11058,
                "topic": "Marriage: of Holy Prophet<sup>(sa)</sup>",
                "verses": "33:51-53, 33:7"
            },
            {
                "id": 12418,
                "topic": "Muhammad<sup>(sa)</sup>: Divine solicitude for",
                "verses": "8:68, 9:43, 33:38, 80:2-12"
            },
            {
                "id": 12511,
                "topic": "Muhammad<sup>(sa)</sup>: marriages of",
                "verses": "33:51-53, 33:7, 33:29-35, 33:38-39"
            },
            {
                "id": 17195,
                "topic": "Spouse: <i>Zauj</i>: mate",
                "verses": "2:26, 4:2, 2:36, 2:103, 2:231, 2:233, 2:235, 2:241, 4:13, 4:21, 7:20, 7:190, 13:39, 16:73, 20:118, 21:91, 23:6-7, 24:7, 25:75, 26:167, 30:22, 33:5, 33:7, 33:29, 33:38, 33:53, 33:60, 36:57, 39:7, 58:2, 60:12, 64:15, 66:4, 66:6"
            },
            {
                "id": 18202,
                "topic": "Unlawful: <i>Haram</i>",
                "verses": "2:174, 2:276, 4:24, 4:25, 5:4, 5:73, 5:88, 6:120, 6:122, 6:146, 6:152, 7:33-34, 7:51, 7:158, 16:116, 17:34, 25:69"
            },
            {
                "id": 18798,
                "topic": "Wives of the Holy Prophet<sup>(sa)</sup>",
                "verses": "33:29-35, 11:74, 19:29, 24:12-19, 33:7, 33:51-56, 33:60"
            }
        ],
        "ar": "یٰۤاَیُّہَا النَّبِیُّ  لِمَ  تُحَرِّمُ مَاۤ  اَحَلَّ اللّٰہُ  لَکَ ۚ تَبۡتَغِیۡ  مَرۡضَاتَ  اَزۡوَاجِکَ ؕ وَ اللّٰہُ  غَفُوۡرٌ  رَّحِیۡمٌ ﴿۲﴾ ",
        "ur": "اے نبی! تُو کیوں حرام کررہا ہے جسے اللہ نے تیرے لئے حلال قرار دیا ہے۔ تُو اپنی بیویوں کی رضا چاہتا ہے اور اللہ بہت بخشنے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "O Prophet! why dost thou forbid <i>thyself</i> that which Allah has made lawful to thee. Thou seekest the pleasure of thy wives? And Allah is Most Forgiving, Merciful.[4278]",
            "notes": [
                {
                    "ref": "4278",
                    "note": "<p><strong>Commentary:</strong></p><p>It is related that one day one of the wives of the Holy Prophet gave him a drink made from honey, which he seemed to like. Some of his other wives, out of pique, pointed out to him that his breath smelt of <i>Maghafir</i>, a shrub the taste of which resembled that of honey but having a bad smell. The Holy Prophet, because of his delicate nature, promised not to take honey any more (Buldan). It is to this incident that the verse under comment is generally taken to refer. But it seems improbable that the Holy Prophet, merely to satisfy the pique of his wife or wives, should have taken such a drastic step as to have forbidden himself the use of some-thing which was lawful, particularly that in which, according to the Quran, \"there is cure for men\" (16:70). It appears the narrator or narrators of this incident in the traditions suffered from some misunderstanding or confusion, particularly when, accor-ding to one tradition, the Holy Prophet took honey from the house of Zainab, and it were ‘A’ishah and Hafsah who contrived to draw him into making the aforesaid promise, while, according to another tradition, it was at the house of Hafsah that he was served with honey and that the wives who objected were ‘A’ishah, Zainab and Safiyya. It appears, moreover, that according to the hadith, two, or at the most three, of the Holy Prophet’s wives were concerned in the incident, but, according to vv. 2 &amp; 6 of the present <i>Surah</i>, all were connected with it, two of them taking a leading part (v.5). These considerations indicate that the <i>Surah</i> refers to some incident of much greater significance than the mere taking of honey by the Holy Prophet at the house of one of his wives and of having been drawn into making a promise not to take it anymore. In the commentary on this <i>Surah</i>, Bukhari (<i>Kitabul-Mazalim wal Ghasb</i>) quotes Ibn ‘Abbas as relating that he was always on the lookout to enquire of ‘Umar as to who were the two wives to whom reference had been made in the verse: \"Now, if you two turn unto Allah, it will be better for you, and your hearts are already so inclined.\" One day, finding ‘Umar alone, he sought to satisfy his curiosity. He had hardly finished his question, says Ibn ‘Abbas, when ‘Umar said that they were ‘A’ishah and Hafsah and then proceeded to relate the story: \"Once, when my wife offered me her advice concerning some domestic affair, I curtly told her that it was no business of hers to advise me, for in those days we did not hold our womenfolk in much respect. My wife sternly replied: 'Your daughter Hafsah takes so much liberty with the Holy Prophet that she retorts back, when he says something not to her liking till he feels offended, and you do not allow me to speak to you even about our domestic affairs.' Upon this I went to Hafsah and sternly told her that she should not be misled by ‘A’ishah in this matter as she was nearer to the Prophet’s heart. Then I went to Ummi Salma and had hardly broached the matter with her when she also curtly told me not to interfere in affairs concerning the Prophet and his wives. A short time after this, the Prophet separated himself from his wives and decided not to go to the house of any of them. The news went round that the Prophet had divorced his wives. I went to him and asked him if it was true that he had divorced his wives to which he replied in the negative.\" This incident shows that ‘Umar, and Ibn ‘Abbas were of the view that the relevant verses of the <i>Surah</i> referred to this temporary separation of the Holy Prophet from his wives. The fact that the preceding <i>Surah</i> mentions the subject of <i>Talaq</i> which is separation of a permanent character, lends weight to the inference that these verses relate to the Prophet’s separation from his wives, which, however, was of a temporary nature. Besides, as reported by ‘A’ishah in the above mentioned hadith, immediately after the period of separation was over, v. 33:29 was revealed, and the Prophet’s wives were given the choice between the Prophet’s companionship and a life of poverty and austere simplicity on the one hand, and separation from him with a life of ease and comfort and all sorts of material benefit on the other. The choice was given to all the wives and the verse under comment speaks of <i>all </i>the wives, as also does v. 4. This shows that the incident referred to in these verses concerns all the wives in which two of them took a more prominent part. And this was when the Prophet’s wives, led by ‘A’ishah and Hafsah, demanded of him that like other Muslim women they should also have amenities of life and comfortable living (Fathul-Qadir). In this context the words تبتغی مرضاة أزواجک would seem to mean something like this: \"Since thou always desirest to please thy wives and meet their wishes, they have been encouraged by this loving attitude of thine naturally to lose sight of thy high position as a Prophet of God and to make excessive demands on thee.\"</p><p>The alleged incident of Mariah, the Copt, being too foolish and fantastic a concoction of Christian writers and lacking all reliable historical evidence, does not merit serious notice. Mary was the Holy Prophet’s wedded consort and the respected mother of the Faithful. The Prophet never kept a slave girl.</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 3264,
                "topic": "Attributes of Allah: Al-Hakim (The Wise)",
                "verses": "2:130, 2:33, 2:210, 2:221, 2:229, 2:261, 3:7, 4:12, 4:57, 4:131, 4:166, 5:119, 9:15, 9:40, 11:2, 12:101, 15:26, 16:61, 22:53, 24:19, 27:7, 27:10, 31:28, 34:2, 35:3, 41:43, 42:52, 43:85, 44:5, 46:3, 48:5, 48:8, 48:20, 49:9, 57:2, 59:2, 59:25, 62:2, 64:19"
            },
            {
                "id": 11058,
                "topic": "Marriage: of Holy Prophet<sup>(sa)</sup>",
                "verses": "33:51-53, 33:7"
            },
            {
                "id": 12511,
                "topic": "Muhammad<sup>(sa)</sup>: marriages of",
                "verses": "33:51-53, 33:7, 33:29-35, 33:38-39"
            },
            {
                "id": 13124,
                "topic": "Oaths: <i>yamin</i>: expiation of",
                "verses": "5:90"
            },
            {
                "id": 18798,
                "topic": "Wives of the Holy Prophet<sup>(sa)</sup>",
                "verses": "33:29-35, 11:74, 19:29, 24:12-19, 33:7, 33:51-56, 33:60"
            }
        ],
        "ar": "قَدۡ  فَرَضَ اللّٰہُ  لَکُمۡ تَحِلَّۃَ  اَیۡمَانِکُمۡ ۚ وَ اللّٰہُ  مَوۡلٰٮکُمۡ ۚ وَ ہُوَ الۡعَلِیۡمُ  الۡحَکِیۡمُ ﴿۳﴾ ",
        "ur": "اللہ نے تم پر اپنی قسمیں کھولنا لازم کردیا ہے۔ اور اللہ تمہارا مولا ہے اور وہ صاحبِ علم (اور) صاحبِ حکمت ہے۔",
        "v5": {
            "text": "Allah has indeed allowed to you the dissolution of your oaths, and Allah is your Friend; and He is All-Knowing, Wise.[4279]",
            "notes": [
                {
                    "ref": "4279",
                    "note": "<p><strong>Commentary:</strong></p><p>The Holy Prophet had severely taken to heart his wives’ demand for amenities of life, and in order to show his extreme displeasure had sworn to keep away from them for one month. The verse under comment prescribes that a lawful thing does not become unlawful to a person merely by his swearing not to use it. In such a contingency he is required only to expiate his broken oath.</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 3332,
                "topic": "Attributes of Allah: Al-Khabir (All-Aware)",
                "verses": "6:104, 2:272, 4:36, 4:136, 5:9, 6:19, 6:74, 11:2, 17:18, 17:31, 22:64, 31:17, 33:35, 35:15, 35:32, 42:28, 49:14, 57:11, 58:14, 59:19, 63:12, 64:9, 67:15, 100:12"
            },
            {
                "id": 11058,
                "topic": "Marriage: of Holy Prophet<sup>(sa)</sup>",
                "verses": "33:51-53, 33:7"
            },
            {
                "id": 12511,
                "topic": "Muhammad<sup>(sa)</sup>: marriages of",
                "verses": "33:51-53, 33:7, 33:29-35, 33:38-39"
            },
            {
                "id": 17196,
                "topic": "Spouse: <i>Zauj</i>: mate",
                "verses": "2:26, 4:2, 2:36, 2:103, 2:231, 2:233, 2:235, 2:241, 4:13, 4:21, 7:20, 7:190, 13:39, 16:73, 20:118, 21:91, 23:6-7, 24:7, 25:75, 26:167, 30:22, 33:5, 33:7, 33:29, 33:38, 33:53, 33:60, 36:57, 39:7, 58:2, 60:12, 64:15, 66:2, 66:6"
            },
            {
                "id": 18798,
                "topic": "Wives of the Holy Prophet<sup>(sa)</sup>",
                "verses": "33:29-35, 11:74, 19:29, 24:12-19, 33:7, 33:51-56, 33:60"
            }
        ],
        "ar": "وَ اِذۡ  اَسَرَّ النَّبِیُّ  اِلٰی  بَعۡضِ  اَزۡوَاجِہٖ حَدِیۡثًا ۚ فَلَمَّا نَبَّاَتۡ بِہٖ وَ اَظۡہَرَہُ  اللّٰہُ عَلَیۡہِ  عَرَّفَ بَعۡضَہٗ  وَ اَعۡرَضَ عَنۡۢ بَعۡضٍ ۚ فَلَمَّا نَبَّاَہَا بِہٖ  قَالَتۡ مَنۡ اَنۡۢبَاَکَ ہٰذَا ؕ قَالَ  نَبَّاَنِیَ الۡعَلِیۡمُ الۡخَبِیۡرُ ﴿۴﴾ ",
        "ur": "اور جب نبی نے اپنی بیویوں میں سے کسی سے بصیغہء راز ایک بات کہی۔ پھر جب اس نے وہ بات (آگے) بتا دی اور اللہ نے اُس (یعنی نبی) پر وہ (معاملہ) ظاہر کر دیا تو اُس نے کچھ حصہ سے تو اُس (بیوی) کو آگاہ کردیا اور کچھ سے چشم پوشی کی۔ پس جب اُس نے اُس (بیوی) کو اِس کی خبر دی تو اُس نے پوچھا کہ آپ کو کس نے بتایا ہے ؟ تو اس نے کہا کہ علیم و خبیر نے مجھے بتایا ہے۔",
        "v5": {
            "text": "And when the Prophet confided a matter unto one of his wives and she then divulged it, and Allah informed him of it he made known <i>to her</i> part thereof, and avoided <i>mentioning</i> part <i>of it</i>. And when he informed her of it, she said, ‘Who has informed thee of it?’ He said, ‘The All-Knowing, the All-Aware <i>God</i> has informed me.’[4280]",
            "notes": [
                {
                    "ref": "4280",
                    "note": "<p><strong>Commentary:</strong></p><p>It is difficult to say to what particular incident the present verse in fact refers. The reference which seems to be supported by the context may be to the incident described by ‘A’ishah herself, which is to this effect: When verse 33:29 was revealed, giving the Holy Prophet’s wives a choice between his companionship and separation from him, by way of a reply to their demand for a life of comfort and ease, the Prophet first of all, broached the matter with ‘A’ishah (Bukhari, <i>Kitabul-Mazalim wal Ghasb</i>). The Holy Prophet appears to have taken that course because it was ‘A’ishah who had led the demand along with Hafsah, and it is not unlikely that ‘A’ishah passed on the Holy Prophet’s secret communication to Hafsah. Whatever the actual facts may be, the verse emphasizes the obligation of a person to whom a secret is confided not to divulge it, particularly when the parties concerned are husband and wife and the secret relates to a private domestic affair; or for that matter when they are a Prophet of God and one of his followers.</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 2593,
                "topic": "Angels: <i>Mala’ikah</i>: Gabriel and Michael",
                "verses": "2:98-99"
            },
            {
                "id": 7912,
                "topic": "Gabriel: <i>Jibril(as)</i>",
                "verses": "2:98-99, 26:194, 81:20"
            },
            {
                "id": 8483,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: perverse",
                "verses": "53:12, 3:8-9, 9:117, 61:6"
            },
            {
                "id": 11058,
                "topic": "Marriage: of Holy Prophet<sup>(sa)</sup>",
                "verses": "33:51-53, 33:7"
            },
            {
                "id": 12511,
                "topic": "Muhammad<sup>(sa)</sup>: marriages of",
                "verses": "33:51-53, 33:7, 33:29-35, 33:38-39"
            },
            {
                "id": 18798,
                "topic": "Wives of the Holy Prophet<sup>(sa)</sup>",
                "verses": "33:29-35, 11:74, 19:29, 24:12-19, 33:7, 33:51-56, 33:60"
            }
        ],
        "ar": "اِنۡ تَتُوۡبَاۤ  اِلَی اللّٰہِ  فَقَدۡ صَغَتۡ قُلُوۡبُکُمَا ۚ وَ اِنۡ  تَظٰہَرَا عَلَیۡہِ  فَاِنَّ اللّٰہَ  ہُوَ مَوۡلٰٮہُ  وَ جِبۡرِیۡلُ وَ صَالِحُ الۡمُؤۡمِنِیۡنَ ۚ وَ الۡمَلٰٓئِکَۃُ  بَعۡدَ  ذٰلِکَ ظَہِیۡرٌ ﴿۵﴾ ",
        "ur": "اگر تم دونوں اللہ کی طرف توبہ کرتے ہوئے جھکو تو (یہی زیبا ہے کیونکہ) تم دونوں کے دل مائل (بہ گناہ) ہوچکے تھے اور اگر تم دونوں اُس کے خلاف ایک دوسرے کی مدد کرو تو یقیناً اللہ ہی اس کا مولیٰ ہے اور جبرائیل بھی اور مومنوں میں سے ہر صالح شخص بھی اور مزید برآں فرشتے بھی اس کے پشت پناہ ہیں۔",
        "v5": {
            "text": "<i>Now</i> if you two turn unto Allah repentant, <i>it will be better for you</i>, and your hearts are <i>already so</i> inclined. But if you back up each other against him, surely Allah is his Helper and Gabriel and the righteous among the believers; and furthermore, angels <i>too</i> are <i>his</i> helpers.[4281]",
            "notes": [
                {
                    "ref": "4281",
                    "note": "<p><strong>Commentary:</strong></p><p>The words \"you two,\" seem to refer to ‘A’ishah and Hafsah who led the demand for worldly comforts in their homes. All the wives of the Holy Prophet had, however, joined in the demand, though the leading part was taken by these two, and this, perhaps because they were daughters respectively of Abu Bakr and ‘Umar, the two most respected among the Holy Prophet’s Companions. See also v. 2 above.</p><p>The phraseology of the verse indicates that the matter referred to in these verses was of a very serious nature, but taking honey from the house of one’s wife evidently is not so serious an affair as to have led to separation of the Holy Prophet from all his wives for nearly a month. Nor was the reprimand to the Prophet’s wives implied in the words \"Allah is his Helper and Gabriel and believers…\" called for.</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 11058,
                "topic": "Marriage: of Holy Prophet<sup>(sa)</sup>",
                "verses": "33:51-53, 33:7"
            },
            {
                "id": 12511,
                "topic": "Muhammad<sup>(sa)</sup>: marriages of",
                "verses": "33:51-53, 33:7, 33:29-35, 33:38-39"
            },
            {
                "id": 17197,
                "topic": "Spouse: <i>Zauj</i>: mate",
                "verses": "2:26, 4:2, 2:36, 2:103, 2:231, 2:233, 2:235, 2:241, 4:13, 4:21, 7:20, 7:190, 13:39, 16:73, 20:118, 21:91, 23:6-7, 24:7, 25:75, 26:167, 30:22, 33:5, 33:7, 33:29, 33:38, 33:53, 33:60, 36:57, 39:7, 58:2, 60:12, 64:15, 66:2, 66:4"
            },
            {
                "id": 18294,
                "topic": "Virgin",
                "verses": "3:48, 19:21, 19:23, 24:33, 33:38, 56:37"
            },
            {
                "id": 18798,
                "topic": "Wives of the Holy Prophet<sup>(sa)</sup>",
                "verses": "33:29-35, 11:74, 19:29, 24:12-19, 33:7, 33:51-56, 33:60"
            }
        ],
        "ar": "عَسٰی رَبُّہٗۤ  اِنۡ  طَلَّقَکُنَّ  اَنۡ  یُّبۡدِلَہٗۤ اَزۡوَاجًا  خَیۡرًا مِّنۡکُنَّ  مُسۡلِمٰتٍ مُّؤۡمِنٰتٍ قٰنِتٰتٍ تٰٓئِبٰتٍ عٰبِدٰتٍ سٰٓئِحٰتٍ ثَیِّبٰتٍ وَّ  اَبۡکَارًا ﴿۶﴾ ",
        "ur": "قریب ہے کہ اگر وہ تمہیں طلاق دیدے (تو) اس کا ربّ تمہارے بدلے اُس کے لئے تم سے بہتر ازواج لے آئے، مسلمان، ایمان والیاں، فرمانبردار، توبہ کرنے والیاں، عبادت کرنے والیاں، روزے رکھنے والیاں، بیوائیں اور کنواریاں۔",
        "v5": {
            "text": "It may be that, if he divorce you, his Lord will give him instead wives better than you—resigned, believing, obedient, always turning to God, devout in worship, given to fasting, <i>both</i> widows and virgins.[4282]",
            "notes": [
                {
                    "ref": "4282",
                    "note": "<p><strong>Important Words:</strong></p><p>سائحات (given to fasting) is feminine of سائحون which is plural of سائح which is act. part. from ساح. They say ساح فی الارض i.e. he went through the land for the purpose of devoting himself to religious services. سائح means, one who (1) goes through the land as a devotee; or forsakes his home for the sake of God; (2) who observes the obligatory fasts; (3) one who fasts constantly (Lane &amp; Aqrab).</p><p>ثیبات (widows) is the plural of ثیب which is derived from ثاب. They say ثیبت المرأة i.e. the woman became a ثیب which means.(1) a woman who has become separated from her husband by his death or by being divorced by him; (2) one who is not a virgin; (3) a woman to whom a man has gone in; (4) a man who has gone in to a woman; (5) a person who has married, whether man or woman; (6) a woman who has attained the age of puberty, though a virgin. رجل ثیب means a man who has been married to a woman (Lane &amp; Aqrab.)</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 2582,
                "topic": "Angels: <i>Mala’ikah</i>: disobey not Allah",
                "verses": "16:50-51, 7:207, 19:65"
            },
            {
                "id": 7612,
                "topic": "Fire: <i>An-Nar</i>: of Hell",
                "verses": "52:14, 2:25, 2:40, 2:81, 2:82, 2:127, 2:168, 2:175-176, 2:202, 2:218, 2:222, 2:258, 3:11, 3:17, 3:25, 3:103, 3:117, 3:132, 3:152, 3:186, 3:192-193, 4:15, 4:31, 5:30, 7:37, 7:39, 8:15, 9:17, 10:9, 11:17, 13:6, 14:31, 16:63, 18:30, 21:40, 22:20, 23:105, 24:58, 28:42, 29:26, 111:4"
            },
            {
                "id": 7906,
                "topic": "Fuel",
                "verses": "2:25, 3:11, 21:99, 72:16, 85:6"
            },
            {
                "id": 8814,
                "topic": "Hell: <i>Jahannam</i>: fuel and fire of",
                "verses": "19:69, 2:25, 2:168, 3:11, 4:57, 5:38, 7:42, 14:51, 17:98, 18:30, 21:99, 25:12-13, 32:21, 39:17, 40:47, 74:29-30, 74:27-30, 74:32, 77:33-34, 87:13, 88:4-5, 92:15, 101:11-12, 104:6-8, 111:4"
            }
        ],
        "ar": "یٰۤاَیُّہَا  الَّذِیۡنَ  اٰمَنُوۡا قُوۡۤا  اَنۡفُسَکُمۡ  وَ اَہۡلِیۡکُمۡ  نَارًا وَّ قُوۡدُہَا  النَّاسُ وَ الۡحِجَارَۃُ  عَلَیۡہَا مَلٰٓئِکَۃٌ  غِلَاظٌ شِدَادٌ لَّا یَعۡصُوۡنَ اللّٰہَ مَاۤ  اَمَرَہُمۡ وَ یَفۡعَلُوۡنَ مَا  یُؤۡمَرُوۡنَ ﴿۷﴾ ",
        "ur": "اے لوگو جو ایمان لائے ہو! اپنے آپ کو اور اپنے اہل و عیال کو آگ سے بچاؤ جس کا ایندھن انسان اور پتھر ہیں۔ اُس پر بہت سخت گیر قوی فرشتے (مسلط) ہیں۔ وہ اللہ کی، اُس بارہ میں جو وہ انہیں حکم دے، نافرمانی نہیں کرتے اور وہی کرتے ہیں جو وہ حکم دیئے جاتے ہیں۔",
        "v5": {
            "text": "O ye who believe! save yourselves and your families from a Fire whose fuel is men and stones,[a] over which are appointed angels, stern <i>and</i> severe, who disobey not Allah in what He commands them and do as they are commanded.[4283]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:25."
                },
                {
                    "ref": "4283",
                    "note": "<p><strong>Commentary:</strong></p><p>As the <i>Surah</i> deals particularly with domestic disagreements and conflicts, believers are enjoined to train and educate members of their household in such a way that there should reign complete harmony, peace and concord in the house as it prevails in Paradise.</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 5997,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: on that day",
                "verses": "37:21, 27:88, 2:282, 3:26, 3:162, 3:186, 4:88, 6:13, 6:23, 6:74, 10:46, 10:55, 15:26, 17:14, 17:72, 18:49, 18:50, 19:69, 19:72, 19:73, 19:96, 20:109, 21:48, 22:57, 23:102, 25:27, 30:13, 30:15, 36:50, 36:51, 36:55, 39:69, 40:17, 40:18, 45:27-29, 46:20, 50:45, 52:17, 54:7-9, 56:2-12, 70:44-45, 101:5"
            }
        ],
        "ar": "یٰۤاَیُّہَا  الَّذِیۡنَ کَفَرُوۡا  لَا تَعۡتَذِرُوا الۡیَوۡمَ ؕ اِنَّمَا  تُجۡزَوۡنَ مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ٪﴿۸﴾ ",
        "ur": "اے وہ لوگو جنہوں نے کفر کیا! آج عذر پیش نہ کرو۔ یقیناً تمہیں صرف اُسی کی جزا دی جائے گی جو تم کیا کرتے تھے۔",
        "v5": {
            "text": "[b]O ye who disbelieve! make no excuses this day. You are requited for what you did.",
            "notes": [
                {
                    "ref": "b",
                    "note": "9:66; 77:37."
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 2335,
                "topic": "Allah: seeking forgiveness of",
                "verses": "11:53, 4:65, 8:34, 11:4, 71:11"
            },
            {
                "id": 7786,
                "topic": "Forgiveness: <i>‘Afw</i>: prayers for",
                "verses": "3:194-195, 2:287, 3:17, 3:148, 11:48, 14:42, 23:110, 23:119, 26:83, 59:11"
            },
            {
                "id": 7813,
                "topic": "Forgiveness: <i>‘Afw</i>: seek of Allah",
                "verses": "11:53, 2:200, 3:136, 4:65, 4:107, 4:111, 5:75, 8:34, 11:4, 11:91, 40:56, 41:7, 47:20, 71:11, 73:21, 110:4"
            },
            {
                "id": 12408,
                "topic": "Muhammad<sup>(sa)</sup>: companions of",
                "verses": "24:38-39, 3:160, 5:23, 7:158, 8:6, 9:100, 9:117, 9:128, 26:220, 33:24, 47:5, 48:30, 77:2-7, 79:2-6, 92:4, 100:2-12"
            },
            {
                "id": 13644,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 14090,
                "topic": "Prayer: <i>Du‘a’</i>: of supplicant",
                "verses": "2:187, 2:202, 3:195, 6:163, 7:30, 7:56-57, 7:181, 9:103, 14:40, 17:111, 19:49, 20:15, 25:66, 32:17, 40:15, 40:61, 40:66"
            },
            {
                "id": 14131,
                "topic": "Prayers of the Holy Qur’an: for forgiveness",
                "verses": "3:17, 2:286-287, 3:148, 3:194-195, 7:24, 7:150, 7:152, 7:156-157, 11:48, 12:102, 18:11, 21:88, 23:95, 23:110, 23:119, 25:66-67, 28:17, 35:38, 38:36, 40:8, 59:11, 71:27-29"
            },
            {
                "id": 14896,
                "topic": "Qadir: powerful: Allah has the power to do all",
                "verses": "46:34, 2:107, 2:285, 3:27, 3:30, 3:166, 3:190, 4:134, 6:18, 6:38, 6:66, 16:71, 17:100, 22:7, 22:40, 23:19, 23:96, 25:55, 30:55, 33:28, 36:82, 42:30, 42:51, 60:8, 65:13, 70:41, 75:5, 75:41, 86:9"
            },
            {
                "id": 15551,
                "topic": "Repentance: <i>Taubah</i>: meaning of",
                "verses": "9:112, 3:90, 11:91, 25:71-72"
            }
        ],
        "ar": "یٰۤاَیُّہَا  الَّذِیۡنَ  اٰمَنُوۡا تُوۡبُوۡۤا  اِلَی اللّٰہِ تَوۡبَۃً  نَّصُوۡحًا ؕ عَسٰی رَبُّکُمۡ  اَنۡ یُّکَفِّرَ عَنۡکُمۡ سَیِّاٰتِکُمۡ وَ یُدۡخِلَکُمۡ جَنّٰتٍ تَجۡرِیۡ  مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ۙ یَوۡمَ لَا یُخۡزِی اللّٰہُ  النَّبِیَّ  وَ الَّذِیۡنَ اٰمَنُوۡا مَعَہٗ ۚ  نُوۡرُہُمۡ  یَسۡعٰی بَیۡنَ اَیۡدِیۡہِمۡ وَ بِاَیۡمَانِہِمۡ  یَقُوۡلُوۡنَ  رَبَّنَاۤ اَتۡمِمۡ  لَنَا نُوۡرَنَا وَ اغۡفِرۡ لَنَا ۚ اِنَّکَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۹﴾",
        "ur": "اے لوگو جو ایمان لائے ہو! اللہ کی طرف خالص توبہ کرتے ہوئے جھکو۔ بعید نہیں کہ تمہارا ربّ تم سے تمہاری برائیاں دورکردے اور تمہیں ایسی جنتوں میں داخل کرے جن کے دامن میں نہریں بہتی ہیں، جس دن اللہ نبی کو اور ان کو رُسوا نہیں کرے گا جو اس کے ساتھ ایمان لائے۔ ان کا نور ان کے آگے بھی تیزی سے چلے گا اور ان کے دائیں بھی۔ وہ کہیں گے اے ہمارے ربّ! ہمارے لئے ہمارے نور کو مکمل کردے اور ہمیں بخش دے۔ یقیناً تو ہر چیز پر جسے تُو چاہے دائمی قدرت رکھتا ہے۔",
        "v5": {
            "text": "O ye who believe! turn to Allah in sincere repentance. It may be that your Lord will remove the evil <i>consequences</i> of your deeds and make you enter Gardens through which rivers flow,[a] on the day when Allah will not abase the Prophet nor those who have believed with him. Their light will run before them and on their right hands. They will say, ‘Our Lord, perfect our light for us and forgive us; surely, Thou hast power over all things.’[4284]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:30; 48:6; 64:10."
                },
                {
                    "ref": "4284",
                    "note": "<p><strong>Commentary:</strong></p><p>The never-ceasing desire for perfection on the part of believers in Paradise as expressed in the words, \"Our Lord perfect our light for us,\" shows that life in Paradise will not be a life of inaction. On the contrary, spiritual advance in Paradise will know no end, for as the believers will attain excellence, characteristic of a certain stage, they will not stop at that, but seeing in front of it a higher stage of excellence and thus finding that the stage at which they had arrived was not the highest stage, will desire the attainment of the next higher stage, and so on without end.</p><p>In short the believers will go on making advancement in Paradise and shall never recede a step. Their activity far from ceasing will rather increase. The Holy Prophet is reported to have said that in Paradise the believers will be imparted knowledge of new attributes of God which they will try to copy in themselves.</p><p>From the verse it further appears that after entering Paradise, the believers will seek <i>maghfirah</i>, i.e. \"suppression of a defect.\" In this sense of <i>maghfirah</i> the verse means that the righteous will be continually praying to God for the attainment of perfection and complete immersion in divine light. They will be continually going upwards and will regard each state as defective in comparison with a higher one to which they will aspire and will, therefore, pray to God to suppress the defective state that they may be able to get to the higher one. This is the true significance of <i>Istighfar</i> of which the literal meaning is, \"asking forgiveness for one’s lapses.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 186,
                "topic": "Abode: in Hell, in fire, <i>Ma’wa</i>, <i>Mathwa</i>",
                "verses": "3:163, 3:152, 3:198, 4:98, 5:73, 6:129, 8:17, 9:73, 9:95, 10:9, 13:19, 16:30, 17:98, 24:58, 25:67, 29:26, 29:69, 39:33, 39:61, 39:73, 40:77, 41:25, 45:35, 47:13, 57:16, 79:40"
            },
            {
                "id": 9959,
                "topic": "Jihad: waging",
                "verses": "2:191-194, 4:76, 6:105, 8:40, 9:6, 9:8-13, 9:92, 16:127, 48:17"
            },
            {
                "id": 12306,
                "topic": "Muhammad<sup>(sa)</sup>: and disbelievers",
                "verses": "15:89-98, 2:7, 2:110, 2:119, 2:192, 2:218, 3:33, 3:128, 3:177, 3:197, 4:91, 4:103, 5:42, 5:55, 6:34, 8:31, 9:2, 9:4, 9:32, 9:40, 9:73, 9:123, 10:66, 11:13, 13:28, 15:3, 16:128, 18:7, 20:134, 22:16, 25:5, 26:4, 27:71, 28:57, 29:51, 35:5, 35:9, 36:77, 41:6, 48:30, 52:34, 68:52, 73:11, 93:6, 94:2-4"
            }
        ],
        "ar": "یٰۤاَیُّہَا  النَّبِیُّ  جَاہِدِ الۡکُفَّارَ وَ الۡمُنٰفِقِیۡنَ وَ اغۡلُظۡ عَلَیۡہِمۡ ؕ وَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ  بِئۡسَ  الۡمَصِیۡرُ ﴿۱۰﴾ ",
        "ur": "اے نبی! کفار سے اور منافقین سے جہاد کر اور ان کے مقابلہ پر سختی کر۔ اور اُن کا ٹھکانا جہنّم ہے اور وہ بہت ہی برا ٹھکانا ہے۔",
        "v5": {
            "text": "O Prophet! strive hard against the disbelievers and the Hypocrites; and be strict against them, their resort is Hell, and an evil destination it is![4285]",
            "notes": [
                {
                    "ref": "4285",
                    "note": "<p><strong>Commentary:</strong></p><p>Whereas, in the preceding verse it was stated that spiritual progress, not only in this world but in the life after death, is endless, in the verse under comment we are told that no advance is possible unless the disbelievers and the hypocrites are strenuously striven against. Incidentally, the verse explains the real significance of jihad which means, \"striving against\". Since the hypocrites were regarded as part of the Muslim Community, jihad in the sense of fighting with the sword was never waged against them.</p>"
                }
            ]
        }
    },
    {
        "ch": 66,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 2139,
                "topic": "Allah: parables set forth by, <i>Amthal</i>",
                "verses": "13:18, 2:18, 2:27, 2:172, 2:262, 2:265, 7:177, 13:36, 14:19, 14:25-27, 14:46, 16:75-77, 16:113, 18:33, 22:74, 24:36, 25:40, 29:42, 29:44, 30:29, 30:59, 36:14, 39:28, 39:30, 43:9, 47:4, 47:16, 59:22, 62:6"
            },
            {
                "id": 6525,
                "topic": "Dishonesty: <i>Khiyanah</i>",
                "verses": "8:28, 3:162, 4:106, 4:108, 8:59, 12:53, 22:39, 40:20"
            },
            {
                "id": 6874,
                "topic": "Ears: of disbelievers",
                "verses": "2:19-20, 41:21"
            },
            {
                "id": 10674,
                "topic": "Lot: <i>Lut(as)</i>: wife of",
                "verses": "15:61, 27:58"
            },
            {
                "id": 13103,
                "topic": "Noah: <i>Nuh(as)</i>: wife of, an example",
                "verses": null
            },
            {
                "id": 13387,
                "topic": "Parable of: disbelievers example",
                "verses": null
            },
            {
                "id": 15893,
                "topic": "Righteous: <i>Salihin</i>: unrighteous",
                "verses": "11:47, 2:104, 2:190, 5:66, 7:97, 23:101, 49:7"
            },
            {
                "id": 16555,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:82, 37:161, 38:18, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 89:30"
            },
            {
                "id": 18775,
                "topic": "Wives: of Noah, Lot",
                "verses": "30:22"
            }
        ],
        "ar": "ضَرَبَ اللّٰہُ  مَثَلًا  لِّلَّذِیۡنَ  کَفَرُوا امۡرَاَتَ  نُوۡحٍ وَّ امۡرَاَتَ  لُوۡطٍ ؕ کَانَتَا تَحۡتَ عَبۡدَیۡنِ مِنۡ عِبَادِنَا صَالِحَیۡنِ فَخَانَتٰہُمَا فَلَمۡ یُغۡنِیَا عَنۡہُمَا مِنَ اللّٰہِ شَیۡئًا وَّ قِیۡلَ ادۡخُلَا  النَّارَ مَعَ الدّٰخِلِیۡنَ ﴿۱۱﴾",
        "ur": "اللہ نے اُن لوگوں کے لئے جنہوں نے کفر کیا نوح کی بیوی اور لوط کی بیوی کی مثال بیان کی ہے۔ وہ دونوں ہمارے دو صالح بندوں کے ماتحت تھیں۔ پس ان دونوں نے ان سے خیانت کی تو وہ اُن کو اللہ کی پکڑ سے ذرا بھی بچا نہ سکے اور کہا گیا کہ تم دونوں داخل ہونے والوں کے ساتھ آگ میں داخل ہو جاؤ۔",
        "v5": {
            "text": "Allah sets forth for those who disbelieve the example <i>of</i> the wife of Noah and the wife of Lot. They were under two righteous servants of Ours, but they acted unfaithfully towards them. So they availed them naught against Allah, and it was said <i>to them</i>, ‘Enter the Fire, ye twain, along with those who enter.’",
            "notes": null
        }
    },
    {
        "ch": 66,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 2139,
                "topic": "Allah: parables set forth by, <i>Amthal</i>",
                "verses": "13:18, 2:18, 2:27, 2:172, 2:262, 2:265, 7:177, 13:36, 14:19, 14:25-27, 14:46, 16:75-77, 16:113, 18:33, 22:74, 24:36, 25:40, 29:42, 29:44, 30:29, 30:59, 36:14, 39:28, 39:30, 43:9, 47:4, 47:16, 59:22, 62:6"
            },
            {
                "id": 2949,
                "topic": "Asiyah: example of",
                "verses": null
            },
            {
                "id": 3931,
                "topic": "Bait: house",
                "verses": "11:74, 28:13, 29:42, 33:34, 51:37"
            },
            {
                "id": 13381,
                "topic": "Parable of: believers example",
                "verses": null
            },
            {
                "id": 13645,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 13921,
                "topic": "Pharaoh: <i>Fir‘aun</i>: wife of",
                "verses": null
            },
            {
                "id": 14146,
                "topic": "Prayers of the Holy Qur’an: for deliverance",
                "verses": "2:287, 3:192, 4:76, 10:86-87, 21:84, 21:88-89, 23:98-9, 25:66-67, 26:170, 28:22, 38:42, 40:8-10, 59:11"
            },
            {
                "id": 14155,
                "topic": "Prayers of the Holy Qur’an: for victory over the enemy",
                "verses": "10:89, 2:287, 7:48, 10:86-87, 23:27, 23:98-99, 29:31, 60:5-6, 71:27-28"
            },
            {
                "id": 18924,
                "topic": "Wrongdoers: <i>Zalim</i>: deliverence from",
                "verses": "4:76, 23:95, 28:22, 71:25"
            }
        ],
        "ar": "وَ ضَرَبَ اللّٰہُ  مَثَلًا  لِّلَّذِیۡنَ  اٰمَنُوا امۡرَاَتَ  فِرۡعَوۡنَ ۘ اِذۡ  قَالَتۡ رَبِّ ابۡنِ  لِیۡ عِنۡدَکَ  بَیۡتًا فِی الۡجَنَّۃِ  وَ نَجِّنِیۡ  مِنۡ فِرۡعَوۡنَ  وَ عَمَلِہٖ وَ نَجِّنِیۡ  مِنَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿ۙ۱۲﴾ ",
        "ur": "اوراللہ نے اُن لوگوں کے لئے جو ایمان لائے فرعون کی بیوی کی مثال دی ہے۔ جب اس نے کہا اے میرے ربّ! میرے لئے اپنے حضور جنت میں ایک گھر بنادے اور مجھے فرعون سے اور اس کے عمل سے بچالے اور مجھے ان ظالم لوگوں سے نجات بخش۔",
        "v5": {
            "text": "And Allah sets forth for those who believe the example <i>of</i> the wife of Pharaoh when she said, ‘My Lord! build for me a house with Thee in the Garden; and deliver me from Pharaoh and his work, and deliver me from the wrongdoing people;’",
            "notes": null
        }
    }
]
