[
    {
        "ch": 97,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 97,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 6276,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4"
            },
            {
                "id": 13040,
                "topic": "Night of Decree",
                "verses": "44:4-5"
            },
            {
                "id": 15187,
                "topic": "Qur’an: revelation of",
                "verses": "2:186, 12:3, 13:38, 16:104, 17:107, 20:5, 20:114, 25:33-34, 26:194-197, 39:29, 41:4, 42:8, 43:4, 44:4-5, 46:13, 76:24"
            }
        ],
        "ar": "اِنَّاۤ  اَنۡزَلۡنٰہُ  فِیۡ  لَیۡلَۃِ  الۡقَدۡرِ ۚ﴿ۖ۲﴾ ",
        "ur": "یقیناً ہم نے اسے قدر کی رات میں اتارا ہے۔",
        "v5": {
            "text": "Surely, We sent it down on the Night of Destiny[b].[4793]",
            "notes": [
                {
                    "ref": "b",
                    "note": "44:4."
                },
                {
                    "ref": "4793",
                    "note": "<p><strong>Important Words:</strong></p><p>القدر (Destiny) is derived from قدر (<i>qadara</i>). They say قدر الشیء i.e. he measured or decreed the things; he thought upon the thing or affair and considered its issue, or result and compared one part of it with another; he estimated, honoured or magnified the thing. قدرت علی الشیء means, I had power or ability to do the thing. قدر means, measure, limit or number; value, worth, greatness; dignity, majesty; power; decree or destiny, ordinance (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>Generally لیل and لیلة mean the same thing, i.e. night, but according to the famous lexicographer, Marzuqi, لیل is used as opposed to نھار and لیلة as opposed to یوم. لیلة like علامة and نسابة is expressive of exaggeration, and possesses a wider and more extensive meaning than لیل as یوم which is its opposite has a wider sense than نھار which is opposite of لیل. The word لیلة has been used as many as eight times in the Quran (2:52; 2:188; 44:4; twice in 7:143 &amp; three times in the verse under comment), and everywhere it has been used in connection with the revelation of the Quran and other kindred subjects. It thus points to the dignity, majesty and greatness of those nights in which the Quran was revealed. In view of different meanings of قدر given under Important Words and of the significance of the word لیلة the present verse may be interpreted as follows:</p><p>1. We have revealed the Quran in the night which We had specifically set apart for the manifestation of Our special powers, i.e. We have revealed the Quran at a time about which prophecies were to be found in previous Scriptures.</p><p>2. We have revealed it in a night which is equal in worth to all the other nights put together, i.e. this one night is equal in worth to the life of the whole of humanity.</p><p>3. We have revealed it in a night of dignity, majesty and honour, i.e. the Quranic teaching is too dignified to be successfully assailed.</p><p>4. We have revealed it in the night of sufficiency, i.e. the Quran fully meets all moral and spiritual human needs and requirements so as to render man independent of all other scriptures.</p><p>5. We have revealed it in the Night of Decree or Destiny, i.e. the Quran was revealed at a time when man’s destiny was decreed, the future pattern of the universe was settled, and right principles of guidance for humanity were laid down for all time to come. The time of the appearance of a great Divine Reformer is also called لیلة القدر because at that time sin and vice hold widespread sway and the powers of darkness reign supreme. It has also been taken to mean the particular night among the odd nights in the last ten days of Ramadan when the Quran first began to be revealed. Or it may signify the whole period of 23 years of the Holy Prophet’s ministry when the Quran gradually was being revealed.</p>"
                }
            ]
        }
    },
    {
        "ch": 97,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 6276,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4"
            },
            {
                "id": 13040,
                "topic": "Night of Decree",
                "verses": "44:4-5"
            }
        ],
        "ar": "وَ مَاۤ  اَدۡرٰٮکَ مَا لَیۡلَۃُ  الۡقَدۡرِ ؕ﴿۳﴾ ",
        "ur": "اور تُجھے کیا سمجھائے کہ قدر کی رات کیا ہے۔",
        "v5": {
            "text": "And what should make thee know what the Night of Destiny is?[4794]",
            "notes": [
                {
                    "ref": "4794",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means that the blessings of the Night of Destiny are beyond count or calculation.</p>"
                }
            ]
        }
    },
    {
        "ch": 97,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 6276,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4"
            },
            {
                "id": 13040,
                "topic": "Night of Decree",
                "verses": "44:4-5"
            },
            {
                "id": 13120,
                "topic": "Number: <i>‘Adad</i>",
                "verses": "2:185-186, 2:30, 9:36-37, 9:80, 12:43, 15:45, 18:23, 23:18, 30:5, 31:28, 33:50, 65:2, 65:5, 74:31, 89:4"
            },
            {
                "id": 15405,
                "topic": "Reformers: advent of",
                "verses": "15:19, 19:52, 25:48, 28:60, 30:47, 30:57, 36:52, 45:6, 56:76, 72:10, 77:12, 81:3, 81:19, 85:2, 91:3, 92:2-3"
            }
        ],
        "ar": "لَیۡلَۃُ  الۡقَدۡرِ ۬ۙ خَیۡرٌ  مِّنۡ  اَلۡفِ شَہۡرٍ ؕ﴿ؔ۴﴾",
        "ur": "قدر کی رات ہزار مہینوں سے بہتر ہے۔",
        "v5": {
            "text": "The Night of Destiny is better than a thousand months.[4795]",
            "notes": [
                {
                    "ref": "4795",
                    "note": "<p><strong>Commentary:</strong></p><p>ألف (a thousand) being the highest number of count in Arabic signifies a number beyond count, and the verse means, that the Night of Destiny is better than countless number of months, i.e. the period of the Holy Prophet is infinitely better and superior to all other periods put together. Or the verse may signify that the sacrifices which the Muslims were required to make at Mecca in the night of their distress and agony which had taken out of their lives all light and happiness, were infinitely greater than those sacrifices which they made afterwards.</p><p>The word شھر also means a learned man. The verse in this sense may signify that the mysteries of spiritual sciences and heavenly knowledge which will be revealed in the Book which is being revealed in the Night of Decree are greater in quantity and superior in quality than the knowledge produced by the concerted and combined efforts of all learned men.</p><p>The verse, however, embodies an allusion to the appearance of Divine Reformers among the Muslims when they would stand in need of them. One thousand months roughly make one century and the Holy Prophet is reported to have said that God would continue to raise from among his followers, at the head of every century, a Reformer who would regenerate Islam and give it new life and new vigour (Majah). Thus لیلة القدر (Night of Destiny) may signify the period of each one of these Divine Reformers.</p>"
                }
            ]
        }
    },
    {
        "ch": 97,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 2326,
                "topic": "Allah: sends angels to reassure steadfast",
                "verses": "41:31-2, 16:3, 21:104"
            },
            {
                "id": 2577,
                "topic": "Angels: <i>Mala’ikah</i>: descend on steadfast",
                "verses": "41:31-32"
            },
            {
                "id": 6276,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4"
            },
            {
                "id": 13040,
                "topic": "Night of Decree",
                "verses": "44:4-5"
            },
            {
                "id": 13861,
                "topic": "Permission: Leave, <i>Idhn</i>: of Allah",
                "verses": "64:12, 2:98, 2:103, 2:214, 2:222, 2:250, 2:252, 2:256, 3:50, 3:146, 3:153, 3:167, 4:65, 5:17, 5:111, 7:59, 8:67, 10:4, 10:101, 11:106, 13:39, 14:2, 14:12, 14:24, 14:26, 22:66, 33:47, 34:13, 35:33, 42:52, 58:11, 59:6"
            },
            {
                "id": 15699,
                "topic": "Revelation: to non-Prophets",
                "verses": "16:69-70, 19:12, 20:39-40, 28:8, 41:13, 41:31"
            },
            {
                "id": 17014,
                "topic": "Soul: <i>Ruh</i>, spirit",
                "verses": "4:172, 2:49, 3:26, 3:146, 3:186, 6:152, 12:54, 16:3, 17:86, 19:18, 31:29, 50:22, 58:23, 70:5, 75:3, 78:39, 86:5, 89:28-29"
            }
        ],
        "ar": "تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ  فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ  کُلِّ  اَمۡرٍ ۙ﴿ۛ۵﴾ ",
        "ur": "بکثرت نازل ہوتے ہیں اُس میں فرشتے اور  روح القدس اپنے ربّ کے حکم سے ۔ ہر معاملہ میں۔",
        "v5": {
            "text": "Therein descend angels[a] and the Spirit by the command of their Lord with Divine decree concerning every matter[b].[4796]",
            "notes": [
                {
                    "ref": "a",
                    "note": "16:3; 40:16."
                },
                {
                    "ref": "b",
                    "note": "44:5."
                },
                {
                    "ref": "4796",
                    "note": "<p><strong>Commentary:</strong></p><p>الروح here signifies a new spirit, awakening, zeal and determination. The verse purports to say that in the Night of Destiny the angels of God descend to help the Divine Messenger or Reformer to promote and further the cause of truth and that his followers are inspired with a new life, a new spirit and a new awakening, to spread and propagate the Divine Message.</p><p>The expression من کل أمر signifies that the angels of God descend to meet and satisfy every religious need and to remove all obstacles and impediments from the way of the expansion and spread of the new Message.</p>"
                }
            ]
        }
    }
]
