[
    {
        "ch": 90,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 3924,
                "topic": "Bakkah: <i>Makkah</i>, Mecca,",
                "verses": "3:97-98, 2:127, 14:36, 27:92, 28:58, 29:68, 95:4"
            },
            {
                "id": 13157,
                "topic": "Oaths: <i>yamin</i>: of Allah",
                "verses": "4:66, 15:73, 15:93, 16:57, 16:64, 36:3, 37:2-4, 38:2, 43:2-3, 44:2-3, 50:2, 51:2-8, 51:24, 52:2-7, 53:2, 56:76, 68:2, 69:39, 69:40, 70:41, 74:33, 74:35, 75:2-3, 77:2-6, 79:2-6, 81:16-19, 84:17-19, 85:2-4, 86:2, 86:12-13, 89:2-5, 90:4, 91:2-8, 92:2-4, 93:2-3, 95:2-4, 100:2, 103:2-3"
            },
            {
                "id": 14455,
                "topic": "Prophecies in the Holy Qur’an: about: Islam",
                "verses": "30:3-5, 2:116, 8:61, 9:33, 12:103, 16:78, 17:2, 19:41, 22:24, 22:27, 32:6, 33:23, 35:12, 38:2, 41:54, 43:90, 48:29-30, 53:2, 56:4, 58:22, 60:8, 61:10, 70:37-38, 79:2-6, 81:19, 81:24-25, 82:2, 83:30-35, 89:23, 91:2-5, 93:2-3, 94:6-7, 99:2-7, 100:10-12"
            },
            {
                "id": 18746,
                "topic": "Witness: to truth",
                "verses": "4:136, 3:53-54, 3:65, 3:87, 11:18, 43:87, 95:2-4"
            }
        ],
        "ar": "لَاۤ  اُقۡسِمُ  بِہٰذَا الۡبَلَدِ ۙ﴿۲﴾ ",
        "ur": "خبردار! میں اس شہر کی قسم کھاتا ہوں۔",
        "v5": {
            "text": "[b]Nay, I call to witness this City—[4723]",
            "notes": [
                {
                    "ref": "b",
                    "note": "52:5; 95:4."
                },
                {
                    "ref": "4723",
                    "note": "<p><strong>Commentary:</strong></p><p>According to some authorities, the particle لا has been used here to draw pointed attention to the subject which is about to be introduced. According to them, the meaning of the verse is: \"Listen! Listen! I call to witness this city.\" Some other scholars think that the verse signifies that the subject which is going to be introduced is so clear and obvious that it needs no swearing to support it. Yet according to another school the particle is intended to refute an understood objection and the meaning of the verse is: \"Not that thou art a forger, as the disbelievers think. Thou art not a forger but a true Prophet of God and this city is called to bear witness to this fact.\" But more appropriately the verse would mean something like this: \"You harbour evil designs about Islam, O, disbelievers! I know what is in your minds, but I tell you that it would never happen as you desire, and I cite this city as a witness to this fact.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 14455,
                "topic": "Prophecies in the Holy Qur’an: about: Islam",
                "verses": "30:3-5, 2:116, 8:61, 9:33, 12:103, 16:78, 17:2, 19:41, 22:24, 22:27, 32:6, 33:23, 35:12, 38:2, 41:54, 43:90, 48:29-30, 53:2, 56:4, 58:22, 60:8, 61:10, 70:37-38, 79:2-6, 81:19, 81:24-25, 82:2, 83:30-35, 89:23, 91:2-5, 93:2-3, 94:6-7, 99:2-7, 100:10-12"
            },
            {
                "id": 18746,
                "topic": "Witness: to truth",
                "verses": "4:136, 3:53-54, 3:65, 3:87, 11:18, 43:87, 95:2-4"
            }
        ],
        "ar": "وَ اَنۡتَ حِلٌّۢ بِہٰذَا الۡبَلَدِ ۙ﴿۳﴾ ",
        "ur": "جبکہ تو اس شہر میں (ایک دن) اُترنے والا ہے۔",
        "v5": {
            "text": "And thou art a dweller in this City—[4724]",
            "notes": [
                {
                    "ref": "4724",
                    "note": "<p><strong>Important Words:</strong></p><p>حل (dweller) is derived from حل which means, he was or became free from an obligation or responsibility; it was or became lawful. They say حل علیھم العذاب i.e. the punishment alighted upon them or the punishment was necessitated by the requirements of justice to take effect upon them. حل بالمکان means, he alighted or dwelt in the house. حل حقی علیه means, the discharge of my right became obligatory on him. حل(<i>hillun</i>) means: (1) the place outside the sacred precincts of Mecca; (2) the thing the doing of which is lawful; (3) target; (4) free from obligation; (5) alighting or dwelling in a place (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>According to the different meanings of the word حل given under Important Words the verse would signify: (1) It is considered lawful to do you any harm, even to kill you, in this city of Mecca which is so sacred that the doing of harm to a living creature in its precincts, not to say of killing it, is strictly forbidden. (2) Thou alone art the target of every conceivable abuse, harm, injury, cruelty or violence against life, property or honour in this Sacred City. (3) Thou wilt alight as a conqueror in this city from where thou art being driven out as a fugitive. (4) Thou wilt be freed from obligation to observe the sacredness of this city when thou wilt enter it as a victor and wilt punish those wicked persons who had placed themselves outside the pale of law by perpetrating unutterable cruelties on innocent Muslims.</p><p>What a mighty prophecy! It was made at a time when opposition to the Holy Prophet was still confined to mocking and jeering at him. The <i>Surah</i> as stated in the Introduction, was revealed towards the end of the third year of the Call when Islam had not yet begun to be preached openly nor had the Meccans awakened to a realization of the danger which the new Faith subsequently proved to be and, therefore, considered it beneath their dignity to offer it any opposition.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 229,
                "topic": "Abraham: <i>Ibrahim(as)</i>: bears witness to truth of Holy Prophet<sup>(sa)</sup>",
                "verses": null
            },
            {
                "id": 11175,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 109:6, 111:2"
            },
            {
                "id": 12673,
                "topic": "Muhammad<sup>(sa)</sup>: truth of",
                "verses": "34:45-51, 3:82, 10:17, 11:18, 21:6, 23:70, 36:2-4, 43:87, 47:3, 69:39-48"
            },
            {
                "id": 13158,
                "topic": "Oaths: <i>yamin</i>: of Allah",
                "verses": "4:66, 15:73, 15:93, 16:57, 16:64, 36:3, 37:2-4, 38:2, 43:2-3, 44:2-3, 50:2, 51:2-8, 51:24, 52:2-7, 53:2, 56:76, 68:2, 69:39, 69:40, 70:41, 74:33, 74:35, 75:2-3, 77:2-6, 79:2-6, 81:16-19, 84:17-19, 85:2-4, 86:2, 86:12-13, 89:2-5, 90:2, 91:2-8, 92:2-4, 93:2-3, 95:2-4, 100:2, 103:2-3"
            },
            {
                "id": 18746,
                "topic": "Witness: to truth",
                "verses": "4:136, 3:53-54, 3:65, 3:87, 11:18, 43:87, 95:2-4"
            }
        ],
        "ar": "وَ  وَالِدٍ وَّ  مَا وَلَدَ ۙ﴿۴﴾ ",
        "ur": "اور باپ کی اور جو اُس نے اولاد پیدا کی۔",
        "v5": {
            "text": "And the begetter and whom he begot,[4725]",
            "notes": [
                {
                    "ref": "4725",
                    "note": "<p><strong>Commentary:</strong></p><p>While raising the foundations of the Ka‘bah, the Patriarch Abraham and his son Ishmael had prayed: \"And our Lord, raise among them a Messenger from among themselves, who may recite to them Thy signs and teach them the Book and wisdom and may purify them\" (2:130). The expression \"the father and the son\" refers to Abraham and Ishmael, and the verse purports to say that God had His own plan to accomplish by getting the structure of the Ka‘bah raised up by Abraham and Ishmael. This plan was to send the greatest of His Messengers and to give him the Final and most Perfect Law in the form of the Quran for the eternal guidance of mankind. That Divine plan has been fulfilled in the person of the Holy Prophet. Thus \"the father and the son\" stand as a witness to the truth of his Divine claim. Or \"the father and the son,\" may refer to the Holy Prophet and his noble followers, and the verse may signify that the Holy Prophet himself and his followers constitute a proof of the Divine origin of his mission. Their spotless character, their good qualities of head and heart, the great sacrifices they are making in the cause of truth—all leave no room for doubt that they will succeed in their mission and that those who stand in their way will fail.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 10477,
                "topic": "Life: <i>Hayat</i>: a struggle",
                "verses": "6:32, 84:7"
            },
            {
                "id": 10856,
                "topic": "Man: nature of, <i>Fitrah</i>",
                "verses": "30:31, 4:29, 10:13, 11:10-11, 14:35, 16:5, 17:12, 17:68-70, 17:101, 18:55, 21:38, 22:6, 22:67, 23:78-79, 25:51, 30:37, 31:7-8, 31:22, 33:73, 34:32, 36:78-79, 38:61, 39:50, 40:11, 41:50-52, 42:49, 43:16, 57:9, 70:20-22, 75:21, 80:18, 89:16-21, 91:8-9, 95:5, 96:7-8, 100:7, 100:9, 103:3-4"
            },
            {
                "id": 10892,
                "topic": "Man: purpose of creation",
                "verses": "51:57, 1:5, 2:132, 4:126, 6:166"
            },
            {
                "id": 14412,
                "topic": "Prophecies in the Holy Qur’an: about: the Holy Prophet<sup>(sa)</sup>",
                "verses": "28:86, 2:41-42, 2:90, 5:48, 10:72, 17:2, 17:61, 17:81, 38:12, 46:11-13, 47:14, 54:7-9, 81:24, 89:2-3, 92:2-3, 94:5"
            }
        ],
        "ar": "لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ فِیۡ  کَبَدٍ ؕ﴿۵﴾ ",
        "ur": "یقیناً ہم نے انسان کو ایک مسلسل محنت میں (رہنے کے لئے) پیدا کیا۔",
        "v5": {
            "text": "[a]We have surely created man to toil and struggle.[4726]",
            "notes": [
                {
                    "ref": "a",
                    "note": "84:7."
                },
                {
                    "ref": "4726",
                    "note": "<p><strong>Important Words:</strong></p><p>کبد (toil). کبده means, he smote his liver or stomach. کبد means, difficulty; distress; affliction; the middle of the sky. فی کبدmeans, in a state in which he has to work hard. It also means, in a right and just state; in just proportion; in an erect state (Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse purports to say that the prophecy made in the foregoing verses, viz. that the Holy Prophet will be expelled from Mecca but will come back to it as a conqueror and that Mecca will submit to him, and its inhabitants will enter his fold, will be fulfilled only after he and his followers had gone through great hardships, that is to say, great toil and incessant struggle will be demanded of them to achieve their great goal.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 10892,
                "topic": "Man: purpose of creation",
                "verses": "51:57, 1:5, 2:132, 4:126, 6:166"
            }
        ],
        "ar": "اَیَحۡسَبُ اَنۡ  لَّنۡ یَّقۡدِرَ عَلَیۡہِ  اَحَدٌ  ۘ﴿۶﴾",
        "ur": "کیا وہ گمان کرتا ہے کہ ہرگز اُس پر کوئی غلبہ نہ پا سکےگا۔",
        "v5": {
            "text": "[a]Does he think that no one has power over him?[4727]",
            "notes": [
                {
                    "ref": "a",
                    "note": "96:15."
                },
                {
                    "ref": "4727",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse warns disbelievers that if they think that they can suppress Islam and by means of their wealth and influence can arrest its progress, they labour under a serious misconception. God is aware of their evil designs and He has the power and will bring them to nought.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 7,
        "v_": 6,
        "topics": [],
        "ar": "یَقُوۡلُ  اَہۡلَکۡتُ مَالًا  لُّبَدًا ؕ﴿۷﴾ ",
        "ur": "وہ کہتا ہے میں نے ڈھیروں مال لُٹا دیا۔",
        "v5": {
            "text": "He says, ‘I have spent enormous wealth.’[4728]",
            "notes": [
                {
                    "ref": "4728",
                    "note": "<p><strong>Important Words:</strong></p><p>لبد (enormous) means, much wealth; wealth so abundant that there is no fear of its being exhausted; wealth collected in heaps (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>Let the opponents of Islam use all their means (the verse purports to say) and spend heaps of wealth to stop spread of Islam, they will not succeed in their evil designs and Islam will continue to make both spiritual and political conquests.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 8,
        "v_": 7,
        "topics": [],
        "ar": "اَیَحۡسَبُ اَنۡ  لَّمۡ  یَرَہٗۤ   اَحَدٌ ؕ﴿۸﴾ ",
        "ur": "کیا وہ سمجھتا ہے کہ اسے کسی نے نہیں دیکھا؟",
        "v5": {
            "text": "Does he think that no one sees him?[4729]",
            "notes": [
                {
                    "ref": "4729",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means that God sees deep into the hearts of opponents of the Holy Prophet. All their endeavours and designs to bring about the failure of his Movement will prove abortive.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 16844,
                "topic": "Sin: <i>Dhanb</i>: man created without",
                "verses": "7:43, 7:23, 49:8, 75:3, 76:3-4, 91:8-9, 95:5-6"
            }
        ],
        "ar": "اَلَمۡ  نَجۡعَلۡ لَّہٗ عَیۡنَیۡنِ ۙ﴿۹﴾ ",
        "ur": "کیا ہم نے اُس کے لئے دو آنکھیں نہیں بنائیں؟",
        "v5": {
            "text": "Have We not given him two eyes,",
            "notes": null
        }
    },
    {
        "ch": 90,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 16844,
                "topic": "Sin: <i>Dhanb</i>: man created without",
                "verses": "7:43, 7:23, 49:8, 75:3, 76:3-4, 91:8-9, 95:5-6"
            },
            {
                "id": 17719,
                "topic": "Tongue: <i>Lisan</i>",
                "verses": "5:79, 3:79, 4:47, 7:177, 16:63, 16:104, 16:117, 19:51, 19:98, 20:28, 24:16, 24:25, 26:14, 26:85, 26:196, 30:23, 33:20, 41:45, 42:8, 44:59, 48:12, 60:3, 75:17"
            }
        ],
        "ar": "وَ  لِسَانًا وَّ  شَفَتَیۡنِ ۙ﴿۱۰﴾ ",
        "ur": "اور زبان اور دو ہونٹ؟",
        "v5": {
            "text": "And a tongue and two lips?",
            "notes": null
        }
    },
    {
        "ch": 90,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 5192,
                "topic": "Compulsion in Faith: <i>Ikrah fid-Din</i>",
                "verses": "2:257, 2:191, 2:194, 5:49, 5:93, 6:150, 7:89, 8:40, 9:6, 10:100, 11:119, 13:32, 16:10, 18:21, 18:30, 22:39, 22:41, 25:58, 26:5, 50:46, 76:4, 95:6, 109:7"
            },
            {
                "id": 10812,
                "topic": "Man: granted freedom of choice",
                "verses": "6:108, 6:150, 41:12, 41:41, 76:4, 91:9"
            },
            {
                "id": 14860,
                "topic": "Qada’ Qadr: free will",
                "verses": "54:50, 13:28, 3:87, 6:36, 6:126, 13:12, 13:32-33, 16:94, 16:105, 35:46, 71:5, 74:32, 76:4"
            },
            {
                "id": 16844,
                "topic": "Sin: <i>Dhanb</i>: man created without",
                "verses": "7:43, 7:23, 49:8, 75:3, 76:3-4, 91:8-9, 95:5-6"
            }
        ],
        "ar": "وَ ہَدَیۡنٰہُ  النَّجۡدَیۡنِ ﴿ۚ۱۱﴾ ",
        "ur": "اور ہم نے اُسے دو مرتفع راستوں کی طرف ہدایت دی۔",
        "v5": {
            "text": "[b]And We have pointed out to him the two highways <i>of good and evil</i>.[4730]",
            "notes": [
                {
                    "ref": "b",
                    "note": "76:4."
                },
                {
                    "ref": "4730",
                    "note": "<p><strong>Important Words:</strong></p><p>النجدین (two highways). نجد is inf. noun from نجد (<i>najada</i>). نجدہ means, he helped him. أنجد البناء means, the building rose high. نجد (<i>najdun</i>) means, high and elevated land; an elevated or conspicuous road; a road in a mountain; a plain or evident affair; a skilful guide (Lane &amp; Aqrab). النجدین signifies, the two high or conspicuous ways of good and evil, of truth and falsehood, of spiritual and material progress (Aqrab).</p><p><strong>Commentary:</strong></p><p>God has provided man with all those means by which he can find out the right path, can sift right from wrong and truth from falsehood. He has been endowed with both spiritual and physical eyes that he may distinguish good from evil. He has been given a tongue and two lips that he might ask for guidance, and above all God has placed before him a supreme object that he may devote all his faculties and energies to achieve it.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 14019,
                "topic": "Poor",
                "verses": "2:272, 3:182, 4:7, 4:136, 9:60, 22:29, 24:33, 28:25, 35:16, 47:39, 69:35, 107:4"
            }
        ],
        "ar": "فَلَا  اقۡتَحَمَ الۡعَقَبَۃَ ﴿۫ۖ۱۲﴾ ",
        "ur": "پس وہ عَقَبَہ پر نہیں چڑھا۔",
        "v5": {
            "text": "But he attempted not the steep ascent.[4731]",
            "notes": [
                {
                    "ref": "4731",
                    "note": "<p><strong>Important Words:</strong></p><p>اقتحم (attempted). They say اقتحم فی الامر i.e. he rushed or plunged into the affair without consideration. اقتحم المنزل means, he entered the place suddenly and without permission; rushed suddenly upon the place; he invaded or attacked the place. اقتحم العقبة means, he ascended or attacked or rushed upon عقبه which means, hill; mountain; high place; steep road (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse means that through the Holy Prophet God had opened up for the Arabs all the ways and means by using which they could make unlimited spiritual and material progress but they refused to make the necessary sacrifices required to achieve the two objectives. See also next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 14019,
                "topic": "Poor",
                "verses": "2:272, 3:182, 4:7, 4:136, 9:60, 22:29, 24:33, 28:25, 35:16, 47:39, 69:35, 107:4"
            }
        ],
        "ar": "وَ مَاۤ  اَدۡرٰٮکَ مَا الۡعَقَبَۃُ ﴿ؕ۱۳﴾ ",
        "ur": "اور تُجھے کیا سمجھائے کہ عَقَبَہ کیا ہے؟",
        "v5": {
            "text": "And what should make thee know what the steep ascent is?",
            "notes": null
        }
    },
    {
        "ch": 90,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 4932,
                "topic": "Captives: <i>Asir</i>",
                "verses": "8:68-69, 2:86, 2:178, 4:25, 5:90, 8:71, 9:60, 33:27, 47:5, 58:4, 76:9"
            },
            {
                "id": 11840,
                "topic": "Moral Traits: kindness",
                "verses": "17:24-25, 2:84, 2:178, 2:216, 2:242, 2:264, 2:281, 4:6, 4:9, 4:37, 5:55, 6:152, 7:200, 9:61, 16:91, 17:29, 29:9, 30:39, 31:15, 31:16, 33:50, 51:20, 60:9, 76:9"
            },
            {
                "id": 12892,
                "topic": "Nations",
                "verses": "11:102, 2:245, 2:262, 2:270, 3:27-28, 3:140, 7:35, 10:25, 17:17, 21:97, 21:105, 23:81, 29:21, 29:25, 31:30, 35:10, 36:69, 38:54, 83:2-6, 103:2-4, 111:5-6"
            },
            {
                "id": 14019,
                "topic": "Poor",
                "verses": "2:272, 3:182, 4:7, 4:136, 9:60, 22:29, 24:33, 28:25, 35:16, 47:39, 69:35, 107:4"
            },
            {
                "id": 16927,
                "topic": "Slavery: abolition of",
                "verses": "47:5, 24:34, 33:51"
            }
        ],
        "ar": "فَکُّ رَقَبَۃٍ ﴿ۙ۱۴﴾ ",
        "ur": "گردن کاآزاد کرنا۔",
        "v5": {
            "text": "<i>It is</i> the freeing of a slave.",
            "notes": null
        }
    },
    {
        "ch": 90,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 5789,
                "topic": "Day of Hunger: <i>Yaumo Dhi-Masghabah</i>",
                "verses": null
            },
            {
                "id": 7717,
                "topic": "Food: <i>Ta‘am</i>: for poor",
                "verses": "5:6, 5:90, 5:96, 69:35, 74:45, 76:9, 89:19, 107:4"
            },
            {
                "id": 11670,
                "topic": "Moral Traits: feeding the hungry",
                "verses": "76:9"
            },
            {
                "id": 11840,
                "topic": "Moral Traits: kindness",
                "verses": "17:24-25, 2:84, 2:178, 2:216, 2:242, 2:264, 2:281, 4:6, 4:9, 4:37, 5:55, 6:152, 7:200, 9:61, 16:91, 17:29, 29:9, 30:39, 31:15, 31:16, 33:50, 51:20, 60:9, 76:9"
            },
            {
                "id": 12892,
                "topic": "Nations",
                "verses": "11:102, 2:245, 2:262, 2:270, 3:27-28, 3:140, 7:35, 10:25, 17:17, 21:97, 21:105, 23:81, 29:21, 29:25, 31:30, 35:10, 36:69, 38:54, 83:2-6, 103:2-4, 111:5-6"
            },
            {
                "id": 13347,
                "topic": "Orphans: <i>Yatim</i>: welfare of",
                "verses": "2:221, 2:178, 2:216, 4:3-4, 4:128, 8:42, 59:8, 76:9"
            },
            {
                "id": 14019,
                "topic": "Poor",
                "verses": "2:272, 3:182, 4:7, 4:136, 9:60, 22:29, 24:33, 28:25, 35:16, 47:39, 69:35, 107:4"
            }
        ],
        "ar": "اَوۡ  اِطۡعٰمٌ فِیۡ یَوۡمٍ ذِیۡ مَسۡغَبَۃٍ ﴿ۙ۱۵﴾ ",
        "ur": "یا ایک عام فاقے والے دن میں کھانا کھلانا۔",
        "v5": {
            "text": "[a]Or feeding on a day of hunger[4732]",
            "notes": [
                {
                    "ref": "a",
                    "note": "76:9; 89:19."
                },
                {
                    "ref": "4732",
                    "note": "<p><strong>Important Words:</strong></p><p>مسغبة (hunger) is derived from سغب which means, he was or became hungry or suffered hunger, together with fatigue. أسغب القوم means, the people entered upon a state of hunger. They say به مسغبة i.e. in him is hunger or hunger together with fatigue (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 7717,
                "topic": "Food: <i>Ta‘am</i>: for poor",
                "verses": "5:6, 5:90, 5:96, 69:35, 74:45, 76:9, 89:19, 107:4"
            },
            {
                "id": 11670,
                "topic": "Moral Traits: feeding the hungry",
                "verses": "76:9"
            },
            {
                "id": 11840,
                "topic": "Moral Traits: kindness",
                "verses": "17:24-25, 2:84, 2:178, 2:216, 2:242, 2:264, 2:281, 4:6, 4:9, 4:37, 5:55, 6:152, 7:200, 9:61, 16:91, 17:29, 29:9, 30:39, 31:15, 31:16, 33:50, 51:20, 60:9, 76:9"
            },
            {
                "id": 12892,
                "topic": "Nations",
                "verses": "11:102, 2:245, 2:262, 2:270, 3:27-28, 3:140, 7:35, 10:25, 17:17, 21:97, 21:105, 23:81, 29:21, 29:25, 31:30, 35:10, 36:69, 38:54, 83:2-6, 103:2-4, 111:5-6"
            },
            {
                "id": 13347,
                "topic": "Orphans: <i>Yatim</i>: welfare of",
                "verses": "2:221, 2:178, 2:216, 4:3-4, 4:128, 8:42, 59:8, 76:9"
            },
            {
                "id": 14019,
                "topic": "Poor",
                "verses": "2:272, 3:182, 4:7, 4:136, 9:60, 22:29, 24:33, 28:25, 35:16, 47:39, 69:35, 107:4"
            }
        ],
        "ar": "یَّتِیۡمًا ذَا مَقۡرَبَۃٍ ﴿ۙ۱۶﴾ ",
        "ur": "ایسے یتیم کو جو قرابت والا ہو۔",
        "v5": {
            "text": "An orphan near of kin.",
            "notes": null
        }
    },
    {
        "ch": 90,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 7717,
                "topic": "Food: <i>Ta‘am</i>: for poor",
                "verses": "5:6, 5:90, 5:96, 69:35, 74:45, 76:9, 89:19, 107:4"
            },
            {
                "id": 11670,
                "topic": "Moral Traits: feeding the hungry",
                "verses": "76:9"
            },
            {
                "id": 11840,
                "topic": "Moral Traits: kindness",
                "verses": "17:24-25, 2:84, 2:178, 2:216, 2:242, 2:264, 2:281, 4:6, 4:9, 4:37, 5:55, 6:152, 7:200, 9:61, 16:91, 17:29, 29:9, 30:39, 31:15, 31:16, 33:50, 51:20, 60:9, 76:9"
            },
            {
                "id": 12892,
                "topic": "Nations",
                "verses": "11:102, 2:245, 2:262, 2:270, 3:27-28, 3:140, 7:35, 10:25, 17:17, 21:97, 21:105, 23:81, 29:21, 29:25, 31:30, 35:10, 36:69, 38:54, 83:2-6, 103:2-4, 111:5-6"
            },
            {
                "id": 14019,
                "topic": "Poor",
                "verses": "2:272, 3:182, 4:7, 4:136, 9:60, 22:29, 24:33, 28:25, 35:16, 47:39, 69:35, 107:4"
            }
        ],
        "ar": "اَوۡ مِسۡکِیۡنًا ذَا مَتۡرَبَۃٍ ﴿ؕ۱۷﴾ ",
        "ur": "یا ایسے مسکین کو جو خاک آلودہ ہو۔",
        "v5": {
            "text": "Or a poor man <i>lying</i> in the dust.[4733]",
            "notes": [
                {
                    "ref": "4733",
                    "note": "<p><strong>Commentary:</strong></p><p>These verses (vv. 14-17) speak of the two methods to raise the moral stature of a people: (a) Freeing of the slaves, i.e. raising the suppressed, oppressed and depressed sections of the community to an equal partnership in life. (b) Helping the orphans and the poor to stand on their own legs and to become useful members of the community.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 18,
        "v_": 17,
        "topics": [
            {
                "id": 12892,
                "topic": "Nations",
                "verses": "11:102, 2:245, 2:262, 2:270, 3:27-28, 3:140, 7:35, 10:25, 17:17, 21:97, 21:105, 23:81, 29:21, 29:25, 31:30, 35:10, 36:69, 38:54, 83:2-6, 103:2-4, 111:5-6"
            }
        ],
        "ar": "ثُمَّ کَانَ مِنَ الَّذِیۡنَ  اٰمَنُوۡا وَ تَوَاصَوۡا بِالصَّبۡرِ  وَ تَوَاصَوۡا بِالۡمَرۡحَمَۃِ ﴿ؕ۱۸﴾ ",
        "ur": "پھر وہ اُن میں سے ہو جائے جو ایمان لے آئے اور صبر پر قائم رہتے ہوئے ایک دوسرے کو صبر کی نصیحت کرتے ہیں اور رحم پر قائم رہتے ہوئے ایک دوسرے کو رحم کی نصیحت کرتے ہیں۔",
        "v5": {
            "text": "Then, he should have been of those who believe and exhort one another to perseverance and exhort one another to mercy[a].[4734]",
            "notes": [
                {
                    "ref": "a",
                    "note": "103:4."
                },
                {
                    "ref": "4734",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse points out that the doing only of good actions mentioned in the foregoing verses is not enough for raising the all round stature of a community. Good ideals and right principles, combined with continuous and sustained adherence to the path of moral rectitude and the teaching of virtues to others, are equally essential for the attainment of the above-mentioned high aim.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 19,
        "v_": 18,
        "topics": [
            {
                "id": 2936,
                "topic": "Ashabul-Maimanah",
                "verses": "56:9"
            }
        ],
        "ar": "اُولٰٓئِکَ اَصۡحٰبُ الۡمَیۡمَنَۃِ ﴿ؕ۱۹﴾ ",
        "ur": "یہی ہیں دائیں طرف والے۔",
        "v5": {
            "text": "These are the people of the right hand[b].[4735]",
            "notes": [
                {
                    "ref": "b",
                    "note": "56:28; 69:20; 84:8-9."
                },
                {
                    "ref": "4735",
                    "note": "<p><strong>Commentary:</strong></p><p>See 56:9.</p>"
                }
            ]
        }
    },
    {
        "ch": 90,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 8764,
                "topic": "Hell: <i>Jahannam</i>: for those who reject or hide signs of Allah",
                "verses": "19:69, 2:40, 2:175, 4:57, 18:107, 40:71-73, 45:12, 45:35, 45:36, 57:20, 64:11, 73:12-14"
            }
        ],
        "ar": "وَ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِنَا ہُمۡ اَصۡحٰبُ الۡمَشۡـَٔمَۃِ ﴿ؕ۲۰﴾ ",
        "ur": "اور وہ لوگ جنہوں نے ہماری آیات کا انکار کردیا وہ بائیں طرف والے ہیں۔",
        "v5": {
            "text": "But those who disbelieve Our Signs, they are the people of the left hand[c].[4735A]",
            "notes": [
                {
                    "ref": "c",
                    "note": "56:42; 69:26; 84:11-12."
                },
                {
                    "ref": "4735A",
                    "note": "<p><strong>Commentary:</strong></p><p>See 56:10.</p>"
                }
            ]
        }
    }
]
