[
    {
        "ch": 28,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[2876]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                },
                {
                    "ref": "2876",
                    "note": "<p><strong>Commentary:</strong></p><p>See 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 73,
                "topic": "Abbreviations: <i>Ta Sin Mim</i>",
                "verses": "26:2"
            }
        ],
        "ar": "طٰسٓمّٓ ﴿۲﴾ ",
        "ur": "طَیِّب سَمِیع عَلِیم : پاک، بہت سننے والا، بہت جاننے والا۔",
        "v5": {
            "text": "[b]Ta Sin Mim.[2876A]",
            "notes": [
                {
                    "ref": "b",
                    "note": "26:2; 27:2."
                },
                {
                    "ref": "2876A",
                    "note": "<p><strong>Commentary:</strong></p><p>For an explanation of the abbreviated letters, <i>Ta Sin Mim</i>, see 26:2 &amp; 27:2.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 3,
        "v_": 2,
        "topics": [],
        "ar": "تِلۡکَ اٰیٰتُ  الۡکِتٰبِ  الۡمُبِیۡنِ ﴿۳﴾ ",
        "ur": "یہ ایک کھلی کھلی کتاب کی آیات ہیں۔",
        "v5": {
            "text": "[c]These are verses of the clear Book.[2877]",
            "notes": [
                {
                    "ref": "c",
                    "note": "12:2; 15:2; 26:3; 27:2."
                },
                {
                    "ref": "2877",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse has been commented upon in some detail in 12:2; 26:3 &amp; 27:2.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "نَتۡلُوۡا عَلَیۡکَ مِنۡ نَّبَاِ مُوۡسٰی وَ فِرۡعَوۡنَ بِالۡحَقِّ  لِقَوۡمٍ  یُّؤۡمِنُوۡنَ ﴿۴﴾ ",
        "ur": "ہم تیرے سامنے موسیٰ اور فرعون کی خبر میں سے حق کے ساتھ کچھ پڑھتے ہیں، اُن لوگوں کی خاطر جو ایمان لانے والے ہیں۔",
        "v5": {
            "text": "We rehearse unto thee <i>a portion</i> of the story of Moses and Pharaoh with truth, for <i>the benefit of</i> a people who would believe.[2878]",
            "notes": [
                {
                    "ref": "2878",
                    "note": "<p><strong>Commentary:</strong></p><p>Perhaps in no other <i>Surah</i> of the Quran have the different phases of Moses’ life been treated in such detail as in the present <i>Surah</i>—his infancy, and childhood, his youth, his flight or exile and his Call. The Holy Prophet’s pre-eminence as a Prophet is a thing apart, but as he has been \"likened\" to Moses, the conditions and circumstances of his life resemble more those of Moses than of any other Prophet.</p><p>The words, \"with truth\" imply that the Quranic narrative of Moses differs in certain details from that of the Bible but wherever the Quranic description differs from the Biblical account, it will be found to be nearer truth and reality.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 1432,
                "topic": "Allah: does not love mischief-mongers",
                "verses": "28:78, 2:12-13, 2:28, 2:61, 2:252, 5:33-34, 5:65, 7:57, 7:75, 7:87, 7:104, 7:143, 8:74, 10:82, 11:86, 13:26, 17:5, 18:95, 26:153, 26:184, 28:84, 38:29, 89:13"
            },
            {
                "id": 6564,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:20, 8:26, 8:40, 8:74, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 13:26, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:78, 28:84, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 7306,
                "topic": "Exploitation",
                "verses": "83:2-6, 11:85, 26:182-184, 55:10"
            },
            {
                "id": 9592,
                "topic": "Israelites: suffered cruelties",
                "verses": "3:94, 2:50, 7:142, 14:7"
            },
            {
                "id": 11471,
                "topic": "Mischief",
                "verses": "10:82, 10:92, 11:79, 12:30, 12:74, 28:78, 38:42, 113:5"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13304,
                "topic": "Oppressed: weak, <i>da‘if</i>",
                "verses": "14:22, 2:267, 2:283, 4:10, 4:76, 4:98-99, 7:76, 8:27, 9:91, 11:92, 34:32-33, 40:48"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "اِنَّ فِرۡعَوۡنَ عَلَا فِی الۡاَرۡضِ وَ جَعَلَ اَہۡلَہَا شِیَعًا یَّسۡتَضۡعِفُ طَآئِفَۃً  مِّنۡہُمۡ یُذَبِّحُ اَبۡنَآءَہُمۡ وَ یَسۡتَحۡیٖ نِسَآءَہُمۡ ؕ اِنَّہٗ  کَانَ مِنَ الۡمُفۡسِدِیۡنَ ﴿۵﴾ ",
        "ur": "فرعون نے یقیناً زمین میں سرکشی کی اور اس کے باشندوں کو گروہ درگروہ بانٹ دیا۔ وہ ان میں سے کسی ایک گروہ کو بے بس کر دیتا تھا۔ ان کے بیٹوں کوذبح کرتا تھا اور ان کی عورتوں کو زندہ رکھتا تھا۔ یقیناً وہ فساد کرنے والوں میں سے تھا۔",
        "v5": {
            "text": "[d]Verily, Pharaoh behaved arrogantly in the earth, and divided the people thereof into parties; he sought to weaken one party of them, [e]slaying their sons, and sparing their women. Certainly, he was of the mischief makers.[2879]",
            "notes": [
                {
                    "ref": "d",
                    "note": "10:84."
                },
                {
                    "ref": "e",
                    "note": "2:50; 7:142; 14:7."
                },
                {
                    "ref": "2879",
                    "note": "<p><strong>Commentary:</strong></p><p>The policy of \"divide and rule\" which has been practised with such deadly effect by the Colonial Powers of the west in this twentieth century was also followed by Pharaoh. He had split the people of Egypt into parties and sections and had made invidious distinctions between them. Some of them he favoured and others he exploited and suppressed. Moses’ people belonged to the latter unfortunate class.</p><p>The words, \"he slew their sons and spared their women,\" besides bearing the apparent sense, viz. that in order to keep the Israelites under permanent subjection, Pharaoh destroyed their manhood and kept alive their women, may also signify that by his policy of exploitation and heartless suppression, Pharaoh sought to kill all manly qualities among the Israelites and thus made them timid like women.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 1572,
                "topic": "Allah: favour on Israelites",
                "verses": "2:50-54, 7:142, 14:7"
            },
            {
                "id": 9542,
                "topic": "Israelites: Allah’s favour on",
                "verses": "3:94, 2:48, 2:58, 2:61, 2:63, 2:123, 5:70, 7:161, 26:60"
            },
            {
                "id": 9573,
                "topic": "Israelites: Moses rescued",
                "verses": "3:94, 20:78-79, 7:106, 20:48, 26:53, 44:24"
            },
            {
                "id": 12058,
                "topic": "Moses: Musa(as): and Israelites",
                "verses": "61:6, 5:26-27, 7:106, 7:160, 10:84-94, 17:5-9, 26:53"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13304,
                "topic": "Oppressed: weak, <i>da‘if</i>",
                "verses": "14:22, 2:267, 2:283, 4:10, 4:76, 4:98-99, 7:76, 8:27, 9:91, 11:92, 34:32-33, 40:48"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ نُرِیۡدُ اَنۡ نَّمُنَّ عَلَی الَّذِیۡنَ اسۡتُضۡعِفُوۡا فِی الۡاَرۡضِ وَ نَجۡعَلَہُمۡ اَئِمَّۃً  وَّ  نَجۡعَلَہُمُ  الۡوٰرِثِیۡنَ ۙ﴿۶﴾ ",
        "ur": "اور ہم نے ارادہ کیا کہ جو لوگ ملک میں کمزور سمجھے گئے ان پر احسان کریں اور انہیں رہنما بنادیں اور اُنہیں وارث کر دیں۔",
        "v5": {
            "text": "And We desired to show favour unto those who had been considered weak in the earth, and to make them leaders and to make them inheritors <i>of Our favours</i>,[2880]",
            "notes": [
                {
                    "ref": "2880",
                    "note": "<p><strong>Commentary:</strong></p><p>When the degradation and humiliation of the Israelites in Egypt reached its nadir and the cup of iniquities of Pharaoh and his people became full to the brim and God in His infallible wisdom decreed that the oppressors should be punished and those held in bondage be emancipated, He raised Moses. Such has always been God’s practice that He raises a Prophet to lead a down-trodden people to honour and glory and through his influence and under his lead the erstwhile suppressed and exploited people become the leaders and teachers of men. This phenomenon which took place in the time of every Divine Messenger witnessed its fullest and finest manifestation during the ministry of the Holy Prophet of Islam.</p><p>The words \"to make them inheritors\", refer to the Israelites becoming heirs to that 'land of promise'—Canaan—which, like Egypt, \"flowed with milk and honey\" and which God had \"ordained for them\" (5:22).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 1572,
                "topic": "Allah: favour on Israelites",
                "verses": "2:50-54, 7:142, 14:7"
            },
            {
                "id": 8369,
                "topic": "Haman",
                "verses": "28:39, 28:9, 40:25, 40:37"
            },
            {
                "id": 9573,
                "topic": "Israelites: Moses rescued",
                "verses": "3:94, 20:78-79, 7:106, 20:48, 26:53, 44:24"
            },
            {
                "id": 12058,
                "topic": "Moses: Musa(as): and Israelites",
                "verses": "61:6, 5:26-27, 7:106, 7:160, 10:84-94, 17:5-9, 26:53"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ نُمَکِّنَ لَہُمۡ فِی الۡاَرۡضِ وَ نُرِیَ فِرۡعَوۡنَ وَ ہَامٰنَ وَ جُنُوۡدَہُمَا مِنۡہُمۡ مَّا  کَانُوۡا  یَحۡذَرُوۡنَ ﴿۷﴾ ",
        "ur": "اور اُنہیں زمین میں تمکنت عطا کریں اور فرعون اور ہامان اور ان دونوں کے لشکروں کو ان (بنی اسرائیل) کی طرف سے وہ کچھ دکھا دیں جس سے وہ ڈرتے تھے۔",
        "v5": {
            "text": "[a]And to establish them in the earth, and to show Pharaoh and Haman and their hosts that which they feared from them.[2881]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:138; 26:60; 44:29."
                },
                {
                    "ref": "2881",
                    "note": "<p><strong>Commentary:</strong></p><p>Exploitation and tyranny produce their own nemesis and the exploiters and oppressors never feel secure from the standard of revolt being raised against them by those whom they exploit, suppress and oppress. The greater the oppression of the tyrant, the greater his fear of revolt on the part of the tyrannized. Pharaoh, too, was seized with this fear and, therefore, he employed all sorts of means and machinations to keep the Israelites under permanent subjection. But the time had come that he should be punished and those held in bondage should be emancipated.</p><p>Haman was the title of the High Priest of the god Amon, \"ham\" in Egyptian meaning high priest and Amon was the god who dominated all other Egyptian gods. \"Haman was the director of the double treasury and granary and director of the soldiers and all the craftsmen of Thebes. His name was Nebunnef and he was high priest under Ramesus II and his son Merneptah. Being the head of the extremely rich sacerdotal organization embracing all the priesthoods of the country his power and prestige had increased so much that he controlled a most influential political faction and even kept his own private army\" (A story of Egypt by James Henry Breasted, Ph.D.).</p><p>Haman is also said to be the name of a minister of Ahasuerus, a king of Persia who lived many ages after Moses. There is nothing strange or objectionable in two persons living in two different periods bearing the same name. But Mr. Wherry, only to expose his own crass ignorance, has pretended to discover a serious anachronism in the Quran having called a minister of Pharaoh by the name of Haman, which incidentally was also the name of a minister of a king of Persia (Wherry’s Commentary, vol. 3, p. 254). In fact, anachronism lies in the brain of Mr. Wherry himself and not in the Quran.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 12158,
                "topic": "Mother of: <i>Umm...</i>: Moses",
                "verses": "28:11, 20:39-40"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 15696,
                "topic": "Revelation: to non-Prophets",
                "verses": "16:69-70, 19:12, 20:39-40, 41:13, 41:31, 97:5"
            },
            {
                "id": 15923,
                "topic": "River: Moses thrown into",
                "verses": "20:40"
            }
        ],
        "ar": "وَ اَوۡحَیۡنَاۤ  اِلٰۤی اُمِّ مُوۡسٰۤی اَنۡ  اَرۡضِعِیۡہِ ۚ فَاِذَا خِفۡتِ عَلَیۡہِ  فَاَلۡقِیۡہِ فِی الۡیَمِّ  وَ لَا تَخَافِیۡ  وَ لَا تَحۡزَنِیۡ ۚ اِنَّا رَآدُّوۡہُ  اِلَیۡکِ وَ جَاعِلُوۡہُ  مِنَ الۡمُرۡسَلِیۡنَ ﴿۸﴾ ",
        "ur": "اور ہم نے موسیٰ کی ماں کی طرف وحی کی کہ اُسے دودھ پلا۔ پس جب تو اُس کے بارہ میں خوف محسوس کرے تو اسے دریا میں ڈال دے اور کوئی خوف نہ کر اور کوئی غم نہ کھا۔ ہم یقیناً اسے تیری طرف دوبارہ لانے والے ہیں اور اسے مرسلین میں سے (ایک رسول) بنانے والے ہیں۔",
        "v5": {
            "text": "[a]And We revealed to the mother of Moses <i>saying</i>, ‘Suckle him; and when thou fearest for him, then cast him into the river and fear not, nor grieve; for We shall restore him to thee, and shall make him <i>one</i> of the Messengers.’[2882]",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:39."
                },
                {
                    "ref": "2882",
                    "note": "<p><strong>Commentary:</strong></p><p>The preceding seven verses had spoken of Moses’ mission and by implication had referred to the mission of the Holy Prophet and in fact to the mission of every Prophet of God. From this verse, however, begins the actual story of Moses.</p><p>Whereas Moses was cast into the river by his mother to escape being killed by the people of Pharaoh, the Holy Prophet’s mother had to entrust him, while yet a child, to the care of a poor wet-nurse, to whom all the well-to-do families of Mecca had refused to entrust their babies on account of her poverty.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 7377,
                "topic": "Family",
                "verses": "11:46-47, 2:41, 2:197, 2:249, 3:34, 3:36, 7:84, 11:41, 11:82, 12:7, 12:89, 15:66, 20:30, 21:77, 21:85, 26:170-171, 27:50, 28:30, 29:33, 37:77, 38:44, 49:14, 84:10"
            },
            {
                "id": 8370,
                "topic": "Haman",
                "verses": "28:39, 28:7, 40:25, 40:37"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "فَالۡتَقَطَہٗۤ  اٰلُ فِرۡعَوۡنَ  لِیَکُوۡنَ لَہُمۡ عَدُوًّا وَّ حَزَنًا ؕ اِنَّ فِرۡعَوۡنَ  وَ ہَامٰنَ  وَ جُنُوۡدَہُمَا  کَانُوۡا خٰطِئِیۡنَ ﴿۹﴾ ",
        "ur": "پس فرعون کے خاندان نے (اذنِ الٰہی کے مطابق) اسے اٹھا لیا تاکہ وہ ان کے لئے دشمن (ثابت ہو) اور غم کا موجب بن جائے۔ یقیناً فرعون اور ہامان اور ان دونوں کے لشکر خطاکار تھے۔",
        "v5": {
            "text": "[a]And the people of Pharaoh picked him up that he might become for them an enemy and a <i>source of</i> sorrow. Verily, Pharaoh and Haman and their hosts were wrongdoers.[2883]",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:40."
                },
                {
                    "ref": "2883",
                    "note": "<p><strong>Important Words:</strong></p><p>التقطه (picked him up) is derived from لقط which means, he picked it up, took it up from the ground. التقط الشیء means, he picked up the thing; he stumbled upon it unexpectedly without seeking it. لقیته التقاطا means, I met him unexpectedly (Lane &amp; Aqrab).</p><p>The particle ل in لیکون (that he might become) is called لام العاقبة and denotes result and consequence, as in the well-known Arabic couplet:</p><p>لدو اللموت وابنوا للخراب</p><p>فکلکم یسیر الی تباب</p><p>i.e. bear children that they should die and build houses that they should fall into ruins, for all of you are marching towards destruction. Thus the first part of the verse would mean, \"And the family of Pharaoh picked him up with the result that ultimately he became an enemy and a source of great grief and sorrow for them.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 653,
                "topic": "Adoption: <i>Ad‘iya’</i>",
                "verses": "33:5, 33:38"
            },
            {
                "id": 1088,
                "topic": "‘Ain: eyes",
                "verses": "7:41, 20:40-41, 5:46, 16:78, 17:37, 19:27, 28:14, 53:18, 54:51, 75:8, 102:8"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ قَالَتِ امۡرَاَتُ فِرۡعَوۡنَ قُرَّتُ عَیۡنٍ لِّیۡ وَ لَکَ ؕ لَا تَقۡتُلُوۡہُ ٭ۖ عَسٰۤی اَنۡ  یَّنۡفَعَنَاۤ اَوۡ  نَتَّخِذَہٗ   وَلَدًا  وَّ  ہُمۡ  لَا یَشۡعُرُوۡنَ ﴿۱۰﴾ ",
        "ur": "اور فرعون کی بیوی نے کہا کہ (یہ) میرے لئے اور تیرے لئے آنکھوں کی ٹھنڈک (ثابت) ہوگا، اسے قتل نہ کرو۔ ہو سکتا ہے کہ ہمیں یہ فائدہ دے یا ہم اسے بیٹا بنا لیں جبکہ وہ کچھ شعور نہیں رکھتے ہوں گے۔",
        "v5": {
            "text": "And Pharaoh’s wife said, ‘<i>He will be</i> a joy of the eye for me and for thee. Slay him not. Haply he will be useful to us, or we may adopt him as a son.’ And they perceived not <i>the consequences thereof</i>.[2884]",
            "notes": [
                {
                    "ref": "2884",
                    "note": "<p><strong>Commentary:</strong></p><p>God’s ways indeed are inscrutable. Pharaoh did not know that the very child upon whom he had lavished so much care and love will one day prove an instrument of punishment for him in the hands of Destiny because he had flouted and defied Divine commandments and had held the Israelites in bondage and had tyrannized over them for a long time.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 8431,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>",
                "verses": "53:12, 3:30, 3:120, 7:44, 9:14, 10:58, 15:48, 17:37, 22:47, 25:33, 29:50, 40:20, 100:10-11, 104:8, 114:6"
            },
            {
                "id": 8519,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: strengthened",
                "verses": "53:12, 18:15, 8:12, 11:121"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 12156,
                "topic": "Mother of: <i>Umm...</i>: Moses",
                "verses": "20:39-40, 28:8"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ اَصۡبَحَ فُؤَادُ  اُمِّ مُوۡسٰی فٰرِغًا ؕ اِنۡ کَادَتۡ لَتُبۡدِیۡ بِہٖ  لَوۡ لَاۤ  اَنۡ رَّبَطۡنَا عَلٰی قَلۡبِہَا لِتَکُوۡنَ مِنَ الۡمُؤۡمِنِیۡنَ ﴿۱۱﴾ ",
        "ur": "اور موسیٰ کی ماں کا دل (فکروں سے) فارغ ہوگیا۔ عین ممکن تھا کہ وہ اس (راز) کو ظاہر کر دیتی اگر ہم اس کے دل کو سنبھالے نہ رکھتے۔ (ہم نے ایسا کیا) تاکہ وہ مومنوں میں سے ہوجاتی۔",
        "v5": {
            "text": "And the heart of the mother of Moses became free <i>from anxiety.</i> She had almost disclosed <i>his identity</i>, were it not that We had strengthened her heart so that she might be of the <i>firm</i> believers.[2885]",
            "notes": [
                {
                    "ref": "2885",
                    "note": "<p><strong>Important Words:</strong></p><p>فارغا (free from anxiety) is derived from فرغ which means, it was or became empty, void, devoid; he died. فرغ له means, he made him or it the object to which he directed himself. فارغ means, vacant, devoid of or free from care or anxiety or disquietude (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The heart of Moses’ mother became free from care or anxiety because of the consolation and assurance given to her by Divine revelation referred to in v. 8 above. The pronoun ہ in به may refer either to Moses or to the matter concerned. In the first case the expression ان کادت لتبدی به would mean that Moses’ mother was so much pleased with Moses having been restored to her that out of joy she was on the point of declaring that the child belonged to her. In the second case the meaning would be that if God had not restrained her, she almost had told people about the whole affair—how she had received a Divine revelation and how in pursuance of it she had put the child into the river and so on.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ قَالَتۡ لِاُخۡتِہٖ قُصِّیۡہِ ۫ فَبَصُرَتۡ بِہٖ عَنۡ  جُنُبٍ  وَّ  ہُمۡ  لَا  یَشۡعُرُوۡنَ ﴿ۙ۱۲﴾ ",
        "ur": "اور اُس (یعنی موسیٰ کی ماں) نے اُس کی بہن سے کہا کہ اس کے پیچھے پیچھے جا۔ پس وہ دُور سے اُسے دیکھتی رہی اور انہیں کچھ پتہ نہ تھا۔",
        "v5": {
            "text": "And she said to his sister, ‘Follow him up.’ So she observed him from afar; and they knew not <i>of her relationship</i>.[2885A]",
            "notes": [
                {
                    "ref": "2885A",
                    "note": "<p><strong>Important Words:</strong></p><p>قصیه (follow him up) is derived from قص. They say قصه i.e. he cut it; or he clipped it. قص أثرہ means, he followed, or followed after, his track, or footsteps, in pursuit; he endeavoured to trace or track him; he endeavoured to trace him by degrees, or by night or at any time (Lane &amp; Aqrab). See also 7:177 &amp; 12:4.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 1060,
                "topic": "Ahlul-Bait: people of the household",
                "verses": "33:34, 11:46-47, 11:74"
            },
            {
                "id": 3927,
                "topic": "Bait: house",
                "verses": "11:74, 29:42, 33:34, 51:37, 66:12"
            },
            {
                "id": 11921,
                "topic": "Moral Traits: sincerity",
                "verses": "4:147, 2:140, 7:22, 7:30, 7:63, 7:69, 7:80, 7:94, 9:91, 10:23, 11:35, 12:12, 29:66, 30:34, 39:3-4, 39:12, 39:15, 40:15, 40:66, 98:6"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ حَرَّمۡنَا عَلَیۡہِ الۡمَرَاضِعَ مِنۡ قَبۡلُ فَقَالَتۡ ہَلۡ  اَدُلُّکُمۡ  عَلٰۤی  اَہۡلِ بَیۡتٍ یَّکۡفُلُوۡنَہٗ  لَکُمۡ وَ ہُمۡ لَہٗ نٰصِحُوۡنَ ﴿۱۳﴾ ",
        "ur": "اور پہلے ہی سے ہم نے اُس (یعنی موسیٰ) پر دودھ پلانے والیاں حرام کر دی تھیں۔ پس اُس (کی بہن) نے کہا کہ کیا میں تمہیں ایسے گھر والوں کا پتہ دوں جو تمہارے لئے اس کی پرورش کر سکیں اور وہ اس کے خیرخواہ ہوں؟",
        "v5": {
            "text": "And We had already ordained that he should refuse the wet-nurses; so she said, [a]‘Shall I tell you of a household who will bring him up for you and will be his sincere well-wishers?’",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:41."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 1089,
                "topic": "‘Ain: eyes",
                "verses": "7:41, 20:40-41, 5:46, 16:78, 17:37, 19:27, 28:10, 53:18, 54:51, 75:8, 102:8"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 14269,
                "topic": "Promise: Allah true to His",
                "verses": "3:195, 3:10, 4:123, 6:135, 7:45, 10:5, 10:56, 11:46, 14:48, 16:39, 17:109, 18:22, 18:99, 21:10, 22:48, 30:61, 31:10, 31:34, 35:6, 40:56, 40:78, 43:43, 45:33, 46:18, 51:6, 77:8"
            }
        ],
        "ar": "فَرَدَدۡنٰہُ  اِلٰۤی  اُمِّہٖ کَیۡ تَقَرَّ عَیۡنُہَا وَ لَا تَحۡزَنَ وَ لِتَعۡلَمَ  اَنَّ وَعۡدَ اللّٰہِ حَقٌّ وَّ لٰکِنَّ  اَکۡثَرَہُمۡ  لَا  یَعۡلَمُوۡنَ ﴿٪۱۴﴾",
        "ur": "پس ہم نے اُسے اس کی ماں کی طرف لَوٹا دیا تاکہ اس کی آنکھیں ٹھنڈی ہو جائیں اور وہ غم نہ کرے اور تاکہ وہ جان لے کہ اللہ کا وعدہ سچا ہے لیکن اُن میں سے اکثر نہیں جانتے تھے۔",
        "v5": {
            "text": "Thus did We restore him to his mother that her eye might be gladdened and that she might not grieve, and that she might know that the promise of Allah is true. But most of them know not.",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 2947,
                "topic": "Ashudda: <i>Balughah</i>, maturity,",
                "verses": "46:16, 6:153, 12:23, 17:35, 18:83"
            },
            {
                "id": 8901,
                "topic": "Hikmah: wisdom",
                "verses": "2:130, 2:252, 2:270, 3:49, 3:59, 3:80, 3:82, 3:165, 4:55, 4:114, 5:111, 6:74, 10:2, 14:20, 16:126, 17:40, 19:13, 21:75, 21:80, 26:84, 31:3, 31:13, 33:35, 36:3, 38:21, 40:68, 43:5, 43:64, 44:5, 54:6, 62:3, 71:14"
            },
            {
                "id": 9613,
                "topic": "Istawa: firmly settled",
                "verses": "2:30, 7:55, 10:4, 13:3, 20:6, 25:60, 32:5, 41:12, 48:30, 53:6-7, 57:5"
            },
            {
                "id": 9720,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 10281,
                "topic": "Knowledge: <i>‘Ilm</i>: and Messengers",
                "verses": "18:66, 2:32, 12:23, 12:56, 12:69, 12:109, 15:54, 19:44, 21:75, 21:80, 27:16-17, 51:29"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 12715,
                "topic": "Muhsin: who do good: are rewarded",
                "verses": "3:135, 29:70, 2:59, 2:113, 4:126, 5:86, 6:85, 7:57, 7:162, 12:23, 22:38, 31:23, 33:30, 37:106, 37:111, 37:122, 37:132, 39:35, 77:45"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ لَمَّا بَلَغَ  اَشُدَّہٗ  وَ اسۡتَوٰۤی اٰتَیۡنٰہُ حُکۡمًا وَّ عِلۡمًا ؕ وَ کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿۱۵﴾ ",
        "ur": "اور جب وہ پختگی کی عمر کو پہنچا اور متوازن ہو گیا تو ہم نے اسے حکمت اور علم عطا کیا اور اسی طرح ہم احسان کرنے والوں کو جزا دیتے ہیں۔",
        "v5": {
            "text": "[a]And when he reached his <i>age of</i> full strength and attained maturity, We gave him wisdom and knowledge; and thus do We reward those who do good.[2886]",
            "notes": [
                {
                    "ref": "a",
                    "note": "12:23; 46:16."
                },
                {
                    "ref": "2886",
                    "note": "<p><strong>Commentary:</strong></p><p>Moses was fully equipped with temporal as well as divine knowledge. Having been brought up in the house of a powerful monarch of the time he must have had the best tutors to teach him the current sciences. His physical development must also have been perfect as is apparent from 28:16; and he must have been inspired by noble ideals. As God had marked him out for a great destiny, he was endowed with wisdom and spiritual knowledge in a very large measure. By the time Moses had attained maturity he was a محسن i.e. a constant doer of good deeds.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 7142,
                "topic": "Enmity: <i>‘Adawah</i>: of Satan",
                "verses": "2:169, 2:209, 6:143, 7:23, 12:6, 17:54, 20:118, 35:7, 36:61, 43:63"
            },
            {
                "id": 10171,
                "topic": "Killing",
                "verses": "25:69, 2:55, 2:62, 2:179-180, 2:252, 3:22, 4:93-94, 4:158, 5:33, 6:152, 17:34, 24:3, 26:15, 27:49, 29:70, 40:29"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12112,
                "topic": "Moses: Musa(as): slandered, accused",
                "verses": "33:70, 26:15, 61:6"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ دَخَلَ الۡمَدِیۡنَۃَ عَلٰی حِیۡنِ غَفۡلَۃٍ مِّنۡ اَہۡلِہَا فَوَجَدَ فِیۡہَا رَجُلَیۡنِ یَقۡتَتِلٰنِ ٭۫ ہٰذَا مِنۡ شِیۡعَتِہٖ وَ ہٰذَا مِنۡ عَدُوِّہٖ ۚ فَاسۡتَغَاثَہُ  الَّذِیۡ مِنۡ شِیۡعَتِہٖ عَلَی الَّذِیۡ  مِنۡ عَدُوِّہٖ ۙ فَوَکَزَہٗ  مُوۡسٰی فَقَضٰی عَلَیۡہِ ٭۫  قَالَ ہٰذَا مِنۡ عَمَلِ الشَّیۡطٰنِ ؕ اِنَّہٗ  عَدُوٌّ مُّضِلٌّ مُّبِیۡنٌ ﴿۱۶﴾ ",
        "ur": "اور وہ شہر میں اس کے رہنے والوں کی غفلت کی حالت میں (ان سے چھپتا ہوا) داخل ہوا تو وہاں اس نے دو مَردوں کو دیکھا جو ایک دوسرے سے لڑ رہے تھے۔ یہ (ایک) اس کے قبیلے کا تھا اور وہ (دوسرا) اس کے دشمن قبیلے کا۔ پس وہ جو اس کے قبیلے کا تھا اس نے اس کو مخالف قبیلے والے کے خلاف مدد کے لئے آواز دی۔ پس موسیٰ نے اسے مُکّا مارا اور اس کا کام تمام کر دیا۔ اس نے (دل میں) کہا کہ یہ (جو کچھ ہوا) یہ تو شیطان کا کام تھا۔ یقیناً وہ کھلا کھلا گمراہ کرنے والا دشمن ہے۔",
        "v5": {
            "text": "And <i>one day</i> he entered the city at a time when its inhabitants were in a state of heedlessness; and he found therein two men fighting—one of his own party, and the other of his enemies. And he who was of his party sought his help against him who was of his enemies. [b]So Moses struck him with his fist; and thereby caused his death. Then he said, ‘This is of Satan’s doing; he is indeed an enemy, a manifest misleader.’[2887]",
            "notes": [
                {
                    "ref": "b",
                    "note": "20:41; 26:20."
                },
                {
                    "ref": "2887",
                    "note": "<p><strong>Important Words:</strong></p><p>وکزہ (struck him with his fist) means, he struck or beat him; he beat or struck him with his fist; he pushed or impelled or repelled him; he goaded him (Lane).</p><p><strong>Commentary:</strong></p><p>Being of a very noble nature and having been inspired by high ideals, Moses was always ready to help weak and oppressed people and so when a poor and weak Israelite sought his help against an arrogant and cruel Egyptian, he at once went to his rescue.</p><p>The expression, \"this is of Satan’s doing,\" according to Arabic idiom means that some evil thing has happened, i.e. \"Satan had caused an Egyptian and an Israelite to fight and I had to come to the assistance of the oppressed Israelite which resulted in an evil thing i.e. the death of a person.\" Or the words might have been addressed to the dead Egyptian meaning, \"this is the outcome of your satanic deed,\" i.e. \"your death is the result of your own wickedness and transgression.\" The fact that Moses used no lethal weapon and only repelled the Egyptian or at best struck him with his fist shows that the latter’s death was accidental. Clearly there was no intention on Moses’ part to cause it.</p><p>The Quran has not mentioned the wicked deed of the Egyptian to which Moses refers in this verse but from Jewish Encyclopedia we know that the said Egyptian had forced an Israelite woman to commit adultery with him and that was indeed a devilish deed. It apparently led to the quarrel referred to in the verse and ultimately to Moses’ interference and the death of the Egyptian (Jew. Enc. under \"Moses\").</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 2149,
                "topic": "Allah: prayer seeking Divine mercy",
                "verses": "3:9, 2:287, 7:24"
            },
            {
                "id": 7756,
                "topic": "Forgiveness: <i>‘Afw</i>: Adam, Prophets, seek",
                "verses": "19:48, 7:24, 7:152, 7:156, 9:114, 14:42, 26:87, 38:36, 60:5-6, 71:29"
            },
            {
                "id": 10171,
                "topic": "Killing",
                "verses": "25:69, 2:55, 2:62, 2:179-180, 2:252, 3:22, 4:93-94, 4:158, 5:33, 6:152, 17:34, 24:3, 26:15, 27:49, 29:70, 40:29"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12112,
                "topic": "Moses: Musa(as): slandered, accused",
                "verses": "33:70, 26:15, 61:6"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 14126,
                "topic": "Prayers of the Holy Qur’an: for forgiveness",
                "verses": "3:17, 2:286-287, 3:148, 3:194-195, 7:24, 7:150, 7:152, 7:156-157, 11:48, 12:102, 18:11, 21:88, 23:95, 23:110, 23:119, 25:66-67, 35:38, 38:36, 40:8, 59:11, 66:9, 71:27-29"
            }
        ],
        "ar": "قَالَ رَبِّ اِنِّیۡ ظَلَمۡتُ نَفۡسِیۡ فَاغۡفِرۡ لِیۡ فَغَفَرَ  لَہٗ ؕ اِنَّہٗ  ہُوَ  الۡغَفُوۡرُ  الرَّحِیۡمُ ﴿۱۷﴾ ",
        "ur": "اس نے کہا اے میرے ربّ! یقیناً میں نے اپنی جان پر ظلم کیا۔ پس مجھے بخش دے۔ تو اُس نے اسے بخش دیا۔ یقیناً وہی ہے جو بہت بخشنے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "He said, ‘My Lord, I have wronged my soul, so do thou forgive me.’ So He forgave him; He is Most Forgiving, Merciful.[2888]",
            "notes": [
                {
                    "ref": "2888",
                    "note": "<p><strong>Important Words:</strong></p><p>ظلمت (I have wronged my soul) is derived from ظلم which means, he did wrong; he acted unjustly or tyrannically; he put a thing in a wrong place; he made one to suffer loss or detriment. ظلمه also signifies, he imposed upon him a burden that was beyond his power or ability to bear; he exposed himself to danger (Lane, Aqrab &amp; Mufradat). See also 2:36, 52 &amp; 17:60.</p><p><strong>Commentary:</strong></p><p>Moses realized that in trying to help the poor Israelite he had happened to kill the Egyptian and thus had exposed himself to a great danger and had taken upon himself a burden which apparently he did not have the power to bear. So he prayed to God to protect him from the evil consequences that might flow from his accidentally killing a member of the ruling race.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 18,
        "v_": 17,
        "topics": [
            {
                "id": 10171,
                "topic": "Killing",
                "verses": "25:69, 2:55, 2:62, 2:179-180, 2:252, 3:22, 4:93-94, 4:158, 5:33, 6:152, 17:34, 24:3, 26:15, 27:49, 29:70, 40:29"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12112,
                "topic": "Moses: Musa(as): slandered, accused",
                "verses": "33:70, 26:15, 61:6"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 12931,
                "topic": "Ni‘mat: favours",
                "verses": "1:7, 2:41, 2:48, 2:123, 2:151, 2:212, 2:232, 3:104, 3:172, 3:175, 4:70, 5:4, 5:7-8, 5:12, 5:21, 5:111, 8:54, 12:7, 14:7, 14:29, 14:35, 16:19, 16:54, 16:72-73, 16:84, 16:122, 19:59, 26:23, 27:20, 31:32, 33:10, 35:4, 37:58, 39:9, 39:50, 46:16, 48:3, 49:9, 52:30, 54:36, 68:3, 68:50, 93:12"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "قَالَ رَبِّ بِمَاۤ  اَنۡعَمۡتَ عَلَیَّ  فَلَنۡ  اَکُوۡنَ  ظَہِیۡرًا  لِّلۡمُجۡرِمِیۡنَ ﴿۱۸﴾ ",
        "ur": "اس نے کہا اے میرے ربّ! اس وجہ سے کہ تُو نے مجھ پر انعام کیا میں آئندہ ہر گز کبھی مجرموں کا مددگار نہیں بنوں گا۔",
        "v5": {
            "text": "He said, ‘My Lord, because of the favour Thou hast bestowed upon me, I will never be a helper of the guilty.’[2889]",
            "notes": [
                {
                    "ref": "2889",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse shows Moses as saying, \"My Lord! Thou hast always been Gracious to me, so in my gratitude to Thee for Thy favour, I promise that I will always help the oppressed as I did on the last occasion, and will never take sides with the oppressors.\" Or it may mean, \"My Lord, since Thou hast given me an opportunity to help an oppressed man and thus hast done me a great favour, so in gratitude for Thy favour I will always help the poor and the oppressed.\" Or the verse may mean, \"My Lord, since Thou hast been always kind and gracious to me, how can I be a helper and supporter of the oppressors?\"</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 19,
        "v_": 18,
        "topics": [
            {
                "id": 10171,
                "topic": "Killing",
                "verses": "25:69, 2:55, 2:62, 2:179-180, 2:252, 3:22, 4:93-94, 4:158, 5:33, 6:152, 17:34, 24:3, 26:15, 27:49, 29:70, 40:29"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12112,
                "topic": "Moses: Musa(as): slandered, accused",
                "verses": "33:70, 26:15, 61:6"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "فَاَصۡبَحَ فِی الۡمَدِیۡنَۃِ خَآئِفًا یَّتَرَقَّبُ فَاِذَا  الَّذِی اسۡتَنۡصَرَہٗ  بِالۡاَمۡسِ یَسۡتَصۡرِخُہٗ ؕ قَالَ لَہٗ  مُوۡسٰۤی  اِنَّکَ لَغَوِیٌّ  مُّبِیۡنٌ ﴿۱۹﴾ ",
        "ur": "پس وہ صبح شہر میں داخل ہوا، ڈرتا ہوا اِدھر اُدھر  نظر ڈالتا ہوا تو اچانک وہی شخص جس نے اُسے گزشتہ دن مدد کے لئے بلایا تھا پھر اُس سے چیخ چیخ کر مددمانگ رہا ہے۔ موسیٰ نے اس سے کہا یقیناً تُو ہی ظاہر و باہر سخت گمراہ ہے۔",
        "v5": {
            "text": "And morning found him in the city, apprehensive, watchful; and lo! he who had sought his help the day before cried out to him <i>again</i> for help. Moses said to him: ‘Verily, thou art manifestly a misguided fellow.’[2890]",
            "notes": [
                {
                    "ref": "2890",
                    "note": "<p><strong>Commentary:</strong></p><p>Moses in this verse seems to reproach the man who called him for help by saying to him, \"you are a foolish fellow and not being able to realise the consequences of your actions you become readily involved in trouble.\" The words do not mean, as is generally misunderstood, that Moses regarded the man as an offender.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 10171,
                "topic": "Killing",
                "verses": "25:69, 2:55, 2:62, 2:179-180, 2:252, 3:22, 4:93-94, 4:158, 5:33, 6:152, 17:34, 24:3, 26:15, 27:49, 29:70, 40:29"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12112,
                "topic": "Moses: Musa(as): slandered, accused",
                "verses": "33:70, 26:15, 61:6"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "فَلَمَّاۤ  اَنۡ  اَرَادَ  اَنۡ یَّبۡطِشَ بِالَّذِیۡ ہُوَ عَدُوٌّ لَّہُمَا ۙ قَالَ یٰمُوۡسٰۤی  اَتُرِیۡدُ اَنۡ تَقۡتُلَنِیۡ  کَمَا قَتَلۡتَ نَفۡسًۢا بِالۡاَمۡسِ ٭ۖ اِنۡ تُرِیۡدُ  اِلَّاۤ  اَنۡ تَکُوۡنَ جَبَّارًا فِی الۡاَرۡضِ وَ مَا تُرِیۡدُ اَنۡ تَکُوۡنَ مِنَ الۡمُصۡلِحِیۡنَ ﴿۲۰﴾ ",
        "ur": "پھر جب اس نے ارادہ کیا کہ اُسے پکڑے جو اُن دونوں کا دشمن ہے تو اس نے کہا اے موسیٰ! کیا تو چاہتا ہے کہ مجھے بھی قتل کر دے جیسا تُو نے ایک شخص کو کل قتل کیا تھا۔ اس کے سوا تُوکچھ نہیں چاہتا کہ ملک میں دھونس جماتا پھرے اور تُو نہیں چاہتا کہ اصلاح کرنے والوں میں سے ہو۔",
        "v5": {
            "text": "And when he made up his mind to lay hold of the man who was an enemy to both of them, he said, ‘O Moses, dost thou intend to kill me as thou didst kill a man yesterday? Thou only intendest to become a tyrant in the land, and thou desirest not to be a peace-maker.’[2891]",
            "notes": [
                {
                    "ref": "2891",
                    "note": "<p><strong>Commentary:</strong></p><p>The words \"who was an enemy to both of them,\" show that the man referred to was an Egyptian. But if he was an Israelite as the Bible says then he must have been in league with the Egyptians and must have reported the previous day’s incident to the authorities and thus was an enemy both to Moses and the Israelite who called Moses for help.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 10171,
                "topic": "Killing",
                "verses": "25:69, 2:55, 2:62, 2:179-180, 2:252, 3:22, 4:93-94, 4:158, 5:33, 6:152, 17:34, 24:3, 26:15, 27:49, 29:70, 40:29"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12112,
                "topic": "Moses: Musa(as): slandered, accused",
                "verses": "33:70, 26:15, 61:6"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ جَآءَ رَجُلٌ مِّنۡ اَقۡصَا الۡمَدِیۡنَۃِ یَسۡعٰی ۫ قَالَ یٰمُوۡسٰۤی  اِنَّ الۡمَلَاَ یَاۡتَمِرُوۡنَ بِکَ لِیَقۡتُلُوۡکَ فَاخۡرُجۡ  اِنِّیۡ لَکَ  مِنَ  النّٰصِحِیۡنَ ﴿۲۱﴾ ",
        "ur": "اور ایک شخص شہر کے پرلے کنارے سے دوڑتا ہوا آیا۔ اس نے کہا اے موسیٰ! یقیناً سردار تیرے خلاف منصوبہ بنا رہے ہیں کہ تجھے قتل کر دیں۔ پس نکل بھاگ۔ یقیناً میں تیری بھلائی چاہنے والوں میں سے ہوں۔",
        "v5": {
            "text": "And there came a man from the far side of the city, running. He said, ‘O Moses, of a truth, the chiefs are taking counsel together against thee to kill thee. Therefore get thee away; surely, I am of thy well-wishers.’[2892]",
            "notes": [
                {
                    "ref": "2892",
                    "note": "<p><strong>Commentary:</strong></p><p>The implied reference in the verse is to the counsel that the leaders of Mecca had held to kill the Holy Prophet. But whereas Moses was informed of the designs of the Egyptian chiefs by a well-wisher of his, as the verse under comment says, the Holy Prophet was made aware of the evil designs of the Quraishite leaders against him by God Himself (8:31).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 22,
        "v_": 21,
        "topics": [
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 14142,
                "topic": "Prayers of the Holy Qur’an: for deliverance",
                "verses": "2:287, 3:192, 4:76, 10:86-87, 21:84, 21:88-89, 23:98-9, 25:66-67, 26:170, 38:42, 40:8-10, 59:11, 66:12"
            },
            {
                "id": 18923,
                "topic": "Wrongdoers: <i>Zalim</i>: deliverence from",
                "verses": "4:76, 23:95, 66:12, 71:25"
            }
        ],
        "ar": "فَخَرَجَ مِنۡہَا خَآئِفًا یَّتَرَقَّبُ ۫ قَالَ  رَبِّ نَجِّنِیۡ مِنَ الۡقَوۡمِ  الظّٰلِمِیۡنَ ﴿٪۲۲﴾ ",
        "ur": "پس وہ وہاں سے نکل کھڑا ہوا، خوفزدہ اور اِدھر اُدھر نگاہ ڈالتا ہوا۔ اس نے کہا اے میرے ربّ! مجھے ظالم قوم سے نجات بخش۔",
        "v5": {
            "text": "[a]So he went forth therefrom, fearful, watchful. He said, ‘My Lord, deliver me from the unjust people.’",
            "notes": [
                {
                    "ref": "a",
                    "note": "26:22."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 10690,
                "topic": "Madyan: Midian, <i>Mada’in-e-Salih</i>",
                "verses": "15:79, 2:251, 7:86-94, 11:85, 11:95-96, 18:61, 18:66, 20:41, 22:45, 26:142, 27:19, 28:46, 29:37, 29:41"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 18506,
                "topic": "Way of: <i>Sabil</i>: believers",
                "verses": "16:126, 2:109, 4:116, 5:13, 5:61, 5:78, 7:147, 40:30, 40:39, 60:2"
            }
        ],
        "ar": "وَ لَمَّا تَوَجَّہَ  تِلۡقَآءَ مَدۡیَنَ قَالَ عَسٰی رَبِّیۡۤ   اَنۡ  یَّہۡدِیَنِیۡ  سَوَآءَ  السَّبِیۡلِ ﴿۲۳﴾ ",
        "ur": "پس جب اس نے مدین کی جانب رخ کیا اس نے کہا قریب ہے کہ میرا ربّ مجھے صحیح راستے کی طرف ہدایت دیدے۔",
        "v5": {
            "text": "And when he turned his face towards Midian, he said, ‘I hope my Lord will guide me to the right way.’",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 24,
        "v_": 23,
        "topics": [
            {
                "id": 10690,
                "topic": "Madyan: Midian, <i>Mada’in-e-Salih</i>",
                "verses": "15:79, 2:251, 7:86-94, 11:85, 11:95-96, 18:61, 18:66, 20:41, 22:45, 26:142, 27:19, 28:46, 29:37, 29:41"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ لَمَّا وَرَدَ مَآءَ مَدۡیَنَ وَجَدَ عَلَیۡہِ اُمَّۃً مِّنَ النَّاسِ یَسۡقُوۡنَ ۬۫ وَ  وَجَدَ مِنۡ دُوۡنِہِمُ  امۡرَاَتَیۡنِ تَذُوۡدٰنِ ۚ قَالَ مَا خَطۡبُکُمَا ؕ قَالَتَا لَا نَسۡقِیۡ حَتّٰی یُصۡدِرَ الرِّعَآءُ ٜ وَ اَبُوۡنَا شَیۡخٌ   کَبِیۡرٌ ﴿۲۴﴾ ",
        "ur": "پس جب وہ مدین کے پانی کے گھاٹ پر اترا۔ اس نے وہاں لوگوں کی ایک جماعت کو (اپنے جانوروں کو) پانی پلاتے ہوئے دیکھا اور ان سے پرَے دو عورتوں کو بھی موجود پایا جو اپنے جانوروں کو پرَے ہٹا رہی تھیں۔ اس نے پوچھا کہ تم دونوں کا کیا ماجرا ہے؟ انہوں نے جواب دیا ہم پانی نہیں پلائیں گی یہاں تک کہ چرواہے لَوٹ جائیں اور ہمارا باپ بہت بوڑھا ہے۔",
        "v5": {
            "text": "And when he arrived at the water of Midian, he found there a party of men, watering <i>their flocks</i>. And he found beside them two women keeping back <i>their flocks</i>. He said, ‘What is the matter with you?’ They replied, ‘We cannot water <i>our flocks</i> until the shepherds take away <i>their flocks</i>, and our father is a very old man.’[2893]",
            "notes": [
                {
                    "ref": "2893",
                    "note": "<p><strong>Important Words:</strong></p><p>تذودان (keeping back) is formed from ذاد which means, he drove; drove away, and he repelled. ذاد الابل عن الماء means, he kept back or debarred the camels from the water, or prevented them from coming to it. They say ذاد عن عرضه i.e. he defended his honour (Lane &amp; Aqrab).</p><p>یصدر (take back) is from صدر which means, he returned, went back or turned away from water. صدر الیه means, he went to it (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The girls seem to be jealous of the honour of their father and therefore in order to disabuse Moses’ mind of any possible misconception that their father was an indolent and easy-going man for having sent his young daughters to the well and keeping himself at home they say that their father is an old man and therefore could not himself come to water his flock.</p><p>The general opinion among the commentators of the Quran is that Shu‘aib was Moses’ father-in-law. In the Bible he is called Jethro (Exod. 3:1).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 25,
        "v_": 24,
        "topics": [
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 14027,
                "topic": "Poor",
                "verses": "90:12-17, 2:272, 3:182, 4:7, 4:136, 9:60, 22:29, 24:33, 35:16, 47:39, 69:35, 107:4"
            },
            {
                "id": 14109,
                "topic": "Prayers of the Holy Qur’an: for seeking good",
                "verses": "2:202, 7:157"
            },
            {
                "id": 14167,
                "topic": "Prayers of the Holy Qur’an: for marriage",
                "verses": null
            }
        ],
        "ar": "فَسَقٰی لَہُمَا ثُمَّ تَوَلّٰۤی اِلَی الظِّلِّ فَقَالَ رَبِّ اِنِّیۡ لِمَاۤ  اَنۡزَلۡتَ اِلَیَّ مِنۡ خَیۡرٍ  فَقِیۡرٌ ﴿۲۵﴾ ",
        "ur": "تو اس نے ان دونوں کی خاطر (اُن کے جانوروں کو) پانی پلایا۔ پھر وہ ایک سائے کی طرف مڑ گیا اور کہا کہ اے میرے ربّ! یقیناً میں ہر اچھی چیز کے لئے، جو تُو میری طرف نازل کرے، ایک فقیر ہوں۔",
        "v5": {
            "text": "So he watered <i>their flocks</i> for them. Then he turned aside into the shade, and said, ‘My Lord, I am in need of whatever good Thou mayest send down to me.’",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 26,
        "v_": 25,
        "topics": [
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "فَجَآءَتۡہُ  اِحۡدٰٮہُمَا تَمۡشِیۡ عَلَی اسۡتِحۡیَآءٍ ۫ قَالَتۡ اِنَّ  اَبِیۡ یَدۡعُوۡکَ لِیَجۡزِیَکَ اَجۡرَ مَا سَقَیۡتَ لَنَا ؕ فَلَمَّا جَآءَہٗ  وَ قَصَّ عَلَیۡہِ  الۡقَصَصَ ۙ قَالَ  لَا تَخَفۡ ٝ۟ نَجَوۡتَ مِنَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿۲۶﴾ ",
        "ur": "پس ان دونوں میں سے ایک اس کے پاس حیا سے لجاتی ہوئی آئی۔ اس نے کہا یقیناً میرا باپ تجھے بلاتا ہے تاکہ تجھے اس کا بدلہ دے جو تُو نے ہماری خاطر پانی پلایا۔ پس جب وہ اس کے (باپ کے) پاس آیا اور سارا واقعہ اس کے سامنے بیان کیا اس نے کہا خوف نہ کر تُو ظالم قوم سے نجات پا چکا ہے۔",
        "v5": {
            "text": "And one of the two <i>women</i> came to him, walking bashfully. She said, ‘My father calls thee that he may reward thee for thy having watered <i>our flocks</i> for us.’ So when he came to him and told him the story, he said, ‘Fear not; thou hast escaped from the unjust people.’[2894]",
            "notes": [
                {
                    "ref": "2894",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, \"thou has escaped from the wicked people,\" show that on hearing Moses’ story the old and righteous man was convinced that Moses had committed no murder and that the death of the Egyptian was only accidental. On the other hand he dubbed and denounced the Egyptians as a wicked people.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 27,
        "v_": 26,
        "topics": [
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "قَالَتۡ اِحۡدٰٮہُمَا یٰۤاَبَتِ اسۡتَاۡجِرۡہُ ۫ اِنَّ خَیۡرَ مَنِ اسۡتَاۡجَرۡتَ الۡقَوِیُّ الۡاَمِیۡنُ ﴿۲۷﴾ ",
        "ur": "ان دونوں میں سے ایک نے کہا اے میرے باپ! اسے نوکر رکھ لے۔ یقیناً جنہیں بھی تُو نوکر رکھے اُن میں بہترین وہی (ثابت) ہوگا جو مضبوط (اور) امانت دار ہو۔",
        "v5": {
            "text": "One of the two <i>women</i> said, ‘O my father, hire him; for the best man that thou canst hire is the one who is strong and trustworthy.’",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 28,
        "v_": 27,
        "topics": [
            {
                "id": 5722,
                "topic": "Daughters",
                "verses": "11:79-80, 4:12, 15:72, 24:32, 33:60, 42:50, 66:13"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12074,
                "topic": "Moses: Musa(as): marriage of",
                "verses": null
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 15817,
                "topic": "Righteous: <i>Salihin</i>: example of",
                "verses": "49:14, 2:131, 3:40, 3:47, 3:115, 4:70, 4:157, 5:9, 6:70, 6:85-87, 12:37, 16:123, 18:73, 21:73, 21:76, 21:87, 24:24, 29:28, 33:33, 37:113, 41:34, 48:27, 66:13, 103:4"
            },
            {
                "id": 16669,
                "topic": "Shu‘aib<sup>(as)</sup>: Jethro: story of",
                "verses": "11:85-96, 26:177-190"
            }
        ],
        "ar": "قَالَ اِنِّیۡۤ  اُرِیۡدُ اَنۡ اُنۡکِحَکَ اِحۡدَی ابۡنَتَیَّ ہٰتَیۡنِ عَلٰۤی اَنۡ تَاۡجُرَنِیۡ ثَمٰنِیَ حِجَجٍ ۚ فَاِنۡ اَتۡمَمۡتَ عَشۡرًا  فَمِنۡ عِنۡدِکَ ۚ وَ مَاۤ  اُرِیۡدُ اَنۡ اَشُقَّ عَلَیۡکَ ؕ سَتَجِدُنِیۡۤ اِنۡ  شَآءَ  اللّٰہُ  مِنَ  الصّٰلِحِیۡنَ ﴿۲۸﴾ ",
        "ur": "اس نے (موسیٰ سے) کہا میں چاہتا ہوں کہ اپنی اِن دونوں بیٹیوں میں سے ایک تجھ سے بیاہ دوں اس شرط پر کہ تُو آٹھ سال میری خدمت کرے۔ پس اگر تُو دس پورے کر دے تو یہ تیری طرف سے (طوعی طور پر) ہوگا اور میں تجھ پر کسی قسم کی سختی نہیں کرنا چاہتا۔ اللہ چاہے تو تُو مجھے نیک لوگوں میں سے پائے گا۔",
        "v5": {
            "text": "He said, ‘I intend to marry one of these two daughters of mine to thee on condition that thou serve me on hire for eight years. But if thou complete ten <i>years</i>, it will be of thine own accord. And I would not lay any hardship upon thee; thou wilt find me, if Allah wills, of the righteous.’[2894A]",
            "notes": [
                {
                    "ref": "2894A",
                    "note": "<p><strong>Commentary:</strong></p><p>The construction of the verse does not seem to lend countenance to the conclusion generally considered derivable from it, viz. that Shu‘aib or Jethro agreed to marry one of his daughters to Moses in lieu of eight or ten years of service. The fact of the matter appears to be that Shu‘aib having grown very old needed an honest man to look after his flocks and Moses having been found as possessing the required qualifications was taken in service by him at the instance of one of his daughters. Eight or ten years were agreed upon as the tenure of service. Shu‘aib, however, being a holy man either himself realized or was informed by God that a great future lay before Moses. He, therefore, offered to marry one of his daughters to him and, desiring that his son-in-law should live with him for some time and benefit by his noble company, laid it down as one of the conditions of marriage that Moses should stay with him for eight or ten years. Thus it is not correct to say that Shu‘aib offered to marry his daughter to Moses in lieu of the latter serving him for eight or ten years. Whatever remuneration Moses might have received from Shu‘aib had nothing to do with the marriage proposal.</p><p>The flight of Moses from Egypt and his stay in Midian for ten years bears a striking resemblance to the residence of the Holy Prophet for ten years in Medina after his Hijrah from Mecca. Moses must have, in a large measure, benefited himself spiritually by his God-fearing and righteous father-in-law’s company just as his upbringing in the house of Pharaoh had equipped him with temporal knowledge. But the noble Prophet of Islam was indebted to no human being for the great treasures of spiritual and temporal knowledge possessed by him. He had received them direct from God.</p><p>The expression من عندک means, 'It would be an additional favour from you.'</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 29,
        "v_": 28,
        "topics": [
            {
                "id": 3654,
                "topic": "Attributes of Allah: Al-Wakil (Disposer of Affairs, Guardian, Trustee)",
                "verses": "3:174, 4:82, 4:133, 4:172, 6:103, 11:13, 17:3, 17:66, 17:69, 33:4, 33:49, 73:10"
            },
            {
                "id": 9352,
                "topic": "Injustice: wrongdoing, <i>Zulm</i>",
                "verses": "25:2, 3:109, 4:4, 4:11, 4:31, 4:161, 6:83, 6:132, 11:118, 17:60, 20:112-13, 40:18, 40:32, 42:42, 72:14"
            },
            {
                "id": 11804,
                "topic": "Moral Traits: justice",
                "verses": "16:91, 2:49, 2:283, 3:19, 3:109, 4:4, 4:31, 4:59, 4:106, 4:136, 5:9, 5:43, 5:50, 6:83, 6:116, 6:152-153, 7:30, 7:160, 7:182, 15:9, 16:77, 25:5, 38:23, 38:27, 39:70, 39:76, 40:18, 40:32, 40:79, 49:10, 55:9-10, 57:26, 72:14"
            },
            {
                "id": 12064,
                "topic": "Moses: Musa(as): early life of",
                "verses": "20:39-41"
            },
            {
                "id": 12074,
                "topic": "Moses: Musa(as): marriage of",
                "verses": null
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "قَالَ ذٰلِکَ بَیۡنِیۡ وَ بَیۡنَکَ ؕ اَیَّمَا الۡاَجَلَیۡنِ قَضَیۡتُ فَلَا عُدۡوَانَ عَلَیَّ ؕ وَ اللّٰہُ  عَلٰی  مَا  نَقُوۡلُ  وَکِیۡلٌ ﴿٪۲۹﴾ ",
        "ur": "اس نے کہا یہ میرے اور تیرے درمیان طے ہوگیا۔ دونوں میں سے جو میعاد بھی میں پوری کروں تو میرے خلاف کوئی زیادتی نہیں ہونی چاہئے۔ اور اللہ اُس پر، جو ہم کہہ رہے ہیں،نگران ہے۔",
        "v5": {
            "text": "He said, ‘That is <i>settled</i> between me and thee. Whichever of the two terms I fulfil, there shall be no injustice to me; and Allah watches over what we say.’",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 30,
        "v_": 29,
        "topics": [
            {
                "id": 7378,
                "topic": "Family",
                "verses": "11:46-47, 2:41, 2:197, 2:249, 3:34, 3:36, 7:84, 11:41, 11:82, 12:7, 12:89, 15:66, 20:30, 21:77, 21:85, 26:170-171, 27:50, 28:9, 29:33, 37:77, 38:44, 49:14, 84:10"
            },
            {
                "id": 7616,
                "topic": "Fire: <i>An-Nar</i>: of Moses",
                "verses": "20:11, 27:8-9"
            },
            {
                "id": 12078,
                "topic": "Moses: Musa(as): meeting with God",
                "verses": "7:143-148, 2:52, 27:8-10"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 12239,
                "topic": "Mountains: <i>Jibal</i>: <i>Tur</i>",
                "verses": "2:64, 2:94, 4:155, 19:53, 20:81, 23:21, 28:45, 28:47, 52:3, 95:2-3"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "فَلَمَّا قَضٰی مُوۡسَی الۡاَجَلَ وَ سَارَ بِاَہۡلِہٖۤ  اٰنَسَ مِنۡ جَانِبِ الطُّوۡرِ نَارًا ۚ قَالَ  لِاَہۡلِہِ  امۡکُثُوۡۤا  اِنِّیۡۤ  اٰنَسۡتُ نَارًا لَّعَلِّیۡۤ  اٰتِیۡکُمۡ مِّنۡہَا بِخَبَرٍ اَوۡ جَذۡوَۃٍ مِّنَ النَّارِ  لَعَلَّکُمۡ  تَصۡطَلُوۡنَ ﴿۳۰﴾ ",
        "ur": "پس جب موسیٰ نے مقررہ مدت پوری کر دی اور اپنے گھر والوں کو لے کر چلا، اس نے طور کی طرف ایک آگ سی دیکھی۔ اس نے اپنے گھر والوں سے کہا ذرا ٹھہرو، مجھے ایک آگ سی دکھائی دے رہی ہے۔ ہو سکتا ہے کہ میں اُس (کے پاس) سے کوئی خبر تمہارے پاس لے آؤں یا کوئی آگ کا انگارہ لے آؤں تاکہ تم آگ تاپ سکو۔",
        "v5": {
            "text": "And when Moses had fulfilled the term, and was travelling with his family, he perceived a fire in the direction of the Mount. He said to his family, ‘Wait, [a]I perceive a fire; haply I may bring you some <i>useful</i> information therefrom, or a burning brand from the fire that you may warm yourselves.’[2895]",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:11; 27:8."
                },
                {
                    "ref": "2895",
                    "note": "<p><strong>Important Words:</strong></p><p>جذوة (burning brand) is derived from جذا. They say جذا علی الشیء i.e. he stood firmly upon a thing. جذوة means, a brand or firebrand; a thick piece of firewood not flaming; a piece of fire; a live coal. They say فلان جذوة شر i.e. such a one is a kindler or a piece of mischief (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>Seclusion and solitude are very essential for meditation and communion with the Divine Being. Moses sought separation from his family, in fact from all worldly contacts and connections, in order that he might be blessed with communion with God.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 31,
        "v_": 30,
        "topics": [
            {
                "id": 3787,
                "topic": "Attributes of Allah: Rabbul-‘Alamin (Lord of all the worlds)",
                "verses": "1:2, 2:132, 5:29, 6:163, 7:55, 10:11, 26:24, 26:78, 32:3, 37:183, 40:65, 41:10, 59:17, 81:30"
            },
            {
                "id": 4060,
                "topic": "Barakah: <i>blessings</i>: on earth",
                "verses": "7:138, 11:74, 21:72, 21:82, 23:30, 24:36, 34:19, 41:11, 50:10"
            },
            {
                "id": 12046,
                "topic": "Moses: Musa(as): and Holy Prophet<sup>(sa)</sup>",
                "verses": "11:18, 2:109, 7:145, 20:30, 28:45-46, 46:11, 52:2-7, 95:2-4"
            },
            {
                "id": 12078,
                "topic": "Moses: Musa(as): meeting with God",
                "verses": "7:143-148, 2:52, 27:8-10"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 18268,
                "topic": "Valley: <i>Wadi</i>",
                "verses": "14:38, 9:121, 13:18, 20:13, 23:51, 26:142, 26:226, 27:19, 37:103, 46:25, 48:25, 55:47, 79:16-17, 89:10"
            }
        ],
        "ar": "فَلَمَّاۤ  اَتٰٮہَا نُوۡدِیَ مِنۡ شَاطِیَٴ الۡوَادِ الۡاَیۡمَنِ فِی الۡبُقۡعَۃِ  الۡمُبٰرَکَۃِ مِنَ الشَّجَرَۃِ  اَنۡ یّٰمُوۡسٰۤی  اِنِّیۡۤ  اَنَا اللّٰہُ  رَبُّ الۡعٰلَمِیۡنَ ﴿ۙ۳۱﴾ ",
        "ur": "پس جب وہ اُس کے پاس آیا تو بابرکت وادی کے کنارے سے نِدا دی گئی، درخت کے ایک مبارک حصہ میں، کہ اے موسیٰ! یقیناً میں ہی اللہ ہوں تمام جہانوں کا ربّ۔",
        "v5": {
            "text": "And when he came to it, [a]he was called <i>by a voice</i> from the right side of the Valley, in the blessed spot, out of the tree: ‘O Moses, verily I am, Allah, the Lord of the worlds.’[2896]",
            "notes": [
                {
                    "ref": "a",
                    "note": "19:53; 20:81; 79:17."
                },
                {
                    "ref": "2896",
                    "note": "<p><strong>Important Words:</strong></p><p>شاطئی (side) is derived from شطا which means, he walked on the bank or side of the river. شطا الام بالولد means, the mother threw or cast away the child. الشاطئی من النھر means, the side or bank of the stream (Aqrab).</p><p>بقعة (plot) is infinitive-noun from بقع (<i>baqi</i>‘<i>a</i>) which means, it (a bird or dog) was black and white; it was partly coloured and pied. بقعة means, a piece, part, portion or plot of land differing in appearance or colour or external state from that which adjoins it. The Arabs say ھو حسن البقعة عند الامیر i.e. he has a good station with the prince (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>Whereas Moses was only on the side of the blessed spiritual valley, the Holy Prophet Muhammad had actually entered it (53:14, 15).</p><p>Moses could not attain that high stage of nearness to God, which was reserved for the Holy Prophet.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 32,
        "v_": 31,
        "topics": [
            {
                "id": 12078,
                "topic": "Moses: Musa(as): meeting with God",
                "verses": "7:143-148, 2:52, 27:8-10"
            },
            {
                "id": 12108,
                "topic": "Moses: Musa(as): signs of Allah",
                "verses": "7:108-109, 2:61, 7:118, 7:131, 7:134, 17:102, 20:18-24, 20:67-70, 26:33-34, 26:64, 27:11, 27:13-15, 79:21"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 15948,
                "topic": "Rod: <i>‘Asa</i>",
                "verses": "7:108, 2:61, 7:118, 7:161, 8:18, 17:102, 20:19-22, 20:70, 20:78, 26:33, 26:46, 26:64, 27:11"
            },
            {
                "id": 16504,
                "topic": "Serpent: <i>Hayyah, Jann, Thu‘ban</i>",
                "verses": "7:108, 7:118, 20:21, 26:33, 27:11, 37:66"
            }
        ],
        "ar": "وَ اَنۡ  اَلۡقِ عَصَاکَ ؕ فَلَمَّا رَاٰہَا تَہۡتَزُّ کَاَنَّہَا جَآنٌّ  وَّلّٰی مُدۡبِرًا وَّ لَمۡ  یُعَقِّبۡ ؕ یٰمُوۡسٰۤی اَقۡبِلۡ وَ لَا تَخَفۡ ۟ اِنَّکَ مِنَ الۡاٰمِنِیۡنَ ﴿۳۲﴾ ",
        "ur": "اور ( کہا گیا) کہ اپنا عصا پھینک۔ پس جب اُس نے اُس (عصا) کو دیکھا کہ وہ حرکت کر رہا ہے گویا سانپ ہو تو وہ پیٹھ دکھاتا ہوا مُڑ گیا اور پلٹ کر بھی نہ دیکھا۔ اے موسیٰ! آگے بڑھ اور نہ ڈر۔ تُو یقیناً سلامت رہنے والوں میں سے ہے۔",
        "v5": {
            "text": "And <i>it also said</i>: [b]‘Throw down thy rod.’ And when he saw it move as though it were a serpent, he turned back retreating and did not look back. ‘O Moses, come forward and fear not; surely thou art of those who are safe;[2897]",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:118; 20:20; 26:46."
                },
                {
                    "ref": "2897",
                    "note": "<p><strong>Commentary:</strong></p><p>For an exhaustive treatment of the miracles of the rod and white hand see 7:108,109 &amp; 20:19-24.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 33,
        "v_": 32,
        "topics": [
            {
                "id": 7651,
                "topic": "Fisq: abhorrence, disobedience",
                "verses": "2:100, 2:283, 3:83, 3:111, 5:4, 5:48, 5:50, 5:60, 5:82, 5:109, 6:122, 6:146, 7:103, 7:146, 9:8, 9:24, 9:53, 9:67, 9:84, 9:96, 24:5, 24:56, 27:13, 43:55, 46:36, 49:8, 51:47, 57:17, 57:28, 59:6, 59:20, 61:6"
            },
            {
                "id": 12078,
                "topic": "Moses: Musa(as): meeting with God",
                "verses": "7:143-148, 2:52, 27:8-10"
            },
            {
                "id": 12108,
                "topic": "Moses: Musa(as): signs of Allah",
                "verses": "7:108-109, 2:61, 7:118, 7:131, 7:134, 17:102, 20:18-24, 20:67-70, 26:33-34, 26:64, 27:11, 27:13-15, 79:21"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "اُسۡلُکۡ یَدَکَ فِیۡ جَیۡبِکَ تَخۡرُجۡ بَیۡضَآءَ مِنۡ غَیۡرِ سُوۡٓءٍ ۫ وَّ اضۡمُمۡ  اِلَیۡکَ جَنَاحَکَ مِنَ الرَّہۡبِ فَذٰنِکَ بُرۡہَانٰنِ مِنۡ رَّبِّکَ اِلٰی فِرۡعَوۡنَ وَ مَلَا۠ئِہٖ ؕ اِنَّہُمۡ کَانُوۡا قَوۡمًا فٰسِقِیۡنَ ﴿۳۳﴾ ",
        "ur": "اپنا ہاتھ اپنے گریبان میں ڈال وہ بغیر کسی عیب کے چمکتا ہوا نکلے گا۔ پھر اپنے بازو کو خوف سے (بچنے کےلئے) اپنے ساتھ چمٹالے۔ پس تیرے ربّ کی طرف سے یہ دو براہین فرعون اور اس کے سرداروں کی طرف (بھیجی جا رہی) ہیں۔ یقیناً وہ بدکردار لوگ ہیں۔",
        "v5": {
            "text": "[c]Insert thy hand into thy bosom; it will come forth white without evil <i>effect</i>, and draw back thy arm toward thyself <i>in order to</i> <i>be free</i> from fear. So these <i>shall</i> <i>be</i> two proofs from thy Lord to Pharaoh and his chiefs. Surely, they are a rebellious people.’[2898]",
            "notes": [
                {
                    "ref": "c",
                    "note": "7:109; 20:23; 27:13."
                },
                {
                    "ref": "2898",
                    "note": "<p><strong>Important Words:</strong></p><p>ذانک (those two) is the dual of ذاک which is formed from ذا which is a noun of indication (properly meaning <i>this</i>, but sometimes, when repeated, better rendered <i>that</i>), relating to an object of masc. gender, such as is near: or it relates to what is distant (according to some, and therefore should always be rendered <i>that</i>). ذاک relates to an object which is distant or to that which occupies a middle place between the near and the distant. They say جاءنی ذانک الرجلان i.e. those two persons came to me (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 34,
        "v_": 33,
        "topics": [
            {
                "id": 12078,
                "topic": "Moses: Musa(as): meeting with God",
                "verses": "7:143-148, 2:52, 27:8-10"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "قَالَ رَبِّ اِنِّیۡ قَتَلۡتُ مِنۡہُمۡ نَفۡسًا فَاَخَافُ اَنۡ یَّقۡتُلُوۡنِ ﴿۳۴﴾ ",
        "ur": "اس نے کہا اے میرے ربّ! یقیناً میں نے ان کا ایک شخص قتل کیا ہوا ہے۔ پس میں ڈرتا ہوں کہ وہ مجھے قتل کر دیں گے۔",
        "v5": {
            "text": "[a]He said, ‘My Lord, I killed a person from among them, and I fear that they will kill me.[2899]",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:41; 26:15."
                },
                {
                    "ref": "2899",
                    "note": "<p><strong>Commentary:</strong></p><p>In this verse Moses alludes only to the mere fact of a man having been accidentally killed by him and not that he pleads guilty to the charge of deliberately killing him.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 35,
        "v_": 34,
        "topics": [
            {
                "id": 23,
                "topic": "Aaron: <i>Harun(as)</i>: subordinate of Moses",
                "verses": "7:143, 20:30-37, 25:36, 26:14"
            },
            {
                "id": 7347,
                "topic": "Falsehood: <i>Batil</i>: Prophets accused of",
                "verses": "17:82, 6:34, 6:148-149, 16:106, 16:117, 18:57, 22:43-45, 25:5, 42:25, 68:10"
            },
            {
                "id": 10363,
                "topic": "Language: <i>Lisan</i>",
                "verses": "14:5, 16:104, 19:98, 26:195-196, 30:23, 44:59, 46:13"
            },
            {
                "id": 12041,
                "topic": "Moses: Musa(as): and Aaron [<i>Harun<sup>(as)</sup></i>],",
                "verses": "26:14, 20:26-36, 25:36"
            },
            {
                "id": 12078,
                "topic": "Moses: Musa(as): meeting with God",
                "verses": "7:143-148, 2:52, 27:8-10"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 18739,
                "topic": "Witness: Prophets bear",
                "verses": "4:136, 85:4, 5:118, 22:79, 33:46, 43:89, 46:11, 48:9, 73:16, 83:22"
            }
        ],
        "ar": "وَ اَخِیۡ ہٰرُوۡنُ ہُوَ اَفۡصَحُ مِنِّیۡ لِسَانًا فَاَرۡسِلۡہُ  مَعِیَ رِدۡاً  یُّصَدِّقُنِیۡۤ  ۫ اِنِّیۡۤ   اَخَافُ  اَنۡ  یُّکَذِّبُوۡنِ ﴿۳۵﴾ ",
        "ur": "اور میرا بھائی ہارون زبان کے لحاظ سے مجھ سے زیادہ فصیح ہے۔ پس میرے مددگار کے طور پر اسے میرے ساتھ بھیج دے وہ میری تصدیق کرے گا۔ یقیناً مجھے (یہ بھی) ڈر ہے کہ وہ مجھے جھٹلا دیں گے۔",
        "v5": {
            "text": "And my brother Aaron—he is more eloquent in speech than I; [b]send him therefore with me as a helper that he may bear witness to my truth. I fear that they will accuse me of falsehood.’[2900]",
            "notes": [
                {
                    "ref": "b",
                    "note": "20:30-33; 26:14."
                },
                {
                    "ref": "2900",
                    "note": "<p><strong>Important Words:</strong></p><p>ردأ (helper) is infinitive noun from ردأ (<i>rada</i>’). They say ردأ الحائط i.e. he supported or propped the wall by means of a piece of timber or wood or buttress to prevent it from falling. ردأ means, he helped, aided or assisted him. ردء means, a buttress or the like by means of which a wall is strengthened and supported; a thing by means of which one is helped, aided or assisted; a helper or aider. They say فلان ردء فلان i.e. such a one is an aider to such a one (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 36,
        "v_": 35,
        "topics": [
            {
                "id": 23,
                "topic": "Aaron: <i>Harun(as)</i>: subordinate of Moses",
                "verses": "7:143, 20:30-37, 25:36, 26:14"
            },
            {
                "id": 12041,
                "topic": "Moses: Musa(as): and Aaron [<i>Harun<sup>(as)</sup></i>],",
                "verses": "26:14, 20:26-36, 25:36"
            },
            {
                "id": 12078,
                "topic": "Moses: Musa(as): meeting with God",
                "verses": "7:143-148, 2:52, 27:8-10"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "قَالَ سَنَشُدُّ عَضُدَکَ بِاَخِیۡکَ وَ نَجۡعَلُ لَکُمَا سُلۡطٰنًا فَلَا یَصِلُوۡنَ  اِلَیۡکُمَا ۚۛ بِاٰیٰتِنَاۤ ۚۛ اَنۡتُمَا وَ مَنِ اتَّبَعَکُمَا الۡغٰلِبُوۡنَ ﴿۳۶﴾ ",
        "ur": "اس نے کہا ہم ضرور تیرے بھائی کے ذریعہ تیرا بازو مضبوط کریں گے اور تم دونوں کو ایک غالب نشان عطا کریں گے۔ پس ہمارے نشانات کے ہوتے ہوئے وہ تم دونوں تک نہیں پہنچ سکیں گے۔ تم دونوں بھی اور وہ بھی جو تمہاری پیروی کریں گے غالب آنے والے ہیں۔",
        "v5": {
            "text": "[c]<i>God</i> said, ‘We will strengthen thy arm with thy brother, and We will give power to you both so that they shall not be able to reach you. <i>Go</i> with Our Signs. You two and those who follow you will be the victors.’[2901]",
            "notes": [
                {
                    "ref": "c",
                    "note": "19:54; 20:37."
                },
                {
                    "ref": "2901",
                    "note": "<p><strong>Important Words:</strong></p><p>عضدک (thy arm) is derived from عضد (<i>adada</i>). They say عضدہ i.e. he aided or assisted him. عضد الدابة means, he walked by the side of the beast. عضد means, the upper arm or upper half of the arm; the side of the arm-pit and the side of a road; an aider or assistant. They say ھم اعضادی i.e. they are my aiders (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 37,
        "v_": 36,
        "topics": [
            {
                "id": 2309,
                "topic": "Allah: signs of, <i>Ayatullah</i>",
                "verses": "2:165, 2:212, 3:50, 4:141, 5:3, 6:5, 6:47, 6:127, 7:41, 7:134, 7:204, 10:6-8, 10:16, 10:18, 10:21-22, 10:25, 13:28, 16:66, 17:13, 17:102, 20:43, 20:48, 20:54-57, 20:73, 27:13, 30:20-26, 31:32, 36:34-43, 36:47, 41:38-41, 42:30, 42:33-36, 45:7, 51:38"
            },
            {
                "id": 10709,
                "topic": "Magicians",
                "verses": "7:110, 2:103, 5:111, 6:8, 7:108, 7:113-123, 10:3, 10:77-78, 10:82, 20:64, 20:67-71, 27:14, 34:44, 37:16, 38:5, 40:25, 43:31, 43:50, 46:8, 51:40, 51:53, 61:7, 74:25"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "فَلَمَّا جَآءَہُمۡ مُّوۡسٰی بِاٰیٰتِنَا بَیِّنٰتٍ قَالُوۡا مَا ہٰذَاۤ  اِلَّا سِحۡرٌ مُّفۡتَرًی وَّ مَا سَمِعۡنَا بِہٰذَا  فِیۡۤ   اٰبَآئِنَا  الۡاَوَّلِیۡنَ ﴿۳۷﴾ ",
        "ur": "پس جب موسیٰ ان کے پاس ہمارے کھلے کھلے نشانات لے کر آیا تو انہوں نے کہا یہ تو ایک گھڑا ہوا جادو ہے اور ہم نے اپنے گزشتہ آباءو اجداد میں ایسا نہیں سنا۔",
        "v5": {
            "text": "[a]And when Moses came to them with Our clear Signs, they said, ‘This is nothing but a forged sorcery, and we never heard <i>the like</i> of this among our forefathers.’",
            "notes": [
                {
                    "ref": "a",
                    "note": "29:40."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 38,
        "v_": 37,
        "topics": [
            {
                "id": 5655,
                "topic": "Dar: abode, home: <i>‘Aqibatud-Dar</i>",
                "verses": "22:41, 13:23"
            },
            {
                "id": 9721,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 17351,
                "topic": "Success: <i>Falah</i>, disbelievers, wrongdoers shall not achieve",
                "verses": "6:22, 6:136, 10:18, 10:70, 10:78, 10:82, 12:24, 16:117, 18:21, 23:118, 28:83"
            }
        ],
        "ar": "وَ قَالَ  مُوۡسٰی رَبِّیۡۤ  اَعۡلَمُ بِمَنۡ جَآءَ بِالۡہُدٰی مِنۡ عِنۡدِہٖ  وَ مَنۡ تَکُوۡنُ لَہٗ عَاقِبَۃُ  الدَّارِ ؕ اِنَّہٗ  لَا یُفۡلِحُ  الظّٰلِمُوۡنَ ﴿۳۸﴾ ",
        "ur": "اور موسیٰ نے کہا میرا ربّ سب سے زیادہ جانتا ہے کہ کون اس کی طرف سے ہدایت لے کر آیا ہے اور کون ہے جس کو آخرت کا گھر نصیب ہوگا۔ یقیناً ظالم کامیاب نہیں ہوا کرتے۔",
        "v5": {
            "text": "Moses said, ‘My Lord knows best who it is that has brought guidance from Him, and whose will be the reward of the <i>final</i> abode. Verily, the wrongdoers never prosper.’[2902]",
            "notes": [
                {
                    "ref": "2902",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, \"the wrongdoers never prosper,\" lay down an immutable law of God and an infallible criterion to test the truth of a claimant to Divine revelation. The law is that a false claimant to Divine revelation or a false Prophet never succeeds in his mission. Sooner or later he must come to naught.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 39,
        "v_": 38,
        "topics": [
            {
                "id": 5114,
                "topic": "Clay: Tin, <i>Sijjil</i>",
                "verses": "23:13, 3:50, 5:111, 6:3, 7:13, 11:83, 15:75, 17:62, 32:8, 37:12, 38:72, 38:77, 51:34, 105:5"
            },
            {
                "id": 5245,
                "topic": "Conjecture: <i>Zann</i>: thinking, doubt",
                "verses": "4:158, 7:172, 11:28, 12:43, 17:102-103, 26:187, 28:40, 33:11, 38:25, 40:38, 41:23, 41:24, 48:13, 59:3, 72:6, 72:8, 84:15"
            },
            {
                "id": 8368,
                "topic": "Haman",
                "verses": "28:7, 28:9, 40:25, 40:37"
            },
            {
                "id": 10440,
                "topic": "Liar",
                "verses": "3:62, 6:29, 9:43, 9:107, 11:28, 11:94, 12:27, 12:75, 16:87, 16:106, 23:91, 24:8-9, 24:14, 26:224, 27:28, 29:4, 29:13, 37:153, 38:5, 39:4, 40:25, 40:29, 40:38, 54:26-27"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13882,
                "topic": "Pharaoh: <i>Fir‘aun</i>: arrogance of",
                "verses": "40:27, 40:37-38, 43:52-53, 44:32, 51:40-41, 79:21-25"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ قَالَ فِرۡعَوۡنُ یٰۤاَیُّہَا الۡمَلَاُ  مَا عَلِمۡتُ لَکُمۡ مِّنۡ  اِلٰہٍ غَیۡرِیۡ ۚ فَاَوۡقِدۡ لِیۡ یٰہَامٰنُ عَلَی الطِّیۡنِ فَاجۡعَلۡ  لِّیۡ صَرۡحًا لَّعَلِّیۡۤ اَطَّلِعُ  اِلٰۤی  اِلٰہِ مُوۡسٰی ۙ وَ اِنِّیۡ لَاَظُنُّہٗ مِنَ  الۡکٰذِبِیۡنَ ﴿۳۹﴾ ",
        "ur": "اور فرعون نے کہا اے سردارو! میں تمہارے لئے اپنے سوا کسی اور معبود کو نہیں جانتا۔ پس اے ہامان! میرے لئے مٹی (کی اینٹوں) پر آگ بھڑکا۔ پس مجھے ایک محل بنادے تاکہ میں موسیٰ کے معبود کو جھانک کر دیکھوں تو سہی اور میں یقیناً یہی گمان رکھتا ہوں کہ وہ جھوٹاہے۔",
        "v5": {
            "text": "And Pharaoh said, ‘O chiefs, [b]I know of no god for you other than myself; so burn me <i>bricks of</i> clay, [c]O Haman, and build me a tower, that I may have a look at the God of Moses, though I believe him to be one of the liars.’[2903]",
            "notes": [
                {
                    "ref": "b",
                    "note": "26:30."
                },
                {
                    "ref": "c",
                    "note": "40:37."
                },
                {
                    "ref": "2903",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse is susceptible of two interpretations: (1) The Israelites were already working as labourers at the kilns. Pharaoh alludes to this ignoble condition of theirs and seems derisively to say to Haman: \"These people do not appear to have sufficient work to do. Having more than enough leisure they have begun to dream of prophethood. They must be put to hard labour; then will they come to their senses and give up having false illusions about God and prophethood.\" (2) The Egyptians were well-versed in astronomy. They built high observatories for observing the movements of the stars. So Pharaoh jeeringly asked Haman to build for him a lofty observatory so that he might have a peep at the God of Moses. The verse may also imply a reference to an ancient belief of the Egyptians that heavenly spirits descended upon lofty places and therefore in order to achieve spiritual perfection they constructed high buildings.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 40,
        "v_": 39,
        "topics": [
            {
                "id": 5246,
                "topic": "Conjecture: <i>Zann</i>: thinking, doubt",
                "verses": "4:158, 7:172, 11:28, 12:43, 17:102-103, 26:187, 28:39, 33:11, 38:25, 40:38, 41:23, 41:24, 48:13, 59:3, 72:6, 72:8, 84:15"
            },
            {
                "id": 11578,
                "topic": "Moral Traits: arrogance, conceit",
                "verses": "41:51, 2:35, 2:88, 4:174, 7:14, 7:37, 7:41, 7:49, 7:56, 7:76-77, 7:89, 7:134, 7:147, 10:76, 14:22, 16:24, 16:30, 17:38, 23:47, 25:22, 28:84, 29:40, 31:19-20, 34:32-34, 38:3, 38:75-76, 39:60, 40:36, 40:48-49, 40:57, 41:16, 41:39, 44:50, 45:32, 46:11, 46:21, 57:24, 71:8, 74:24"
            },
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13882,
                "topic": "Pharaoh: <i>Fir‘aun</i>: arrogance of",
                "verses": "40:27, 40:37-38, 43:52-53, 44:32, 51:40-41, 79:21-25"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ اسۡتَکۡبَرَ ہُوَ وَ جُنُوۡدُہٗ  فِی الۡاَرۡضِ بِغَیۡرِ الۡحَقِّ وَ ظَنُّوۡۤا اَنَّہُمۡ  اِلَیۡنَا لَا یُرۡجَعُوۡنَ ﴿۴۰﴾ ",
        "ur": "اور اس نے اور اس کے لشکروں نے زمین میں ناحق تکبر کیا اور یہ گمان کیا کہ وہ ہماری طرف نہیں لوٹائے جائیں گے۔",
        "v5": {
            "text": "[a]And he and his hosts behaved arrogantly in the land without any justification. And they thought that they would never be brought back to Us.",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:134."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 41,
        "v_": 40,
        "topics": [
            {
                "id": 12123,
                "topic": "Moses: Musa(as): story of",
                "verses": "7:104-156, 10:76-93, 11:97-98, 17:102-105, 19:52-54, 20:10-99, 26:11-69, 27:8-15, 79:16-27"
            },
            {
                "id": 13896,
                "topic": "Pharaoh: <i>Fir‘aun</i>: drowning of",
                "verses": "2:51, 8:55, 10:91, 17:104, 20:79, 26:67, 43:56, 44:25, 51:41"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            },
            {
                "id": 16439,
                "topic": "Sea: body of water, <i>Bahr</i>: parted for Moses",
                "verses": "55:20-21, 2:51, 7:137, 7:139, 10:91, 20:78-79, 26:64, 51:41"
            }
        ],
        "ar": "فَاَخَذۡنٰہُ وَ جُنُوۡدَہٗ  فَنَبَذۡنٰہُمۡ فِی الۡیَمِّ ۚ فَانۡظُرۡ کَیۡفَ کَانَ عَاقِبَۃُ  الظّٰلِمِیۡنَ ﴿۴۱﴾ ",
        "ur": "پس ہم نے اسے اور اس کے لشکروں کو گرفت میں لے لیا اور انہیں سمندر میں پھینک دیا۔ پس دیکھ کہ ظالموں کا کیسا انجام ہوا۔",
        "v5": {
            "text": "[b]So We seized him and his hosts, and cast them into the sea. See, then, how <i>evil</i> was the end of the wrongdoers![2904]",
            "notes": [
                {
                    "ref": "b",
                    "note": "2:51; 7:137; 17:104; 20:79; 26:67; 79:26."
                },
                {
                    "ref": "2904",
                    "note": "<p><strong>Commentary:</strong></p><p>The use of the word یم (sea) in this verse and v. 8 above seems to suggest a curious coincidence. In order to save the child Moses from being killed by Pharaoh, Moses’ mother cast him into the یم from which he was later rescued. But Pharaoh and his mighty hosts while endeavouring to cross the یم in order to overtake the Israelites, were drowned. See also 20:79.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 42,
        "v_": 41,
        "topics": [
            {
                "id": 6019,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: punished on the",
                "verses": "37:21, 22:10, 2:175, 3:78, 3:181, 5:37, 7:168, 11:61, 11:99-100, 15:36, 16:26, 16:28, 17:98, 20:101, 20:125, 25:70, 28:62, 29:14, 29:26, 39:16, 39:25, 39:48, 39:61, 41:41, 42:46, 82:16"
            },
            {
                "id": 7610,
                "topic": "Fire: <i>An-Nar</i>: of Hell",
                "verses": "52:14, 2:25, 2:40, 2:81, 2:82, 2:127, 2:168, 2:175-176, 2:202, 2:218, 2:222, 2:258, 3:11, 3:17, 3:25, 3:103, 3:117, 3:132, 3:152, 3:186, 3:192-193, 4:15, 4:31, 5:30, 7:37, 7:39, 8:15, 9:17, 10:9, 11:17, 13:6, 14:31, 16:63, 18:30, 21:40, 22:20, 23:105, 24:58, 29:26, 66:7, 111:4"
            },
            {
                "id": 13909,
                "topic": "Pharaoh: <i>Fir‘aun</i>: punishment of",
                "verses": "11:99-100, 3:12, 7:131, 8:55, 10:91, 40:47, 44:30, 54:42-43, 73:17, 79:25-26"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ جَعَلۡنٰہُمۡ  اَئِمَّۃً  یَّدۡعُوۡنَ  اِلَی النَّارِ ۚ وَ  یَوۡمَ  الۡقِیٰمَۃِ  لَا  یُنۡصَرُوۡنَ ﴿۴۲﴾ ",
        "ur": "اور ہم نے انہیں ایسے امام بنایا تھا جو آگ کی طرف بُلاتے تھے اور قیامت کے دن وہ مدد نہیں دیئے جائیں گے۔",
        "v5": {
            "text": "And We made them leaders [c]who invited <i>people</i> unto the Fire; and on the Day of Resurrection they will not be helped.",
            "notes": [
                {
                    "ref": "c",
                    "note": "11:99."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 43,
        "v_": 42,
        "topics": [
            {
                "id": 5474,
                "topic": "Curse: <i>La‘nah</i>: on disbelievers, idolaters, wrong-doers",
                "verses": "4:48, 2:89-90, 2:160, 2:162, 4:47, 4:53, 4:94, 4:119, 5:61, 5:79, 7:39, 7:45, 9:68, 11:19, 11:61, 13:26, 23:42, 23:45, 29:26, 33:58, 33:62, 33:65, 33:69, 40:11, 40:53, 47:24, 48:7"
            },
            {
                "id": 13903,
                "topic": "Pharaoh: <i>Fir‘aun</i>: ignominy of",
                "verses": "44:30, 10:91, 11:100"
            },
            {
                "id": 13909,
                "topic": "Pharaoh: <i>Fir‘aun</i>: punishment of",
                "verses": "11:99-100, 3:12, 7:131, 8:55, 10:91, 40:47, 44:30, 54:42-43, 73:17, 79:25-26"
            },
            {
                "id": 13915,
                "topic": "Pharaoh: <i>Fir‘aun</i>: story of",
                "verses": "2:50-51, 7:104-142, 10:76-93, 20:44-80, 26:17-67"
            }
        ],
        "ar": "وَ اَتۡبَعۡنٰہُمۡ فِیۡ ہٰذِہِ الدُّنۡیَا لَعۡنَۃً ۚ وَ یَوۡمَ الۡقِیٰمَۃِ ہُمۡ مِّنَ الۡمَقۡبُوۡحِیۡنَ ﴿٪۴۳﴾ ",
        "ur": "اور ہم نے اس دنیا میں بھی ان کے پیچھے لعنت لگادی اور قیامت کے دن بھی وہ بدحالوں میں سے ہوں گے۔",
        "v5": {
            "text": "[d]And We caused them to be followed by a curse in this world; and on the Day of Resurrection they will be among those deprived of <i>all</i> good.[2905]",
            "notes": [
                {
                    "ref": "d",
                    "note": "11:61,100."
                },
                {
                    "ref": "2905",
                    "note": "<p><strong>Important Words:</strong></p><p>مقبوحین (deprived of good) is the plural of مقبوح which is passive participle from قبح (<i>qabaha</i>). They say قبحه اللّٰه (<i>qabbaha</i>) i.e. God removed him or may God remove him far from good or prosperity or from all that is good, or God rendered him or may God render him foul, unseemly, unsightly, ugly or hideous or despised. مقبوح means, removed far from good or prosperity or from all that is good or from success or the attainment of that which he desires or seeks, or driven away like a dog or despised or rendered foul, unseemly, ugly or hideous. قبح (<i>qabuha</i>) which is intransitive form means, it was or became bad, abominable, ugly or hideous. قبیح which means, bad, ugly, abominable, etc. is formed from this verb (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 44,
        "v_": 43,
        "topics": [
            {
                "id": 4657,
                "topic": "Book: <i>Kitab</i>: revelation sent through Messengers",
                "verses": "5:49, 2:54, 2:214, 3:49, 3:82, 4:163, 6:92, 11:18, 13:2, 19:31, 20:134, 23:50, 25:36, 32:24, 35:26, 37:118, 40:54, 40:71, 41:46, 46:13, 57:26"
            },
            {
                "id": 15393,
                "topic": "Reflect: ponder, <i>Tafakkur</i>",
                "verses": "30:9, 2:220, 2:267, 4:83, 6:51, 7:177, 10:25, 13:4, 16:12, 16:45, 16:70, 27:63, 30:22, 32:5, 34:47, 38:30, 39:43, 40:59, 45:14, 47:25, 51:50, 56:63, 59:22"
            },
            {
                "id": 17756,
                "topic": "Torah: guidance for Jews",
                "verses": "45:17, 3:4-5, 3:51, 3:66, 3:94, 5:44-45, 5:67, 5:111, 6:92, 6:155, 17:3, 23:50, 32:24, 37:118, 40:54-55, 61:7, 62:6"
            }
        ],
        "ar": "وَ لَقَدۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ مِنۡۢ بَعۡدِ مَاۤ اَہۡلَکۡنَا الۡقُرُوۡنَ الۡاُوۡلٰی بَصَآئِرَ لِلنَّاسِ وَ ہُدًی وَّ رَحۡمَۃً  لَّعَلَّہُمۡ  یَتَذَکَّرُوۡنَ ﴿۴۴﴾ ",
        "ur": "اور یقیناً ہم نے، بعد اس کے کہ پہلی قوموں کو ہلاک کر دیا تھا، موسیٰ کو کتاب عطا کی۔ یہ لوگوں کے لئے آنکھیں کھولنے والی اور ہدایت اور رحمت کے طور پر تھی تاکہ وہ نصیحت پکڑیں۔",
        "v5": {
            "text": "[a]And We gave the Book to Moses, after We had destroyed the earlier generations, as <i>a source</i> <i>of</i> enlightenment for men, and a guidance and a mercy, that they might reflect.[2906]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:155; 46:13."
                },
                {
                    "ref": "2906",
                    "note": "<p><strong>Important Words:</strong></p><p>بصائر (source of enlightenment) is the plural of بصیرة which means, perceptive faculty of the mind, understanding; intelligence; firm belief of the heart; an evidence, testimony, proof or argument; a witness; a shield; the blood by which one is directed to an animal that has been shot (Lane &amp; Aqrab). See also 7:204.</p><p><strong>Commentary:</strong></p><p>In this verse, the Book of Moses has been described as بصائر which in view of the various meanings of this word seemed to possess the following characteristics: (1) It was a potent means of sharpening the perceptive faculties of those who believed in it and followed it, as the Word of God is indeed a great sharpener of human intellect. (2) It constituted a strong evidence in favour of the Holy Prophet and a pointer, directing people to the Quran. It also served as an argument and a proof to prove the truth of Moses’ own claim. (3) It served as a shield which protected followers of Moses from the vicissitudes of time and heavenly chastisement. (4) It formed a mark or sign which pointed and led to God as the blood of a wounded animal points and leads to the place where it has fallen. This means that the Torah served as a guidance and showed the believers the way to God and led them right up to the threshold of His pleasure and nearness. In fact, all Divine Books possess these attributes and characteristics in a greater or lesser degree in keeping with their divine status and the scope and tenure of their message.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 45,
        "v_": 44,
        "topics": [
            {
                "id": 12047,
                "topic": "Moses: Musa(as): and Holy Prophet<sup>(sa)</sup>",
                "verses": "11:18, 2:109, 7:145, 20:30, 28:31, 46:11, 52:2-7, 95:2-4"
            },
            {
                "id": 12087,
                "topic": "Moses: Musa(as): Prophet of <i>Bani Isra’il</i>",
                "verses": "26:11, 4:165, 7:105-106, 7:145, 11:97-98, 17:3-4, 23:46-47"
            },
            {
                "id": 12240,
                "topic": "Mountains: <i>Jibal</i>: <i>Tur</i>",
                "verses": "2:64, 2:94, 4:155, 19:53, 20:81, 23:21, 28:30, 28:47, 52:3, 95:2-3"
            },
            {
                "id": 12620,
                "topic": "Muhammad<sup>(sa)</sup>: prophecies about",
                "verses": "7:158, 2:147, 5:82, 6:21, 7:144, 11:50, 12:103, 26:197-198, 33:2, 46:11-13, 54:46, 61:7, 73:16"
            },
            {
                "id": 18601,
                "topic": "West",
                "verses": "111:2-6, 2:116, 2:143, 2:178, 2:259, 18:87, 26:29, 55:18, 70:41, 73:10"
            }
        ],
        "ar": "وَ مَا کُنۡتَ بِجَانِبِ الۡغَرۡبِیِّ  اِذۡ  قَضَیۡنَاۤ اِلٰی مُوۡسَی الۡاَمۡرَ  وَ مَا کُنۡتَ  مِنَ  الشّٰہِدِیۡنَ ﴿ۙ۴۵﴾",
        "ur": "اور تو (طُور کے) غربی جانب نہیں تھا جب ہم نے موسیٰ کی طرف امر بھیجا۔ اور تُو (چشم دید) گواہوں میں سے نہیں تھا۔",
        "v5": {
            "text": "And thou wast not on the western side <i>of the Mount</i> when We committed the matter <i>of prophethood</i> to Moses, nor wast thou among the witnesses.[2907]",
            "notes": [
                {
                    "ref": "2907",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that the prophecy of Moses about the advent of the Holy Prophet (Deut. 18:18) has been fulfilled so clearly and in such detail as if he was present in person with Moses and the latter was actually seeing him when he was making the prophecy. The verse possesses a double significance. It proves the truth of Moses himself, inasmuch as he made a prophecy about the advent of the Holy Prophet which was literally fulfilled, and it proves also the truth of the Holy Prophet, as the prophecy made by Moses about the advent of \"a Prophet like unto him from among the brethren of the Israelites\" was fulfilled in his person in letter and in spirit.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 46,
        "v_": 45,
        "topics": [
            {
                "id": 10691,
                "topic": "Madyan: Midian, <i>Mada’in-e-Salih</i>",
                "verses": "15:79, 2:251, 7:86-94, 11:85, 11:95-96, 18:61, 18:66, 20:41, 22:45, 26:142, 27:19, 28:23-24, 29:37, 29:41"
            },
            {
                "id": 12047,
                "topic": "Moses: Musa(as): and Holy Prophet<sup>(sa)</sup>",
                "verses": "11:18, 2:109, 7:145, 20:30, 28:31, 46:11, 52:2-7, 95:2-4"
            },
            {
                "id": 12620,
                "topic": "Muhammad<sup>(sa)</sup>: prophecies about",
                "verses": "7:158, 2:147, 5:82, 6:21, 7:144, 11:50, 12:103, 26:197-198, 33:2, 46:11-13, 54:46, 61:7, 73:16"
            }
        ],
        "ar": "وَ لٰکِنَّاۤ  اَنۡشَاۡنَا قُرُوۡنًا فَتَطَاوَلَ عَلَیۡہِمُ الۡعُمُرُ ۚ وَ مَا کُنۡتَ ثَاوِیًا فِیۡۤ  اَہۡلِ مَدۡیَنَ تَتۡلُوۡا عَلَیۡہِمۡ اٰیٰتِنَا ۙ وَ لٰکِنَّا کُنَّا  مُرۡسِلِیۡنَ ﴿۴۶﴾",
        "ur": "لیکن ہم نے کئی قوموں کو عروج بخشا یہاں تک کہ ان پر عُمر طویل ہوگئی۔ اور تُو اہلِ مدین میں بھی اُن پر ہماری آیات پڑھتا ہوا نہیں ٹھہرا لیکن یہ ہم ہی ہیں جو پیغمبر بھیجنے والے تھے۔",
        "v5": {
            "text": "But We brought forth generations <i>after Moses</i>, and life became prolonged for them. Neither wast thou a dweller among the people of Midian, rehearsing Our Signs unto them; but it is We Who send Messengers.[2908]",
            "notes": [
                {
                    "ref": "2908",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse alludes to two more significant facts: (1) Ages passed and a long line of Prophets appeared after Moses and they preached their messages, yet none of these Prophets ever claimed to be \"that Prophet\" about whom Moses had made the prophecy mentioned in Deut. 18:18, till the Quran was revealed and it claimed that the grand prophecy of Moses had been fulfilled in the person of the Holy Prophet of Islam (73:16). (2) The words \"And thou wast not a dweller among the people of Midian, rehearsing Our signs unto them\" refer to a striking resemblance of the Holy Prophet with Moses. According to the prophecy (Deut. 18:18) the Promised Prophet was to be like unto Moses, and what greater similarity there could be between these two noble Prophets than that Moses had to flee for life from Egypt, where he was born and brought up, to Midian where for ten long years he lived among a strange people, and then went back to Egypt, armed with Divine authority to free and reclaim his depressed people, from the bondage of Pharaoh. Likewise the Prophet of Islam had to leave Mecca where he was born and brought up and then for ten years he lived in Medina among a people who were not of his kith and kin, and again in pursuance of Divine command marched forth to conquer Mecca at the head of an army of ten thousand saints to fulfil another prophecy of the Bible (Deut. 33:2).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 47,
        "v_": 46,
        "topics": [
            {
                "id": 12241,
                "topic": "Mountains: <i>Jibal</i>: <i>Tur</i>",
                "verses": "2:64, 2:94, 4:155, 19:53, 20:81, 23:21, 28:30, 28:45, 52:3, 95:2-3"
            },
            {
                "id": 12255,
                "topic": "Muhammad<sup>(sa)</sup>: advent of",
                "verses": "61:7, 2:90, 2:130, 2:152, 3:145, 3:165, 5:16, 6:21, 9:128, 14:36-38, 35:17-18, 45:19, 46:36, 62:3"
            },
            {
                "id": 12620,
                "topic": "Muhammad<sup>(sa)</sup>: prophecies about",
                "verses": "7:158, 2:147, 5:82, 6:21, 7:144, 11:50, 12:103, 26:197-198, 33:2, 46:11-13, 54:46, 61:7, 73:16"
            },
            {
                "id": 18425,
                "topic": "Warner: <i>Nadhir</i>",
                "verses": "35:24-25, 2:120, 2:214, 4:166, 5:20, 7:185, 7:189, 11:3, 11:13, 11:26, 15:90, 17:106, 22:50, 25:2, 25:8, 25:52, 25:57, 26:115-116, 27:93, 29:51, 32:4, 33:46, 34:29, 34:35, 34:47, 35:38, 35:43, 38:71, 41:5, 46:10, 48:9, 51:51, 53:57, 67:9-10, 67:27, 71:3"
            }
        ],
        "ar": "وَ مَا کُنۡتَ بِجَانِبِ الطُّوۡرِ  اِذۡ نَادَیۡنَا وَ لٰکِنۡ رَّحۡمَۃً مِّنۡ رَّبِّکَ لِتُنۡذِرَ قَوۡمًا مَّاۤ  اَتٰٮہُمۡ مِّنۡ نَّذِیۡرٍ  مِّنۡ قَبۡلِکَ  لَعَلَّہُمۡ  یَتَذَکَّرُوۡنَ ﴿۴۷﴾ ",
        "ur": "اور تُو طُور کے کنارے پر نہیں تھا جب ہم نے (موسیٰ کو) آواز دی لیکن (تُو) اپنے ربّ کی طرف سے ایک عظیم رحمت کے طور پر (بھیجا گیا ہے) تاکہ ایسی قوم کو جس کے پاس تجھ سے پہلے کوئی ڈرانے والا نہیں آیا، تُو ڈرائے۔ تاکہ وہ نصیحت پکڑیں۔",
        "v5": {
            "text": "And thou wast not on the side of the Mount <i>with Moses</i> when [a]We called <i>to him</i>. But <i>We have sent thee as</i> a mercy from thy Lord, [b]that thou mayest warn a people to whom no Warner had come before thee, that they may reflect.[2909]",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:12-13; 79:17."
                },
                {
                    "ref": "b",
                    "note": "32:4; 36:7."
                },
                {
                    "ref": "2909",
                    "note": "<p><strong>Commentary:</strong></p><p>The present verse continues the theme of the preceding two verses and purports to say that God spoke to Moses at the side of Mount Sinai, giving him the glad tidings that a Prophet like unto him would appear among the brethren of the Israelites (Deut. 18:18). It further implies that it was not possible for the Holy Prophet first to have caused Moses to make a prophecy concerning him and then to have claimed to have come in fulfilment of that prophecy. The verse emphasizes the fact that one Prophet (Moses) made a prophecy concerning another Prophet (the Holy Prophet) about two thousand years ago in a place far away from the scene of the activities of the latter, and that that prophecy was literally fulfilled in him. It proves beyond the shadow of a doubt that the maker of the prophecy, and he about whom the prophecy was made were both true Prophets of God.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 48,
        "v_": 47,
        "topics": [
            {
                "id": 849,
                "topic": "Affliction: <i>Bala’</i>",
                "verses": "2:156-158, 2:50, 2:125, 2:178, 2:215, 2:250, 3:143, 3:155, 4:63, 6:18, 7:142, 7:164, 7:169, 8:26, 16:28, 16:54-55, 17:57, 17:74, 21:84, 21:88, 22:36, 23:31, 29:11, 30:34, 30:37, 38:42, 39:9, 41:51, 47:32, 64:12, 68:7"
            },
            {
                "id": 14534,
                "topic": "Prophethood: functions of",
                "verses": "23:53, 2:214, 2:254, 5:45, 5:100, 6:49, 10:73, 19:52, 20:135, 21:93, 25:11, 30:42, 33:40, 36:15"
            }
        ],
        "ar": "وَ لَوۡ لَاۤ  اَنۡ تُصِیۡبَہُمۡ مُّصِیۡبَۃٌۢ  بِمَا قَدَّمَتۡ  اَیۡدِیۡہِمۡ فَیَقُوۡلُوۡا رَبَّنَا لَوۡ لَاۤ اَرۡسَلۡتَ  اِلَیۡنَا رَسُوۡلًا فَنَتَّبِعَ اٰیٰتِکَ وَ نَکُوۡنَ  مِنَ  الۡمُؤۡمِنِیۡنَ ﴿۴۸﴾ ",
        "ur": "اور مبادا انہیں کوئی مصیبت پہنچے بسبب اس کے جو اُن کے ہاتھوں نے آگے بھیجا تو وہ کہیں کہ اے ہمارے ربّ! کیوں نہ تو نے ہماری طرف کوئی رسول بھیجا تاکہ ہم تیری آیات کی پیروی کرتے اور مومنوں میں سے ہوجاتے۔",
        "v5": {
            "text": "And were it not that if an affliction should befall them because of what their hands have sent before <i>them</i>, they would say, [c]‘Our Lord, wherefore didst Thou not send a Messenger to us that we might have followed Thy Signs, and been of the believers?’ <i>We should not have sent thee as Messenger</i>.[2910]",
            "notes": [
                {
                    "ref": "c",
                    "note": "20:135."
                },
                {
                    "ref": "2910",
                    "note": "<p><strong>Commentary:</strong></p><p>The sense implied in the verse is that by their iniquities and transgressions the disbelievers render themselves deserving of God’s punishment but as it is inconsistent with His justice and mercy to punish them without first giving them an opportunity to reform themselves, so He raises a Prophet among them so that when punishment should overtake them they might not say that they were not given an opportunity to reform themselves by following the Divine Prophet if one had appeared among them.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 49,
        "v_": 48,
        "topics": [],
        "ar": "فَلَمَّا جَآءَہُمُ الۡحَقُّ مِنۡ عِنۡدِنَا قَالُوۡا لَوۡ لَاۤ  اُوۡتِیَ  مِثۡلَ  مَاۤ   اُوۡتِیَ  مُوۡسٰی ؕ اَوَ لَمۡ  یَکۡفُرُوۡا بِمَاۤ  اُوۡتِیَ  مُوۡسٰی  مِنۡ  قَبۡلُ ۚ قَالُوۡا  سِحۡرٰنِ تَظٰہَرَا ۟ٝ وَ قَالُوۡۤا اِنَّا بِکُلٍّ  کٰفِرُوۡنَ ﴿۴۹﴾ ",
        "ur": "پس جب ہماری طرف سے اُن کے پاس حق آگیا تو انہوں نے کہا کہ اسے ویسا ہی کیوں نہ دیا گیا جیسا موسیٰ کو دیا گیا تھا۔ کیا وہ اِس سے پہلے اُس کا انکار نہیں کر چکے جو موسیٰ کو دیاگیا تھا؟انہوں نے یہ کہا تھا کہ یہ دو بہت بڑے جادوگر ہیں جو ایک دوسرے کے مددگار ہوئے اور انہوں نے کہا ہم تو یقیناً ہر ایک کا انکار کرنے والے ہیں۔",
        "v5": {
            "text": "But when the truth has come to them from Us, they say, [a]‘Why has he not been given the like of what was given to Moses?’ Did they not reject that which was given to Moses before? They say, ‘Two <i>works of</i> sorcery—<i>the Torah and the Quran</i>—that back up each other.’ And they say, ‘We disbelieve in all.’[2911]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:125."
                },
                {
                    "ref": "2911",
                    "note": "<p><strong>Commentary:</strong></p><p>It is customary with disbelievers in the time of every Prophet that they demand from him signs and miracles which had been shown by a previous Prophet, while the disbelievers of that very Prophet had also rejected him in spite of the fact that he had shown the same miracles which disbelievers in the time of the later Prophet demanded. The verse exposes the absurdity of this worn out demand of disbelievers and purports to say that they demand from the Holy Prophet the same teachings which were given to Moses while the spiritual needs and requirements of the Holy Prophet’s time are different from those of Moses and, therefore, their demand is foolish. Yet when they are told that prophecies which were made by Moses have been fulfilled in the person of the Holy Prophet and that the teachings of the Quran in many respects support and corroborate the teachings of Torah, they say that both the Quran and the Torah are two pieces of magic that support each other.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 50,
        "v_": 49,
        "topics": [
            {
                "id": 16399,
                "topic": "Scriptures: <i>Suhuf</i>",
                "verses": "87:19-20, 2:42, 2:107, 2:160, 3:8, 3:82, 5:49, 6:115, 6:156, 10:38, 16:44-45, 16:85, 18:2-3, 20:134, 26:193-94, 26:197, 27:31, 29:49, 35:26, 36:3, 36:13, 41:42, 42:16, 43:22, 46:5, 53:6, 53:37, 53:38, 54:18, 54:44, 74:53, 80:14, 98:3"
            },
            {
                "id": 17728,
                "topic": "Torah: and Qur’an",
                "verses": "3:4-5, 5:16, 9:111, 61:7"
            },
            {
                "id": 18084,
                "topic": "Truthful: <i>Sadiq</i>: if you are",
                "verses": "2:178, 2:24, 2:95, 2:112, 3:94, 3:169, 3:184, 6:41, 6:144, 7:71, 7:107, 7:195, 10:39, 10:49, 11:14, 11:33, 15:8, 21:39, 26:155, 26:188, 27:65, 27:72, 32:29, 34:30, 36:49, 40:29, 37:158, 45:26, 46:23, 49:16, 49:18, 56:88, 62:7, 68:42"
            }
        ],
        "ar": "قُلۡ فَاۡتُوۡا بِکِتٰبٍ مِّنۡ عِنۡدِ اللّٰہِ ہُوَ اَہۡدٰی مِنۡہُمَاۤ  اَتَّبِعۡہُ  اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۵۰﴾ ",
        "ur": "تُو کہہ دے کہ اگر تم سچے ہو تو اللہ کی طرف سے کوئی ایسی کتاب تو لاؤ جو اُن دونوں (یعنی تورات اور قرآن) سے زیادہ ہدایت دینے والی ہو تو میں اُسی کی پیروی کروں گا۔",
        "v5": {
            "text": "Say, ‘Then bring a Book from Allah which is a better guide than these two Books, that I may follow it, if you are truthful.’[2912]",
            "notes": [
                {
                    "ref": "2912",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse alludes to the very high position which both the Quran and the Torah hold among heavenly Scriptures, the Quran being par excellence the best among the revealed Books and the Torah standing only second to it. It further says to disbelievers that if the revelations of the Quran and the Torah do not satisfy them, then let them produce a Book which is better suited to be humanity’s guide and which has brought about greater transformation in the lives of men than these Books have done.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 51,
        "v_": 50,
        "topics": [
            {
                "id": 6314,
                "topic": "Desire: (evil, low), <i>Hawa</i>",
                "verses": "4:136, 7:177, 18:29, 20:17, 25:44, 38:27, 45:24, 53:3, 53:5, 79:41, 79:42"
            },
            {
                "id": 8187,
                "topic": "Guidance: Allah does not give to unjust",
                "verses": "2:259, 2:265, 3:87, 5:52, 5:68, 5:109, 6:145, 9:19, 9:24, 9:37, 9:80, 9:109, 16:38, 16:108, 39:4, 40:29, 46:11, 61:6, 61:8, 62:6, 63:7"
            }
        ],
        "ar": "فَاِنۡ لَّمۡ یَسۡتَجِیۡبُوۡا لَکَ فَاعۡلَمۡ  اَنَّمَا یَتَّبِعُوۡنَ  اَہۡوَآءَہُمۡ ؕ وَ مَنۡ اَضَلُّ  مِمَّنِ اتَّبَعَ ہَوٰٮہُ بِغَیۡرِ ہُدًی مِّنَ اللّٰہِ ؕ اِنَّ اللّٰہَ  لَا  یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿٪۵۱﴾ ",
        "ur": "پس اگر وہ تیری اس دعوت کو قبول نہ کریں تو جان لے کہ وہ محض اپنی خواہشات ہی کی پیروی کر رہے ہیں۔ اور اس سے زیادہ گمراہ کون ہوگا جو اللہ کی ہدایت کو چھوڑ کر اپنی خواہشات کی پیروی کرے۔ اللہ ہرگز ظالم قوم کو ہدایت نہیں دیتا۔",
        "v5": {
            "text": "[a]But if they answer thee not, then know that they only follow their own evil inclinations. And who is more erring than he who follows his evil inclinations without any guidance from Allah? Verily, Allah guides not the unjust people.",
            "notes": [
                {
                    "ref": "a",
                    "note": "11:15."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 52,
        "v_": 51,
        "topics": [],
        "ar": "وَ لَقَدۡ وَصَّلۡنَا لَہُمُ الۡقَوۡلَ لَعَلَّہُمۡ یَتَذَکَّرُوۡنَ ﴿ؕ۵۲﴾ ",
        "ur": "اور یقیناً ہم نے اُن تک بات اچھی طرح پہنچا دی تھی تاکہ وہ نصیحت پکڑیں۔",
        "v5": {
            "text": "And We have, indeed, thoroughly conveyed to them the Word, that they may be admonished.[2913]",
            "notes": [
                {
                    "ref": "2913",
                    "note": "<p><strong>Important Words:</strong></p><p>وصلنا (thoroughly conveyed) is transitive verb from وصل (<i>wasala</i>). They say وصل الی المکان i.e. he came, reached or attained the place. وصل الشیء بالشیء (<i>wassala</i>) means, he joined or connected one thing with the other وصله الیه او أوصله (<i>wassala-hu</i>) means, he conveyed it to him (Aqrab).</p><p><strong>Commentary:</strong></p><p>In view of the two significations of the word وصل given under \"Important Words\" the verse may have the following two interpretations: (1) We have joined one revelation with another, which means that God has been sending His Messengers and revelations one after the other. The Quran has also been revealed quite in harmony with this time-honoured Divine practice. It has come after the Torah which had made a prophecy about it (Deut. 18:18) and whose prophecies it has fulfilled and whose basic principles it supports. (2) The Word of God, i.e. the Quran, has been fully conveyed to the Meccans and thoroughly explained to them.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 53,
        "v_": 52,
        "topics": [],
        "ar": "اَلَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ مِنۡ قَبۡلِہٖ ہُمۡ بِہٖ یُؤۡمِنُوۡنَ ﴿۵۳﴾ ",
        "ur": "جنہیں ہم نے اس سے پہلے کتاب دی تھی (اُن میں سے کئی) اس (قرآن) پر ایمان لاتے ہیں۔",
        "v5": {
            "text": "Those to whom We gave the Book before it—they believe in it.[2914]",
            "notes": [
                {
                    "ref": "2914",
                    "note": "<p><strong>Commentary:</strong></p><p>The word الکتاب referring to Torah or to every revealed Book, the verse may either mean, (1) that those who have been given a right understanding of the Book—the Torah, and ponder over it are sure to believe in it—the Quran; or (2) that from among the followers of every revealed Book,—the Jews, the Christians the Zoroastrians, the Hindus, etc., a large section will believe in the Quran and join the fold of Islam during the ages. In this sense the verse embodies a prophecy about the eventual triumph of Islam over all other Faiths.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 54,
        "v_": 53,
        "topics": [],
        "ar": "وَ  اِذَا یُتۡلٰی عَلَیۡہِمۡ  قَالُوۡۤا اٰمَنَّا بِہٖۤ  اِنَّہُ الۡحَقُّ مِنۡ رَّبِّنَاۤ  اِنَّا کُنَّا مِنۡ قَبۡلِہٖ مُسۡلِمِیۡنَ ﴿۵۴﴾ ",
        "ur": "اور جب ان پر (قرآن ) پڑھا جاتا ہے تو وہ کہتے ہیں ہم اس پر ایمان لے آئے۔ یقیناً یہ ہمارے ربّ کی طرف سے حق ہے۔ یقیناً ہم اس سے پہلے ہی فرمانبردار تھے۔",
        "v5": {
            "text": "[a]And when it is recited unto them, they say, ‘We believe in it. Verily, it is the truth from our Lord. Indeed, even before it we had submitted ourselves <i>to</i> <i>God</i>.’[2915]",
            "notes": [
                {
                    "ref": "a",
                    "note": "13:37; 39:12-13; 72:21."
                },
                {
                    "ref": "2915",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that when prophecies about the revelation of the Quran and the Holy Prophet are recited to them—\"the People of the Book,\" the God-fearing among them believe in it—the Quran—saying that they had already expected such a revelation to come.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 55,
        "v_": 54,
        "topics": [
            {
                "id": 2385,
                "topic": "Allah: spend in the way of",
                "verses": "2:268, 2:4, 2:196, 2:216, 2:220, 2:246, 2:255, 2:263, 2:265, 2:273, 2:275, 3:93, 8:4, 8:61, 9:20, 9:34, 9:41, 9:99, 9:111, 13:23, 14:32, 16:76, 22:36, 24:38-39, 32:17, 35:30, 42:39, 47:39, 57:8, 57:11, 61:12, 63:11, 64:17-18, 65:8, 73:21"
            },
            {
                "id": 4368,
                "topic": "Believers: <i>Mu’min</i>: who enjoin good",
                "verses": "22:42, 2:178, 3:18, 3:111, 3:115, 3:135, 7:158, 7:200, 9:112, 13:21-23, 23:4, 23:9, 23:62, 24:23, 25:64, 25:73, 26:228, 32:17, 33:36, 41:35, 57:19, 70:33"
            },
            {
                "id": 9722,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 11960,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:47, 8:66-67, 10:90, 10:110, 11:12, 11:116, 12:91, 13:25, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:81, 29:60, 32:25, 33:36, 34:20, 37:103, 38:45, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            },
            {
                "id": 13750,
                "topic": "Patience: <i>sabr</i>: reward of",
                "verses": "16:111, 7:138, 11:12, 13:23, 13:25, 16:43, 16:97, 16:127, 23:112, 25:76, 29:60, 41:36, 76:13"
            },
            {
                "id": 14229,
                "topic": "Preaching: repel evil with good",
                "verses": "13:23, 5:106, 16:126, 23:97, 41:35, 103:4"
            }
        ],
        "ar": "اُولٰٓئِکَ یُؤۡتَوۡنَ اَجۡرَہُمۡ مَّرَّتَیۡنِ بِمَا صَبَرُوۡا وَ یَدۡرَءُوۡنَ بِالۡحَسَنَۃِ  السَّیِّئَۃَ  وَ  مِمَّا  رَزَقۡنٰہُمۡ  یُنۡفِقُوۡنَ ﴿۵۵﴾ ",
        "ur": "یہی وہ لوگ ہیں جو دو مرتبہ اپنا اجر دئیے جائیں گے بسبب اس کے کہ انہوں نے صبر کیا اور وہ بھلائی کے ساتھ برائی کو دور کرتے ہیں اور جو کچھ ہم انہیں عطا کرتے ہیں وہ اس میں سے خرچ کرتے ہیں۔",
        "v5": {
            "text": "These will be given their reward twice, for they have been steadfast and [b]they repel evil with good, and spend out of what We have given them.[2916]",
            "notes": [
                {
                    "ref": "b",
                    "note": "13:23; 23:97; 41:35."
                },
                {
                    "ref": "2916",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that such persons from among the \"People of the Book\" as believe in the Quran will have double reward for the belief both in the Torah and the Quran and also for suffering patiently for the cause of truth and for their perseverance and steadfastness under trials and tribulations.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 56,
        "v_": 55,
        "topics": [
            {
                "id": 416,
                "topic": "Actions: <i>A‘mal</i>: each responsible for his own",
                "verses": "45:16, 2:140, 2:282, 3:26, 4:85, 6:165, 10:42, 17:16, 32:19, 35:19, 38:29, 39:8, 39:71, 42:16, 45:22, 53:39, 68:36, 109:7"
            },
            {
                "id": 4368,
                "topic": "Believers: <i>Mu’min</i>: who enjoin good",
                "verses": "22:42, 2:178, 3:18, 3:111, 3:115, 3:135, 7:158, 7:200, 9:112, 13:21-23, 23:4, 23:9, 23:62, 24:23, 25:64, 25:73, 26:228, 32:17, 33:36, 41:35, 57:19, 70:33"
            },
            {
                "id": 10346,
                "topic": "Laghw: vain",
                "verses": "5:90, 2:226, 19:63, 23:4, 25:73, 41:27, 52:24, 56:26, 78:36, 88:12"
            },
            {
                "id": 12031,
                "topic": "Moral Traits: vain, idle talk",
                "verses": "23:4, 6:92, 9:69, 46:9, 52:13, 70:43, 74:46"
            },
            {
                "id": 16028,
                "topic": "Salam: greetings of",
                "verses": "39:74, 4:95, 7:47, 10:11, 10:26, 11:70, 13:25, 14:24, 16:33, 19:16, 19:34, 19:48, 19:63, 25:64, 25:76, 33:45, 36:59, 37:80, 37:110, 37:121, 37:131, 37:182, 43:90, 51:26, 56:27, 56:92"
            }
        ],
        "ar": "وَ اِذَا سَمِعُوا اللَّغۡوَ اَعۡرَضُوۡا عَنۡہُ وَ قَالُوۡا لَنَاۤ  اَعۡمَالُنَا وَ لَکُمۡ  اَعۡمَالُکُمۡ ۫ سَلٰمٌ  عَلَیۡکُمۡ ۫ لَا  نَبۡتَغِی الۡجٰہِلِیۡنَ ﴿۵۶﴾ ",
        "ur": "اور جب وہ کسی لغو بات کو سنتے ہیں تو اس سے اعراض کرتے ہیں اور کہتے ہیں کہ ہمارے لئے ہمارے اعمال ہیں اور تمہارے لئے تمہارے اعمال۔ تم پر سلام ہو۔ ہم جاہلوں کی طرف رغبت نہیں رکھتے۔",
        "v5": {
            "text": "[a]And when they hear vain talk, they turn away from it and say, ‘Unto us our works and unto you your works. Peace be to you. [b]We seek not the ignorant.’",
            "notes": [
                {
                    "ref": "a",
                    "note": "23:4; 25:73."
                },
                {
                    "ref": "b",
                    "note": "25:64."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 57,
        "v_": 56,
        "topics": [
            {
                "id": 1662,
                "topic": "Allah: guides towards the right path",
                "verses": "16:10, 2:143, 2:214, 2:273, 3:74, 6:40, 6:89, 6:127, 6:154, 7:179, 9:115, 10:26, 10:36, 13:28, 14:5, 16:94, 17:98, 18:18, 22:17, 24:36, 24:47, 29:70, 33:5, 34:7, 35:9, 39:24, 39:38, 42:14, 74:32"
            },
            {
                "id": 8226,
                "topic": "Guidance: Allah gives",
                "verses": "20:51, 2:121, 2:186, 2:214, 3:74, 3:102, 4:69, 5:17, 6:36, 6:72, 6:89, 6:150, 7:44, 7:179, 10:10, 10:26, 10:36, 13:28, 13:32, 14:5, 14:13, 16:10, 16:94, 16:122, 19:77, 22:17, 22:38, 24:36, 24:47, 26:63, 26:79, 29:70, 31:5-6, 33:5, 35:9, 37:119, 39:19, 39:24, 39:38, 42:14, 47:18, 48:3, 48:21, 49:18, 64:12, 74:32, 76:4, 93:8"
            },
            {
                "id": 12298,
                "topic": "Muhammad<sup>(sa)</sup>: and disbelievers",
                "verses": "15:89-98, 2:7, 2:110, 2:119, 2:192, 2:218, 3:33, 3:128, 3:177, 3:197, 4:91, 4:103, 5:42, 5:55, 6:34, 8:31, 9:2, 9:4, 9:32, 9:40, 9:73, 9:123, 10:66, 11:13, 13:28, 15:3, 16:128, 18:7, 20:134, 22:16, 25:5, 26:4, 27:71, 29:51, 35:5, 35:9, 36:77, 41:6, 48:30, 52:34, 66:10, 68:52, 73:11, 93:6, 94:2-4"
            }
        ],
        "ar": "اِنَّکَ لَا تَہۡدِیۡ مَنۡ  اَحۡبَبۡتَ وَ لٰکِنَّ اللّٰہَ یَہۡدِیۡ مَنۡ یَّشَآءُ ۚ وَ ہُوَ اَعۡلَمُ بِالۡمُہۡتَدِیۡنَ ﴿۵۷﴾",
        "ur": "یقیناً تُو جسے چاہے ہدایت نہیں دے سکتا لیکن اللہ جسے چاہے ہدایت دے سکتا ہے اور وہ ہدایت پانے کے اہل لوگوں کو خوب جانتا ہے۔",
        "v5": {
            "text": "[c]Surely, thou wilt not be able to guide <i>all</i> whom thou lovest; but Allah guides whomsoever He pleases; and He knows best those who would accept guidance.[2917]",
            "notes": [
                {
                    "ref": "c",
                    "note": "12:104; 16:38."
                },
                {
                    "ref": "2917",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse shows how anxious the Holy Prophet was that all those to whom he addressed his message should have believed in him and thus should have saved themselves from the evil consequences of rejecting the Divine Message. See also 18:7.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 58,
        "v_": 57,
        "topics": [
            {
                "id": 3922,
                "topic": "Bakkah: <i>Makkah</i>, Mecca,",
                "verses": "3:97-98, 2:127, 14:36, 27:92, 29:68, 90:2, 95:4"
            },
            {
                "id": 3944,
                "topic": "Baitul-Haram: <i>Ka‘bah</i>",
                "verses": "17:2, 2:126, 2:128, 2:159, 5:3, 5:98, 8:36, 14:38, 22:27, 22:30, 106:4-5"
            },
            {
                "id": 11129,
                "topic": "Mecca: <i>Makkah</i>: spiritual centre",
                "verses": "7:99, 42:8, 2:126-127, 2:151, 2:192, 3:97, 6:93, 14:36-38, 27:92, 95:4"
            },
            {
                "id": 11165,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 14700,
                "topic": "Provisions: worldly",
                "verses": "20:132, 2:241, 2:237, 3:15, 5:97, 8:5, 8:75, 10:60, 10:99, 11:4, 11:7, 11:89, 12:60, 12:66, 14:31, 16:72, 16:76, 17:19, 20:132-133, 22:51, 22:59, 24:27, 33:32, 33:50, 34:5, 34:16, 40:40, 42:37, 43:30, 43:36, 45:6, 50:12, 67:16, 67:22, 79:34"
            }
        ],
        "ar": "وَ قَالُوۡۤا اِنۡ نَّتَّبِعِ الۡہُدٰی مَعَکَ نُتَخَطَّفۡ مِنۡ  اَرۡضِنَا ؕ اَوَ لَمۡ نُمَکِّنۡ لَّہُمۡ حَرَمًا اٰمِنًا یُّجۡبٰۤی  اِلَیۡہِ  ثَمَرٰتُ  کُلِّ شَیۡءٍ رِّزۡقًا مِّنۡ لَّدُنَّا وَ لٰکِنَّ  اَکۡثَرَہُمۡ  لَا  یَعۡلَمُوۡنَ ﴿۵۸﴾",
        "ur": "اور انہوں نے کہا کہ اگر ہم تیرے ہمراہ ہدایت کی پیروی کریں گے تو ہم اپنے وطن سے نکال پھینکے جائیں گے۔ کیا ہم نے انہیں پُرامن حرم میں سکونت نہیں بخشی جس کی طرف ہر قسم کے پھل لائے جاتے ہیں (یہ) ہماری طرف سے بطور رزق (ہیں)۔ لیکن ان میں سے اکثر علم نہیں رکھتے۔",
        "v5": {
            "text": "And they say, ‘If we were to follow the guidance with thee, we should be snatched away from our land.’ Have We not established for them a safe sanctuary, [d]to which are brought the fruits of all things, <i>as</i> a provision from Us? But most of them know not.[2918]",
            "notes": [
                {
                    "ref": "d",
                    "note": "2:127; 14:38."
                },
                {
                    "ref": "2918",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse seeks to dispel the unfounded fears particularly of those Meccans who think that if they accepted the new message, more powerful people will swoop down upon them and deprive them of their possessions and freedom. It purports to say that from time immemorial Mecca (which is now going to be the centre of the new Faith) has remained a safe sanctuary and those whoever sought to interfere with its sacred character themselves met with ruin and destruction. When such is the case why should the Meccans be afraid that if they accepted the new Faith they will suffer economically or politically? The fact that Mecca has remained a safe sanctuary throughout the ages amidst all the great changes that have come over the face of the earth bears a standing testimony to the truth of the prophecy that God has made it a haven of safety.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 59,
        "v_": 58,
        "topics": [
            {
                "id": 3674,
                "topic": "Attributes of Allah: Al-Warith (The Inheritor)",
                "verses": "15:24, 19:41, 21:90"
            },
            {
                "id": 5094,
                "topic": "City: <i>Ummul-Qura</i>: destroyed as punishment",
                "verses": "6:93, 7:5, 9:70, 11:103, 17:17, 18:60, 21:7, 22:46, 29:32, 29:35, 65:9"
            },
            {
                "id": 11165,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 17763,
                "topic": "Town: <i>Ummul-Qura</i>",
                "verses": "6:93"
            }
        ],
        "ar": "وَ کَمۡ  اَہۡلَکۡنَا مِنۡ قَرۡیَۃٍۭ  بَطِرَتۡ مَعِیۡشَتَہَا ۚ فَتِلۡکَ مَسٰکِنُہُمۡ لَمۡ تُسۡکَنۡ مِّنۡۢ  بَعۡدِہِمۡ  اِلَّا قَلِیۡلًا ؕ وَ کُنَّا نَحۡنُ  الۡوٰرِثِیۡنَ ﴿۵۹﴾ ",
        "ur": "اور ہم نے کتنی ہی بستیوں کو ہلاک کیا جو اپنی معیشت پر اِتراتی تھیں۔ پس یہ اُن کے مساکن ہیں جنہیں اُن کے بعد آباد نہ رکھا گیا مگر تھوڑا۔ اور یقیناً ہم ہی وارث ہوئے۔",
        "v5": {
            "text": "[a]And how many a township have We destroyed which exulted in its <i>manner of</i> life! And these are their dwellings which have not been inhabited after them except a little. [b]And it is We Who became the inheritors <i>thereof</i>.[2919]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:5; 21:12; 22:46; 65:9."
                },
                {
                    "ref": "b",
                    "note": "15:24; 19:41."
                },
                {
                    "ref": "2919",
                    "note": "<p><strong>Important Words:</strong></p><p>بطرت (exulted) is feminine gender from بطر which means, he exulted; or exulted greatly or excessively and behaved insolently, or he exulted by reason of wealth and behaved with pride. بطرت عیشک means, thou exultest excessively and behavest insolently in thy manner of life. بطرت معیشتھا in reality is بطرت فی معیشتھا which means, it exulted in its manner or means of life. بطر النعمة means, he held the favour in light estimation and was ungrateful for it. بطر الحق means, he disdainfully rejected the truth (Lane &amp; Aqrab). See also 8:48.</p><p><strong>Commentary:</strong></p><p>The verse means to say that the Meccans fear that if they accepted the new message, they will be deprived of their property and possessions by more wealthy and powerful peoples. But they seem to ignore the fact that there had lived in the past peoples who were more powerful and wealthier and possessed superior civilizations than the people of whom the Meccans are afraid and yet when those people rejected the truth and behaved proudly they were so completely wiped out from the face of the earth as if they had never lived on it, and those who were considered weak were made to take their place.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 60,
        "v_": 59,
        "topics": [
            {
                "id": 2019,
                "topic": "Allah: never destroys a township without a warner",
                "verses": "26:209, 6:132, 7:95, 7:97, 7:102, 11:118, 17:16, 20:135, 29:35, 35:38"
            },
            {
                "id": 4816,
                "topic": "Calamities: <i>‘Adhab</i>: law of God about",
                "verses": "23:77-78, 6:132, 7:95, 11:118, 16:46-47, 17:16, 20:135, 26:209, 38:4, 67:17-20"
            },
            {
                "id": 5101,
                "topic": "City: <i>Ummul-Qura</i>: not destroyed unjustly",
                "verses": "6:93, 26:209, 11:118, 15:5"
            },
            {
                "id": 14756,
                "topic": "Punishment: after warning",
                "verses": "26:209, 17:16, 20:135, 23:77-78"
            },
            {
                "id": 15409,
                "topic": "Reformers: advent of",
                "verses": "97:4, 15:19, 19:52, 25:48, 30:47, 30:57, 36:52, 45:6, 56:76, 72:10, 77:12, 81:3, 81:19, 85:2, 91:3, 92:2-3"
            },
            {
                "id": 17763,
                "topic": "Town: <i>Ummul-Qura</i>",
                "verses": "6:93"
            }
        ],
        "ar": "وَ مَا کَانَ رَبُّکَ مُہۡلِکَ الۡقُرٰی حَتّٰی یَبۡعَثَ فِیۡۤ  اُمِّہَا رَسُوۡلًا یَّتۡلُوۡا عَلَیۡہِمۡ اٰیٰتِنَا ۚ وَ مَا کُنَّا مُہۡلِکِی الۡقُرٰۤی  اِلَّا وَ اَہۡلُہَا ظٰلِمُوۡنَ ﴿۶۰﴾ ",
        "ur": "اور تیرا ربّ بستیوں کو ہلاک نہیں کرتا یہاں تک کہ ان (بستیوں) کی ماں میں رسول مبعوث کرچکا ہوتا ہے جو اُن پر ہماری آیات پڑھتا ہے۔ اور ہم اس کے سوا بستیوں کو ہلاک نہیں کرتے کہ ان کے بسنے والے ظالم ہوچکے ہوں۔",
        "v5": {
            "text": "[c]And thy Lord would never destroy the towns until He has raised in the mother-<i>town</i> thereof a Messenger, reciting unto them Our Signs; nor would We destroy the towns unless the people thereof are wrongdoers.[2920]",
            "notes": [
                {
                    "ref": "c",
                    "note": "6:132; 11:118; 20:135; 26:209."
                },
                {
                    "ref": "2920",
                    "note": "<p><strong>Commentary:</strong></p><p>Two laws have been enunciated in this verse: (1) No people are punished until God has first raised among them a Messenger who warns them of the impending punishment and exhorts them to repent and give up their evil ways. (2) No people are punished unless they have given themselves up to sin and iniquity and have completely closed the doors of repentance upon themselves.</p><p>The unusual frequency and universality of natural calamities in the form of famines, wars, earthquakes and epidemics during the last five or six decades call for the appearance of a Divine Messenger in the present time. That Divine Messenger appeared in the fullness of time in the person of Ahmad, the Promised Messiah and Holy Founder of the Ahmadiyya Movement.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 61,
        "v_": 60,
        "topics": [
            {
                "id": 783,
                "topic": "Adornment: <i>Zinah</i>: of this world",
                "verses": "7:32-33, 7:33, 11:16, 16:9, 18:8, 18:29, 18:47, 20:60, 20:88, 24:32, 24:61, 28:80, 33:29, 33:34, 37:7, 57:21"
            },
            {
                "id": 910,
                "topic": "Afterlife: <i>Akhirah</i>: comparison of present life with",
                "verses": "3:15, 3:186, 4:78, 6:33, 7:170, 8:68, 9:38, 10:71, 12:58, 12:110, 13:27, 14:4, 16:31, 16:42, 16:108, 16:118, 17:22, 29:65, 40:40, 47:37, 57:21, 75:21-22"
            },
            {
                "id": 10520,
                "topic": "Life: <i>Hayat</i>: of this world",
                "verses": "23:113-115, 2:87, 2:201, 2:213, 3:15, 3:186, 4:75, 4:95, 6:30, 6:33, 6:71, 6:131, 7:52, 9:38, 10:8-9, 10:25, 10:65, 11:16, 13:27, 14:4, 16:108, 17:19, 18:29, 18:46-47, 18:104-105, 20:132, 23:38, 29:64, 29:65, 30:8, 31:34, 35:6, 40:40, 41:32, 42:37, 43:36, 45:25, 45:36, 46:36, 47:27, 53:30, 57:21, 76:28, 79:39, 87:17-18"
            }
        ],
        "ar": "وَ مَاۤ  اُوۡتِیۡتُمۡ مِّنۡ شَیۡءٍ فَمَتَاعُ  الۡحَیٰوۃِ الدُّنۡیَا وَ زِیۡنَتُہَا ۚ وَ مَا عِنۡدَ اللّٰہِ خَیۡرٌ  وَّ  اَبۡقٰی ؕ اَفَلَا  تَعۡقِلُوۡنَ ﴿٪۶۱﴾ ",
        "ur": "اور جو کچھ بھی تم دیئے جاتے ہو یہ دنیوی زندگی کا عارضی فائدہ اور اِس (دنیا) کی زینت ہے۔ اور جو اللہ کے پاس ہے وہ بہتر اور باقی رہنے والا ہے۔ پس کیا تم عقل نہیں کرو گے؟",
        "v5": {
            "text": "[a]And whatever of the things <i>of this world</i> you are given is only a temporary enjoyment of the present life and an adornment thereof; and that which is with Allah is better and more lasting. Will you not then understand?",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:15; 9:38; 10:71; 16:118; 40:40."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 62,
        "v_": 61,
        "topics": [
            {
                "id": 525,
                "topic": "Accountability: <i>Hisab</i>: Allah calls to account",
                "verses": "2:226, 2:285, 3:31, 4:41, 6:63, 17:37, 18:50, 19:85, 21:48, 24:40, 28:85, 33:6, 37:128, 41:18, 42:23, 56:87, 58:7, 65:9, 68:40, 75:3, 83:6, 88:27, 99:8-9, 102:9"
            },
            {
                "id": 6020,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: punished on the",
                "verses": "37:21, 22:10, 2:175, 3:78, 3:181, 5:37, 7:168, 11:61, 11:99-100, 15:36, 16:26, 16:28, 17:98, 20:101, 20:125, 25:70, 28:42, 29:14, 29:26, 39:16, 39:25, 39:48, 39:61, 41:41, 42:46, 82:16"
            },
            {
                "id": 14307,
                "topic": "Promise: of Allah",
                "verses": "24:56, 2:269, 3:153, 4:96, 5:10, 8:8, 9:72, 9:111, 13:36, 18:49, 19:62, 19:88, 21:102, 21:104-105, 23:36, 25:16-17, 30:7, 33:23, 34:31, 38:54, 39:75, 41:31, 46:17, 47:16, 48:22, 48:30, 50:33, 51:23, 57:11, 85:3"
            }
        ],
        "ar": "اَفَمَنۡ وَّعَدۡنٰہُ وَعۡدًا حَسَنًا فَہُوَ لَاقِیۡہِ کَمَنۡ مَّتَّعۡنٰہُ مَتَاعَ الۡحَیٰوۃِ الدُّنۡیَا ثُمَّ ہُوَ یَوۡمَ الۡقِیٰمَۃِ مِنَ الۡمُحۡضَرِیۡنَ ﴿۶۲﴾",
        "ur": "پس کیا وہ جس سے ہم نے اچھا وعدہ کیا اور وہ اسے حاصل کرنے والا ہے اُس جیسا ہوسکتا ہے جسے ہم نے دنیا کی زندگی کا عارضی فائدہ پہنچایا ہو پھر وہ قیامت کے دن (جوا ب دہی کے لئے) حاضر کئے جانے والوں میں سے ہو۔",
        "v5": {
            "text": "Is he, then, to whom We have promised a goodly promise, <i>the fulfilment of</i> which he will meet, [b]like him whom We have provided with the good things of this life <i>only</i>, and then on the Day of Resurrection he will be among those who will be brought <i>to account before</i> <i>God</i>?[2921]",
            "notes": [
                {
                    "ref": "b",
                    "note": "20:132; 26:206-208."
                },
                {
                    "ref": "2921",
                    "note": "<p><strong>Commentary:</strong></p><p>The present verse continues and further develops the theme of its predecessor. It purports to say, \"let not those who are given only a temporary enjoyment of the good things of this life deceive themselves into the false notion that the good things will last forever. In their very nature they are temporary but the fact that those who have been provided with material amenities and comforts have defied and flouted God’s Message and rejected His Messenger has lessened their tenure all the more and in addition the disbelievers will be punished in this world and the next.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 63,
        "v_": 62,
        "topics": [],
        "ar": "وَ یَوۡمَ یُنَادِیۡہِمۡ فَیَقُوۡلُ  اَیۡنَ شُرَکَآءِیَ الَّذِیۡنَ  کُنۡتُمۡ  تَزۡعُمُوۡنَ ﴿۶۳﴾ ",
        "ur": "اور جس دن وہ انہیں پکارے گا اور کہے گا کہاں ہیں میرے وہ شریک جن کو تم (شریک) گمان کیا کرتے تھے؟",
        "v5": {
            "text": "And on that day He will call to them, and say, [c]“Where are those whom you claimed to be my associates?”",
            "notes": [
                {
                    "ref": "c",
                    "note": "28:75; 41:48."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 64,
        "v_": 63,
        "topics": [],
        "ar": "قَالَ الَّذِیۡنَ حَقَّ عَلَیۡہِمُ الۡقَوۡلُ رَبَّنَا ہٰۤؤُلَآءِ  الَّذِیۡنَ اَغۡوَیۡنَا ۚ اَغۡوَیۡنٰہُمۡ کَمَا غَوَیۡنَا ۚ تَبَرَّاۡنَاۤ  اِلَیۡکَ ۫ مَا کَانُوۡۤا اِیَّانَا یَعۡبُدُوۡنَ ﴿۶۴﴾ ",
        "ur": "وہ جن پر فرمان صادق آ چکا ہو گا کہیں گے اے ہمارے ربّ! یہ وہ لوگ ہیں جنہیں ہم نے گمراہ کیا۔ ہم نے اُن کو گمراہ کیا جیسے ہم خود گمراہ ہوئے۔ بےزاری کا اظہار کرتے ہوئے (اب) ہم تیری طرف آتے ہیں۔ یہ ہرگز ہماری عبادت نہیں کیا کرتے تھے۔",
        "v5": {
            "text": "Those against whom the sentence <i>of punishment</i> will have become due, will say, [a]‘Our Lord, these are those whom we led astray. We led them astray, even as we had gone astray <i>ourselves</i>. We <i>now</i> dissociate ourselves <i>from them and turn</i> to Thee. [b]It was not us that they worshipped.’[2922]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:39, 40; 14:22; 33:68-69; 34:32-33; 40:48-49."
                },
                {
                    "ref": "b",
                    "note": "10:29; 16:87."
                },
                {
                    "ref": "2922",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, \"those against whom the sentence will have become due,\" refer to the leaders of disbelief whom the misguided people blindly follow. Or the words may apply only to those associate-gods who themselves will be under Divine punishment and not to all those whom the idolaters worshipped because some of the righteous and God-fearing men have also been made the object of worship by their misguided followers.</p><p>The words, \"it was not us they worshipped,\" mean that the leaders of disbelief would say that their so-called followers did not worship them but only their own ideas and fancies, i.e. it was because of their own false and foolish beliefs that they were led astray from the path of truth and righteousness.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 65,
        "v_": 64,
        "topics": [],
        "ar": "وَ قِیۡلَ ادۡعُوۡا شُرَکَآءَکُمۡ  فَدَعَوۡہُمۡ فَلَمۡ  یَسۡتَجِیۡبُوۡا لَہُمۡ وَ رَاَوُا الۡعَذَابَ ۚ لَوۡ  اَنَّہُمۡ  کَانُوۡا یَہۡتَدُوۡنَ ﴿۶۵﴾ ",
        "ur": "اور ان سے کہا جائے گا کہ اپنے (بنائے ہوئے) شرکاءکو پکارو۔ پھر وہ انہیں پکاریں گے تو وہ ان کو کوئی جواب نہ دیں گے اور وہ عذاب کو دیکھیں گے۔ کاش کہ وہ ہدایت پاجاتے۔",
        "v5": {
            "text": "And it will be said, [c]‘Now call upon your <i>so-called</i> partners.’ And they will call upon them, but they will not answer them. And they will see the punishment. Would that they had followed the guidance!",
            "notes": [
                {
                    "ref": "c",
                    "note": "10:29-30; 16:87."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 66,
        "v_": 65,
        "topics": [],
        "ar": "وَ یَوۡمَ یُنَادِیۡہِمۡ فَیَقُوۡلُ مَاذَاۤ  اَجَبۡتُمُ الۡمُرۡسَلِیۡنَ ﴿۶۶﴾ ",
        "ur": "اور (یاد رکھو) وہ دن جب وہ انہیں پکارے گا اور پوچھے گا کہ تم نے مُرسَلین کو کیا جواب دیا؟",
        "v5": {
            "text": "And on that day He will call to them and say, [d]‘What answer did you give to the Messengers?’",
            "notes": [
                {
                    "ref": "d",
                    "note": "5:110; 7:7."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 67,
        "v_": 66,
        "topics": [],
        "ar": "فَعَمِیَتۡ عَلَیۡہِمُ الۡاَنۡۢبَآءُ یَوۡمَئِذٍ فَہُمۡ لَا  یَتَسَآءَلُوۡنَ ﴿۶۷﴾ ",
        "ur": "پس اُس دن اُن پر خبریں مشتبہ ہو جائیں گی۔ پس وہ ایک دوسرے سے بھی کوئی سوال نہ کریں گے۔",
        "v5": {
            "text": "Then all excuses will become obscure to them on that day, and they shall not <i>even</i> ask each other.[2923]",
            "notes": [
                {
                    "ref": "2923",
                    "note": "<p><strong>Important Words:</strong></p><p>عمیت (will become obscure) is formed from عمی which means, he was or became blind; he was or became spiritually blind; he failed to see a thing; he was or became stupid or ignorant. They say عمی علیه الامر i.e. the affair became obscure or confused to him. عمیت الاخبار عن فلان means, news or information became hidden to such a one (Aqrab &amp; Lane).</p><p>انباء (excuses) is the plural of نبأ which means, important news; information; message; excuse (Lane, Aqrab &amp; Kulliyyat). See also 6:6.</p><p><strong>Commentary:</strong></p><p>The verse means to say that at the time of reckoning the disbelievers will be in utter confusion and despair and will be completely at a loss how to defend themselves. The untenability of all false pleas and excuses will become manifest to them, and they will not be allowed to consult each other for the sake of preparing their defence.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 68,
        "v_": 67,
        "topics": [
            {
                "id": 1993,
                "topic": "Allah: mercy of for those who repent and believe",
                "verses": "7:154, 2:161, 3:90, 4:18, 4:147, 5:40, 6:55, 7:150, 16:120, 20:83, 24:6, 25:72, 40:8"
            },
            {
                "id": 15541,
                "topic": "Repentance: <i>Taubah</i>: door of always open",
                "verses": "9:112, 4:111, 5:40, 6:55, 25:71-72, 39:54"
            },
            {
                "id": 17333,
                "topic": "Success: <i>Falah</i>, believers, obedient, shall achieve",
                "verses": "3:201, 2:6, 2:190, 3:105, 3:131, 5:36, 5:91, 5:101, 7:9, 7:70, 7:158, 8:46, 9:88, 20:65, 22:78, 23:2, 23:103, 24:32, 24:52, 30:39, 31:6, 59:10, 62:11, 64:17, 87:15, 91:10"
            }
        ],
        "ar": "فَاَمَّا مَنۡ تَابَ وَ اٰمَنَ وَ عَمِلَ صَالِحًا فَعَسٰۤی اَنۡ  یَّکُوۡنَ مِنَ الۡمُفۡلِحِیۡنَ ﴿۶۸﴾ ",
        "ur": "پس جہاں تک اس کا تعلق ہے جس نے توبہ کی اور ایمان لایا اور نیک عمل کئے تو بعید نہیں کہ وہ کامیاب ہونے والوں میں سے ہوجائے۔",
        "v5": {
            "text": "[a]But as for him who repents and believes and does righteous deeds, maybe he will be among the prosperous.[2924]",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:83; 25:72."
                },
                {
                    "ref": "2924",
                    "note": "<p><strong>Important Words:</strong></p><p>عسی (maybe) meaning, it may be that, maybe or perhaps, is a word which expresses eager desire or hope and fear, sometimes with reference to the person addressed and sometimes with reference to the speaker himself. It denotes hope in the case of that which is liked and fear in the case of that which is disliked. It also denotes opinion or doubt, and certainty. When used by persons of very high authority the object is to engender hope but not overconfidence in the person or persons with reference to whom it is used. In the opinion of most commentators of the Quran the words عسی and لعل when used with reference to God denote certainty because uncertainty and expectancy cannot be attributed to God. Imam Raghib, however, differs from this view and says that in the Quran these words are used to express hope only on the part of the person or persons with reference to whom they are used (Lane &amp; Mufradat).</p><p><strong>Commentary:</strong></p><p>The verse shows that according to Islam the door of repentance always remains open. The sinner can repent even with the last breath of life. He is never beyond redemption except when by persistent rejection of truth he himself deliberately chooses to shut the door of repentance upon him.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 69,
        "v_": 68,
        "topics": [
            {
                "id": 760,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: Glory be to Allah",
                "verses": "12:109, 2:33, 2:117, 3:192, 4:172, 5:117, 6:101, 7:144, 9:31, 10:11, 10:19, 10:69, 16:2, 16:58, 17:2, 17:44, 17:94, 17:109, 19:36, 21:23, 21:27, 21:88, 23:92, 24:17, 25:19, 27:9, 30:18, 30:41, 34:42, 36:37, 36:84, 37:160, 37:181, 39:5, 39:68, 43:83, 52:44, 59:24, 68:30"
            },
            {
                "id": 1703,
                "topic": "Allah: has no partners",
                "verses": "6:164, 3:65, 3:152, 4:37, 4:49, 6:15, 6:80, 6:82, 6:101, 7:34, 7:191, 10:19, 12:39, 13:17, 13:34, 13:37, 16:2, 16:4, 17:112, 18:43, 18:111, 22:32, 23:60, 23:93, 25:3-4, 30:41, 39:68, 40:43, 40:85, 59:24"
            }
        ],
        "ar": "وَ رَبُّکَ یَخۡلُقُ مَا یَشَآءُ وَ یَخۡتَارُ ؕ مَا کَانَ لَہُمُ الۡخِیَرَۃُ ؕ سُبۡحٰنَ اللّٰہِ  وَ تَعٰلٰی عَمَّا یُشۡرِکُوۡنَ ﴿۶۹﴾ ",
        "ur": "اور تیرا ربّ جو چاہتا ہے پیدا کرتا ہے اور (اُس میں سے) اختیار کرتا ہے۔ اور اُن کو کوئی اختیار حاصل نہیں۔ پاک ہے اللہ اور بہت بلند ہے اُس سے جو وہ شریک ٹھہراتے ہیں۔",
        "v5": {
            "text": "And thy Lord creates whatever He pleases, and chooses <i>whomsoever He pleases</i>. It is not for them to choose. Glorified be Allah, and He is far above all that they associate <i>with Him</i>.[2925]",
            "notes": [
                {
                    "ref": "2925",
                    "note": "<p><strong>Commentary:</strong></p><p>Whereas in the preceding several verses polytheism has been condemned and denounced, the present and the following few verses give the reasons for this denunciation and condemnation. The most effective argument against polytheism is that God is All-Knowing, All-Powerful and is the sole Creator of the whole universe. He depends on no one for help or advice in the control and direction of the affairs of the universe and His wisdom being infallible His choice in all things is unfettered.</p><p>The expression تعالی عما یشرکون may mean: (1) He is far above being associated with other persons and things as equal; (2) He is far above those persons or things which the idolaters associate with Him as His equal.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 70,
        "v_": 69,
        "topics": [
            {
                "id": 1881,
                "topic": "Allah: knowledge encompasses everything",
                "verses": "2:256, 4:127, 6:4, 6:60, 10:62, 20:8, 20:111, 21:29, 27:75, 34:3-4, 35:39, 50:17, 58:8, 67:14"
            },
            {
                "id": 1919,
                "topic": "Allah: knows what you hide or disclose",
                "verses": "64:5, 2:78, 3:120, 5:100, 6:4, 9:78, 11:6, 16:20, 16:24, 20:8, 21:111, 27:26, 27:75, 33:55, 35:39, 36:77, 67:14"
            }
        ],
        "ar": "وَ رَبُّکَ یَعۡلَمُ مَا تُکِنُّ صُدُوۡرُہُمۡ وَ مَا یُعۡلِنُوۡنَ ﴿۷۰﴾ ",
        "ur": "اور تیرا ربّ جانتا ہے جو اُن کے سینے چھپاتے ہیں اور جو وہ (لوگ) ظاہر کرتے ہیں۔",
        "v5": {
            "text": "[a]And thy Lord knows what their breasts conceal, and what they reveal.",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:78; 11:6; 16:24; 36:77."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 71,
        "v_": 70,
        "topics": [
            {
                "id": 2061,
                "topic": "Allah: no god but He, <i>La ilaha illallah</i>",
                "verses": "40:4, 2:164, 2:256, 3:3, 3:19, 3:63, 3:65, 4:88, 5:74, 6:20, 9:31, 16:3, 16:23, 16:52, 21:26, 22:35, 23:117, 37:5, 40:63"
            },
            {
                "id": 5417,
                "topic": "Creed: <i>‘Aqidah, Millah</i>",
                "verses": "2:256, 2:108, 2:111, 2:113, 2:121, 12:38, 22:79, 27:27"
            }
        ],
        "ar": "وَ ہُوَ اللّٰہُ  لَاۤ  اِلٰہَ  اِلَّا ہُوَ ؕ لَہُ  الۡحَمۡدُ فِی الۡاُوۡلٰی وَ الۡاٰخِرَۃِ ۫ وَ لَہُ  الۡحُکۡمُ  وَ  اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۷۱﴾ ",
        "ur": "اور وہی ہے اللہ، اس کے سوا کوئی معبود نہیں۔ ابتدا اور آخرت (دونوں) میں تعریف اُسی کی ہے اور اُسی کا حکم چلتا ہے اور اُسی کی طرف تم لوٹائے جاؤ گے۔",
        "v5": {
            "text": "And He is Allah; there is no god but He. To Him belongs all praise in the beginning and the Hereafter. His is the judgement, and to Him shall you be brought back.[2926]",
            "notes": [
                {
                    "ref": "2926",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, \"To Him belongs all praise in the beginning and the Hereafter,\" signify that it is not possible to begin a work unless God provides the means for it and that no work can become complete unless He has provided the means for its completion, and that it can produce no result without His help. The expression الا ولٰی و آلاخرة may also signify respectively the Mosaic and Islamic Dispensations.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 72,
        "v_": 71,
        "topics": [
            {
                "id": 9170,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: their gods produce nothing, are helpless, dead",
                "verses": "9:3-14, 7:192-196, 6:72, 10:19, 10:35, 10:107, 13:34, 16:21-22, 20:90, 21:23-25, 22:74, 29:18, 29:42, 30:41, 35:14, 35:41, 43:19, 46:5-6"
            },
            {
                "id": 13030,
                "topic": "Night: signs of Allah",
                "verses": "17:13, 3:28, 3:191, 6:14, 6:97, 7:5, 7:55, 7:98, 10:7, 10:68, 13:4, 14:34, 16:13, 21:34, 22:62, 23:81, 24:45, 25:63, 31:30, 35:14, 36:38, 36:41, 45:6, 79:30"
            }
        ],
        "ar": "قُلۡ اَرَءَیۡتُمۡ  اِنۡ جَعَلَ اللّٰہُ عَلَیۡکُمُ الَّیۡلَ سَرۡمَدًا  اِلٰی یَوۡمِ الۡقِیٰمَۃِ مَنۡ اِلٰہٌ غَیۡرُ اللّٰہِ یَاۡتِیۡکُمۡ بِضِیَآءٍ ؕ اَفَلَا تَسۡمَعُوۡنَ ﴿۷۲﴾ ",
        "ur": "تُو کہہ دے کہ مجھے بتاؤ تو سہی کہ اگر اللہ تم پر رات قیامت کے دن تک دراز کر دے تو اللہ کے سوا کون معبود ہے جو تمہارے پاس کوئی روشنی لا سکے؟ پس کیا تم سنو گے نہیں؟",
        "v5": {
            "text": "Say, ‘Tell me, if Allah make the night continue over you till the Day of Resurrection, what god is there besides Allah who could bring you light? Will you not then hearken?’",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 73,
        "v_": 72,
        "topics": [
            {
                "id": 11180,
                "topic": "Medicine: healing",
                "verses": "16:70, 23:52, 47:16"
            },
            {
                "id": 13030,
                "topic": "Night: signs of Allah",
                "verses": "17:13, 3:28, 3:191, 6:14, 6:97, 7:5, 7:55, 7:98, 10:7, 10:68, 13:4, 14:34, 16:13, 21:34, 22:62, 23:81, 24:45, 25:63, 31:30, 35:14, 36:38, 36:41, 45:6, 79:30"
            }
        ],
        "ar": "قُلۡ  اَرَءَیۡتُمۡ  اِنۡ جَعَلَ  اللّٰہُ عَلَیۡکُمُ النَّہَارَ سَرۡمَدًا  اِلٰی یَوۡمِ الۡقِیٰمَۃِ مَنۡ اِلٰہٌ غَیۡرُ اللّٰہِ یَاۡتِیۡکُمۡ بِلَیۡلٍ تَسۡکُنُوۡنَ  فِیۡہِ ؕ اَفَلَا  تُبۡصِرُوۡنَ ﴿۷۳﴾ ",
        "ur": "تُو کہہ دے کہ بتاؤ تو سہی اگر اللہ تم پر دن، قیامت کے روز تک دراز کردے تو اللہ کے سوا کون معبود ہے جو تمہارے پاس رات کو لا سکے جس میں تم تسکین پاتے ہو؟ کیا تم بصیرت سے کام نہیں لو گے؟",
        "v5": {
            "text": "Say, ‘Tell me, if Allah make the day continue over you till the Day of Resurrection, what god is there besides Allah who could bring you night wherein you could rest? Will you not then see?’[2927]",
            "notes": [
                {
                    "ref": "2927",
                    "note": "<p><strong>Commentary:</strong></p><p>While speaking of \"the day\" as in the present verse, the Quran uses the words \"will you not then see\" and when speaking of \"the night\" as in the preceding verse it uses the words, \"will you not then hearken\", the reason being that one cannot properly see at night.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 74,
        "v_": 73,
        "topics": [
            {
                "id": 11699,
                "topic": "Moral Traits: gratefulness, thankfulness",
                "verses": "3:145, 2:153, 2:173, 2:186, 2:244, 5:7, 5:90, 14:8, 14:29, 16:113, 27:41, 29:67, 31:13, 34:18, 39:8, 39:67, 46:16, 80:18"
            },
            {
                "id": 12999,
                "topic": "Night: for rest",
                "verses": "6:97, 10:68, 27:87, 30:24, 40:62, 41:38-9"
            },
            {
                "id": 13030,
                "topic": "Night: signs of Allah",
                "verses": "17:13, 3:28, 3:191, 6:14, 6:97, 7:5, 7:55, 7:98, 10:7, 10:68, 13:4, 14:34, 16:13, 21:34, 22:62, 23:81, 24:45, 25:63, 31:30, 35:14, 36:38, 36:41, 45:6, 79:30"
            }
        ],
        "ar": "وَ مِنۡ رَّحۡمَتِہٖ جَعَلَ لَکُمُ الَّیۡلَ وَ النَّہَارَ  لِتَسۡکُنُوۡا فِیۡہِ وَ لِتَبۡتَغُوۡا مِنۡ فَضۡلِہٖ  وَ  لَعَلَّکُمۡ  تَشۡکُرُوۡنَ ﴿۷۴﴾ ",
        "ur": "اور اس نے اپنی رحمت سے تمہارے لئے رات اور دن کو اس لئے بنایا کہ تم اس میں سکینت حاصل کرو اور اس کے فضلوں کی جستجو کرو اور تاکہ تم شکر کرو۔",
        "v5": {
            "text": "[a]And of His mercy He has made for you the night and the day, that you may rest therein, and that you may seek of His bounty, and that you may be grateful.[2928]",
            "notes": [
                {
                    "ref": "a",
                    "note": "10:68; 17:13; 27:87; 30:24."
                },
                {
                    "ref": "2928",
                    "note": "<p><strong>Commentary:</strong></p><p>Whereas both perpetual work and perpetual rest are injurious for man’s physical health, periodical rest in the form of the night and periodical work in the shape of the day are great boons of God. At night our jaded and tired limbs are rested and we are able with renewed vigour to do the next day’s work and in the day we work and earn our livelihood. Thus their alternation constitutes a great Divine blessing.</p><p>'Day' may also be compared to the period of glory and prosperity in the life of a nation and 'night' to the time of its decline and decadence. 'Day' may also signify the time when Divine Reformer is present in the world and 'night' the time of spiritual darkness.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 75,
        "v_": 74,
        "topics": [],
        "ar": "وَ یَوۡمَ یُنَادِیۡہِمۡ فَیَقُوۡلُ اَیۡنَ شُرَکَآءِیَ الَّذِیۡنَ  کُنۡتُمۡ تَزۡعُمُوۡنَ ﴿۷۵﴾ ",
        "ur": "اور (وہ دن یاد رکھو) جس دن وہ انہیں پکارے گا اور کہے گا کہاں ہیں میرے وہ شریک جنہیں تم (میرا شریک) گمان کیا کرتے تھے؟",
        "v5": {
            "text": "And on that day He will call to them and say, [b]“Where are those whom you claimed to be My associates?”[2929]",
            "notes": [
                {
                    "ref": "b",
                    "note": "16:28; 18:53; 28:63; 41:48."
                },
                {
                    "ref": "2929",
                    "note": "<p><strong>Commentary:</strong></p><p>After a brief mention about the powers and favours of God, made in the preceding few verses, the present verse reverts to the subject of the futility of idol worship and puts forth these Divine powers and favours as an argument in support of the Unity of God.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 76,
        "v_": 75,
        "topics": [
            {
                "id": 2845,
                "topic": "Arguments for: <i>Burhan</i>",
                "verses": "2:112, 4:175, 12:25, 23:118"
            },
            {
                "id": 18124,
                "topic": "Ummah: people, nation, body of men",
                "verses": "16:121, 2:129, 2:135, 2:142, 2:144, 2:214, 3:105, 3:111, 10:20, 10:50, 16:37, 21:93, 22:68, 27:84, 33:41, 35:25, 42:9, 45:29"
            }
        ],
        "ar": "وَ نَزَعۡنَا مِنۡ کُلِّ  اُمَّۃٍ  شَہِیۡدًا فَقُلۡنَا ہَاتُوۡا بُرۡہَانَکُمۡ فَعَلِمُوۡۤا اَنَّ الۡحَقَّ  لِلّٰہِ وَ ضَلَّ عَنۡہُمۡ  مَّا  کَانُوۡا  یَفۡتَرُوۡنَ ﴿٪۷۶﴾ ",
        "ur": "اور ہم ہر امت سے ایک گواہ نکال لائیں گے اور کہیں گے کہ اپنی برہان لاؤ۔ پس وہ جان لیں گے کہ حق اللہ کے اختیار میں ہے اور جو کچھ وہ افترا کیا کرتے تھے ان سے جاتارہے گا۔",
        "v5": {
            "text": "[a]And We shall draw from every people a witness and We shall say, ‘Bring your proof.’ Then they will know that the truth belongs to Allah. And that which they used to forge will <i>all</i> be lost unto them.",
            "notes": [
                {
                    "ref": "a",
                    "note": "4:42; 16:85."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 77,
        "v_": 76,
        "topics": [
            {
                "id": 1410,
                "topic": "Allah: loves not",
                "verses": "31:19, 2:191, 2:206, 2:277, 3:33, 4:37, 4:108, 4:149, 5:65, 7:32, 8:59, 16:24, 22:39, 42:41"
            },
            {
                "id": 5301,
                "topic": "Corah: <i>Qarun</i>",
                "verses": "28:80, 28:82-83, 29:40-41, 40:25"
            },
            {
                "id": 8922,
                "topic": "Hoarding",
                "verses": "104:3-5, 3:158, 9:34-35, 10:59, 23:5, 70:19, 89:21"
            },
            {
                "id": 17843,
                "topic": "Treasure",
                "verses": "3:50, 1:1, 2:24, 3:76, 4:21, 6:51, 11:13, 11:32, 12:56, 15:22, 17:101, 18:83, 25:9, 26:59, 38:10, 52:38, 63:8"
            }
        ],
        "ar": "اِنَّ قَارُوۡنَ کَانَ مِنۡ قَوۡمِ  مُوۡسٰی فَبَغٰی عَلَیۡہِمۡ ۪ وَ اٰتَیۡنٰہُ مِنَ الۡکُنُوۡزِ مَاۤ  اِنَّ مَفَاتِحَہٗ  لَتَنُوۡٓاُ بِالۡعُصۡبَۃِ  اُولِی الۡقُوَّۃِ ٭ اِذۡ  قَالَ  لَہٗ  قَوۡمُہٗ  لَا تَفۡرَحۡ  اِنَّ اللّٰہَ  لَا یُحِبُّ الۡفَرِحِیۡنَ ﴿۷۷﴾ ",
        "ur": "یقیناً قارون موسیٰ کی قوم میں سے تھا۔ پس اس نے ان کے خلاف بغاوت کی اور ہم نے اسے ایسے خزانے دیئے تھے کہ ان کی چابیاں (اپنے بوجھ سے) ایک مضبوط جماعت کو بھی تھکا دیتی تھیں۔ (پھر) جب اس کی قوم نے اس سے کہا شیخی نہ بگھار، یقیناً اللہ اِترانے والوں کو پسند نہیں کرتا۔",
        "v5": {
            "text": "[b]Verily, Korah was of the people of Moses, but he behaved tyrannically towards them. And We had given him treasures <i>of hoarded wealth</i> so much that the stores thereof would have weighed down a party of strong men. When his people said to him, ‘Exult not, surely Allah loves not those who exult.[2930]",
            "notes": [
                {
                    "ref": "b",
                    "note": "29:40; 40:25."
                },
                {
                    "ref": "2930",
                    "note": "<p><strong>Important Words:</strong></p><p>کنوز (treasures of hoarded wealth) is the plural of کنز which is noun-inf. from کنز (<i>kanaza</i>). They say کنز المال i.e. he buried the property or treasure in the earth; he hoarded it, or stored, or he collected the property and treasured it. کنز therefore, means, treasure, property buried in the earth; property that is preserved in a receptacle; that receptacle in which property is buried or preserved or hoarded; treasure-boxes; anything abundant and collected together (Lane &amp; Aqrab).</p><p>مفاتح (stores) is the plural of مفتح (<i>maftah</i>) which is derived from فتح. They say فتح الباب i.e. he opened the door. مفتح (<i>maftah</i>) means, a hoard; a treasure, a store or store room or magazine; buried property. مفتح (<i>miftah</i>) of which مفاتح also is the plural and مفتاح (plural مفاتیح) mean a key (Lane &amp; Aqrab).</p><p>لتنوء (would have weighed down) is derived fromناء which means, he rose or rose with difficulty and effort under a load; he was oppressed by weight and fell down. ناء بحمله means, he rose with his burden with effort and difficulty. ناء به الحملmeans, the burden weighed him down (Aqrab).</p><p><strong>Commentary:</strong></p><p>It would appear that Korah was an Israelite who stood high in the favour of Pharaoh and held one of the principal offices of State under him. Very likely he was Pharaoh’s treasurer. When Pharaoh went on official tour the royal treasures were probably transported under Korah’s charge. In order to safeguard his position and to win further favours from Pharaoh, Korah seemed to have persecuted his own people and behaved haughtily and tyrannically towards them.</p><p>The name of Qarun (Korah) seems also to have been symbolically used here for men of material wealth. Abundance of riches has proved the undoing of many a man. Elated with riches and wealth and lulled into a false sense of security, wealthy people are prone to reject God’s Message and defy His Prophets. Korah as it appears from the Bible (Num. 16:1-35), was a believer in Moses. According to Rabbinical literature he was fabulously rich (Jew. Enc.) and in the pride of wealth revolted against Moses and Aaron and consequently perished with his 250 followers, the earth having swallowed them up.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 78,
        "v_": 77,
        "topics": [
            {
                "id": 1410,
                "topic": "Allah: loves not",
                "verses": "31:19, 2:191, 2:206, 2:277, 3:33, 4:37, 4:108, 4:149, 5:65, 7:32, 8:59, 16:24, 22:39, 42:41"
            },
            {
                "id": 1412,
                "topic": "Allah: does not love mischief-mongers",
                "verses": "2:12-13, 2:28, 2:61, 2:252, 5:33-34, 5:65, 7:57, 7:75, 7:87, 7:104, 7:143, 8:74, 10:82, 11:86, 13:26, 17:5, 18:95, 26:153, 26:184, 28:5, 28:84, 38:29, 89:13"
            },
            {
                "id": 5685,
                "topic": "Darul-Akhirah: abode of Hereafter",
                "verses": "2:95, 6:33, 7:170, 12:110, 16:31, 28:84, 29:65, 33:30, 38:47"
            },
            {
                "id": 6565,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:20, 8:26, 8:40, 8:74, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 13:26, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:5, 28:84, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 11472,
                "topic": "Mischief",
                "verses": "10:82, 10:92, 11:79, 12:30, 12:74, 28:5, 38:42, 113:5"
            }
        ],
        "ar": "وَ ابۡتَغِ  فِیۡمَاۤ  اٰتٰٮکَ اللّٰہُ  الدَّارَ الۡاٰخِرَۃَ  وَ لَا تَنۡسَ نَصِیۡبَکَ مِنَ الدُّنۡیَا وَ اَحۡسِنۡ کَمَاۤ  اَحۡسَنَ اللّٰہُ  اِلَیۡکَ وَ لَا تَبۡغِ الۡفَسَادَ فِی الۡاَرۡضِ ؕ اِنَّ اللّٰہَ  لَا یُحِبُّ الۡمُفۡسِدِیۡنَ ﴿۷۸﴾ ",
        "ur": "اور جو کچھ اللہ نے تجھے عطا کیا ہے اس کے ذریعہ دارِآخرت کمانے کی خواہش کر اور دنیا میں سے بھی اپنا معیّن حصہ نظرانداز نہ کر اور احسان کا سلوک کر جیسا کہ اللہ نے تجھ سے احسان کا سلوک کیا اور زمین میں فساد (پھیلانا) پسند نہ کر۔ یقیناً اللہ فسادیوں کو پسند نہیں کرتا۔",
        "v5": {
            "text": "And seek, in that which Allah has given thee, the Home of the Hereafter; and neglect not thy lot in this world; and do good <i>to others</i> as Allah has done good to thee; and seek not to make mischief in the earth, verily, Allah loves not those who make mischief.’[2931]",
            "notes": [
                {
                    "ref": "2931",
                    "note": "<p><strong>Commentary:</strong></p><p>Islam does not view with favour such flight from the world as Christianity inculcates among its votaries. One should not deny one’s portion of the good things of the world. As a matter of fact at another place in the Quran the believers are enjoined to pray to God \"to grant them the good things of this world as well as the good things of the world to come\" (2:202), only the pursuit of the good things of this world should not make one neglect the seeking of the good things of the Hereafter. Islam is not a religion of monks and recluses but of pious and righteous men of the world.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 79,
        "v_": 78,
        "topics": [
            {
                "id": 8262,
                "topic": "Guilty: <i>Mujrim</i>",
                "verses": "10:18, 6:148, 7:41, 7:134, 9:66, 10:14, 11:117, 12:111, 14:50, 19:87, 20:75, 20:103, 27:70, 30:13, 30:56, 32:13, 36:60, 37:35, 43:75, 46:26, 55:42, 55:44, 70:12, 77:19"
            },
            {
                "id": 16885,
                "topic": "Sin: <i>Dhanb</i>: punishment of",
                "verses": "10:28, 2:82, 3:12, 5:19, 5:50, 6:7, 6:161, 7:101, 8:53, 8:55, 28:85, 40:41, 45:34, 91:15"
            }
        ],
        "ar": "قَالَ  اِنَّمَاۤ   اُوۡتِیۡتُہٗ  عَلٰی  عِلۡمٍ عِنۡدِیۡ ؕ اَوَ لَمۡ یَعۡلَمۡ اَنَّ اللّٰہَ  قَدۡ اَہۡلَکَ مِنۡ قَبۡلِہٖ مِنَ الۡقُرُوۡنِ مَنۡ ہُوَ اَشَدُّ مِنۡہُ  قُوَّۃً وَّ اَکۡثَرُ جَمۡعًا ؕ وَ لَا یُسۡـَٔلُ عَنۡ ذُنُوۡبِہِمُ  الۡمُجۡرِمُوۡنَ ﴿۷۹﴾ ",
        "ur": "اس نے کہا مجھے تو یہ اس علم کی وجہ سے دیا گیا ہے جو مجھے حاصل ہے۔ پھر کیا اسے علم نہیں ہوا کہ یقیناً اللہ اُس سے پہلے کتنی ہی نسلوں کو ہلاک کرچکا ہے جو قوت میں اس سے سخت تر اور جمعیت میں زیادہ تھیں؟ اور مجرموں سے ان کے گناہوں کے بارہ میں پوچھا نہیں جائے گا۔",
        "v5": {
            "text": "[a]He said, ‘This has been given to me because of the knowledge I possess.’ Did he not know that Allah had destroyed before him generations that were mightier than he and greater in riches? And the guilty shall not be asked <i>to offer an explanation</i> of their sins.[2932]",
            "notes": [
                {
                    "ref": "a",
                    "note": "39:50."
                },
                {
                    "ref": "2932",
                    "note": "<p><strong>Commentary:</strong></p><p>The expression ولا یسأل عن ذنوبھم المجرمون may mean that the guilt of the disbelievers will be so patent that no further investigation will be considered necessary to establish it; or it may mean that the guilty will not be given an opportunity to defend themselves or to redress the wrong done by them, their sins and crimes being all too apparent.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 80,
        "v_": 79,
        "topics": [
            {
                "id": 794,
                "topic": "Adornment: <i>Zinah</i>: of this world",
                "verses": "7:32-33, 28:61, 7:33, 11:16, 16:9, 18:8, 18:29, 18:47, 20:60, 20:88, 24:32, 24:61, 33:29, 33:34, 37:7, 57:21"
            },
            {
                "id": 4176,
                "topic": "Beauty: in physical world, <i>Bahjah</i>, <i>Zinah</i>,",
                "verses": "16:9, 7:32-33, 10:89, 11:16, 16:7, 18:8, 18:29, 18:47, 20:88, 22:6, 27:61, 33:29, 37:7, 41:26, 49:8, 50:7-8, 57:21"
            },
            {
                "id": 5302,
                "topic": "Corah: <i>Qarun</i>",
                "verses": "28:77, 28:82-83, 29:40-41, 40:25"
            }
        ],
        "ar": "فَخَرَجَ عَلٰی قَوۡمِہٖ فِیۡ زِیۡنَتِہٖ ؕ قَالَ الَّذِیۡنَ یُرِیۡدُوۡنَ الۡحَیٰوۃَ  الدُّنۡیَا یٰلَیۡتَ لَنَا مِثۡلَ مَاۤ  اُوۡتِیَ  قَارُوۡنُ ۙ اِنَّہٗ  لَذُوۡ حَظٍّ عَظِیۡمٍ ﴿۸۰﴾ ",
        "ur": "پس وہ اپنی قوم میں اپنی سج دھج کے ساتھ نکلا۔ ان لوگوں نے جو دنیا کی زندگی چاہتے تھے کہا کاش! ہمارے لئے بھی ویسا ہی ہوتا جو قارون کو دیا گیا۔ یقیناً وہ بڑے نصیب والا ہے۔",
        "v5": {
            "text": "So he went forth before his people in all his pomp. Those who were desirous of the life of this world said, ‘Would that we had the like of what Korah has been given! Truly, he is the master of a great fortune.’",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 81,
        "v_": 80,
        "topics": [
            {
                "id": 9723,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 10181,
                "topic": "Knowledge: <i>‘Ilm</i>: Allah bestows",
                "verses": "20:115, 2:248, 12:77, 21:80, 22:55, 33:64, 35:29, 39:10, 47:32, 58:12"
            },
            {
                "id": 10219,
                "topic": "Knowledge: <i>‘Ilm</i>: and believers",
                "verses": "4:163, 2:248, 3:8, 6:36, 6:58, 6:98, 6:106, 12:23, 12:56, 12:69, 12:109, 15:76, 16:28, 17:108, 22:55, 29:48, 29:50, 30:57, 31:16, 34:7, 58:12"
            },
            {
                "id": 11961,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:47, 8:66-67, 10:90, 10:110, 11:12, 11:116, 12:91, 13:25, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:55, 29:60, 32:25, 33:36, 34:20, 37:103, 38:45, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            },
            {
                "id": 17681,
                "topic": "Thawab: reward",
                "verses": "3:149, 2:104, 3:146, 3:196, 4:135, 18:32, 18:45, 18:47, 19:77, 48:19, 83:37"
            },
            {
                "id": 18810,
                "topic": "Woe: <i>Wail</i>",
                "verses": "2:80, 5:32, 11:73, 14:3, 18:50, 19:38, 20:62, 21:19, 21:47, 25:29, 36:53, 38:28, 39:23, 41:7-8, 43:66, 45:8, 46:18, 47:21, 51:61, 52:12, 68:32, 75:35-36, 77:16, 77:20, 77:25, 77:29, 77:35, 77:38, 77:41, 77:46, 77:48, 77:50, 80:18, 83:2-3, 83:11-12, 104:2, 107:5-6"
            }
        ],
        "ar": "وَ قَالَ الَّذِیۡنَ  اُوۡتُوا الۡعِلۡمَ وَیۡلَکُمۡ ثَوَابُ اللّٰہِ خَیۡرٌ  لِّمَنۡ  اٰمَنَ وَ عَمِلَ صَالِحًا ۚ وَ لَا  یُلَقّٰہَاۤ   اِلَّا الصّٰبِرُوۡنَ ﴿۸۱﴾ ",
        "ur": "اور اُن لوگوں نے جنہیں علم عطا کیا گیا تھا کہا وائے افسوس تم پر!۔ اللہ کا (دیا ہوا) ثواب اُس کے لئے بہت بہتر ہے جو ایمان لایا اور نیک عمل بجا لایا۔ مگر صبر کرنے والوں کے سوا کوئی نہیں جو یہ (معرفت) عطا کیا جائے۔",
        "v5": {
            "text": "But those who had been given knowledge said, ‘Woe unto you, Allah’s reward is best for those who believe and do good works; and it shall be granted to none except those who are steadfast.’",
            "notes": null
        }
    },
    {
        "ch": 28,
        "v": 82,
        "v_": 81,
        "topics": [
            {
                "id": 5303,
                "topic": "Corah: <i>Qarun</i>",
                "verses": "28:77, 28:80, 29:40-41, 40:25"
            }
        ],
        "ar": "فَخَسَفۡنَا بِہٖ وَ بِدَارِہِ  الۡاَرۡضَ ۟ فَمَا  کَانَ لَہٗ  مِنۡ فِئَۃٍ  یَّنۡصُرُوۡنَہٗ  مِنۡ دُوۡنِ اللّٰہِ ٭ وَ مَا  کَانَ مِنَ الۡمُنۡتَصِرِیۡنَ ﴿۸۲﴾ ",
        "ur": "پس ہم نے اُسے اور اُس کے گھر کو زمین میں دھنسا دیا۔ پس اُس کا کوئی گروہ نہ تھا جو اللہ کے مقابل پر اس کی مدد کرتے اور وہ انتقام لینے والوں میں سے نہ ہو سکا۔",
        "v5": {
            "text": "[b]Then We caused the earth to swallow him up and his dwelling; and he had no party to help him against Allah, nor was he of those who can defend themselves.[2933]",
            "notes": [
                {
                    "ref": "b",
                    "note": "29:41."
                },
                {
                    "ref": "2933",
                    "note": "<p><strong>Important Words:</strong></p><p>خسفنا (We caused him to be swallowed up) is formed from خسف. They say خسف المکان i.e. the house fell down or sank into the earth. خسف القمر means, the moon suffered an eclipse. خسف الرجل means, the man became emaciated. خسف فلاناً means, he humbled him and made him to bear a thing which he did not like. خسف اللّٰه الارض بفلان means, God made the earth to sink with such a one and to swallow him up (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 83,
        "v_": 82,
        "topics": [
            {
                "id": 3125,
                "topic": "Attributes of Allah: Al-Basit (Enlarger of provisions)",
                "verses": "13:27, 2:246, 17:31, 29:63, 30:38, 34:37, 39:53, 42:13, 42:28"
            },
            {
                "id": 5303,
                "topic": "Corah: <i>Qarun</i>",
                "verses": "28:77, 28:80, 29:40-41, 40:25"
            },
            {
                "id": 7181,
                "topic": "Envy: <i>Hasad</i>",
                "verses": "113:6, 2:110, 2:214, 3:20, 4:55, 24:51, 42:15, 45:18, 48:16"
            },
            {
                "id": 14644,
                "topic": "Provisions: Allah enlarges",
                "verses": "20:132, 13:27, 17:31, 29:63, 30:38, 34:37, 34:40, 39:53, 42:13, 42:28"
            },
            {
                "id": 16538,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:82, 37:161, 38:18, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 66:11, 89:30"
            },
            {
                "id": 17352,
                "topic": "Success: <i>Falah</i>, disbelievers, wrongdoers shall not achieve",
                "verses": "6:22, 6:136, 10:18, 10:70, 10:78, 10:82, 12:24, 16:117, 18:21, 23:118, 28:38"
            }
        ],
        "ar": "وَ اَصۡبَحَ الَّذِیۡنَ تَمَنَّوۡا مَکَانَہٗ بِالۡاَمۡسِ یَقُوۡلُوۡنَ وَیۡکَاَنَّ اللّٰہَ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ وَ یَقۡدِرُ ۚ لَوۡ لَاۤ  اَنۡ مَّنَّ  اللّٰہُ عَلَیۡنَا لَخَسَفَ بِنَا ؕ وَیۡکَاَنَّہٗ  لَا  یُفۡلِحُ  الۡکٰفِرُوۡنَ ﴿٪۸۳﴾ ",
        "ur": "اور ان لوگوں نے ‘ جنہوں نے ایک دن پہلے تک اس کے مقام (کو حاصل کرنے) کی تمنّا کی تھی‘ اس حالت میں صبح کی کہ وہ کہہ رہے تھے وائے حسرت! اللہ اپنے بندوں میں سے جس کےلئے چاہے رزق کشادہ کر دیتا ہے اور (جس کےلئے چاہے) تنگ بھی کر دیتا ہے۔ اگر ہم پر اللہ نے احسان نہ کیا ہوتا تو وہ ہمیں بھی دھنسا دیتا۔ وائے حسرت! کافر کامیاب نہیں ہوا کرتے۔",
        "v5": {
            "text": "[a]And those who had coveted his position the day before began to say, ‘Ah! it is indeed Allah Who enlarges the provision for such of His servants as He pleases and straitens <i>it for whom He pleases</i>. Had not Allah been gracious to us, He would have caused it to swallow us up <i>also</i>. Ah! the ungrateful never prosper.’[2934]",
            "notes": [
                {
                    "ref": "a",
                    "note": "13:27; 29:63; 34:37."
                },
                {
                    "ref": "2934",
                    "note": "<p><strong>Important Words:</strong></p><p>ویکان (Ah).ویک is a compound expression made up of وی and ک and is used for surprise and reproach, وی meaning woe and ک being a letter of address. They say ویک i.e. woe to thee. Some say ویک is ویلک (thy perdition), ل having been omitted. ویک being an expression of surprise or reproach means, oh; ah. وی لزید also means, well done Zaid, bravo Zaid (Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 84,
        "v_": 83,
        "topics": [
            {
                "id": 1433,
                "topic": "Allah: does not love mischief-mongers",
                "verses": "28:78, 2:12-13, 2:28, 2:61, 2:252, 5:33-34, 5:65, 7:57, 7:75, 7:87, 7:104, 7:143, 8:74, 10:82, 11:86, 13:26, 17:5, 18:95, 26:153, 26:184, 28:5, 38:29, 89:13"
            },
            {
                "id": 5318,
                "topic": "Corruption",
                "verses": "30:42, 3:119, 11:117, 15:10, 53:15, 89:13"
            },
            {
                "id": 5686,
                "topic": "Darul-Akhirah: abode of Hereafter",
                "verses": "2:95, 6:33, 7:170, 12:110, 16:31, 28:78, 29:65, 33:30, 38:47"
            },
            {
                "id": 6566,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:20, 8:26, 8:40, 8:74, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 13:26, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:5, 28:78, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 11579,
                "topic": "Moral Traits: arrogance, conceit",
                "verses": "41:51, 2:35, 2:88, 4:174, 7:14, 7:37, 7:41, 7:49, 7:56, 7:76-77, 7:89, 7:134, 7:147, 10:76, 14:22, 16:24, 16:30, 17:38, 23:47, 25:22, 28:40, 29:40, 31:19-20, 34:32-34, 38:3, 38:75-76, 39:60, 40:36, 40:48-49, 40:57, 41:16, 41:39, 44:50, 45:32, 46:11, 46:21, 57:24, 71:8, 74:24"
            }
        ],
        "ar": "تِلۡکَ الدَّارُ الۡاٰخِرَۃُ  نَجۡعَلُہَا لِلَّذِیۡنَ لَا یُرِیۡدُوۡنَ عُلُوًّا فِی الۡاَرۡضِ وَ لَا فَسَادًا ؕ وَ الۡعَاقِبَۃُ  لِلۡمُتَّقِیۡنَ ﴿۸۴﴾ ",
        "ur": "یہ آخرت کا گھر ہے جسے ہم ان لوگوں کے لئے بناتے ہیں جو زمین میں نہ (اپنی) بڑائی چاہتے ہیں اور نہ فساد۔ اور انجام تو متّقیوں ہی کا ہے۔",
        "v5": {
            "text": "[b]This is the Home of the Hereafter! We give it to those who desire not self-exaltation in the earth, nor corruption. And the <i>good</i> end is for the righteous.",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:170; 16:31."
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 85,
        "v_": 84,
        "topics": [
            {
                "id": 429,
                "topic": "Actions: <i>A‘mal</i>: evil requited in equal measure",
                "verses": "6:161, 24:40, 53:32"
            },
            {
                "id": 445,
                "topic": "Actions: <i>A‘mal</i>: good rewarded manifold",
                "verses": "6:161, 2:262, 4:41, 27:90"
            },
            {
                "id": 466,
                "topic": "Actions: <i>A‘mal</i>: rewarded",
                "verses": "3:196, 4:41, 4:58, 4:174, 5:10, 7:9, 7:44, 9:121, 11:16, 11:112, 16:98, 17:10, 18:3, 18:47, 18:108-9, 19:77, 20:76-77, 22:15, 22:57, 24:39, 29:8, 29:10, 31:9-10, 32:18, 32:20, 33:30, 34:38, 35:8, 35:11, 35:33, 39:36, 41:9, 42:23-24, 42:27, 43:73-74, 45:31, 46:20, 47:13, 47:36, 48:30, 52:18-21, 65:12, 84:26, 85:12, 95:7, 98:8-9, 99:8, 101:7-8"
            },
            {
                "id": 526,
                "topic": "Accountability: <i>Hisab</i>: Allah calls to account",
                "verses": "2:226, 2:285, 3:31, 4:41, 6:63, 17:37, 18:50, 19:85, 21:48, 24:40, 28:62, 33:6, 37:128, 41:18, 42:23, 56:87, 58:7, 65:9, 68:40, 75:3, 83:6, 88:27, 99:8-9, 102:9"
            },
            {
                "id": 1998,
                "topic": "Allah: mercy transcends His wrath",
                "verses": "6:161, 6:13, 6:55"
            },
            {
                "id": 2276,
                "topic": "Allah: rewards according to actions",
                "verses": "39:36, 3:116, 4:125, 17:8, 29:8, 41:47"
            },
            {
                "id": 9670,
                "topic": "Jaza’: recompense: justice in",
                "verses": "2:287, 3:116, 4:41, 16:98, 23:73, 42:16"
            },
            {
                "id": 10378,
                "topic": "Law: Divine",
                "verses": "6:116, 4:29, 6:35, 13:16, 29:20, 30:47, 35:44, 39:56, 46:20, 48:24, 55:34, 57:23"
            },
            {
                "id": 15732,
                "topic": "Reward: <i>Jaza’</i>, Ajr",
                "verses": "4:41, 4:115, 4:125, 4:135, 4:163, 5:10, 6:161, 8:29, 10:73, 11:109, 12:57, 17:10, 26:110, 32:20-23"
            },
            {
                "id": 16834,
                "topic": "Sin: <i>Dhanb</i>: man accountable for his",
                "verses": "2:226, 4:80, 4:112-113, 7:43, 16:35, 29:5, 39:49, 39:52, 40:22"
            },
            {
                "id": 16886,
                "topic": "Sin: <i>Dhanb</i>: punishment of",
                "verses": "10:28, 2:82, 3:12, 5:19, 5:50, 6:7, 6:161, 7:101, 8:53, 8:55, 28:79, 40:41, 45:34, 91:15"
            }
        ],
        "ar": "مَنۡ جَآءَ بِالۡحَسَنَۃِ فَلَہٗ  خَیۡرٌ  مِّنۡہَا ۚ وَ مَنۡ جَآءَ بِالسَّیِّئَۃِ  فَلَا یُجۡزَی الَّذِیۡنَ عَمِلُوا السَّیِّاٰتِ  اِلَّا مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۸۵﴾ ",
        "ur": "جو بھی کوئی نیکی لے کر آئے گا تو اُس کے لئے اس سے بہتر (اجر) ہوگا۔ اور جو بدی لے کر آئے گا تو وہ لوگ جو بدیوں کے مرتکب ہوئے، جزا نہیں دیئے جائیں گے مگر اتنی ہی جو وہ کیا کرتے تھے۔",
        "v5": {
            "text": "[c]He who does a good deed shall have better reward than that; and <i>as for him</i> who does an evil deed—those who do evil deeds shall not be rewarded but <i>according to</i> what they did.[2935]",
            "notes": [
                {
                    "ref": "c",
                    "note": "4:124; 6:161; 17:8; 41:47; 99:8-9."
                },
                {
                    "ref": "2935",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse points to the divine law of compensation which in this life works in this way that whereas for good works God gives a reward many times greater than what the doer has earned, He punishes a bad deed with a punishment which is less than what the guilty person has incurred or at the most with a punishment proportionate to the evil deed which he has committed.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 86,
        "v_": 85,
        "topics": [
            {
                "id": 2009,
                "topic": "Allah: mindful of their motives",
                "verses": "17:85"
            },
            {
                "id": 7119,
                "topic": "Emigration: <i>Hijrah</i>: of Holy Prophet<sup>(sa)</sup>",
                "verses": "9:40, 17:2, 89:2"
            },
            {
                "id": 11131,
                "topic": "Mecca: <i>Makkah</i>: victory of",
                "verses": "7:99, 2:151, 6:116, 9:1-2, 14:49, 34:27, 37:21, 44:17, 54:8-9, 70:43-45"
            },
            {
                "id": 11427,
                "topic": "Migration: <i>Hijrah</i>: of Holy Prophet<sup>(sa)</sup>",
                "verses": "8:31, 9:40, 17:2, 89:2"
            },
            {
                "id": 12424,
                "topic": "Muhammad<sup>(sa)</sup>: emigration of",
                "verses": "9:40, 23:95"
            },
            {
                "id": 14398,
                "topic": "Prophecies in the Holy Qur’an: about: the Holy Prophet<sup>(sa)</sup>",
                "verses": "2:41-42, 2:90, 5:48, 10:72, 17:2, 17:61, 17:81, 38:12, 46:11-13, 47:14, 54:7-9, 81:24, 89:2-3, 90:5, 92:2-3, 94:5"
            }
        ],
        "ar": "اِنَّ الَّذِیۡ فَرَضَ عَلَیۡکَ الۡقُرۡاٰنَ لَرَآدُّکَ اِلٰی مَعَادٍ ؕ قُلۡ رَّبِّیۡۤ  اَعۡلَمُ مَنۡ جَآءَ بِالۡہُدٰی وَ مَنۡ ہُوَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۸۶﴾ ",
        "ur": "یقیناً وہ جس نے تجھ پر قرآن کو فرض کیا ہے تجھے ضرور ایک واپس آنے کی جگہ کی طرف واپس لے آئے گا۔ تُو کہہ دے میرا ربّ اسے زیادہ جانتا ہے جو ہدایت لے کر آتا ہے اور اسے بھی جو کھلی کھلی گمراہی میں ہے۔",
        "v5": {
            "text": "Most surely, He Who has made <i>the teaching of</i> the Quran binding on thee will bring thee back to <i>thy</i> place of return. Say, [a]‘My Lord knows best who has brought the guidance, and who is in manifest error.’[2936]",
            "notes": [
                {
                    "ref": "a",
                    "note": "17:85."
                },
                {
                    "ref": "2936",
                    "note": "<p><strong>Important Words:</strong></p><p>فرض (made binding) means, He (God) made a thing obligatory or binding by a known decree. فرض له means, he appointed to him a thing. فرض اللّٰه الاحکام علی عبادہ means, God has instituted or prescribed for His servants ordinances and commandments (Lane &amp; Aqrab).</p><p>معاد (place of return) is derived from عاد. They say عاد الیه i.e. he returned to it. معاد means, a place to which a person returns; a place, state or result to which a person or thing eventually comes; a place of destination or an ultimate state or condition (Mecca is so called because the pilgrims return to it again and again); Paradise; Pilgrimage; Hereafter (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>This verse is considered by some scholars to have been revealed while the Holy Prophet was on his way from Mecca to Medina. It embodied a great prophecy, viz. that the Holy Prophet one day will have to leave Mecca and then eventually he will come back to it as a victor and conqueror, and the fulfilment of this mighty prophecy under extraordinary circumstances will show \"who has brought the guidance, and who is in manifest error.\" The verse constitutes a befitting sequel to the <i>Surah</i> which gives a somewhat detailed life-story of Moses, the counterpart of the Holy Prophet. Moses fled from Egypt and lived in Midian for ten years which were years of preparation for the great task which lay ahead of him. Then he went back to Egypt with the Divine Message and succeeded in delivering the Israelites from the bondage of Pharaoh. Similarly, the Holy Prophet fled from Mecca and spent ten precious years of his life in Medina which were the years of preparation for the great object of conquering Mecca, the centre and citadel of his Faith. He returned to it as a conqueror and victor and fully succeeded in the achievement of his great object.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 87,
        "v_": 86,
        "topics": [
            {
                "id": 15912,
                "topic": "Rija’: hopes to meet Allah",
                "verses": "10:8, 33:22, 2:219, 4:105, 10:8, 10:12, 10:16, 11:63, 18:111, 25:22, 29:6, 39:10, 60:7, 71:14"
            }
        ],
        "ar": "وَ مَا کُنۡتَ تَرۡجُوۡۤا اَنۡ یُّلۡقٰۤی  اِلَیۡکَ الۡکِتٰبُ  اِلَّا رَحۡمَۃً  مِّنۡ رَّبِّکَ فَلَا تَکُوۡنَنَّ  ظَہِیۡرًا  لِّلۡکٰفِرِیۡنَ ﴿۫۸۷﴾ ",
        "ur": "اور تُو کوئی خواہش نہیں رکھتا تھا کہ تجھے کتاب عطا کی جائے مگر (یہ) تیرے ربّ کی طرف سے بطور رحمت ہے۔ پس کافروں کا ہرگز مددگار نہ بن۔",
        "v5": {
            "text": "And thou didst never expect that the Book would be revealed to thee; [a]but it is a mercy from thy Lord; so never be a helper of those who disbelieve.[2936A]",
            "notes": [
                {
                    "ref": "a",
                    "note": "17:88."
                },
                {
                    "ref": "2936A",
                    "note": "<p><strong>Commentary:</strong></p><p>See next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 28,
        "v": 88,
        "v_": 87,
        "topics": [
            {
                "id": 10964,
                "topic": "Mankind: Holy Prophet<sup>(sa)</sup> &amp;",
                "verses": "7:159, 4:80, 4:171, 6:91, 10:3, 16:45, 18:7, 21:108, 22:50, 25:2, 34:29, 42:16, 42:53"
            },
            {
                "id": 14213,
                "topic": "Preaching: with wisdom",
                "verses": "16:126, 3:188, 22:68, 23:74, 26:215, 29:47, 41:34-35, 51:56, 62:3"
            },
            {
                "id": 16599,
                "topic": "Shirk: associating partners with Allah",
                "verses": "22:27, 6:15, 10:106, 22:32, 30:32"
            }
        ],
        "ar": "وَ لَا یَصُدُّنَّکَ عَنۡ اٰیٰتِ اللّٰہِ  بَعۡدَ  اِذۡ اُنۡزِلَتۡ  اِلَیۡکَ وَ ادۡعُ  اِلٰی رَبِّکَ وَ لَا تَکُوۡنَنَّ  مِنَ  الۡمُشۡرِکِیۡنَ ﴿ۚ۸۸﴾",
        "ur": "اور وہ ہرگز تجھے اللہ کی آیات (کی پیروی) سے نہ روک سکیں بعد اس کے کہ وہ تیری طرف نازل کی جا چکی ہوں۔ اور اپنے ربّ کی طرف بُلاتا رہ اور شرک کرنے والوں میں سے ہرگز نہ ہو۔",
        "v5": {
            "text": "And let them not turn thee away from the Signs of Allah, after they have been sent down to thee; and call <i>mankind</i> to thy Lord, and be not of those who associate <i>equals with</i> <i>Him</i>.[2937]",
            "notes": [
                {
                    "ref": "2937",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse sums up the subject matter of the <i>Surah</i>. The Holy Prophet is told that he did not have the remotest idea that he would ever be made the bearer of the Divine Message but now that he has actually been entrusted with the great and difficult task of preaching the truth, he should 'call mankind to God' and like a great soldier fight his way to success.</p>"
                }
            ]
        }
    }
]
