[
    {
        "ch": 61,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 728,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:14, 13:16, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 22:78, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 37:167, 38:19, 39:10, 39:76, 41:38-39, 48:10, 50:40-41, 55:7, 59:25, 62:2, 64:2, 87:2, 96:20, 110:4"
            },
            {
                "id": 3086,
                "topic": "Attributes of Allah: Al-‘Aziz (The Mighty)",
                "verses": "4:57, 2:130, 2:210, 2:221, 2:229, 3:7, 3:19, 4:159, 4:166, 9:40, 9:71, 14:2, 16:61, 22:41, 22:75, 26:192, 27:10, 27:79, 33:26, 34:7, 35:29, 38:10, 38:67, 40:3, 45:3, 46:3, 48:8, 48:20, 59:2, 59:24, 62:2, 64:19"
            }
        ],
        "ar": "سَبَّحَ  لِلّٰہِ مَا  فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ۚ وَ  ہُوَ  الۡعَزِیۡزُ  الۡحَکِیۡمُ ﴿۲﴾ ",
        "ur": "اللہ ہی کی تسبیح کرتا ہے جو آسمانوں میں ہے اور جو زمین میں ہے اور وہ کامل غلبہ والا (اور) صاحبِ حکمت ہے۔",
        "v5": {
            "text": "[b]Whatever is in the heavens and whatever is in the earth glorifies Allah; and He is the Mighty, the Wise.[4222]",
            "notes": [
                {
                    "ref": "b",
                    "note": "17:45; 24:42; 57:2; 62:2; 64:2."
                },
                {
                    "ref": "4222",
                    "note": "<p><strong>Commentary:</strong></p><p>See 57:2.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 3,
        "v_": 2,
        "topics": [],
        "ar": "یٰۤاَیُّہَا  الَّذِیۡنَ اٰمَنُوۡا  لِمَ  تَقُوۡلُوۡنَ مَا لَا  تَفۡعَلُوۡنَ ﴿۳﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! تم کیوں وہ کہتے ہو جو کرتے نہیں۔",
        "v5": {
            "text": "O ye who believe! why do you say what you do not?[4223]",
            "notes": [
                {
                    "ref": "4223",
                    "note": "<p><strong>Commentary:</strong></p><p>Muslims are told here that their actions should correspond to their professions. Boastful, empty talk carries one nowhere and verbal professions unattended by deeds smack of hypocrisy and insincerity.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 4,
        "v_": 3,
        "topics": [],
        "ar": "کَبُرَ  مَقۡتًا عِنۡدَ  اللّٰہِ  اَنۡ  تَقُوۡلُوۡا مَا  لَا تَفۡعَلُوۡنَ ﴿۴﴾ ",
        "ur": "اللہ کے نزدیک یہ بہت بڑا گناہ ہے کہ تم وہ کہو جو تم کرتے نہیں۔",
        "v5": {
            "text": "Most hateful is it in the sight of Allah that you say what you do not.",
            "notes": null
        }
    },
    {
        "ch": 61,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 1936,
                "topic": "Allah: loves those who...",
                "verses": "3:135, 2:196, 2:223, 3:77, 3:147, 3:149, 3:160, 5:43, 9:4, 9:7, 9:108, 49:10"
            },
            {
                "id": 12813,
                "topic": "Muslims: unity of",
                "verses": "3:111, 3:104, 6:160"
            },
            {
                "id": 15957,
                "topic": "Rows: <i>Saff</i>",
                "verses": "18:49, 20:65, 37:2, 78:39, 89:23"
            },
            {
                "id": 18374,
                "topic": "War: <i>Qital</i>: Muslim warriors",
                "verses": "100:2-6, 3:144, 4:72, 8:16-17, 8:58, 8:61, 8:66, 9:52, 48:17-18"
            }
        ],
        "ar": "اِنَّ اللّٰہَ یُحِبُّ الَّذِیۡنَ یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِہٖ  صَفًّا کَاَنَّہُمۡ  بُنۡیَانٌ  مَّرۡصُوۡصٌ  ﴿۵﴾",
        "ur": "یقیناً اللہ ان لوگوں سے محبت کرتا ہے جو اس کی راہ میں صف باندھ کر قتال کرتے ہیں گویا وہ ایک سیسہ پلائی ہوئی دیوار ہیں۔",
        "v5": {
            "text": "[c]Verily, Allah loves those who fight in His cause arrayed in <i>solid</i> ranks, as though they were a <i>strong</i> structure cemented with <i>molten</i> lead.[4224]",
            "notes": [
                {
                    "ref": "c",
                    "note": "9:111."
                },
                {
                    "ref": "4224",
                    "note": "<p><strong>Important Words:</strong></p><p>مرصوص (strong). They say رص البناء i.e. he made the building firm and compact, or he made it firm and strong; he joined it together; he stuck it together, one part to another, so that there might be no interstice in it; he plastered it with lead. تراصواmeans, they placed themselves close together in prayer or in battle so that there was no intervening space among them. بئر مرصوصة means, a well cased with lead (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>Muslims are expected to present a firm, compact and united front to the forces of evil under the command of their leader whom they should give full and unqualified obedience. But for a people to become united into a solid and strong community, they must possess one code of life, one ideal, one objective and destination and one programme to achieve that objective.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 4915,
                "topic": "Canaan",
                "verses": "2:51, 2:244, 11:70-71, 18:61, 19:49, 20:78, 20:81, 21:72, 21:106, 26:60"
            },
            {
                "id": 7660,
                "topic": "Fisq: abhorrence, disobedience",
                "verses": "2:100, 2:283, 3:83, 3:111, 5:4, 5:48, 5:50, 5:60, 5:82, 5:109, 6:122, 6:146, 7:103, 7:146, 9:8, 9:24, 9:53, 9:67, 9:84, 9:96, 24:5, 24:56, 27:13, 28:33, 43:55, 46:36, 49:8, 51:47, 57:17, 57:28, 59:6, 59:20"
            },
            {
                "id": 8191,
                "topic": "Guidance: Allah does not give to unjust",
                "verses": "2:259, 2:265, 3:87, 5:52, 5:68, 5:109, 6:145, 9:19, 9:24, 9:37, 9:80, 9:109, 16:38, 16:108, 28:51, 39:4, 40:29, 46:11, 61:8, 62:6, 63:7"
            },
            {
                "id": 8482,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: perverse",
                "verses": "53:12, 3:8-9, 9:117, 66:5"
            },
            {
                "id": 9561,
                "topic": "Israelites: demanding nature of",
                "verses": "3:94, 2:62, 2:56, 2:247, 2:250, 5:23, 20:81-82"
            },
            {
                "id": 12051,
                "topic": "Moses: Musa(as): and Israelites",
                "verses": "5:26-27, 7:106, 7:160, 10:84-94, 17:5-9, 26:53, 28:6-7"
            },
            {
                "id": 12113,
                "topic": "Moses: Musa(as): slandered, accused",
                "verses": "33:70, 26:15, 28:16-21"
            }
        ],
        "ar": "وَ اِذۡ  قَالَ مُوۡسٰی لِقَوۡمِہٖ یٰقَوۡمِ لِمَ تُؤۡذُوۡنَنِیۡ  وَ قَدۡ تَّعۡلَمُوۡنَ  اَنِّیۡ  رَسُوۡلُ اللّٰہِ  اِلَیۡکُمۡ ؕ فَلَمَّا  زَاغُوۡۤا اَزَاغَ  اللّٰہُ قُلُوۡبَہُمۡ ؕ وَ اللّٰہُ  لَا یَہۡدِی الۡقَوۡمَ الۡفٰسِقِیۡنَ ﴿۶﴾ ",
        "ur": "اور (یاد کرو) جب موسیٰ نے اپنی قوم سے کہا اے میری قوم! تم مجھے کیوں اذیّت دیتے ہو؟ حالانکہ تم جانتے ہو کہ میں تمہاری طرف اللہ کا رسول ہوں۔ پس جب وہ ٹیڑھے ہوگئے تو اللہ نے اُن کے دلوں کو ٹیڑھا کردیا اور اللہ فاسق قوم کو ہدایت نہیں دیتا۔",
        "v5": {
            "text": "And <i>remember</i> when Moses said to his people, ‘O my people, why do you vex and slander me and you know that I am Allah’s Messenger unto you?’ So when they deviated <i>from the right course</i>, Allah caused their hearts to deviate, for Allah guides not the rebellious people.[4225]",
            "notes": [
                {
                    "ref": "4225",
                    "note": "<p><strong>Commentary:</strong></p><p>Perhaps no Prophet of God suffered so much mental agony at the hands of his followers as did Moses. Among many other signs Moses’s people had seen the mighty hosts of Pharaoh drown before their very eyes and yet they had hardly crossed the sea when they wanted to revert to idolatry, and seeing some people worshipping idols asked Moses to set up one such idol for them. They defied Moses’s brother, the Prophet Aaron, and worshipped the calf (7:149). When asked to march into Canaan which God had promised to them they scornfully and quite brazen-facedly told Moses to go with his Lord upon Whom he had relied so much; they were not going to budge an inch from the place where they had settled (5:25). Thus Moses was repeatedly insulted by, and baulked in his efforts to reclaim from idolatry, the very people whom he had delivered from the crushing bondage of Pharaoh. They even slandered and defamed him. It is to such vexatious act of these ungrateful people that the Quran has referred in 33:70.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 1073,
                "topic": "Ahmad: the Promised Messiah(as): Jesus foretold advent",
                "verses": null
            },
            {
                "id": 3970,
                "topic": "Bani Isra’il: Jesus sent to",
                "verses": "3:50, 4:158, 5:73, 5:111, 43:60, 61:15"
            },
            {
                "id": 4080,
                "topic": "Barnabas",
                "verses": null
            },
            {
                "id": 4406,
                "topic": "Bible: the,: prophecies about Islam in",
                "verses": "3:4-5, 2:150, 7:158, 9:111, 23:21, 48:30"
            },
            {
                "id": 4439,
                "topic": "Biblical History",
                "verses": "17:6-8, 2:103, 2:134, 2:244, 2:260, 4:158, 6:75, 19:17, 21:86, 21:106, 23:51, 37:103, 61:15"
            },
            {
                "id": 9850,
                "topic": "Jesus: <i>‘Isa(as)</i>: followed Torah, Gospel",
                "verses": "3:51, 3:49, 5:47, 57:28"
            },
            {
                "id": 9855,
                "topic": "Jesus: <i>‘Isa(as)</i>: mission of",
                "verses": "3:50-51, 5:73, 23:51, 43:60, 43:64"
            },
            {
                "id": 10719,
                "topic": "Magicians",
                "verses": "7:110, 2:103, 5:111, 6:8, 7:108, 7:113-123, 10:3, 10:77-78, 10:82, 20:64, 20:67-71, 27:14, 28:37, 34:44, 37:16, 38:5, 40:25, 43:31, 43:50, 46:8, 51:40, 51:53, 74:25"
            },
            {
                "id": 12245,
                "topic": "Muhammad<sup>(sa)</sup>: advent of",
                "verses": "2:90, 2:130, 2:152, 3:145, 3:165, 5:16, 6:21, 9:128, 14:36-38, 28:47, 35:17-18, 45:19, 46:36, 62:3"
            },
            {
                "id": 12539,
                "topic": "Muhammad<sup>(sa)</sup>: names of",
                "verses": "2:120, 13:8, 21:108, 33:41, 33:46, 42:49, 53:57, 72:20, 73:2, 73:16, 74:2-3, 88:22-23"
            },
            {
                "id": 12624,
                "topic": "Muhammad<sup>(sa)</sup>: prophecies about",
                "verses": "7:158, 2:147, 5:82, 6:21, 7:144, 11:50, 12:103, 26:197-198, 28:45-47, 33:2, 46:11-13, 54:46, 73:16"
            },
            {
                "id": 12965,
                "topic": "New Testament: Gospel, <i>Injil</i>",
                "verses": "7:158, 2:146, 3:3-4, 5:47-48, 6:75, 9:111, 16:104, 19:17, 19:26, 48:30, 57:28"
            },
            {
                "id": 16983,
                "topic": "Son of…: Mary",
                "verses": "4:172, 5:18, 5:47, 5:73, 5:76, 5:79, 5:111, 5:113, 5:115, 5:117, 9:31, 19:35, 23:51, 33:8, 43:58, 57:28, 61:15"
            },
            {
                "id": 17635,
                "topic": "Testimony: <i>Tasdiq</i>: of Prophets",
                "verses": "2:284, 3:82, 2:102, 3:40, 3:51, 5:47"
            },
            {
                "id": 17727,
                "topic": "Torah: and Holy Prophet<sup>(sa)</sup>",
                "verses": "7:158, 2:150, 23:21, 45:17-19, 48:30"
            },
            {
                "id": 17732,
                "topic": "Torah: and Qur’an",
                "verses": "28:50, 3:4-5, 5:16, 9:111"
            },
            {
                "id": 17760,
                "topic": "Torah: guidance for Jews",
                "verses": "45:17, 3:4-5, 3:51, 3:66, 3:94, 5:44-45, 5:67, 5:111, 6:92, 6:155, 17:3, 23:50, 28:44, 32:24, 37:118, 40:54-55, 62:6"
            }
        ],
        "ar": "وَ اِذۡ قَالَ عِیۡسَی ابۡنُ  مَرۡیَمَ یٰبَنِیۡۤ اِسۡرَآءِیۡلَ  اِنِّیۡ  رَسُوۡلُ  اللّٰہِ  اِلَیۡکُمۡ مُّصَدِّقًا  لِّمَا بَیۡنَ  یَدَیَّ  مِنَ  التَّوۡرٰٮۃِ وَ مُبَشِّرًۢا  بِرَسُوۡلٍ یَّاۡتِیۡ  مِنۡۢ  بَعۡدِی اسۡمُہٗۤ  اَحۡمَدُ ؕ فَلَمَّا جَآءَہُمۡ  بِالۡبَیِّنٰتِ قَالُوۡا ہٰذَا  سِحۡرٌ  مُّبِیۡنٌ ﴿۷﴾ ",
        "ur": "اور (یاد کرو) جب عیسیٰ بن مریم نے کہا اے بنی اسرائیل! یقیناً میں تمہاری طرف اللہ کا رسول ہوں۔ اس کی تصدیق کرتے ہوئے آیا ہوں جو تورات میں سے میرے سامنے ہے اور ایک عظیم رسول کی خوشخبری دیتے ہوئے جو میرے بعد آئے گا جس کا نام احمد ہوگا۔ پس جب وہ کھلے نشانوں کے ساتھ ان کے پاس آیا تو انہوں نے کہا یہ تو ایک کھلا کھلا جادو ہے۔",
        "v5": {
            "text": "And <i>remember</i> when Jesus, son of Mary, said, ‘O children of Israel, surely I am Allah’s Messenger unto you, fulfilling that which is before me of the Torah, and giving glad tidings of a Messenger who will come after me; his name being Ahmad.’ And when he came to them with clear proofs,[a] they said, ‘This is manifest sorcery.’[4226]",
            "notes": [
                {
                    "ref": "a",
                    "note": "27:14; 43:31."
                },
                {
                    "ref": "4226",
                    "note": "<p><strong>Important Words:</strong></p><p> </p><p>أحمد (Ahmad) is derived from حمد and حمدہ means, he praised, eulogised or commended him; spoke well of him; he requited him; he gave him his due. أحمد (<i>Ahmada</i>) means, he did or said that for which he should be praised or which was praiseworthy. أحمد الشیء means, the thing was or became praiseworthy. أحمد means, one who praises much or who is praised much or most (Lane &amp; Taj).</p><p><strong>Commentary:</strong></p><p> </p><p>The prophecy of Jesus about the coming of <i>Paraclete</i> or the Comforter or the Spirit of Truth as given in the Gospels is as follows:</p><p><i>I will pray the Father, and He shall give you another Comforter, that he may abide with you for ever. Even the Spirit of Truth whom the world cannot receive because it sees him not, neither knoweth him… but when the Comforter is come, whom I will send unto you from the Father, even the Spirit of Truth which proceedeth from the Father, he shall testify of me… for if I go not away, the Comforter will not come unto you, but if I depart, I will send him unto you… I have yet many things to say unto you, but ye cannot bear them now. Howbeit when the Spirit of Truth is come, he will guide you unto all truth, for he shall not speak of himself; but whatsoever he shall hear, that shall he speak, and he will show you things to come… He shall glorify me </i>(John 14: 16-17. 15: 26; 16: 7, 12-14)<i>.</i></p><p>From these verses of the Gospel of John the following inferences are clearly deducible:</p><p>(1) That <i>Paraclete</i> or the Comforter or the Spirit of Truth could not come unless Jesus should have departed from the world.</p><p>(2) That the Comforter was to abide in the world for ever.</p><p>(3) That he was to say many things which Jesus himself could not tell because the world could not then bear them.</p><p>(4) That he would guide men unto all truth.</p><p>(5) That he would not speak of himself, but whatever he would hear that would he speak.</p><p>(6) That the Comforter would glorify Jesus and testify of him.</p><p>This description of <i>Paraclete</i> or the Comforter or the Spirit of Truth is in complete harmony with the status and mission of the Holy Prophet as given in the Quran:</p><p>(1) The Holy Prophet appeared after Jesus had departed from this world.</p><p>(2) He is the last Law-giving Prophet and the Quran the last revealed Divine Law for the whole of mankind till the end of time (5:4).</p><p>(3) Jesus could not guide mankind to all truth because his Message was meant only for a particular people and for a particular period. And the Law as amended and given to the Jews by him was not and could not be a complete and perfect Law because they had not yet mentally and morally so developed as to be the bearers of a complete Shari‘ah and the world had to wait till it was given a perfect Law in the form of the Quran (5:4) and a Prophet par excellence i.e. the Holy Prophet who could guide all mankind.</p><p>(4) The Holy Prophet gave to the world a Law complete in all its details which alone could guide mankind unto all truth (5:4).</p><p>(5) The Holy Prophet did not speak of himself but whatever he heard from God that did he speak (53:4).</p><p>(6) The Holy Prophet glorified Jesus (2:254; 3:56).</p><p>The prophecy in the Gospel of John resembles the prophecy mentioned in the verse under comment except that instead of Ahmad the name stated therein is <i>Paraclete</i>. Christian writers challenge the correctness of the Quranic version of the prophecy, basing their contention on this difference of names, irrespective of the otherwise similar features of Biblical &amp; Quranic versions.</p><p>In fact, Jesus spoke Aramaic and Hebrew. Aramaic was his mother tongue and Hebrew his religious language. The present Biblical version is the translation of Aramaic and Hebrew into Greek.</p><p>A translation naturally cannot fully convey the beauty of the text. Languages have their limitations. The same is true of the people who speak them. Their limitations are reflected in their works. The Greek language has another word, i.e.<i>Periklutos</i>, with a similar meaning as Ahmad in Arabic. Jack Finegan, the renowned theologian, in his book, \"The Archaeology of World Religions,\" says:</p><p>\"Where in Greek the word Comforter (Parakletos) is very similar to the word for 'renowned' (Periklutos), the latter being the meaning of the names Ahmad &amp; Muhammad.\"</p><p>Moreover, \"The Damascus Document\" a scripture discovered towards the end of the nineteenth century in Ezra synagogue, Old Cairo (p. 2. lines 12, 13) describes Jesus as having foretold the advent of a \"Holy Spirit,\" named <i>Emeth</i>.</p><p>ویود یعیم بید مشیحو روح قد شو و ھوا ایمة و بفروش</p><p>شمو شمو تیھم</p><p>i.e. And by His Messiah, He has made them know His Holy Spirit. For it is He who is Emeth i.e. “The Truthful One”, and in accordance with His name are also theirs.</p><p>\"<i>Emeth</i>\" in Hebrew means \"the Truth,\" or \"the Truthful one and a person of constant goodness\" (Strachan’s Fourth Gospel, page 141). The word was interpreted by the Jews as \"God’s Seal.\" Naturally, though Jesus must have used the name Ahmad, the phonetic resemblance of the two words (Ahmad &amp; Emeth) caused later writers to substitute \"<i>Emeth</i>\"for Ahmad, its Hebrew synonym.</p><p>Thus the prophecy mentioned in the verse under comment applies to the Holy Prophet, but as a corollary it may also apply to the Promised Messiah, Founder of the Ahmadiyya Movement, since in his person the Second Manifestation of the Holy Prophet took place. To this Second Manifestation or Second Coming of the Holy Prophet, the third verse of the next <i>Surah</i>—Al-Jumu‘ah pointedly refers.</p><p>It may be mentioned here that a prophecy about the Holy Prophet is also clearly stated in Gospel of Barnabas which is treated by the Church as apocryphal but which has as much claim to be accepted as authentic as any of the four Gospels.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 2497,
                "topic": "Allah: who forges lie against, <i>Iftara’</i>",
                "verses": "10:18, 2:141, 3:76, 3:79, 3:95, 4:51, 5:104, 6:22, 6:94, 6:145, 7:38, 10:70, 11:19, 11:36, 18:16, 20:62, 29:69, 34:9, 39:33, 40:29, 42:25, 69:45-47, 72:5-6"
            },
            {
                "id": 7730,
                "topic": "Forge Lies",
                "verses": "7:38, 3:62, 6:22, 6:94, 10:18, 11:19, 62:7-8"
            },
            {
                "id": 8192,
                "topic": "Guidance: Allah does not give to unjust",
                "verses": "2:259, 2:265, 3:87, 5:52, 5:68, 5:109, 6:145, 9:19, 9:24, 9:37, 9:80, 9:109, 16:38, 16:108, 28:51, 39:4, 40:29, 46:11, 61:6, 62:6, 63:7"
            },
            {
                "id": 9467,
                "topic": "Islam: enemies of",
                "verses": "5:34-35, 2:193, 3:120, 7:183, 22:16, 59:15, 88:3-8, 100:10-12"
            },
            {
                "id": 10475,
                "topic": "Lie: <i>Ifk</i>, <i>Kidhb</i>, fabrication",
                "verses": "24:12-13, 3:76, 3:79, 3:95, 4:51, 5:104, 6:22, 6:94, 6:145, 7:38, 10:18, 10:61, 10:70, 11:19, 16:117, 18:16, 25:5, 29:18, 29:69, 34:44, 37:87, 37:152, 46:12, 46:29, 58:15"
            },
            {
                "id": 18900,
                "topic": "Wrongdoers: <i>Zalim</i>: are not guided",
                "verses": "4:76, 2:259, 3:87, 5:52, 6:145, 9:19, 9:109, 31:12, 46:11, 62:6"
            }
        ],
        "ar": "وَ مَنۡ  اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ الۡکَذِبَ وَ ہُوَ  یُدۡعٰۤی  اِلَی الۡاِسۡلَامِ ؕ وَ  اللّٰہُ  لَا  یَہۡدِی الۡقَوۡمَ  الظّٰلِمِیۡنَ ﴿۸﴾ ",
        "ur": "اور اس سے زیادہ ظالم کون ہوگا جو اللہ پر جُھوٹ گھڑے حالانکہ اُسے اسلام کی طرف بلایا جا رہا ہو۔ اور اللہ ظالم قوم کو ہدایت نہیں دیتا۔",
        "v5": {
            "text": "[a]But who does greater wrong than one who forges a lie against Allah while he is called to Islam? Allah guides not the wrongdoing people.[4227]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:22; 10:18; 11:19."
                },
                {
                    "ref": "4227",
                    "note": "<p><strong>Commentary:</strong></p><p>The preceding verse having been applied to the Holy Prophet, the expression \"who can be more unjust than one who forges a lie against Allah while he is called to Islam\" would refer to those Rejecters of Truth to whom he addressed his Message, since he was the Inviter (داعی) and they the invitees (20:109 &amp; 33:47), and having rejected his Message and by intentionally misinterpreting divine prophecies they belonged to that class of people who in the Quran have been called forgers of lies against God (6:138-141). But if the prophecy be taken to apply to the Promised Messiah the expression, \"he is called to Islam,\" would signify that the Promised Messiah would be invited by the so-called defenders of Islam to recant, repent and be a Muslim like them, for, according to them, by his claim to be the Promised Messiah and Mahdi he would cease to be one.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 1813,
                "topic": "Allah: is light of heavens, earth",
                "verses": "24:36, 9:32, 39:70"
            },
            {
                "id": 2414,
                "topic": "Allah: those who seek to extinguish light",
                "verses": "9:32"
            },
            {
                "id": 10568,
                "topic": "Light: <i>Nur, Diya’</i>",
                "verses": "24:36-37, 2:258, 4:175, 5:16-17, 5:45-47, 6:2, 6:92, 6:123, 7:158, 9:32, 10:6, 13:17, 14:2, 14:6, 24:41, 33:44, 35:20-21, 39:23, 39:70, 42:53, 57:10, 57:13-14, 57:29, 64:9, 65:12, 71:16-17"
            },
            {
                "id": 12349,
                "topic": "Muhammad<sup>(sa)</sup>: as a Light—<i>Nur</i>",
                "verses": "33:46-47, 4:175, 5:16-17, 24:36, 64:9"
            }
        ],
        "ar": "یُرِیۡدُوۡنَ  لِیُطۡفِـُٔوۡا  نُوۡرَ اللّٰہِ  بِاَفۡوَاہِہِمۡ وَ اللّٰہُ  مُتِمُّ  نُوۡرِہٖ  وَ لَوۡ  کَرِہَ  الۡکٰفِرُوۡنَ ﴿۹﴾",
        "ur": "وہ چاہتے ہیں کہ وہ اپنے منہ کی پھونکوں سے اللہ کے نور کو بجھادیں حالانکہ اللہ ہر حال میں اپنا نور پورا کرنے والا ہے خواہ کافر ناپسند کریں۔",
        "v5": {
            "text": "[b]They desire to extinguish the light of Allah with <i>the breath </i><i>of</i> their mouths, but Allah will perfect His light, however much the disbelievers hate <i>it</i>.[4228]",
            "notes": [
                {
                    "ref": "b",
                    "note": "9:32."
                },
                {
                    "ref": "4228",
                    "note": "<p><strong>Commentary:</strong></p><p>The Holy Prophet has been repeatedly called the \"Light of Allah,\" in the Quran (4:175; 5:17; 64:9). All the efforts of the enemies of Islam to extinguish this divine light has signally failed and Islam has gone on from strength to strength and will one day embrace in its fold the major enlightened part of all mankind.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 14447,
                "topic": "Prophecies in the Holy Qur’an: about: Islam",
                "verses": "30:3-5, 2:116, 8:61, 9:33, 12:103, 16:78, 17:2, 19:41, 22:24, 22:27, 32:6, 33:23, 35:12, 38:2, 41:54, 43:90, 48:29-30, 53:2, 56:4, 58:22, 60:8, 70:37-38, 79:2-6, 81:19, 81:24-25, 82:2, 83:30-35, 89:23, 90:2-3, 91:2-5, 93:2-3, 94:6-7, 99:2-7, 100:10-12"
            },
            {
                "id": 14474,
                "topic": "Prophecies in the Holy Qur’an: about: latter days",
                "verses": "81:2-19, 16:9, 17:105, 36:42-43, 77:11-12, 82:2-5, 84:2-5, 99:2-9, 111:4"
            },
            {
                "id": 14484,
                "topic": "Prophecies in the Holy Qur’an: about: the Promised Messiah<sup>(as)</sup>",
                "verses": "17:87, 53:2, 62:3-5, 81:19, 85:2-5, 86:2-5, 99:7"
            },
            {
                "id": 15476,
                "topic": "Religion: prescribed Islam as the true",
                "verses": "3:20, 2:133, 2:194, 3:74, 3:86, 4:126, 5:4, 7:30, 8:40, 9:33, 42:14, 48:29"
            },
            {
                "id": 17996,
                "topic": "Truth: <i>Haqq</i>: Islam is",
                "verses": "58:22, 9:33, 5:84-85, 10:109, 37:38, 48:29"
            }
        ],
        "ar": "ہُوَ الَّذِیۡۤ  اَرۡسَلَ  رَسُوۡلَہٗ  بِالۡہُدٰی وَ دِیۡنِ  الۡحَقِّ لِیُظۡہِرَہٗ  عَلَی الدِّیۡنِ کُلِّہٖ وَ لَوۡ  کَرِہَ  الۡمُشۡرِکُوۡنَ ٪﴿۱۰﴾",
        "ur": "وہی ہے جس نے اپنے رسول کو ہدایت اور دین حق کے ساتھ بھیجا تاکہ وہ اُسے دین (کے ہر شعبہ) پر کلیّۃً غالب کردے خواہ مشرک برا منائیں۔",
        "v5": {
            "text": "[c]He it is Who has sent His Messenger with the guidance and the Religion of Truth, that He may cause it to prevail over all religions, even if those who associate partners <i>with God</i> hate <i>it</i>.[4229]",
            "notes": [
                {
                    "ref": "c",
                    "note": "9:33; 48:29."
                },
                {
                    "ref": "4229",
                    "note": "<p><strong>Commentary:</strong></p><p>Most commentators of the Quran are agreed that this verse applies to the Promised Messiah in whose time all religions will make their appearance and the superiority of Islam over all of them will be established.</p><p>This and the previous verse contain two very challenging prophecies, the present one about the establishment of the superiority of Islam over other Faiths and the preceding one about the total failure of the enemies of Islam to extinguish its light.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 4078,
                "topic": "Bargain: with Allah",
                "verses": "62:10, 3:188, 9:111, 62:12"
            },
            {
                "id": 4119,
                "topic": "Barter",
                "verses": "2:17, 2:42, 2:87, 4:75, 5:45, 9:9, 9:111"
            },
            {
                "id": 17772,
                "topic": "Trade: <i>Tijarah</i>",
                "verses": "2:276, 2:17, 2:199, 3:134, 4:30, 4:74, 24:38, 35:30, 62:12"
            }
        ],
        "ar": "یٰۤاَیُّہَا  الَّذِیۡنَ  اٰمَنُوۡا ہَلۡ اَدُلُّکُمۡ عَلٰی تِجَارَۃٍ  تُنۡجِیۡکُمۡ مِّنۡ عَذَابٍ اَلِیۡمٍ ﴿۱۱﴾ ",
        "ur": "اے لوگو جو ایمان لائے ہو! کیا میں تمہیں ایک ایسی تجارت پر مطلع کروں جو تمہیں ایک دردناک عذاب سے نجات دے گی؟",
        "v5": {
            "text": "O ye who believe! shall I point out to you a bargain that will save you from a painful punishment?[4230]",
            "notes": [
                {
                    "ref": "4230",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse seems to refer to the time of the Promised Messiah when trade and commerce will flourish and there will be a mad rush for striking profitable bargains.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 2392,
                "topic": "Allah: spend in the way of",
                "verses": "2:268, 2:4, 2:196, 2:216, 2:220, 2:246, 2:255, 2:263, 2:265, 2:273, 2:275, 3:93, 8:4, 8:61, 9:20, 9:34, 9:41, 9:99, 9:111, 13:23, 14:32, 16:76, 22:36, 24:38-39, 28:55, 32:17, 35:30, 42:39, 47:39, 57:8, 57:11, 63:11, 64:17-18, 65:8, 73:21"
            },
            {
                "id": 9945,
                "topic": "Jihad: is for Allah",
                "verses": "29:70, 2:219, 2:252, 3:143, 4:96, 5:36, 5:55, 8:73, 8:75, 9:16, 9:19-20, 9:24, 9:41, 9:44, 9:73, 9:81, 9:86, 9:88, 16:111, 22:79, 29:7, 49:16, 60:2"
            },
            {
                "id": 13643,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 15995,
                "topic": "Sacrifice: of wealth",
                "verses": "47:37-39, 2:216, 57:12, 57:19, 63:10-11"
            },
            {
                "id": 17097,
                "topic": "Spending: <i>Nafaqah</i>: sacrifice",
                "verses": "2:4, 2:255"
            },
            {
                "id": 17772,
                "topic": "Trade: <i>Tijarah</i>",
                "verses": "2:276, 2:17, 2:199, 3:134, 4:30, 4:74, 24:38, 35:30, 62:12"
            },
            {
                "id": 18589,
                "topic": "Wealth: spend in Allah’s way",
                "verses": "2:262-268, 9:41, 9:44, 9:88, 9:103, 47:37, 92:18-22"
            }
        ],
        "ar": "تُؤۡمِنُوۡنَ بِاللّٰہِ وَ رَسُوۡلِہٖ وَ تُجَاہِدُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ  بِاَمۡوَالِکُمۡ وَ اَنۡفُسِکُمۡ ؕ ذٰلِکُمۡ  خَیۡرٌ  لَّکُمۡ  اِنۡ کُنۡتُمۡ  تَعۡلَمُوۡنَ ﴿ۙ۱۲﴾ ",
        "ur": "تم (جو) اللہ پر اور اس کے رسول پر ایمان لاتے ہو اور اللہ کے راستے میں اپنے اموال اور اپنی جانوں کے ساتھ جہاد کرتے ہو، یہ تمہارے لئے بہت بہتر ہے اگر تم علم رکھتے ہو۔",
        "v5": {
            "text": "[a]That you believe in Allah and His Messenger, and strive in the cause of Allah with your wealth and your persons. That is better for you, if you did but know.[4231]",
            "notes": [
                {
                    "ref": "a",
                    "note": "9:20, 41."
                },
                {
                    "ref": "4231",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference in the verse again seems to be to the present time—the era of the Promised Messiah, in which, in the absence of religious wars, monetary sacrifice is given precedence over other forms of sacrifice. The present is the time for propagation of Islamic principles and ideals for which money, more than anything else, is urgently needed. The two verses (11, 12) equally are of general application.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 13565,
                "topic": "Paradise: <i>Jannah</i>: <i>Jannate ‘Adn</i>",
                "verses": "9:72, 13:24, 16:32, 18:32, 19:62, 20:77, 35:34, 38:50-51, 40:9, 98:9"
            },
            {
                "id": 13643,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 14767,
                "topic": "Pure",
                "verses": "3:39, 4:44, 4:161, 5:7, 16:98, 22:25, 37:85, 40:65, 45:17, 98:3"
            },
            {
                "id": 16815,
                "topic": "Sin: <i>Dhanb</i>: forgiveness of",
                "verses": "3:32, 3:136, 3:148, 3:194, 4:18, 4:32, 4:49, 4:111, 4:117, 5:13, 5:66, 6:55, 7:154, 7:157, 12:30, 12:34, 12:88, 12:98, 14:11, 15:57, 18:59, 29:8, 33:71-72, 39:54, 40:56, 42:26, 46:17, 46:32, 47:3, 47:20, 48:3, 64:10, 65:6, 71:5"
            },
            {
                "id": 17312,
                "topic": "Success: <i>Fauz</i>, <i>Ghalabah</i>",
                "verses": "23:2, 3:186, 4:14, 4:74, 5:57, 9:1, 9:20, 9:72, 9:89, 9:100, 9:111, 10:10, 24:53, 33:72, 37:61, 39:62, 40:10, 47:6, 58:23, 59:10, 78:32"
            },
            {
                "id": 17590,
                "topic": "Tayyib",
                "verses": "3:39, 3:180, 8:38, 9:72, 10:23, 14:25, 16:33, 16:98, 24:62"
            }
        ],
        "ar": "یَغۡفِرۡ لَکُمۡ  ذُنُوۡبَکُمۡ وَ یُدۡخِلۡکُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ وَ مَسٰکِنَ  طَیِّبَۃً  فِیۡ  جَنّٰتِ عَدۡنٍ ؕ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿ۙ۱۳﴾ ",
        "ur": "وہ تمہارے گناہ بخش دے گا اور تمہیں ایسی جنتوں میں داخل کردے گا جن کے دامن میں نہریں بہتی ہیں اور ایسے پاکیزہ گھروں میں بھی جو ہمیشہ رہنے والی جنتوں میں ہیں۔ یہ بہت بڑی کامیابی ہے۔",
        "v5": {
            "text": "He will forgive you your sins, and make you enter the Gardens through which streams flow, and pure and pleasant dwellings in Gardens of Eternity[a]. That is the supreme triumph.[4232]",
            "notes": [
                {
                    "ref": "a",
                    "note": "9:72; 19:62; 20:77."
                },
                {
                    "ref": "4232",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that Muslims, by preaching Islamic ideals and principles to the world, will prosper and Islam will advance and make progress.</p>"
                }
            ]
        }
    },
    {
        "ch": 61,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 4256,
                "topic": "Believers: <i>Mu’min</i>: Allah’s help for",
                "verses": "2:215, 2:154, 3:124, 3:127, 9:25, 10:104, 29:11, 30:6, 30:48, 40:52, 58:22, 110:2"
            },
            {
                "id": 7422,
                "topic": "Fataha: Open: grant victory",
                "verses": "23:78, 48:2, 4:142, 5:53, 48:19, 48:28, 57:11, 110:2"
            },
            {
                "id": 7980,
                "topic": "Glad Tidings: <i>Bushra</i>: to believers, pious, fearful",
                "verses": "2:26, 2:156, 2:224, 9:112, 10:3, 10:65, 10:88, 17:10, 22:35, 22:38, 33:48, 36:12, 39:18, 41:31, 57:13"
            },
            {
                "id": 13288,
                "topic": "Open: <i>Fataha</i>: grant victory",
                "verses": "48:2, 4:142, 5:53, 32:29-30, 48:19, 48:28, 57:11, 110:2"
            }
        ],
        "ar": "وَ اُخۡرٰی تُحِبُّوۡنَہَا ؕ نَصۡرٌ  مِّنَ اللّٰہِ وَ فَتۡحٌ  قَرِیۡبٌ ؕ وَ  بَشِّرِ  الۡمُؤۡمِنِیۡنَ ﴿۱۴﴾ ",
        "ur": "ایک دوسری (بشارت بھی) جسے تم بہت چاہتے ہو۔ اللہ کی طرف سے نصرت اور قریب کی فتح ہے۔ پس تو مومنوں کو خوشخبری دےدے۔",
        "v5": {
            "text": "And <i>He will bestow upon you</i> another <i>favour</i> which you love: help from Allah and a near victory. So give glad tidings to the believers.",
            "notes": null
        }
    }
]
