[
    {
        "ch": 1,
        "v": 1,
        "v_": 1,
        "topics": [
            {
                "id": 1202,
                "topic": "Allah: attributes of, <i>Asma’ul-Husna</i>",
                "verses": "1:7, 2:256, 7:181, 17:111, 20:9, 37:160-161, 59:23-25, 112:2-5, See also Attributes of Allah"
            },
            {
                "id": 3511,
                "topic": "Attributes of Allah: Ar-Rahman (The Gracious, Beneficent)",
                "verses": "1:3, 12:65, 13:31, 17:111, 19:45, 19:46, 19:59, 19:62, 19:86, 21:113, 25:61, 26:6, 27:31, 36:53, 41:3, 50:34, 55:2, 59:23, 67:30, 78:39"
            },
            {
                "id": 3533,
                "topic": "Attributes of Allah: Ar-Rahim (The Merciful)",
                "verses": "1:3, 2:161, 2:164, 2:174, 2:183, 2:193, 2:219, 2:227, 3:32, 4:24, 4:97, 4:101, 5:4, 5:99, 11:42, 12:54, 18:59, 26:192, 27:31, 30:6, 33:44, 36:59, 42:6"
            },
            {
                "id": 8281,
                "topic": "Hadith: <i>bismillah</i>",
                "verses": null
            },
            {
                "id": 10293,
                "topic": "Knowledge: <i>‘Ilm</i>: Qur’an for attainment of",
                "verses": "3:191-192, 2:147, 2:186, 4:167, 6:98, 6:106, 6:141, 6:149, 7:33, 7:53, 9:11, 10:6-7, 12:77, 13:4-5, 15:76, 16:11-17, 35:28-29, 41:4, 45:14"
            },
            {
                "id": 11196,
                "topic": "Mercy: Allah’s mercy",
                "verses": "1:7, 2:38, 2:65, 2:106, 2:129, 2:158, 2:179, 2:188, 2:219, 3:9, 3:75, 3:108, 3:129, 3:133, 3:158, 4:27-28, 4:84, 4:93, 4:97, 4:114, 4:172, 4:176, 5:40, 5:72, 6:13, 6:17, 6:55, 6:134, 6:148, 6:156, 7:57-58, 7:64, 7:73, 7:152, 7:155-157, 7:205, 9:21, 9:99, 10:22, 10:87, 11:10, 11:44, 11:74, 11:120, 12:65, 16:65, 17:9, 17:55, 17:58, 17:88, 18:17, 18:59, 39:54"
            },
            {
                "id": 16954,
                "topic": "Solomon: <i>Sulaiman(as)</i>: <i>Bismillah</i>",
                "verses": "27:31"
            },
            {
                "id": 17830,
                "topic": "Treasure",
                "verses": "3:50, 2:24, 3:76, 4:21, 6:51, 11:13, 11:32, 12:56, 15:22, 17:101, 18:83, 25:9, 26:59, 28:77, 38:10, 52:38, 63:8"
            }
        ],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[1]",
            "notes": [
                {
                    "ref": "a",
                    "note": "Placed before every chapter except ch.9; also in 27:31. See also 96:2."
                },
                {
                    "ref": "1",
                    "note": "<p><strong>Important Words:</strong></p><p>ب (in) occurring here in combination with اسم is a particle used to convey a number of meanings, the one more applicable here being that of 'with'. The compound word بسم therefore would mean 'with the name of.' According to the Arab usage, the words <i>iqra’</i> or <i>aqra’u</i> or <i>naqra’u</i> or <i>ishra’</i> or <i>ashra‘u</i> or<i> nashra‘u </i>would be taken to be understood before بسم اللّٰه. The expression بسم اللّٰه would thus mean 'begin with the name of Allah' or 'recite with the name of Allah,' or 'I or we begin with the name of Allah.' or 'I or we recite with the name of Allah.' In the translation the words بسم اللّٰه have been rendered as \"in the name of Allah\", which is a more familiar form (Lane).</p><p>اسم (name), which is derived either from وسم (a mark) or سمو (height), means a name or attribute (Aqrab). Here it is used in both senses; for, firstly, it refers to 'Allah' which is the personal name of God; and, secondly, it refers to <i>Ar-Rahman </i>(Gracious) and <i>Ar-Rahim </i>(Merciful) which are His attributive names.</p><p>اللّٰه (Allah) is the name of the Supreme Being, Who is the sole possessor of all perfect attributes and is free from all defects. In the Arabic language, the word <i>Allah</i> is never used for any other thing or being. No other language has a distinctive name for the Supreme Being. The names found in other languages are all attributive or descriptive and are often used in the plural, but the word \"Allah\" is never used in the plural number. It is a simple substantive, not derived. It is never used as a qualifying word. Hence, in the absence of a parallel word in the English language, the original name \"Allah\" has been retained throughout the translation.</p><p>This view is corroborated by eminent authorities of the Arabic language. Lane says: \"اللّٰه (Allah) according to the most correct of the opinions respecting it is a proper name, applied to the Being, Who exists necessarily by Himself, comprising all the attributes of perfection, the ال (al) being in-separable from it\" (Arabic-English Lexicon). For a fuller discussion of the word 'Allah,' the reader is referred to <i>Tafsir-e-Kabir </i>by Hadrat Mirza Bashir-ud-Din Mahmud Ahmad, Head of the Ahmadiyya Community.</p><p>الرحمن (Gracious) and الرحیم (Merciful) are both derived from the same root رحم meaning, he showed mercy; he was kind and good; he forgave. The word رحمة combines the idea of رقة i.e.<i> </i>'tenderness' and احسان i.e.<i> </i>'goodness' (Mufradat). الرحمن is in the measure of فعلان and الرحیم in the measure of فعیل. According to the rules of the Arabic language, the larger the number of letters added to the root word, the more extensive or more intensive does the meaning become (Kashshaf). The measure of فعلان<i> </i>thus conveys the idea of fullness and extensiveness, while the measure of فعیل denotes the idea of repetition and giving liberal reward to those who deserve it (Muhit). Thus the word الرحمن would denote \"mercy comprehending the entire universe,\" whereas the word الرحیم would denote \"a mercy limited in its scope but shown repeatedly\".</p><p>In view of the above, الرحمان is One Who shows mercy gratuitously and extensively to all creation without regard to effort or work, and الرحیم is One Who shows mercy in response to, and as a result of, the actions of man but shows it liberally and repeatedly. The former is applicable only to God, while the latter is applied to man also. The former extends not only to the believers and unbelievers but to the whole creation; the latter applies mostly to the believers. The Holy Prophet is reported to have said: الرحمان رحمان الدنیا و الرحیم رحیم الآخرة i.e.<i> </i>the attribute الرحمن generally pertains to this life, while the attribute الرحیم generally pertains to the life to come (Muhit), meaning that as this world is mostly the world of actions and the next a world where actions will be particularly rewarded, God’s attribute of الرحمن provides man with material for his works in this life, whereas His attribute of الرحیم brings about results in the life to come.</p><p>The abundance of everything which we enjoy in this life, which is indeed all a favour of God, is provided for us before we do anything to deserve it or even before we are born, while the blessings in store for us in the life to come will be given to us as a reward of our actions. This shows that الرحمن is the Bestower of gifts which precede our birth, while الرحیم is the giver of blessings which follow our deeds as their reward.</p><p><strong>Commentary:</strong></p><p><i>(i) </i>The verse بسم اللّٰه الرحمن الرحیم is the first verse of every chapter of the Quran, except the chapter <i>Bara’ah, </i>which, however, is not an indepen-dent chapter but a continuation of the chapter <i>Anfal. </i>There is a saying reported by Ibn ‘Abbas to the effect that whenever any new chapter was revealed, <i>Bismillah </i>was the first verse to be revealed, and without <i>Bismillah </i>the Holy Prophet did not know that a new chapter had begun (Dawud). This hadith goes to prove that (1) the verse <i>Bismillah </i>is part of the Quran and not something supernumerary and (2) that the chapter <i>Bara’at </i>is not an independent chapter. It also refutes the belief expressed by some that <i>Bismillah </i>is<i> </i>a part only of <i>Al-Fatihah </i>and not of all the Quranic chapters. Such views are further refuted by the hadith in which the Holy Prophet is reported to have said, definitely, that the verse <i>Bismillah</i> is a<i> </i>part of all the Quranic chapters (Bukhari &amp; Qutni).</p><p><i>(ii) </i>The Holy Prophet attached great importance to the verse <i>Bismillah. </i>He is reported to have said that any important work which is done without reciting <i>Bismillah </i>is apt to prove devoid of God’s blessings. Thus, it is a general practice among Muslims to commence every work with a recital of this prayer.</p><p><i>(iii)</i> The place of this verse in the beginning of every chapter has the following significance:</p><p>1. The Quran is a treasure of divine knowledge to which access cannot be had without the special favour of God. In 56:80 God says regarding the Quran: <i>None shall touch it except those who are purified, </i>meaning that except the favoured ones who have been purified by the hand of God, none shall grasp the deeper meaning of the Quran. Thus <i>Bismillah </i>has been placed at the beginning of each chapter to remind the reader that in order to have access to and benefit from the treasures of divine knowledge contained in the Quran, he should not only approach it with pure motives but also constantly invoke the help of God and try to lead a righteous life.</p><p>2. In the Old Testament (Deut. 18:18,19) we read: \"I will raise them (the Israelites) up a prophet from among their brethren, like unto thee (Moses), and I will put my words in his mouth, and he shall speak unto them all that I shall command him. And it shall come to pass, that whosoever will not hearken unto my words which he shall speak in my name, I will require it of him.\" As the Holy Prophet of Islam was raised in the likeness of Moses (Quran, 73:16), so in fulfilment of the above prophecy God so ordained that each time a new <i>Surah </i>was revealed, it was begun by the words: <i>In</i> <i>the name</i> <i>of Allah. </i>This meant that every chapter of the Quran, i.e.<i> </i>every new proclamation made by God through the Holy Prophet, should commence with this verse so that on the one hand the prophecy made by Moses might be fulfilled and on the other, there might be a constant repetition of the warning to the Jews and Christians that if they hearkened not to the words of the new Prophet, they would be answerable to God.</p><p>3. In the Old Testament, we also read: \"But the prophet, which shall presume to speak a word in my name, which I have not commanded him to speak, or that shall speak in the name of other gods, even that prophet shall die\" (Deut. 18:20). The verse <i>Bismillah </i>(in the name of God) has, therefore, been placed at the beginning of every chapter of the Quran so that the fact might be brought home to the Jews and Christians in particular and to other peoples in general that the success which attended the career of the Holy Prophet was a positive proof of the fact that all that he spoke was spoken by the command of God; for if it had been otherwise, he would surely have met with early destruction. The verse <i>Bismillah </i>is thus a standing challenge to the Jews and Christians, and every time it is repeated at the head of a chapter it serves as an argument for the truth of the Holy Prophet. This result could not have been attained if the verse had been put only in the beginning of the Quran.</p><p>4. The verse <i>Bismillah </i>placed before every chapter of the Quran also serves another important purpose. It is a key to the meaning of each individual chapter. This is so because all questions affecting moral and spiritual matters are related in one way or another with these fundamental divine attributes: <i>Rahmaniyyat </i>(grace) and <i>Rahimiyyat </i>(mercy). Thus each chapter is, in fact, a detailed exposition of some aspect of the divine attributes mentioned in the verse.</p><p><i>(iv)</i> Some Christian writers have raised the objection that the formula of <i>Bismillah </i>has been borrowed from earlier Scriptures, insinuating that it cannot therefore be of Divine origin. Wherry, in his commentary has expressed the opinion that it has been borrowed from the Zend-Avesta where it has the form: بنام ایزد بخشائنده وبخشائش گر<i> </i>i.e.<i> </i>With the name of God, Forgiving, Kind. A similar objection has been raised by Sale. Rodwell, however, has expressed the opinion that the Quran borrowed the formula from the Jews, among whom it was in vogue and from whom its use was borrowed by pre-Islamic Arabs. Both these criticisms are wrong and beside the point; for <i>firstly </i>it has never been claimed by the Muslims that the formula in this or similar form was not known before the revelation of the Quran; <i>secondly</i> it<i> </i>is wrong to argue that the formula could not be of Divine origin even if it was sometimes used by the pre-Islamic peoples in an identical or similar form before its revelation in the Quran. As a matter of fact, the Quran itself states that Solomon used the phrase in his letter to the Queen of Sheba (27:31). What Muslims claim—and this claim has never been refuted—is that the Quran was the first Scripture to use the formula in the way it did [see <i>(iii) </i>above]. It is also wrong to say that the formula was in common vogue among pre-Islamic Arabs, for it is well known that Arabs had an aversion to the use of the name <i>Ar-Rahman </i>for God. Again, if such formulae for the praise of God were known before, it only goes to corroborate the truth of the Quranic teaching that there has not been a people to whom a Teacher has not been sent (35:25), and that the Quran is a repository of all permanent truths contained in the previous Books (98:4). It adds much more, of course, and, whatever it adopts, it improves its form or use or both.</p><p><i>(v) </i>It has been asked why the word اسم (name) has been used before the word اللّٰه (Allah) in the verse <i>Bismillah</i>. This may be explained in a number of ways:</p><p>1. In the Arabic language the particle ب is used not only to signify connection or invoke help, but also in swearing. So if the word اسم had been dropped, the phrase باللّٰه (<i>billah</i>) might have meant \"I swear by Allah.\" The introduction of اسم (name) removes this ambiguity.</p><p>2. God being the source of all goodness, even the invoking of His names proves a blessing. Says the Quran (55:79): <i>Blessed be the name of thy Lord, the Owner of Majesty and Honour</i>. The Holy Prophet sometimes healed people by invoking the various names of God. Therefore, the word اسم (name) has been added in order to remind the Faithful that to remember the names of God is to merit a blessing.</p><p>3. The use of the word \"name\" further indicates that God is hidden and can be known only through His names, i.e. attributes. By reciting <i>Bismillah,</i> a believer seeks the help of God through His attributes of <i>Ar-Rahman</i> and <i>Ar-Rahim</i>.</p><p>4. Again, the inner meanings of the Quran are a guarded treasure and nobody can have access to them, except under proper authority. The person who begins a recitation with the formula, <i>In the name of Allah</i>, says, as it were, to the guardian angels of this spiritual treasure, \"I am approaching it in the name of Allah, so open to me the treasures of the inner meanings of the Quran.\" To the one who approaches the Quran in such a spirit, the treasures will indeed be opened. The verse, <i>None shall touch it except those who are purified</i> (56:80), likewise, shows that only the pure in spirit can find access to the deep secrets of the Quran.</p><p>5. Another reason for introducing the word \"name\" in <i>Bismillah</i> is to draw attention to the prophecy of Moses (Deut. 18:18-20) to which reference has already been made.</p>"
                }
            ]
        }
    },
    {
        "ch": 1,
        "v": 2,
        "v_": 2,
        "topics": [
            {
                "id": 3489,
                "topic": "Attributes of Allah: Ar-Rabb (The Lord)",
                "verses": "2:22, 4:2, 5:29, 5:73, 5:118, 6:2, 6:46, 6:165, 10:11, 22:78, 39:76, 45:37"
            },
            {
                "id": 3779,
                "topic": "Attributes of Allah: Rabbul-‘Alamin (Lord of all the worlds)",
                "verses": "2:132, 5:29, 6:163, 7:55, 10:11, 26:24, 26:78, 28:31, 32:3, 37:183, 40:65, 41:10, 59:17, 81:30"
            },
            {
                "id": 7285,
                "topic": "Evolution",
                "verses": "22:6, 23:13-15, 32:8-10, 56:61-62, 71:15, 71:18, 95:2-6"
            },
            {
                "id": 15974,
                "topic": "Saba’: Queen Sheba",
                "verses": "27:23-45"
            }
        ],
        "ar": "اَلۡحَمۡدُ لِلّٰہِ رَبِّ الۡعٰلَمِیۡنَ ۙ﴿۲﴾ ",
        "ur": "تمام حمد اللہ ہی کے لئے ہے جو تمام جہانوں  کاربّ ہے۔",
        "v5": {
            "text": "[a]All praise belongs to Allah, Lord of all the worlds,[2]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:2; 6:46; 10:11; 18:2; 29:64; 30:19; 31:26; 34:2; 35:2; 37:183; 39:76; 45:37."
                },
                {
                    "ref": "2",
                    "note": "<p><strong>Important Words:</strong></p><p>ال (Al) is more or less like the definite article 'the' of the English language. It is used to convey a number of senses one of which is that of totality. So الحمد would mean, all kinds of praise.</p><p>حمد (praise). They say حمده i.e. he praised him. Thus حمد means 'praise'. There are four words in Arabic which are used, in varying significance, in the sense of praise or thankfulness; viz. شکر, ثنا, مدح and حمد. Of these God has here chosen the last. <i>Shukr</i>, when used about man, expresses recognition of and thankfulness for benefits received, whereas <i>Hamd</i> not only embodies the idea of thankfulness but also makes reference to the intrinsic qualities of the object of praise. <i>Thana</i> indicates an idea of publicity, the root meaning of the word being repetition. The emphasis in <i>Thana</i> is more on publicity than on personal experience. <i>Madh</i> gives a somewhat similar meaning as <i>Hamd</i> but whereas <i>Madh</i> may be false, <i>Hamd</i> is always true. Says the Holy Prophet: احثوا التراب فی وجوه المداحین i.e. \"Throw dust in the faces of those who praise falsely.\" Again <i>Madh</i> may be used about such acts of goodness over which the doer has no control, but <i>Hamd</i> is used only about such acts as are volitional (Mufradat). <i>Hamd</i> also implies admiration, magnifying and honouring of the object of praise, and lowliness, humility and submissiveness in the person who offers it (Lane). Thus <i>Hamd</i> was the most appropriate word to be used here, where a reference to the intrinsic goodness and truly merited praise and glorification of God is intended. In common usage the word <i>Hamd</i> has come to be applied exclusively to God.</p><p>رب (Lord). رب الشیء means: he gathered together the thing; he owned the thing. رب القیوم means: he ruled over the people and administered their affairs. رب النعمة means: he increased and developed the favour. رب الامر means: he improved and completed the matter. رب الصبیی means: he sustained and looked after the child till he was of age. رب means, lord, master or owner; one to whom obedience is due; one who reforms; one who sustains and develops (Aqrab &amp; Lisan); one who brings to perfection by degrees (Mufradat). رب also means: Creator (Muhit). When used in combination with some other word, the word may be used for others besides God, as we say رب البیت i.e. the owner of the house (Lane).</p><p>العالمین (worlds) is the plural of العالم which is derived from علم i.e. he knew. علم (<i>‘alama</i>) means, he put a mark or sign on it. العلم means: the proper name by which a person or thing is known; flag or banner; sign; minaret. العالم primarily means, that by means of which one knows a thing. Hence, the word has come to be applied to all beings or things by means of which one is able to know the Creator (Aqrab). The word is applied not only to all kinds of created beings or things but also to their classes collectively, so that one says عالم الانس i.e. the world of mankind, or عالم الحیوان i.e. the animal kingdom. The word <i>al-‘alamin</i> is not used to denote rational beings—men and angels—only. The Quran applies the word to all created things (26:24-29 &amp; 41:10). Sometimes, of course, it is used in a restricted sense. Thus in 25:2 it is used in the sense of 'mankind' only and not in the sense of 'all created things.' In 2:123 it is used in a still more restricted sense, meaning not all mankind but only the people of the age.</p><p>In the verse under comment the word is used in its widest sense and signifies 'all that is besides Allah', i.e. both those that have life and those that have not, including heavenly bodies, the sun, the moon, the stars, etc.</p><p><strong>Commentary:</strong></p><p>The believer is taught to say, <i>All praise belongs to Allah</i>, and not \"I praise Allah\" or \"we praise Allah.\" The sentence الحمدللّٰه (all praise belongs to Allah) denotes much more than احمداللّٰه (I praise Allah), because man can praise God only according to his knowledge, but الحمدللّٰه (all praise belongs to Allah) comprises not only the praise which man knows, but also the praise which he does not know, to be God’s due. God is worthy of praise at all times, independently of man’s imperfect knowledge or realization. Moreover, if the expression احمداللّٰه (I praise Allah) had been used, it would have implied that man, a finite being, can completely comprehend the infinite, an implication which is obviously wrong.</p><p>The word الحمد is an infinitive and as such can be interpreted both subjectively and objectively. Interpreted subjectively الحمدللّٰه would mean that God alone has the right to bestow true praise. No other being is entitled to give such praise, owing to his limited knowledge. Interpreted objectively, it would signify that true praise is due to God alone. The praise due to other beings and objects is only borrowed and secondary. It is God Who provides everything and grants all powers and capacities. Therefore, when a person or thing is praised, it is really God to Whom the praise belongs, the person or thing being entitled to it only secondarily.</p><p>The verse, <i>All praise belongs to Allah, Lord of all the worlds</i>, conveys, among others, the following meanings:</p><p>1. Allah is free from all blemishes and possesses all perfect attributes.</p><p>2. He alone is fully aware of the real nature of all things. The truth of this statement is verified by the daily multiplying discoveries of science which go to prove how inadequate human knowledge ever remains.</p><p>3. God can be entitled to \"all praise\" only when He is believed to be رب العالمین i.e. Lord of all the worlds and if He is Lord of all the worlds, then His providence must not only be universal but must extend to both the physical and the spiritual worlds. From the above it follows that no people must remain deprived of God’s spiritual blessings and all must have their share. Therefore, if any revelation is meant for a particular people, other peoples must have separate revelations to guide them, as was the case in pre-Islamic times. On the contrary, if, at a certain time, separate revelations are not sent for different peoples and only one revelation is sent, that revelation must claim to be universal, affording equal opportunities to all peoples, as is the case with Islam; otherwise, God cannot be looked upon as \"Lord of all the worlds\", nor can He be considered to be entitled to \"all praise\". In fact, the belief that revelation is the privilege of a particular people to the exclusion of all others who cannot claim any share in it, is false and repugnant to God’s universal provi­dence as well as to His entitlement to all praise.</p><p>4. The powers and faculties with which man is endowed are all gifts of God. So it is He Who is deserving of praise for any good that may be done by man.</p><p>5. By linking up the clause \"all praise belongs to Allah\" with the phrase \"Lord of all the worlds\" God has drawn our attention to the fact that one man’s good is really linked to, and dependent on, the good of all mankind. A true believer should, therefore, look not only to his own good but to the good of all. One who does not do so has failed to grasp the true spirit of Islam and the universality of God’s providence. Happiness for one lies in happiness for all.</p><p>6. The phrase رب العالمین (Lord of all the worlds) also points out that as things which grow, develop and change cannot do so by themselves, so is all life subject to God’s lordship.</p><p>The phrase further points to a law of evolution in the world, that things undergo development and that this development is progressive and is brought about in stages, <i>Rabb</i> being the One Who makes things grow and develop by stages.</p><p>The verse also points out that the principle of evolution is not inconsistent with belief in God. On the contrary, the progressive deve­lopment of things makes creation all the more marvellous and God all the more deserving of praise. It must, however, be noted that the process of evolution referred to here is not identical with the theory of evolution as ordinarily understood; the expression is used here only in a general sense.</p><p>7. Again, the verse points to the fact that man has been created for unlimited progress, because the phrase رب العالمین implies that God develops everything from a lower to a higher stage, and this can be true only if there is a stage beyond every stage in a never-ending process.</p><p>8. Finally, by putting the verse الحمداللّٰه رب العالمین in the very beginning of the Quran, a declaration is made that the time of separate revelations has come to an end, and that God is now going to bestow a universal revelation upon the world. When separate Prophets were raised for separate nations, ignorant people, not understanding the purpose of God, rejected the Prophets of other nations; but, with the advent of Islam, one Prophet and one religion were given to all mankind, and the different peoples inhabiting the world—white, yellow, brown and black—were all invited to sing one common hymn in praise of Allah, the Lord of all the worlds.</p>"
                }
            ]
        }
    },
    {
        "ch": 1,
        "v": 3,
        "v_": 3,
        "topics": [
            {
                "id": 3512,
                "topic": "Attributes of Allah: Ar-Rahman (The Gracious, Beneficent)",
                "verses": "1:1, 12:65, 13:31, 17:111, 19:45, 19:46, 19:59, 19:62, 19:86, 21:113, 25:61, 26:6, 27:31, 36:53, 41:3, 50:34, 55:2, 59:23, 67:30, 78:39"
            },
            {
                "id": 3532,
                "topic": "Attributes of Allah: Ar-Rahim (The Merciful)",
                "verses": "1:1, 2:161, 2:164, 2:174, 2:183, 2:193, 2:219, 2:227, 3:32, 4:24, 4:97, 4:101, 5:4, 5:99, 11:42, 12:54, 18:59, 26:192, 27:31, 30:6, 33:44, 36:59, 42:6"
            }
        ],
        "ar": "الرَّحۡمٰنِ الرَّحِیۡمِ ۙ﴿۳﴾",
        "ur": "بے انتہا رحم کرنے والا، بن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]The Gracious, [b]the Merciful,[3]",
            "notes": [
                {
                    "ref": "a",
                    "note": "25:61; 26:6; 41:3; 55:2; 59:23."
                },
                {
                    "ref": "b",
                    "note": "33:44; 36:59."
                },
                {
                    "ref": "3",
                    "note": "<p><strong>Important Words:</strong></p><p>For the meanings of the words <i>Ar-Rahman </i>and <i>Ar-Rahim </i>see note under 1:1.</p><p><strong>Commentary:</strong></p><p>In the verse <i>Bismillah </i>the attributes of <i>Ar-Rahman </i>and <i>Ar-Rahim </i>serve as a key to the meaning of the chapter at the head of which they have been placed. Their mention here in the third verse serves an additional purpose. Here they are used as a link between the attribute of رب العالمین which precedes and that of مالك یوم الدین which follows them. As we have seen, the phrase رب العالمین (Lord of all the worlds) also implies that after creating things, God leads them progressively to higher stages of development. In the words الرحمان and الرحیم occurring in the present verse, light is thrown on the process of that development. The word <i>Ar-Rahman </i>means that God not only provides all the necessary means, but also all the faculties needed for the development of man; and the word <i>Ar-Rahim </i>signifies that when man makes proper use of the means and faculties bestowed upon him, God not only rewards his labours but also inspires him with a desire for further good actions, thus opening unending avenues of progress and development for him.</p><p>The attribute of <i>Ar-Rahman </i>rules out the doctrine of Atonement, because <i>Ar-Rahman </i>signifies that God can bestow unearned favours on His creatures, whereas the doctrine of Atonement is based on the belief that God is, as it were, bound to treat men only according to their merits. Islam teaches that God is bound by no such restrictions. He possesses the power to forgive sins and treat His servants as He likes, because, being <i>Ar-Rahman, </i>He can reward a person beyond his deficiencies.</p><p>The attribute of <i>Ar-Rahim, </i>on the other hand, rules out the doctrine of the transmigration of souls. This doctrine is born of the idea that actions of man in this life, being limited, cannot bring him everlasting salvation. The attribute of <i>Ar-Rahim </i>shows that by liberally rewarding man’s labours, God creates in him the desire to repeat his good actions, repetition of good works resulting in a repetition of rewards and so on without end.</p><p>Misunderstanding arises from the fact that supporters of the doctrine of transmigration look upon Heaven as a place of inaction. To them salvation means <i>Nirvana </i>or cessation of all desire and action. The words رب العالمین (Lord of all the worlds) emphatically deny this view. As the next life is also a creation of God, the attribute of <i>Rabb </i>will continue to operate therein as well. Man’s spiritual progress will not end with death. On the contrary, he will go on doing good works in the next life, and God, the <i>Ar-Rahim, </i>will continue to reward those works. Spiritual progress will therefore go on forever. The possibility of dropping behind as well as forging ahead exists only in this world; in<i> </i>the next there will be no dropping behind but only forging ahead. Effort and action and, therefore, progress will continue forever. So the question about unlimited reward for the limited action does not arise.</p>"
                }
            ]
        }
    },
    {
        "ch": 1,
        "v": 4,
        "v_": 4,
        "topics": [
            {
                "id": 3360,
                "topic": "Attributes of Allah: Al-Malik (The Sovereign)",
                "verses": "59:24, 20:115, 22:57, 23:117, 25:27, 54:56, 62:2, 114:3"
            },
            {
                "id": 3770,
                "topic": "Attributes of Allah: Maliku Yaumid-Din (Master of the Day of Judgement)",
                "verses": null
            },
            {
                "id": 5817,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>",
                "verses": "37:21, 2:9, 2:49, 2:86, 2:114, 2:127, 3:78, 3:115, 4:40, 4:142, 5:70, 6:13, 9:18, 11:27, 14:32, 14:43, 15:36, 23:102, 24:3, 24:38, 25:27, 26:83, 26:88, 29:37, 30:57, 33:22, 38:80, 43:66, 44:17, 50:45, 51:13, 60:4, 70:9, 74:9-10, 75:2-3, 82:17-18, 83:11-12, 86:10"
            },
            {
                "id": 10931,
                "topic": "Mankind: Allah and",
                "verses": "49:14, 2:22, 10:93, 12:39, 13:7, 13:32, 14:53, 17:71, 22:19, 27:74, 30:31, 35:3, 40:58, 40:62, 45:27, 57:26, 114:2-4"
            },
            {
                "id": 18933,
                "topic": "Yaumud-Din: Day of Judgment",
                "verses": "7:188, 15:36, 26:83, 33:64, 37:21, 38:79, 51:13, 56:57, 70:27, 74:47, 78:2-3, 79:43, 82:16, 82:18-19, 83:12"
            }
        ],
        "ar": "مٰلِکِ یَوۡمِ الدِّیۡنِ ؕ﴿۴﴾",
        "ur": "جزا سزا کے دن کا مالک ہے۔",
        "v5": {
            "text": "[a]Master of the [b]Day of Judgement.[4]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:159; 48:15."
                },
                {
                    "ref": "b",
                    "note": "51:13; 74:47; 82:18, 19; 83:7."
                },
                {
                    "ref": "4",
                    "note": "<p><strong>Important Words:</strong></p><p>مالك (Master) is derived from ملك.They say ملك الشیء meaning: he owned the thing and possessed the right of doing with it what he liked. ملك القوم means: he gained complete dominion over the people. ملك (<i>malak</i>) which, according to some authorities, is derived from the same root, means 'an angel.' ملك (<i>malik</i>) means: king or ruler. مالك means: master or one who possesses the right of ownership over a thing and has the power to deal with it as one likes (Aqrab).</p><p>یوم (Day) means (1) time absolutely, whether day or night, short or long; (2) day from sunrise till sunset; (3) present time or now; (4) ایام اللّٰه means, God’s favours and punishments (Aqrab &amp; Lane). The Quran says: <i>Verily a day with thy Lord is as a thousand years of what you reckon</i> (22:48). At another place (70:5) the Quran uses the word to indicate fifty thousand years. At yet another place the Quran says: الیوم اکملت لکم دینکم i.e. <i>Now have I perfected your religion for you</i> (5:4). Here الیوم simply means 'now.'</p><p>دین (Judgement) is derived from دان. They say دانه meaning: he rewarded or recompensed him; he became his master and set him to any task he liked; he judged him; he obeyed him. دان بالاسلام means: he adopted Islam as his religion (Aqrab). Thus the word دین is used in several different senses, e.g. (1) recompense or requital; (2) judgement or reckoning; (3) dominion or government; (4) obedience; (5) religion (Lane). The word has been used in the Quran in all these different senses: see 37:54; 24:3; 12:77; 5:4; 4:126.</p><p><strong>Commentary:</strong></p><p>Generally, this verse is understood to mean that God is the Master of the Day of Judgement. But it has a wider significance; for although the last and the perfect reckoning will take place on the Day of Judgement, the process of requital is going on even in this life. In its wider significance, therefore, the verse would mean that God, Master of the Day of Judgement, is also Master of the period and process of reckoning in this life as well as in the next. There is, however, one difference. In this life human actions are often also judged and rewarded by other men—kings, rulers, superiors, etc.; and there is, therefore, always the possibility of error. On the Day of Judgement, however, the mastery of God will be exclusive and absolute and the work of requital will lie entirely in His hands. There will be no error, no undue punishments, and no undue rewards. The verse points out that in spite of the fact that God is the Master of the time of requital, both in this world and the world to come, He has been spoken of in this verse as the Master of the Day of Judgement so that it may be emphasized that on the Day of Judgement He will be the Sole Master.</p><p>The use of the word مالك (Master) in the verse is also intended to point to the fact that God is not like a judge who is bound to give his judgement strictly in accordance with a prescribed law. But, being Master, He can forgive and show mercy wherever and in whatever manner He may like.</p><p>The use of the word \"Master\" thus serves a twofold purpose. On the one hand, it encourages a person who has, in a moment of weakness, committed a sin, not to despair because God, being his Master, has the power to forgive. On the other hand, it serves as a warning against taking undue advantage of God’s mercy. For if as God, the Master could, and no doubt would, forgive, He would also hate to see His servants degraded by sin. God, the Master, inspires man both with hope and with fear, and this is essential for man’s spiritual progress and development.</p><p>The four attributes of God, i.e. (1) رب العالمین (Lord of all the worlds); (2) الرحمن (Gracious); (3) الرحیم (Merciful) and (4) مالك یوم الدین (Master of the Day of Judgement) mentioned in verses 2-4 are fundamental. The other attributes only explain and serve as a sort of commentary upon these four attributes, which are like four pillars on which the Throne of the Almighty rests.</p><p>The order in which these four attributes have been mentioned here throws light on how God manifests His attributes to men. It is obvious that the first divine attribute to manifest itself to man is that of رب العالمین (Lord of all the worlds) which means that, together with the creation of man, God creates the necessary environment for his spiritual progress and development. Next, the attribute of الرحمن (Gracious) comes into operation, and through this, God, so to speak, hands over to man the means and material required for his moral and spiritual advancement. And when man has made proper use of the means thus granted to him, the attribute of الرحیم (Merciful) comes in to reward his works. Last of all, the attribute of مالك یوم الدین (Master of the Day of Judgement) produces the final and collective result of man’s labour; and the process finds consummation in him being granted spiritual dominion over the world, as is granted to the chosen ones of God. This is what may be called the descent of God towards man.</p><p>On the other hand, when man begins to ascend towards God, the process is reversed. In this process, man, first of all, becomes the mani­festation of the attribute of مالك (Master); he begins to manifest in himself the attribute of عدل or justice, tempering it with mercy and for­giveness. Having developed in his person the attribute of مالك, man reaches the second stage of spiritual progress where he becomes the manifestation of the attribute of الرحیم i.e. he begins to reward the actions of men liberally and generously. This is the stage which is termed احسان or beneficence. The next stage relates to the attribute of الرحمن. Here the sphere of man’s beneficence becomes widespread; his goodness extends to believers and un-believers alike—he begins to treat them just as a mother treats her children, prompted only by a natural instinct and without hope of any return. This stage has been termed ایتاء ذی القربی i.e. doing good to others as one would do to one’s near relatives. Then comes the attribute of رب العالمین which marks the highest stage of man’s spiritual development, when he becomes a manifestation of \"Lord of all the worlds\". At this stage man makes himself responsible for the welfare and guidance of the whole world. He is not satisfied if he or only those who immediately surround him are guided or otherwise provided for, but desires the good of the whole world, and begins to use his God-given powers for the achievement of this great end. This is the philosophy of ھبوط and صعود i.e. the process of Descent and Ascent which has been so beautifully described in these three short verses.</p>"
                }
            ]
        }
    },
    {
        "ch": 1,
        "v": 5,
        "v_": 5,
        "topics": [
            {
                "id": 2071,
                "topic": "Allah: none to be worshipped except",
                "verses": "2:23, 2:84, 4:37, 7:60, 7:74, 7:141, 12:41, 16:37, 17:24, 41:15"
            },
            {
                "id": 4195,
                "topic": "Belief: <i>Iman</i>: of a righteous",
                "verses": "2:178, 2:4-6, 2:63, 2:137-138, 2:166, 2:257, 2:261, 2:286, 3:17, 3:32, 3:54, 3:194, 4:66, 4:137, 4:148, 4:151-153, 5:84, 10:85, 10:100-101, 13:8, 23:110, 29:47, 45:7, 49:15-16, 72:3, 72:14"
            },
            {
                "id": 10888,
                "topic": "Man: purpose of creation",
                "verses": "51:57, 2:132, 4:126, 6:166, 90:5-6"
            },
            {
                "id": 11748,
                "topic": "Moral Traits: humility, humbleness",
                "verses": "49:4, 33:36, 31:20, 31:19, 27:88, 27:38, 23:77, 23:3, 22:55, 22:35, 21:91, 20:135, 20:112, 17:110, 17:38-39, 17:25, 16:49, 12:33, 11:24, 7:162, 7:95, 7:56, 6:64, 6:44, 6:43, 5:55, 3:18, 2:75, 2:46, 25:64, 57:17"
            },
            {
                "id": 18866,
                "topic": "Worship: <i>‘Ibadah</i>",
                "verses": "2:22, 7:32, 22:68"
            }
        ],
        "ar": "اِیَّاکَ نَعۡبُدُ وَ اِیَّاکَ نَسۡتَعِیۡنُ ؕ﴿۵﴾",
        "ur": " تیری ہی ہم عبادت کرتے ہیں اور تجھی سے ہم مدد چاہتے ہیں۔",
        "v5": {
            "text": "[a]Thee alone do we worship and [b]Thee alone do we implore for help.[5]",
            "notes": [
                {
                    "ref": "a",
                    "note": "11:3; 12:41; 16:37; 17:24; 41:38."
                },
                {
                    "ref": "b",
                    "note": "2:46, 154; 21:113."
                },
                {
                    "ref": "5",
                    "note": "<p><strong>Important Words:</strong></p><p>نعبد (we worship) is derived from عبد. We say عبد اللّٰه meaning: he believed in the Oneness of God and served and obeyed Him with humility and sub-missiveness. عبادة which is the noun-infinitive from عبد signifies humility, submissiveness, obedience and service; the idea is not of simple humility but of complete humility. It also implies belief in God’s Oneness and declaration of it (Aqrab). عبودیة has the same meaning, but عبادة is more intensive and more extensive in its significance (Mufradat). Another meaning of the word is to accept the impress of a thing. In Mufradat we have طریق معبد ای مذلل i.e. a way becomes a way when, on account of constant travelling, it becomes susceptible to the travellers’ footprints. With reference to God the meaning would be \"receiving the impress of His attributes\". عبد means: a man, whether free or slave; a male slave or a bondman (Aqrab); a servant or worshipper of God. عبد الطاغوت means, one who serves or worships the devil (Lane).</p><p><strong>Commentary:</strong></p><p>True worship demands perfect humility and complete submissiveness, and this is not possible unless there is born in the heart of man a state agreeable to it. So a person can worship God in the real sense of the word only when acts of worship are performed with complete humility of heart.</p><p>It should, however, be noted that in Islam عبادة does not merely mean the performance of certain known acts of worship, e.g. Prayer, Fasting, etc. It has a much wider significance. In fact, the Holy Prophet of Islam is reported to have said that any act performed in obedience to God’s commands and to seek His pleasure is an act of <i>‘Ibadah</i>. Says the Holy Prophet: \"If you give a morsel of food to your wife (believing that you are thereby obeying a behest of God), you will find the reward thereof with God\" (Bukhari).</p><p>In the verse the word نعبد has been placed before the word نستعین to signify that after man has become aware of God, his first impulse is to worship Him. The idea of invoking God’s help comes after the impulse to worship. Man wishes to worship God but he finds that for doing so he needs God’s help. That is why the word نستعین is placed after the word عبد. Man should first make up his mind to worship God, then seek His help for carrying out this resolve.</p><p>The word ایاك (Thee alone) has been placed before the words نعبد and نستعین to point to the fact that not only is God alone deserving of worship but that He alone can give the help which man needs to discharge this duty truly and effectively. As long as man is not granted the power and means necessary for his guidance, it is not possible for him to become God’s عبد or servant in the real sense of the word. No man-made law can make man a good and true servant of the Lord; it is only God’s help that can bring about this change in him.</p><p>The use of the plural number in عبد and نستعین directs our attention to two very important points:</p><p>(1) That man is not alone in this world but is part and parcel of the society that surrounds him. He should, therefore, seek not to go alone but to carry others also with him on the path of God.</p><p>(2) That as long as a person does not reform his environment, his own reform cannot make him immune from danger; for a house surrounded by others on fire cannot enjoy security for long. Thus the use of the plural number points to a principle which is of vital importance for the moral, cultural and spiritual uplift of Muslims as well as for their success in missionary and other activities. The principle is a special feature of Islam and remains as important today as it ever was.</p><p>The verse also contains a hint about the eternal controversy whether man is free or predestined to follow a given course of action. Men of learning in all ages have disagreed upon this point, and no solution has yet been found. Some are of the opinion that man is the master of his will and is free to do what he likes, while others believe that freedom of action is an illusion and man only acts in a manner predestined for him. The verse offers an easy solution of this difficult problem.</p><p>The words ایاك نعبد (Thee alone do we worship) which have been put by God in the mouth of man draw our attention to the fact that man is not predestined but free to choose and carry out a course of action as he likes. On the other hand, the words ایاك نستعین (Thee alone do we implore for help) remind us of the fact that, though free, we may yet suffer from constraints and compulsions of various kinds. The prayer, <i>Thee alone do we implore for help</i>, implies that God keeps a watch over our actions and takes steps to remove the constraints which keep us from the path He calls upon us to tread.</p><p>The Christian doctrine that man has inherited sin from Adam and therefore cannot get rid of it without atonement is tantamount to the belief that man is not free but is bound to adopt a course predestined for him. Similarly, the Hindu doctrine of transmigration of souls is also a form of predestination. That man’s state in the present life is the result of his actions in a previous life, only means that man is bound to follow the course to which he is prenatally destined. Of modern thinkers, Freud, the famous Austrian psychologist, has also lent powerful support to this view. He has tried to show that the adult has his actions determined by the environment and experiences through which he passes in early childhood. Unable to shed the influence of his early days, the adult is not free. True, early environment exerts an influence on the later life. The Holy Prophet of Islam, fourteen hundred years ago, drew attention to the fact that one’s childhood environ­ment exerts a distinct influence on adulthood. Says he: \"A child is born in the likeness of Islam; it is his parents that make him a Christian, a Jew or a Fire-worshipper\" (Bukhari). In spite of this, Islam repudiates the idea that man is not free. It is commonly seen that later in one’s life, one often outgrows the atmos-phere and ideas of his childhood and instead adopts a course of life quite different from the life he would have lived if he had not outgrown those ideas.</p><p>There is yet another point to be cleared about this verse. In the first four verses of this chapter, God is spoken of in the third person, but in this verse He is suddenly addressed in the second person. This abrupt change from the third to the second person may appear to be an example of bad grammar. Nothing of the kind. A thoughtful contemplation of the divine attributes in the first four verses brings to the mind of the worshipper such an attractive picture of his Creator that he feels irresistibly drawn towards Him, and this, coupled with the realization of His presence, makes him address his Lord and invoke His assistance in a supplicatory tone. The Quran is not a book of philosophy but has been sent to bring about a change in man and to open up to him avenues of spiritual progress. Therefore, its style is made to fit in with the nature of man and with his innermost feelings. The contemplation of the four attributes creates in man such an irresistible longing for his Creator and such an intense desire to offer his whole-hearted devotion to Him that, in order to satisfy this longing of the soul, the third person used in the first four verses has been changed to the second in the fifth verse. It is to this point that the Holy Prophet has beautifully alluded in a hadith. Says he: \"Allah has divided the chapter <i>As-Salat</i> equally between man and Himself, the first half belongs to Allah, the second to His servant. When, therefore, a man offers this prayer to God from the fullness of his heart and asks for something, the same is given to him\" (Muslim).</p>"
                }
            ]
        }
    },
    {
        "ch": 1,
        "v": 6,
        "v_": 6,
        "topics": [
            {
                "id": 8247,
                "topic": "Guidance: prayer for",
                "verses": "3:9"
            },
            {
                "id": 14104,
                "topic": "Prayers of the Holy Qur’an: for guidance",
                "verses": "3:9, 18:11"
            },
            {
                "id": 17229,
                "topic": "Straight Path",
                "verses": "2:109, 2:171, 2:214, 2:273, 3:52, 3:102, 4:68-69, 4:176, 5:17, 6:40, 6:88, 6:154, 6:162, 10:26, 11:57, 14:2-3, 16:77, 16:122, 19:37, 19:44, 20:136, 22:55, 23:74-5, 24:47, 36:5, 36:62, 37:119, 42:53, 43:44, 43:62, 43:65, 46:31, 48:3, 48:21, 67:23"
            }
        ],
        "ar": "اِہۡدِ نَا الصِّرَاطَ الۡمُسۡتَقِیۡمَ ۙ﴿۶﴾",
        "ur": "ہمیں سیدھے راستہ پر چلا۔",
        "v5": {
            "text": "Guide us in [a]the right path,[6]",
            "notes": [
                {
                    "ref": "a",
                    "note": "19:37; 36:62; 42:53, 54."
                },
                {
                    "ref": "6",
                    "note": "<p><strong>Important Words:</strong></p><p>اھد (guide) is derived from ھدی. ھداه means: he guided him. ھداه الطریق or ھداه الی الطریق or ھداه للطریق means, he showed him the right path and made it known to him. ھدی فلانا means: he led the way for him. The word ھدی is also sometimes used intransitively. They say ھدی الرجل i.e. the man became rightly guided. The infinitive form الھدی is generally used in three different senses:</p><p>(1) to show the right path,</p><p>(2) to lead to the right path,</p><p>(3) to make one follow the right path (Aqrab, Mufradat &amp; Baqa).</p><p>In the Quran, the word has been used in all these different senses. Thus, in the Quran we read:</p><p>(1) وھدینٰه النجدین i.e. We showed him the two highways of good and evil. (90:11).</p><p>(2) والذین جاھدوا فینا لنھدینھم سبلنا i.e. Those who strive in Our cause, We will assuredly lead them to Our ways. (29:70).</p><p>(3) الحمد للّٰه الذی ھدٰنا لھذا i.e. All praise belongs to Allah Who has guided us to this (His Paradise), which means: He made us follow the right path till we reached Heaven (7:44).</p><p>In another place, the Quran says:</p><p>والذین اھتدوا زادھم ھدی meaning: those who accept His guidance, God increases them in guidance and leads them on to higher and higher stages of it, till they reach their destination (47:18).</p><p>صراط (path) is also written with س. It means a path which is even and can be trodden without difficulty (Mufradat).</p><p>مستقیم (right) is derived from قام i.e. he stood up erect, or he stood still. استقام means: it became straight and even; it had the right direction. مستقیم therefore means: straight, undeviating and without any crookedness; right; rightly directed (Mufradat &amp; Lane).</p><p><strong>Commentary:</strong></p><p>The prayer taught in this short verse is so perfect and so comprehensive that it has no parallel in any other religion. In the first place, the verse teaches that paths are of two kinds: (1) even and straight, and (2) uneven and crooked, and the attention of a true believer is drawn to the fact that he should always be on the look out to take the straight path and reject the crooked one.</p><p>Again, sometimes a man is shown the right path but is not led up to it, or, if he is led up to it, he fails to stick to it and follow it to the end. The prayer embodied in this verse requires us not to be satisfied with being shown a path, or even with being led up to it, but ever to go on following it till we reach the destination.</p><p>Another aspect of this wonderful prayer is that it is not confined to things spiritual or to things of this world only, but covers the entire field of human requirements, both spiritual and temporal. This makes the prayer truly comprehensive. A Christian prays only for his \"daily bread,\" but a Muslim is enjoined to make his prayer cover the entire field of his requirements, material or spiritual. Moreover, as hinted above, this prayer is not confined to man’s present requirements but extends to his future requirements also. It is a wonderful prayer, which even a non-Muslim may use without contravening any of his religious views. In fact, many non-Muslims have used this prayer and benefited from its marvellous efficacy.</p><p>It has been objected that Muslims offer this prayer in their daily Prayers and their constant prayer for the right path shows that they have not yet found it. This objection springs from sheer ignorance. As already explained, this verse teaches a Muslim to pray not only that God may show him the right path, not merely that He may lead him to it, but that He may enable him to go on praying till he reaches the goal. In fact, man needs God’s help at every step and at every moment, and it is imperative that he should ever be offering to God the supplication embodied in the verse. Constant praying, therefore, is not only unobjectionable, it is absolutely necessary. To say that the repetition of this comprehensive prayer is futile is simply absurd. As long as we have unfulfilled requirements, unsatisfied needs and unattained goals, we stand in need of this prayer; and what prayer can be more comprehensive and pithier than this?</p>"
                }
            ]
        }
    },
    {
        "ch": 1,
        "v": 7,
        "v_": 7,
        "topics": [
            {
                "id": 1203,
                "topic": "Allah: attributes of, <i>Asma’ul-Husna</i>",
                "verses": "1:1, 2:256, 7:181, 17:111, 20:9, 37:160-161, 59:23-25, 112:2-5, See also Attributes of Allah"
            },
            {
                "id": 3414,
                "topic": "Attributes of Allah: Al-Mun‘im (Bestower of Favours)",
                "verses": "4:70, 5:21, 19:59, 89:16"
            },
            {
                "id": 5560,
                "topic": "Dallin: astray",
                "verses": "2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:28, 13:34, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:5, 22:10, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:33, 37:72, 38:27, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            },
            {
                "id": 9274,
                "topic": "In‘am: favour",
                "verses": "4:70, 2:272, 3:137, 11:11, 16:122, 31:21, 37:76, 44:28, 73:12, 82:14, 89:16"
            },
            {
                "id": 9496,
                "topic": "Islam: spiritual rewards",
                "verses": "4:70, 57:20"
            },
            {
                "id": 10694,
                "topic": "Maghdub",
                "verses": null
            },
            {
                "id": 11197,
                "topic": "Mercy: Allah’s mercy",
                "verses": "1:1, 2:38, 2:65, 2:106, 2:129, 2:158, 2:179, 2:188, 2:219, 3:9, 3:75, 3:108, 3:129, 3:133, 3:158, 4:27-28, 4:84, 4:93, 4:97, 4:114, 4:172, 4:176, 5:40, 5:72, 6:13, 6:17, 6:55, 6:134, 6:148, 6:156, 7:57-58, 7:64, 7:73, 7:152, 7:155-157, 7:205, 9:21, 9:99, 10:22, 10:87, 11:10, 11:44, 11:74, 11:120, 12:65, 16:65, 17:9, 17:55, 17:58, 17:88, 18:17, 18:59, 39:54"
            },
            {
                "id": 12152,
                "topic": "Mother of: <i>Umm...</i>: ul-Kitab",
                "verses": "43:5"
            },
            {
                "id": 12902,
                "topic": "Ni‘mat: favours",
                "verses": "2:41, 2:48, 2:123, 2:151, 2:212, 2:232, 3:104, 3:172, 3:175, 4:70, 5:4, 5:7-8, 5:12, 5:21, 5:111, 8:54, 12:7, 14:7, 14:29, 14:35, 16:19, 16:54, 16:72-73, 16:84, 16:122, 19:59, 26:23, 27:20, 28:18, 31:32, 33:10, 35:4, 37:58, 39:9, 39:50, 46:16, 48:3, 49:9, 52:30, 54:36, 68:3, 68:50, 93:12"
            },
            {
                "id": 14104,
                "topic": "Prayers of the Holy Qur’an: for guidance",
                "verses": "3:9, 18:11"
            },
            {
                "id": 14516,
                "topic": "Prophethood: continuity of",
                "verses": "7:36, 4:70, 22:76"
            },
            {
                "id": 16509,
                "topic": "Servant: of God",
                "verses": "25:64-77, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:82, 37:161, 38:18, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 66:11, 89:30"
            }
        ],
        "ar": "صِرَاطَ الَّذِیۡنَ اَنۡعَمۡتَ عَلَیۡہِمۡ ۬ۙ غَیۡرِ الۡمَغۡضُوۡبِ عَلَیۡہِمۡ وَ لَا الضَّآلِّیۡنَ ٪﴿۷﴾",
        "ur": "ان لوگوں کے راستہ پر جن پر تُو نے انعام کیا۔ جن پر غضب نہیں کیا گیا اور جو گمراہ نہیں ہوئے۔",
        "v5": {
            "text": "The path of [a]those on whom Thou hast bestowed <i>Thy</i> blessings, those who have not [b]incurred <i>Thy</i> displeasure, and those who have not [c]gone astray.[7]",
            "notes": [
                {
                    "ref": "a",
                    "note": "4:70; 5:21; 19:59. "
                },
                {
                    "ref": "b",
                    "note": "2:62, 91; 3:113; 5:61, 79. "
                },
                {
                    "ref": "c",
                    "note": "3:91; 5:78; 18:105."
                },
                {
                    "ref": "7",
                    "note": "<p><strong>Important Words:</strong></p><p>انعمت (Thou hast bestowed blessings) is derived from نعم which means, he became well off. نعم عیشه means: his life became happy and full of comfort and ease. انعم فلانا or انعم علی فلان means: he made his life comfortable; he bestowed favour on him. نعمة means: favour, blessing; anything which affords happiness (Aqrab). The word انعام is used with reference to rational beings only. For instance, we would say انعم علی عبدہ i.e. he bestowed a favour on his slave or servant, and not انعم علی فرسه i.e. he bestowed a favour on his horse (Mufradat).</p><p>المغضوب (those who have incurred displeasure) is derived from غضب which means: he was angry, he showed anger. غضب علیه means: he was angry with him, he was wrathful against him, his anger and wrath being combined with the intention of punishing or retaliating (Aqrab &amp; Mufradat).</p><p>الضالین (those gone astray) is derived from ضل which means: he went astray, he lost his way, he deviated from the right path. ضل سعیه means: his effort was lost, being unsuccessful. ضل الرجل means: the man perished and his body became converted into dust (Aqrab). The word ضلالة is also used to indicate the state of being engrossed or lost in some effort or pursuit. Says the Quran:</p><p>الذین ضل سعیھم فی الحیوة الدنیا</p><p>i.e. those whose labour is all lost in search after things pertaining to the life of this world (18:105).</p><p>Again: ووجدک ضالا فھدی i.e. and He (God) found thee engrossed in search (after Him), so He showed thee the way (93:8).</p><p><strong>Commentary:</strong></p><p>In the last verse, God taught us to pray for guidance to the right path. In the present verse the idea has been further advanced by adding the words, <i>the path of those on whom Thou hast bestowed Thy blessings</i>. This has been done with a twofold purpose:</p><p>1. That a true believer should not be satisfied with only being guided to the right path or with performing certain acts of righteousness. He should set his goal higher, and try to attain to a position in which God begins to bestow His special favours on His servants. He should not merely pass the test but excel in it.</p><p>2. That a true believer should look up to the historical examples of divine favours and receive en-couragement from them. But he is not to stop at that particular point. He should try to join the favoured company and become one of them. And as the topmost in a class is still one of the class, the goal set before a believer is very high indeed.</p><p>For a description of الذین انعمت علیھم i.e. the favoured ones, we read elsewhere in the Quran: فاولئك مع الذین انعم اللّٰه علیھم من النبیین والصدیقین والشھداء والصالحین i.e. those who believe in God and follow the Prophet are among the favoured ones—the Prophets, the truthful, the martyrs and the righteous (4:70).</p><p>Here the favoured ones have been divided into four classes, the topmost being the Prophets and the lowermost the righteous. Thus a Muslim has been enjoined to pray to God for the bestowal of such spiritual favours upon him as may enable him to belong to one of these favoured classes. Even the highest favours, pertaining to prophethood are not denied to Muslims. This indeed is a lofty goal!</p><p>The point needs further elaboration. The verse, as hinted above, beautifully points out that a Muslim should not only desire mere virtue but should aim at inclusion in the class of men who have won the special favours of God. One who loves God does not remain content with an inferior state. Love of the Supreme Being engenders in the heart of man such a burning aspiration that he is not satisfied with an ordinary stage of progress. Indeed, one who understands God cannot look upon any stage of progress as final. Not only is the desire for unending progress found in the heart of the true believer, but God Himself wishes man not to remain content with a low stage, but to pray for ever-increasing righteousness; the righteousness of those who have won special prizes.</p><p>As already pointed out, the word انعام (favour) is not confined to any particular gift but includes everything which is given to a person as a token of pleasure, be it worldly or spiritual.</p><p>Again, though every favour is a divine blessing, it cannot be denied that there are certain favours which particularly deserve to be so called, for they rank among the topmost favours. The Quran says, <i>And remember when Moses said to his people, O my people, call to mind Allah’s favour upon you when He appointed Prophets among you and made you kings and gave you what He gave not to any other among the peoples</i> (5:21). This verse pointedly refers to the things which can be held to be special favours for man; and the Israelites are told that they have been given a goodly portion of all these favours.</p><p>Human excellences are of three kinds: (1) worldly and personal, (2) spiritual and personal, and (3) worldly or spiritual excellences in relation to others, i.e. excellences that are of a relative nature and pertain to the superiority of an individual or a people relative to others. A man naturally likes to attain this last kind of excellence also, which confers upon him a superiority over his rivals and compatriots. In the verse quoted above (i.e. 5:21) Moses ascribes all these three kinds of favours to the Israelites:</p><p>(1) They received worldly favours, so much so that they remained rulers of a land for a long time. All worldly excellences require kingship or government administration for their right growth and development, and a people who become rulers get this important means of development, irrespective of whether they benefit by it or not. The very fact that kingship is granted to a people means that all avenues of worldly progress are thrown open and made secure for them.</p><p>(2) They also received high spiritual favours. Just as kingship is a means of attaining worldly greatness and constitutes its culminating point, prophethood is the means of attaining spiritual greatness and constitutes the culminating point of spiritual progress. This is why Moses tells his people that prophethood, the greatest spiritual favour, has also been conferred upon them. Indeed they were granted this favour through a long series of Prophets.</p><p>(3) The third class of favours being relative, Moses most fittingly tells his people that God <i>gave you what He had not given to any other among the peoples</i>. In the above expression, though the idea is that of Moses, the words are Quranic and, as usual, the Quran has combined brevity of words with vastness of meaning in a manner which cannot fail to impress a thoughtful person.</p><p>The words: <i>the path of those on whom Thou hast bestowed Thy blessings</i>, coming after the words: <i>Guide us in the right path</i>, greatly enhance the significance of the former. The words indicate that the objective of a Muslim is not to merely pray that God show him the right way. They direct him to pray for loftier objects and to implore God that He may not only show him the ways of guidance but that He may lead him to those special paths of spiritual knowledge which had been revealed to the favoured ones before him. By raising such high aspirations in the minds of the believers, God has indeed conferred a great boon on Muslims.</p><p>Although in the presence of this clear and plain teaching it is not necessary to give any further evidence to show that the doors to every kind of progress have been thrown open to the believers, yet, as the latter-day Muslims have generally given way to despair, it is necessary to turn to the Quran to see what it means by prayer for the grant of favours, and whether it holds out any promise of the acceptance of this prayer. As partly quoted above, we read in 4:67-70: <i>And if they had done what they are exhorted to do, it would surely have been better for them, and conducive to greater strength, and then We would have surely given them a great reward from Ourself, and We would have surely guided them in the right path. And whoso obeys Allah and this Messenger </i>(<i>of His</i>)<i>, shall be among those on whom Allah has bestowed His blessings, namely, the Prophets, the truthful, the martyrs, and the righteous, and excellent companions are these</i>.</p><p>The above-quoted verse clearly speaks of the favours that are in store for the true Muslims and uses the very words which occur in the verse under comment, <i>viz</i>. <i>the path of those on whom Thou hast bestowed Thy blessings</i>. As already noted, the recipients of blessings have been explained to mean <i>the Prophets, the truthful, the martyrs and the righteous</i>. This shows that the divine gifts which Muslims are asked to pray for embody the highest stages of spiritual progress, and the Quran informs us that all these stages are attainable, and indeed will be attained, by Muslims.</p><p>The objection is sometimes raised that while prophethood is a موھبة i.e. a free gift and not a کسب i.e. something to be earned, it is meaningless to offer any prayer for its attainment. The answer to this objection is that a Muslim does not pray particularly for the gift of prophethood. He only prays in a general way and implores God to bestow the highest spiritual favours on Muslims, and it rests with God to confer His favours on whomsoever He pleases. The Quran says, <i>Allah knows best where to place His message</i> (6:125), i.e. He alone knows whom to make His Messenger. This is why God has taught this prayer in the plural number, saying <i>Guide us</i>, and not \"Guide me\"—to point out that prayer for such spiritual blessings should be general and not particular. Moreover, though it is true that prophethood is a free gift, yet it is not wholly so, for there is undoubtedly some element of \"earning\" in it, otherwise why was this gift conferred on Muhammad (on whom be peace) and not on Abu Jahl?</p><p>Another objection in this connection is that when the Holy Prophet has been declared to be خاتم النبیین (Seal of Prophets), there is no possibility of any Prophet appearing after him. This objection has also been clearly answered in the verses quoted above (4:67-70); for there the words used are <i>whoso obeys Allah and this Messenger </i>(<i>of His</i>) which definitely means that the spiritual boons, including that of prophethood, promised to Muslims will be given only to such as will obey God and His Messenger—the Holy Prophet; and it is evident that the work of one who is subordinate to the Prophet cannot be considered as separate from the work of the Prophet, nor can such a one bring a new Law. Hence the appearance of a Prophet from among the followers of the Holy Prophet is not inconsistent with the latter’s being the Seal of Prophets. On the contrary, such a Prophet will only complete the significance of خاتم النبیین. But of this we will speak later at its proper place. In short, the verse clearly tells us that the door of the highest spiritual blessings—even that of prophethood—is open to Muslims.</p><p>It should, however, be noted that \"a favour\" or \"a blessing\" spoken of in the verse is not to be understood in the spiritual sense only. It covers the entire field of human activity, and in its wider significance, the prayer includes the seeking of what may be called earthly eminence. Knowledge, honour, power, wealth are all among the favours of God and a true believer may pray for the attainment of these along with the spiritual blessings.</p><p>The latter portion of the verse contains a dreadful warning. Man receives favours from God and then begins to abuse them. Or he loses the right path, encounters a fall, and becomes rejected by God. It is to guard against this danger that the latter portion of the verse contains a warning for mankind in general and for Muslims in particular. God enjoins us to pray that after becoming His favoured ones, we should not incur His displeasure nor stray from the right path, so that our progress, be it spiritual or temporal, may be continuous with no falling back.</p><p>The words المغضوب علیھم and الضالین have been used to denote two kinds of dangers. One is that one should outwardly stick to the right path but lose the inner spirit, retaining the shell without the kernel. The other is that one should lose the path itself and wander away into the wilderness. It is to these two kinds of dangers that the words المغضوب علیھم and الضالین refer. The Holy Prophet said:</p><p>إن المغضوب علیھم الیھود والضالین ھم النصاری i.e. by المغضوب علیھم are meant Jews, and by الضالین Christians (Tirmidhi &amp; Musnad). These words of the Prophet are full of meaning. Not only do they describe the nature of the two dangers but also warn Muslims that if they are not watchful, they may fall a prey to them. They may either lose the spirit of faith just as the Jews did, who stuck to the letter of the Law but lost its spirit; or they may lose the path itself just as the Christians did, who strayed from the true teachings of Jesus and began to tread a different path altogether. The Quran speaks of the wrath of God falling on the Jews time after time (2:62; 2:91; 3:113; 5:61). It also refers to the drifting away of the Christians from the real teaching of Jesus (5:78).</p><p>The words المغضوب علیھم and الضالین also refer to another set of dangers. As is well known, the Holy Prophet had prophesied the second coming of Jesus Christ which meant the coming of a Reformer and a Messiah among Muslims in the spirit and power of Jesus. By using the words المغضوب علیھم, which the Holy Prophet said refer-red to the Jews, the Quran warns Muslims against meeting the fate of the Jews by rejecting the Promised Messiah when he appears among them. This prophecy of the second advent of Jesus has been fulfilled in the person of Hadrat Mirza Ghulam Ahmad of Qadian, the Holy Founder of the Ahmadiyya Movement.</p><p>The other danger is alluded to in الضالین which, according to the Holy Prophet, refers to Christians. The verse foretells a time when Christian nations would dominate the world, and it warns Muslims to be on their guard against the false beliefs and evil culture of these nations. A most dreadful warning, but most deplorably neglected!</p><p>This, the last verse of <i>Al-Fatihah</i>, embodies yet another great prophecy. As we have seen, this chapter was revealed early in Mecca when the Holy Prophet was surrounded by idolaters and Islam had not yet come in contact with either Jews or Christians. Yet the prayer in this verse refers to the danger of Jews and Christians and not to the danger of idolatry. This unexpected omission in the case of idol-worshippers and this unexpected reference to the People of the Book is not without significance. Idol-worship was to be swept out of Arabia and was no longer to be a danger to Islam, but dangers far more formidable were to confront it in the Latter Days—the internal danger of Muslims becoming like Jews, and the external danger of their becoming like Christians. The prophecy in this verse therefore has a threefold significance: (1) it refers to the early extinction of idolatry from Arabia; (2) it speaks of the danger of Muslims drifting into a state like that of Jews, and (3) it alludes to the universal ascendance of Christian nations in the Latter Days, and warns Muslims against adopting their faith and imbibing their culture. All these prophecies have been literally ful­filled.</p><p>The Holy Prophet says that when a Muslim comes to the end of the prayer contained in <i>Al-Fatihah</i>, he should say آمین (Amen), i.e. ‘Accept our prayer, o Lord!’ It is therefore customary with Muslims to say 'Amen' after reciting <i>Al-Fatihah</i>.</p><p><strong>A General Note on the Chapter </strong><i><strong>Al-Fatihah</strong></i></p><p><i>Al-Fatihah</i>, the opening <i>Surah</i> of the Quran, reveals a beautiful order in the arrangement of its words and sentences. It is divided, as the Holy Prophet has said, into two halves. The first half pertains to God, the second to man, and the different parts of each portion correspond to one another in a most remarkable manner. Corresponding to the name اللّٰه (Allah), which stands for the Being possessing all noble attributes, in the first half, we have the words, <i>Thee alone do we worship</i>. In the second half, as soon as the devotee thinks of God as being free from all defects and possessing all perfect attributes, the cry of <i>Thee alone do we worship</i> spontaneously rises from the depths of his heart.</p><p>Again, corresponding to the attribute رب العالمین (Lord of all the worlds) in the first part, we have the words <i>Thee alone do we implore for help</i> in the second part. When a Muslim knows God to be the Lord, i.e. the Creator and Sustainer of the worlds and the Source of all development, he at once takes shelter in Him, saying: <i>Thee alone do we implore for help</i>.</p><p>Again, corresponding to the attribute الرحمن (the Gracious, i.e. the Giver of innumerable blessings, and the Liberal Provider of our needs) in the first part, we have the words <i>Guide us in the right path</i> in the second; for the greatest of the blessings provided for man is guidance which God provides for him by sending revelation through His Messengers.</p><p>Again, corresponding to the attribute الرحیم (the Merciful, i.e. the Giver of the best rewards for man’s works) in the first part, we have the words <i>The path of those on whom Thou had bestowed Thy blessings</i> in the second, for it is <i>Ar-Rahim</i> Who bestows merited blessings on His favoured servants.</p><p>Yet again, corresponding to مالك یوم الدین (Master of the Day of Judgement) in the first half, we have the concluding part of the last verse in the second, viz. <i>those who have not incurred Thy displeasure, and those who have not gone astray</i>. When man thinks of giving an account of his deeds, he dreads failure; so, pondering over the attribute of <i>Master of the Day of Judgement</i>, he begins to pray to God to be saved from His displeasure and from straying from the right path.</p><p>Another special feature of the prayer contained in this chapter is that it appeals to the inner instincts of man in a perfectly natural manner. There are two fundamental motives in human nature which prompt submission, <i>viz.</i> love and fear. Some people are touched by love, while others are moved by fear. The motive of love is certainly nobler but there may be, indeed there are, men to whom love makes no appeal. They will only submit through fear. In <i>Al-Fatihah</i> an appeal has been made to both of these human motives.</p><p>First come those attributes of God which inspire love, i.e. الرب (the Creator and Sustainer of the world), الرحمن (the Gracious) and الرحیم (the Merciful). Then in their wake, as it were, comes the attribute of مالك یوم الدین (Master of the Day of Judgement) which reminds man that if he does not mend his ways and does not respond to love, he should prepare to give an account of his deeds before God. Thus the motive of fear is brought into play side by side with that of love. But as God’s mercy far excels His anger, even the fourth attribute, i.e. that of مالك یوم الدین (Master of the Day of Judgement), which is the only fundamental attribute designed to evoke fear, has not been left without a reference to mercy. In fact, here too God’s mercy transcends His anger, for we are told that we are not appearing before a Judge but before a Master Who has the power to forgive and Who will punish only where punishment is absolutely necessary.</p><p>Similarly, at the end of the prayer, the motives of hope and fear have been brought into play. First God appeals through the motive of love by putting into the mouth of the supplicant the words: <i>Guide us in the right path, the path of those on whom Thou hast bestowed Thy blessings</i>; and then He follows it up with the words: <i>Those who have not incurred Thy displeasure and those who have not gone astray</i>. Thus both the motives of hope and fear have been brought into action. But here too the first appeal is to the motive of love.</p><p>In short, <i>Al-Fatihah</i>, the Opening Chapter of the Quran, is a wonderful storehouse of spiritual knowledge. It is a short chapter of seven brief verses, but it is a mine of knowledge and wisdom. Aptly called the \"Mother of the Book,\" it is the very essence of the Quran.</p><p>Beginning with the name of Allah, the Fountainhead of all blessings, the chapter goes on to narrate the four fundamental attributes of God, i.e. (1) the Creator and Sustainer of the world; (2) the Gracious, Who provides for all the requirements of man even before he is born and without any effort on his part for them; (3) the Merciful, Who determines the best possible results of man’s labour, and Who rewards him most liberally; and (4) Master of the Day of Judgement, before Whom all will have to stand to give an account of their actions, Who will punish the wicked but will not treat His creatures as a mere Judge but as a Master, tempering justice with mercy and Who is eager to forgive whenever forgiveness is calculated to bring about good results. This is the portrait of the God of Islam given in the very beginning of the Quran––a God Whose power and dominion know no bounds and Whose mercy and beneficence have no limitations.</p><p>Then comes the declaration by man that, his God being the possessor of such lofty attributes, he is ready, nay eager, to worship Him and throw himself at His feet in complete sub­mission; however, God knows that man is weak and liable to err, so He mercifully exhorts His servant to seek His help at every step in his onward march and for every need that may confront him.</p><p>Finally comes a prayer—comprehensive and far-reaching––a prayer in which man supplicates his Maker to lead him to the right path in all matters, spiritual or temporal, whether relating to his present or future needs. He prays to God that he may not only withstand all trials but, like the chosen ones of God, do so with credit and become the recipient of His most bounteous favours; that he may forever go on treading the right path, pressing on nearer and yet nearer to his Lord and Master without stumbling on the way, as did many of those who have gone before. This is the theme of the Opening Chapter of the Quran which is constantly repeated, in one form or another, in the main body of the Book which we are now approaching.</p>"
                }
            ]
        }
    }
]
