[
    {
        "ch": 50,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[3855]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                },
                {
                    "ref": "3855",
                    "note": "<p><strong>Commentary:</strong></p><p>See 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 68,
                "topic": "Abbreviations: <i>Qaf</i>",
                "verses": null
            },
            {
                "id": 13136,
                "topic": "Oaths: <i>yamin</i>: of Allah",
                "verses": "4:66, 15:73, 15:93, 16:57, 16:64, 36:3, 37:2-4, 38:2, 43:2-3, 44:2-3, 51:2-8, 51:24, 52:2-7, 53:2, 56:76, 68:2, 69:39, 69:40, 70:41, 74:33, 74:35, 75:2-3, 77:2-6, 79:2-6, 81:16-19, 84:17-19, 85:2-4, 86:2, 86:12-13, 89:2-5, 90:2, 90:4, 91:2-8, 92:2-4, 93:2-3, 95:2-4, 100:2, 103:2-3"
            }
        ],
        "ar": "قٓ ۟ۚ وَ الۡقُرۡاٰنِ  الۡمَجِیۡدِ ۚ﴿۲﴾ ",
        "ur": "قَدِیر: کامل قدرت رکھنے والا۔ عزت والے قرآن کی قَسم!",
        "v5": {
            "text": "Qaf. By [b]the Glorious Quran, <i>thou art a Messenger of God</i>.[3856]",
            "notes": [
                {
                    "ref": "b",
                    "note": "56:78."
                },
                {
                    "ref": "3856",
                    "note": "<p><strong>Important Words:</strong></p><p>The letter ق (<i>Qaf</i>) may stand for the Divine attribute قادر or قدیر (<i>Qadir</i> or <i>Qadir</i>) which means, the Mighty God; or the letter may stand for القیامة حق i.e. the Resurrection is an undoubted reality. This is the last abbreviated letter used in the Quran and therefore possesses a special significance. For a detailed explanation, however, of the abbreviated letters (المقطعات) see 2:2 &amp; 19:2.</p><p>The letter و (by) among other things may mean, 'by' or 'I swear' or 'I cite as witness or evidence.' See also 37:2.</p><p>المجید (Glorious) is derived from مجد (<i>majada</i>) which means, he was or became possessed of or characterized by glory, honour, dignity, nobility, etc. or he was or became glorious, in a state of honour, dignity; noble. مجدتالابل means, the camels fed in a land abounding with pasture, and satiated themselves therewith, or lighted upon abundant herbage. أمجدہ means, he made it (a gift) large or abundant. They say أمجدنا فلان قری i.e. such a one gave us a sufficient and superabundant entertainment. The Arabs say أمجدہ سباً و ذماً i.e. he reviled and dispraised him much. أمجد الدایة means, he gave the beast of carnage much fodder. Thus the primary signification of the root word is abundance or superabundance. مجد (<i>majdun</i>) means, glory, honour, dignity, nobility; (syn. شرف و عز &amp; کرم) or ample glory, nobility, honour, dignity, etc., or the acquisition of glory, honour, etc., or acquired or personal glory, honour, etc., transmitted by one’s ancestors. مجید means, a man possessing or characterized by glory, honour, dignity; nobility. المجید as an epithet of God signifies the Glorious or Great in dignity, Who gives liberally or bountifully.مجید is also applied in the Quran as an epithet to the Throne (عرش) of God and to the Quran itself and signifies exalted, sublime, noble, glorious (Lane &amp; Aqrab). Sec also 38:2. The words القرآن المجید thus may mean, the Glorious Quran, the great Quran, the Quran possessing great and abundant good. In the last sense the word مجیدmay be synonymous with مبارک which is also one of the epithets used by the Quran for itself (6:156). Elsewhere the Quran has been called the Quran full of wisdom (36:3), the Quran full of exhortation (38:2), the Noble Quran (56:78), the Quran which explains things fully (12:3).</p><p><strong>Commentary:</strong></p><p>The construction of this verse exactly resembles that of 38:2. Taking the abbreviated letter ق as signifying 'the Powerful God,' the versemay mean that the Powerful God swears by the Quran, or that He cites the Quran as witness, that by acting upon its teaching and making it a rule of their lives, its followers will achieve glory, greatness and spiritual and material grandeur. And by taking the letter as signifying القیامة حق i.e. the Resurrection is an undoubted reality, the verse would signify that Resurrection will certainly take place and that the Glorious Quran can be cited as an evidence to prove this claim. The proof consists in the fact: (1) that the Quran has made two claims, viz. that by acting upon its teaching the weak, oppressed and persecuted followers of the Holy Prophet will achieve glory, greatness and spiritual and material eminence and an honoured place in the comity of the world’s great nations; and (2) that Resurrection will undoubtedly take place. The fulfilment of the first prophecy, the verse implies, will substantiate and establish the truth of the second claim.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 3,
        "v_": 2,
        "topics": [],
        "ar": "بَلۡ عَجِبُوۡۤا اَنۡ جَآءَہُمۡ مُّنۡذِرٌ مِّنۡہُمۡ فَقَالَ  الۡکٰفِرُوۡنَ ہٰذَا شَیۡءٌ عَجِیۡبٌ ۚ﴿۳﴾ ",
        "ur": "حقیقت یہ ہے کہ انہوں نے تعجب کیا کہ خود انہی میں سے ایک ڈرانے والا ان کے پاس آیا ہے۔ پس کافر کہتے ہیں کہ یہ عجیب بات ہے۔",
        "v5": {
            "text": "But they wonder that there has come to them a Warner from among themselves.[a] And the disbelievers say, ‘This is a strange thing.’[3857]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:64."
                },
                {
                    "ref": "3857",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that in spite of the fact that from time immemorial God has been sending His Messengers and Prophets to guide men to the path of truth and righteousness, the people, whenever there appeared a Prophet, wondered, and considered it highly improbable that God should commission as His Messenger an ordinary man from among themselves. This attitude of disbelievers towards Divine Messengers has been referred to at several other places also in the Quran (7:64; 10:3; 38:5).</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 6834,
                "topic": "Dust: bones turned into",
                "verses": "56:48, 13:6, 23:36, 23:83, 27:68, 37:17, 37:54"
            }
        ],
        "ar": "ءَاِذَا مِتۡنَا وَ کُنَّا تُرَابًا ۚ ذٰلِکَ رَجۡعٌۢ بَعِیۡدٌ ﴿۴﴾ ",
        "ur": " کیا جب ہم مرجائیں گے اور مٹی ہوجائیں گے؟ وہ لَوٹنا ایک دُور کی بات ہے۔",
        "v5": {
            "text": "‘What! when we are dead and have become dust, <i>shall we be raised up again</i>?[b] That is a return far <i>from possible</i>.’[3858]",
            "notes": [
                {
                    "ref": "b",
                    "note": "13:6; 23:36; 27:68; 37:17."
                },
                {
                    "ref": "3858",
                    "note": "<p><strong>Commentary:</strong></p><p>Greater is the disbelievers’ wonder at the idea, says the verse, that when they are dead and are reduced to dust, they will get a new life.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 4597,
                "topic": "Book: <i>Kitab</i>: <i>Kitabul-Hafiz</i>",
                "verses": null
            },
            {
                "id": 4619,
                "topic": "Book: <i>Kitab</i>: repository of Divine knowledge",
                "verses": "10:62, 2:3, 3:4, 4:106, 5:49, 6:39, 6:60, 6:93, 7:3, 11:7, 22:71, 27:76, 34:4"
            },
            {
                "id": 17031,
                "topic": "Soul: <i>Ruh</i>, spirit: immortality of",
                "verses": "4:172, 39:43"
            }
        ],
        "ar": "قَدۡ عَلِمۡنَا مَا تَنۡقُصُ الۡاَرۡضُ مِنۡہُمۡ ۚ وَ عِنۡدَنَا کِتٰبٌ  حَفِیۡظٌ ﴿۵﴾ ",
        "ur": "ہم خوب جانتے ہیں کہ زمین ان میں سے کیا کم کررہی ہے اور ہمارے پاس ایک محفوظ رکھنے والی کتاب ہے۔",
        "v5": {
            "text": "We know how much the earth diminishes of them <i>and how much it adds to them,</i> and with Us is a Book that preserves <i>everything</i>.[3859]",
            "notes": [
                {
                    "ref": "3859",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse refutes the disbelievers’ objection mentioned in the preceding verse, viz. that when they are dead and reduced to broken bones and particles of dust they would be raised again. It is the physical body, says the verse, that disintegrates and perishes. The soul is imperishable and will be given a new body to account for the deeds done in this world which are recorded in \"a Book that preserves everything.\" The verse may also mean that even the particles of objects which the earth disintegrates are well preserved in God’s knowledge. It may also signify that as complete knowledge about all the details of a thing presupposes the power to create it, and God being the Possessor of full knowledge of human anatomy and the process of its disintegration could recreate it after it had perished.</p><p>The verse may also signify that just as the earth corrupts and swallows up dead bodies, it also possesses the means of nourishing living ones.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 6,
        "v_": 5,
        "topics": [],
        "ar": "بَلۡ کَذَّبُوۡا بِالۡحَقِّ لَمَّا جَآءَہُمۡ فَہُمۡ  فِیۡۤ اَمۡرٍ  مَّرِیۡجٍ ﴿۶﴾ ",
        "ur": "بلکہ انہوں نے حق کو جھٹلا دیا جب وہ اُن کے پاس آیا پس وہ ایک الجھاؤ والی بات میں پڑے ہوئے ہیں۔",
        "v5": {
            "text": "Nay, they rejected the truth when it came to them, and so they are in a state of confusion.[3860]",
            "notes": [
                {
                    "ref": "3860",
                    "note": "<p><strong>Important Words:</strong></p><p>مریج (state of confusion) is derived from مرج (<i>maraja</i>) which means, he mixed a thing with another thing or two things together. مرج الامر (<i>marija</i>) means, the affair became corrupt, spoiled, disordered or in a confused or disordered state. مرج الناسmeans, the people became confused so that they could not extricate themselves from their perplexity (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse means that though disbelievers always reject the Divine Message, their rejection or denial does not rest on sure ground. They are always in a confused state of mind. They do not know what they should make of the Message. They call it poetry, sorcery, the day-dreaming of an ambitious visionary, the confused vapourings of an unhinged mind, or the forgery of an impostor (21:6). But the Holy Prophet and his followers stand on the bedrock of certainty and sure knowledge.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 781,
                "topic": "Adornment: <i>Zinah</i>: of heavens",
                "verses": "7:32-33, 15:17, 22:24, 37:7, 41:13, 67:6"
            },
            {
                "id": 1332,
                "topic": "Allah: created Heavens and earth",
                "verses": "41:10-13, 2:165, 3:191, 6:2, 7:55, 10:4, 10:7, 11:8, 14:33, 25:3, 25:60, 29:62, 30:23, 31:11, 32:5, 35:4, 38:28, 39:63, 40:63, 43:10, 44:39, 46:4, 50:39, 57:5, 65:13, 67:4, 71:16-18"
            },
            {
                "id": 4181,
                "topic": "Beauty: in physical world, <i>Bahjah</i>, <i>Zinah</i>,",
                "verses": "16:9, 7:32-33, 10:89, 11:16, 16:7, 18:8, 18:29, 18:47, 20:88, 22:6, 27:61, 28:80, 33:29, 37:7, 41:26, 49:8, 57:21"
            },
            {
                "id": 5324,
                "topic": "Cosmology",
                "verses": "79:28-31, 21:31, 35:42, 78:13-14, 81:12, 84:4"
            },
            {
                "id": 8537,
                "topic": "Heaven: <i>Sama’</i>",
                "verses": "2:36, 21:17, 21:31, 22:66, 51:8, 51:48, 55:88, 67:4, 78:20, 81:12"
            },
            {
                "id": 8596,
                "topic": "Heaven: <i>Sama’</i>: adorned lower",
                "verses": "15:17, 25:62, 37:7, 41:13, 67:6, 85:2"
            }
        ],
        "ar": "اَفَلَمۡ  یَنۡظُرُوۡۤا  اِلَی السَّمَآءِ  فَوۡقَہُمۡ کَیۡفَ بَنَیۡنٰہَا وَ زَیَّنّٰہَا وَ مَا لَہَا مِنۡ فُرُوۡجٍ ﴿۷﴾ ",
        "ur": "کیا انہوں نے اپنے اوپر آسمان کو نہیں دیکھا کہ ہم نے اسے کیسے بنایا اوراسے زینت دی اور اس میں کوئی رخنہ نہیں؟",
        "v5": {
            "text": "Have they not looked at the sky above them, how We have made it and adorned it,[a] and there are no flaws in it?[3861]",
            "notes": [
                {
                    "ref": "a",
                    "note": "15:17; 37:7; 41:13; 67:6."
                },
                {
                    "ref": "3861",
                    "note": "<p><strong>Important Words:</strong></p><p>فروج (flaws) is the plural of فرج which means, a cleft, an opening, a gap, and hence a flaw or defect (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>This and the following few verses draw attention to the marvels of creation, the wonderful design in the universe, to the celestial firmament with its countless beautiful planets and stars, to earth and its wide expanse teeming with human and animal life, and points to the inevitable inference that the Great and Wise Designer, the Architect and the Controller, Who could bring into being this wonderful universe and who placed man at its centre, does possess the power to recreate the universe after its disintegration, and to give man a new life after he is dead.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 1332,
                "topic": "Allah: created Heavens and earth",
                "verses": "41:10-13, 2:165, 3:191, 6:2, 7:55, 10:4, 10:7, 11:8, 14:33, 25:3, 25:60, 29:62, 30:23, 31:11, 32:5, 35:4, 38:28, 39:63, 40:63, 43:10, 44:39, 46:4, 50:39, 57:5, 65:13, 67:4, 71:16-18"
            },
            {
                "id": 4181,
                "topic": "Beauty: in physical world, <i>Bahjah</i>, <i>Zinah</i>,",
                "verses": "16:9, 7:32-33, 10:89, 11:16, 16:7, 18:8, 18:29, 18:47, 20:88, 22:6, 27:61, 28:80, 33:29, 37:7, 41:26, 49:8, 57:21"
            },
            {
                "id": 6889,
                "topic": "Earth: <i>Al-Ard</i>: abode on",
                "verses": "2:30-31, 2:23, 2:37, 4:98, 4:101, 7:25, 11:62, 13:4, 15:20, 27:62, 40:65, 43:11, 51:49, 55:11, 67:16, 71:20, 78:7, 79:31"
            },
            {
                "id": 7005,
                "topic": "Earth: <i>Al-Ard</i>: creations on",
                "verses": "15:20, 2:165, 2:169, 3:84, 3:191, 6:39, 10:24, 10:67, 13:16, 16:16, 16:50, 21:20, 21:32, 22:66, 23:80, 26:8, 27:83, 30:23, 31:11, 31:21, 45:14, 64:4, 71:18"
            },
            {
                "id": 12196,
                "topic": "Mountains: <i>Jibal</i>: created for man",
                "verses": "16:16, 13:4, 15:20, 21:32, 22:19, 24:44, 27:62, 31:11, 35:28, 41:11, 77:28, 78:8, 79:33, 88:20"
            }
        ],
        "ar": "وَ الۡاَرۡضَ مَدَدۡنٰہَا وَ اَلۡقَیۡنَا فِیۡہَا رَوَاسِیَ وَ اَنۡۢبَتۡنَا فِیۡہَا مِنۡ کُلِّ  زَوۡجٍۭ بَہِیۡجٍ ۙ﴿۸﴾   ",
        "ur": "اور زمین کو ہم نے پھیلا دیا اور اس میں مضبوطی سے گڑے ہوئے پہاڑ ڈال دیئے اور ہر قسم کے شاداب جوڑے اس میں اُگائے۔",
        "v5": {
            "text": "And the earth—We have spread it out, and placed therein firm mountains;[b] and We have made to grow therein [c]every <i>kind of</i> beautiful species,",
            "notes": [
                {
                    "ref": "b",
                    "note": "13:4; 15:20; 31:11; 77:28."
                },
                {
                    "ref": "c",
                    "note": "27:61; 31:11."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 9,
        "v_": 8,
        "topics": [],
        "ar": "تَبۡصِرَۃً  وَّ  ذِکۡرٰی لِکُلِّ عَبۡدٍ مُّنِیۡبٍ ﴿۹﴾  ",
        "ur": "آنکھیں کھولنے کے لئے اور ہر ایسے بندہ کے لئے عبرت کے طور پر جو بار بار (اللہ کی طرف) لَوٹنے والا ہے۔",
        "v5": {
            "text": "As <i>a means of</i> enlightenment and as a reminder to every servant that turns <i>to God</i>.[3862]",
            "notes": [
                {
                    "ref": "3862",
                    "note": "<p><strong>Commentary:</strong></p><p>It is logical to assume a purpose behind physical nature. The concept of God as Designer and Creator of all things gives a coherent and complete picture of origin, design and purpose. And the existence of a purpose behind the creation implies the existence of a life after death because the very idea that with the dissolution of its physical tabernacle the human soul suffers death militates against the whole design of God and the purpose in creating the universe.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 1044,
                "topic": "Agriculture: Allah sends down water for",
                "verses": "6:100, 2:23, 10:25, 13:18, 14:33, 16:11-12, 16:66, 18:46, 20:54, 22:64, 25:49-50, 27:61, 32:28, 35:28, 39:22, 79:32"
            },
            {
                "id": 4050,
                "topic": "Barakah: <i>blessings</i>: Allah sent down",
                "verses": "6:156, 6:93, 7:97, 21:51, 33:44, 38:30, 44:4"
            },
            {
                "id": 4063,
                "topic": "Barakah: <i>blessings</i>: on earth",
                "verses": "7:138, 11:74, 21:72, 21:82, 23:30, 24:36, 28:31, 34:19, 41:11"
            },
            {
                "id": 5708,
                "topic": "Date Palms: dates",
                "verses": "36:35, 2:267, 6:100, 6:142, 13:5, 16:12, 16:68, 17:92, 18:33, 19:26, 23:20, 26:149, 55:12, 55:69, 59:6, 80:30"
            },
            {
                "id": 7927,
                "topic": "Garden: earthly",
                "verses": "2:66, 2:267, 6:100, 6:142, 13:5, 18:33, 23:20, 26:135, 34:16, 36:35, 55:63, 68:18, 68:21, 71:13"
            },
            {
                "id": 13537,
                "topic": "Paradise: <i>Jannah</i>: earthly",
                "verses": "2:36, 2:266-267, 6:100, 6:142, 13:5, 17:92, 18:33, 18:34, 18:36, 18:40, 18:41, 25:9, 26:58, 26:135, 26:148, 34:16, 55:47, 68:18, 71:13, 78:17"
            },
            {
                "id": 16300,
                "topic": "Science: climate, wind, rain",
                "verses": "2:165, 7:58, 15:23, 23:19-20, 25:49-50, 30:49, 35:10, 45:6"
            },
            {
                "id": 18487,
                "topic": "Water: <i>Ma’</i>: sent from heaven",
                "verses": "16:11-12, 2:23, 2:165, 6:100, 7:58, 8:12, 10:25, 13:18, 14:33, 15:23, 16:66, 18:46, 22:6, 22:64, 23:19, 27:61, 30:25, 32:28, 35:28, 37:68, 38:58, 39:22, 41:40, 43:12, 55:45, 78:15, 88:6"
            }
        ],
        "ar": "وَ نَزَّلۡنَا مِنَ السَّمَآءِ  مَآءً مُّبٰرَکًا فَاَنۡۢبَتۡنَا بِہٖ جَنّٰتٍ وَّ حَبَّ الۡحَصِیۡدِ ۙ﴿۱۰﴾",
        "ur": "اور ہم نے آسمان سے مبارَک پانی اتارا اور اس کے ذریعہ باغات اور کٹائی کی جانے والی فصلوں کے بیج اُگائے۔",
        "v5": {
            "text": "[d]And We send down from the sky water which is full of blessings, and We produce therewith gardens and grain harvests.",
            "notes": [
                {
                    "ref": "d",
                    "note": "24:44; 25:49."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 5708,
                "topic": "Date Palms: dates",
                "verses": "36:35, 2:267, 6:100, 6:142, 13:5, 16:12, 16:68, 17:92, 18:33, 19:26, 23:20, 26:149, 55:12, 55:69, 59:6, 80:30"
            },
            {
                "id": 16300,
                "topic": "Science: climate, wind, rain",
                "verses": "2:165, 7:58, 15:23, 23:19-20, 25:49-50, 30:49, 35:10, 45:6"
            }
        ],
        "ar": "وَ النَّخۡلَ بٰسِقٰتٍ  لَّہَا طَلۡعٌ  نَّضِیۡدٌ ﴿ۙ۱۱﴾ ",
        "ur": "اور کھجوروں کے اونچے درخت جن کے تہ بہ تہ خوشے ہوتے ہیں۔",
        "v5": {
            "text": "And tall palm-trees, with spathes piled one above the other.[3863]",
            "notes": [
                {
                    "ref": "3863",
                    "note": "<p><strong>Important Words:</strong></p><p>باسقات (tall) is the plural of باسقة , fem. gen. of باسق which is act. part. from بسق. They say بسق النخل i.e. the palm trees were or became tall or exceedingly tall and full grown or they bore fruit. بسق علیھم means, he overcame them, excelled them or was superior to them. بسق فی علمه means, he excelled in his knowledge or learned the whole of it. بسقت الشمس means, the sun rose high. باسق الاخلاق means, a person endowed with noble, moral and mental qualities. نخلة باسقة means, an exceedingly tall palmtree or palm tree bearing fruit (Lane &amp; Aqrab).</p><p>نضید or منضود (piled one above the other) is derived from نضد. They say نضد المتاع i.e. he put goods one upon the other or set them together in regular order or piled them up. تنضدت الاسنان means, the teeth were set in regular order (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 6171,
                "topic": "Dead, Death: <i>Maut</i>: God restores to life",
                "verses": "2:260-261, 2:57, 2:74, 2:244, 6:37, 8:25, 8:43, 22:7, 22:67, 26:82, 30:20, 30:25, 30:51, 36:13, 36:34, 40:12, 41:40, 42:10, 43:12, 46:34, 75:41"
            },
            {
                "id": 14710,
                "topic": "Provisions: worldly",
                "verses": "20:132, 2:241, 2:237, 3:15, 5:97, 8:5, 8:75, 10:60, 10:99, 11:4, 11:7, 11:89, 12:60, 12:66, 14:31, 16:72, 16:76, 17:19, 20:132-133, 22:51, 22:59, 24:27, 28:58, 33:32, 33:50, 34:5, 34:16, 40:40, 42:37, 43:30, 43:36, 45:6, 67:16, 67:22, 79:34"
            },
            {
                "id": 15596,
                "topic": "Resurrection: after death",
                "verses": "23:116, 2:48-49, 5:110, 6:37, 17:50-52, 22:8, 39:68-71, 50:21-24, 71:19, 78:39-40"
            },
            {
                "id": 16300,
                "topic": "Science: climate, wind, rain",
                "verses": "2:165, 7:58, 15:23, 23:19-20, 25:49-50, 30:49, 35:10, 45:6"
            },
            {
                "id": 16554,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:82, 37:161, 38:18, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 66:11, 89:30"
            }
        ],
        "ar": "رِّزۡقًا  لِّلۡعِبَادِ ۙ وَ اَحۡیَیۡنَا بِہٖ بَلۡدَۃً  مَّیۡتًا ؕ  کَذٰلِکَ  الۡخُرُوۡجُ ﴿۱۲﴾ ",
        "ur": "بندوں کے لئے رزق کے طور پر۔ اور ہم نے اُس (یعنی بارش) کے ذریعہ ایک مُردہ علاقہ کو زندہ کردیا۔ اسی طرح خروج ہوگا۔",
        "v5": {
            "text": "As a provision for <i>Our</i> servants; [a]and We quicken thereby a dead land. Even so shall be the Resurrection.[3864]",
            "notes": [
                {
                    "ref": "a",
                    "note": "25:50; 43:12."
                },
                {
                    "ref": "3864",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means that just as God sends down rain from heaven and causes a dry dead land to bloom and blossom and pulsate with a new vigorous life, and brings forth from the earth all sorts of flowers and fruits, similarly He can and will give a new life to man after he is dead so that he might account for and be rewarded or punished for the actions good or bad he might have done in this world.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 13078,
                "topic": "Noah: <i>Nuh(as)</i>: mocked by people",
                "verses": "23:25-27, 7:65, 10:74, 22:43, 25:38, 26:106, 26:118, 38:13, 40:6, 54:10, 71:22"
            },
            {
                "id": 13795,
                "topic": "People of the Well: <i>Ashabur Rass</i>",
                "verses": "25:39"
            }
        ],
        "ar": "کَذَّبَتۡ قَبۡلَہُمۡ قَوۡمُ نُوۡحٍ وَّ اَصۡحٰبُ الرَّسِّ  وَ  ثَمُوۡدُ ﴿ۙ۱۳﴾ ",
        "ur": "اُن سے پہلے نوح کی قوم نے بھی جھٹلایاتھا اور معدنیات والوں نے اور ثمود نے بھی",
        "v5": {
            "text": "[b]The people of Noah rejected <i>the truth</i> before them and <i>so did</i> the People of the Well, and Thamud.[3865]",
            "notes": [
                {
                    "ref": "b",
                    "note": "9:70; 14:10; 38:13; 40:32."
                },
                {
                    "ref": "3865",
                    "note": "<p><strong>Commentary:</strong></p><p>For the People of Noah see 11:26-49; for اصحاب الرس (Companions of the Well) 25:39, and for Thamud 11:62-69.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 568,
                "topic": "‘Ad: people of: destroyed for rejecting truth,",
                "verses": "54:19, 7:73, 9:70, 11:60-61, 25:39, 26:140, 40:31-32, 53:51"
            },
            {
                "id": 591,
                "topic": "‘Ad: people of: rejected Messengers",
                "verses": "38:13, 7:71, 11:54, 11:60, 14:10, 26:124, 41:15, 46:22-23"
            }
        ],
        "ar": "وَ عَادٌ  وَّ  فِرۡعَوۡنُ وَ  اِخۡوَانُ  لُوۡطٍ ﴿ۙ۱۴﴾ ",
        "ur": "اور عاد اور فرعون نے اور لوط کے بھائیوں نے",
        "v5": {
            "text": "And ‘Ad, and Pharaoh and the brethren of Lot.[3866]",
            "notes": [
                {
                    "ref": "3866",
                    "note": "<p><strong>Commentary:</strong></p><p>For ‘Ad see 11:51-61.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 568,
                "topic": "‘Ad: people of: destroyed for rejecting truth,",
                "verses": "54:19, 7:73, 9:70, 11:60-61, 25:39, 26:140, 40:31-32, 53:51"
            },
            {
                "id": 591,
                "topic": "‘Ad: people of: rejected Messengers",
                "verses": "38:13, 7:71, 11:54, 11:60, 14:10, 26:124, 41:15, 46:22-23"
            },
            {
                "id": 13793,
                "topic": "People of Tubba‘: <i>Qaumu Tubba‘</i>",
                "verses": "44:38"
            },
            {
                "id": 13799,
                "topic": "People of the Wood: <i>Ashabul-Aikah</i>",
                "verses": "15:79, 26:177, 38:14"
            },
            {
                "id": 14359,
                "topic": "Promise: warning, <i>Wa‘id</i>",
                "verses": "14:15, 20:114, 50:21, 50:29, 50:46"
            }
        ],
        "ar": "وَّ اَصۡحٰبُ  الۡاَیۡکَۃِ  وَ قَوۡمُ تُبَّعٍ ؕ کُلٌّ کَذَّبَ الرُّسُلَ  فَحَقَّ وَعِیۡدِ ﴿۱۵﴾ ",
        "ur": "اور گھنے درختوں میں بسنے والوں نے اور تُبّع کی قوم نے۔ سب نے رسولوں کو جھٹلا دیا۔ پس میرا اِنذار سچا ثابت ہوگیا۔ ",
        "v5": {
            "text": "[c]And the Dwellers of the Wood, and the people of Tubba‘. [d]All <i>of them</i> rejected the Messengers <i>with the result</i> that My threatened punishment befell <i>them</i>.[3867]",
            "notes": [
                {
                    "ref": "c",
                    "note": "15:79; 26:177; 38:14."
                },
                {
                    "ref": "d",
                    "note": "15:80; 26:140; 38:15."
                },
                {
                    "ref": "3867",
                    "note": "<p><strong>Commentary:</strong></p><p>For اصحاب الأیکة (Dwellers of the Wood) see 15:79 and for the People of Tubba‘ 44:38. The verse purports to say that the above-mentioned peoples were warned by their respective Prophets that if they rejected them, they would be punished in this world and would also have to account for their sins in the next. The first warning was literally fulfilled and, therefore, the second one is also bound to be fulfilled.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 1258,
                "topic": "Allah: can bring a new creation, <i>Khalqan Jadid</i>",
                "verses": "14:20, 4:134, 6:134, 17:50, 17:99, 32:11, 34:8, 35:17"
            },
            {
                "id": 2093,
                "topic": "Allah: not wearied by the care of Heavens and earth",
                "verses": "2:256, 46:34, 50:39"
            }
        ],
        "ar": "اَفَعَیِیۡنَا بِالۡخَلۡقِ الۡاَوَّلِ ؕ بَلۡ ہُمۡ فِیۡ لَبۡسٍ مِّنۡ خَلۡقٍ جَدِیۡدٍ ﴿٪۱۶﴾ ",
        "ur": " کیا ہم پہلی تخلیق سے تھک چکے ہیں؟ نہیں! بلکہ وہ تو تخلیقِ نو کے متعلق بھی شک میں مبتلا ہیں۔",
        "v5": {
            "text": "[a]Have We then become weary with the first creation? Nay, but they are in confusion about the new creation.[3868]",
            "notes": [
                {
                    "ref": "a",
                    "note": "50:39."
                },
                {
                    "ref": "3868",
                    "note": "<p><strong>Important Words:</strong></p><p>عیینا (We have become weary) is derived from عی (‘<i>ayya</i>). They say عی بأمرہ او عن أمرہ i.e. he lacked power, strength or ability to perform or accomplish his affair; was unable to execute it through or found not the right way to do it. عی الامر means, he was ignorant of the affair. أعیا means, he was or became tired, fatigued or wearied عی فی منطقه means, he found not the right way to express himself (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>In these verses \"creation\", besides its ordinary meaning, signifies spiritual awakening or revolution brought about by a Prophet among his people.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 1196,
                "topic": "Allah: answering of prayer by",
                "verses": "2:187, 3:39, 3:196, 6:42, 8:10, 11:62, 12:35, 14:40, 21:85, 21:89, 21:91, 27:63, 34:51, 40:61"
            },
            {
                "id": 1290,
                "topic": "Allah: closer than ones jugular vein, is near",
                "verses": "2:187, 11:62, 34:51, 56:86, 57:5"
            },
            {
                "id": 1364,
                "topic": "Allah: created you",
                "verses": "30:41, 2:22, 2:30, 4:2, 6:103, 7:190, 13:17, 15:29, 15:86, 16:73, 20:56, 21:17, 21:34, 23:13-15, 23:18, 24:46, 27:65, 30:21-22, 35:4, 36:37, 38:72, 39:7, 41:10, 43:13, 46:4, 53:46, 55:4, 55:15-16, 59:25, 67:3, 71:15, 87:3, 92:4, 96:3"
            },
            {
                "id": 1884,
                "topic": "Allah: knowledge encompasses everything",
                "verses": "2:256, 4:127, 6:4, 6:60, 10:62, 20:8, 20:111, 21:29, 27:75, 28:70, 34:3-4, 35:39, 58:8, 67:14"
            },
            {
                "id": 2911,
                "topic": "Artery: life-vein",
                "verses": "69:45-48"
            },
            {
                "id": 15954,
                "topic": "Rope: <i>Habl</i>",
                "verses": "3:104, 3:113, 7:41, 22:16, 111:5, 111:6"
            }
        ],
        "ar": "وَ لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ وَ نَعۡلَمُ مَا تُوَسۡوِسُ بِہٖ  نَفۡسُہٗ ۚۖ وَ نَحۡنُ  اَقۡرَبُ اِلَیۡہِ  مِنۡ  حَبۡلِ  الۡوَرِیۡدِ ﴿۱۷﴾ ",
        "ur": "اور یقیناً ہم نے انسان کو پیدا کیا اور ہم جانتے ہیں کہ اس کا نفس اُسے کیسے کیسے وساوس میں ڈالتا ہے اور ہم اس سے (اس کی) رگِ جان سے بھی زیادہ قریب ہیں۔",
        "v5": {
            "text": "And assuredly, We have created man and We know what his mind whispers <i>to him</i>, and [b]We are nearer to him than <i>even his</i> jugular vein.[3869]",
            "notes": [
                {
                    "ref": "b",
                    "note": "86:5."
                },
                {
                    "ref": "3869",
                    "note": "<p><strong>Commentary:</strong></p><p>Wonderful is God’s creation of the universe, but much more wonderful is the creation of man. The fact that man is master of his conduct and is responsible for his decisions is here put forward as another argument to support the inevitability of the Resurrection. In fact man’s life on Earth is \"the seedbed of an eternal future\".</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 18,
        "v_": 17,
        "topics": [],
        "ar": "اِذۡ یَتَلَقَّی الۡمُتَلَقِّیٰنِ عَنِ الۡیَمِیۡنِ وَ عَنِ الشِّمَالِ قَعِیۡدٌ ﴿۱۸﴾ ",
        "ur": "جب دو بات پکڑنے والے بات پکڑتے ہیں، دائیں اور بائیں بیٹھے ہوئے ہوتے ہیں۔",
        "v5": {
            "text": "When the two Recording <i>angels</i> record <i>everything,</i> <i>one</i> sitting on <i>his</i> right and <i>the other</i> on <i>his</i> left,[3870]",
            "notes": [
                {
                    "ref": "3870",
                    "note": "<p><strong>Important Words:</strong></p><p>یتلقی (will record) is derived from لقی. They say تلقی الشیء منه i.e. he received or got the thing; he learned it from him, hencepreserved or recorded it (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>According to some commentators the angel sitting on man’s right records his good actions and that on his left, his bad actions; the words 'on the right' standing for his good actions and 'on the left' for his bad actions. Every deed or spoken word leaves its impress in the atmosphere and thus is preserved. Elsewhere in the Quran it is stated that the limbs of man—his hands, feet and tongue—will bear witness against him on the Judgement Day. Thus different parts of a man’s body may also be the recorders referred to in the present verse as the two recording angels. See also 24:25; 36:66.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 19,
        "v_": 18,
        "topics": [
            {
                "id": 10874,
                "topic": "Man: not immortal",
                "verses": "21:35-36, 2:29, 3:186, 20:56, 22:8, 23:101, 29:58, 36:69, 36:79, 37:59-60, 40:12, 55:27-28, 58:7, 71:19"
            }
        ],
        "ar": "مَا یَلۡفِظُ مِنۡ  قَوۡلٍ اِلَّا لَدَیۡہِ رَقِیۡبٌ عَتِیۡدٌ ﴿۱۹﴾ ",
        "ur": "وہ کوئی بات نہیں کہتا مگر اس کے پاس ہی (اس کا) ہمہ وقت مستعد نگران ہوتا ہے۔",
        "v5": {
            "text": "He utters not a word but [a]there is by him a guardian angel ready <i>to record it</i>.[3871]",
            "notes": [
                {
                    "ref": "a",
                    "note": "43:81; 82:11-12."
                },
                {
                    "ref": "3871",
                    "note": "<p><strong>Important Words:</strong></p><p>یلفظ (he utters) is aorist from لفظ. They say لفظه البحر i.e. the sea cast it forth upon the shore, لفظ فلان نفسه means, such a one died. لفظ القول او بالقول means, he uttered or spoke the word (Lane &amp; Aqrab).</p><p>عتید (ready) is derived from عتد. They say عتد الشیء i.e. the thing was or became ready, at hand, prepared; it became great, big or bulky. عتید means, ready, at hand, near; bulky, big or great (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 10874,
                "topic": "Man: not immortal",
                "verses": "21:35-36, 2:29, 3:186, 20:56, 22:8, 23:101, 29:58, 36:69, 36:79, 37:59-60, 40:12, 55:27-28, 58:7, 71:19"
            }
        ],
        "ar": "وَ جَآءَتۡ سَکۡرَۃُ  الۡمَوۡتِ بِالۡحَقِّ ؕ ذٰلِکَ مَا کُنۡتَ مِنۡہُ  تَحِیۡدُ ﴿۲۰﴾ ",
        "ur": "اور جب موت کی برحق غشی آجائے گی۔ یہ وہی ہے جس سے تو گریز کرتا رہا۔",
        "v5": {
            "text": "[b]And the stupor of death certainly comes. ‘This is what thou wast trying to run from.’[3872]",
            "notes": [
                {
                    "ref": "b",
                    "note": "6:94; 23:100."
                },
                {
                    "ref": "3872",
                    "note": "<p><strong>Important Words:</strong></p><p>تحید (thou wast trying to run from) is derived from حاد. They say حاد عنه او منه i.e. he turned aside or away from it; he removed or went away or went far away from it; he shunned or avoided it from fear or disdain. حاد عن الطریق means, he turned aside from the road (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 5799,
                "topic": "Day of Promise: <i>Yaumul-Wa‘id</i>",
                "verses": null
            },
            {
                "id": 14360,
                "topic": "Promise: warning, <i>Wa‘id</i>",
                "verses": "14:15, 20:114, 50:15, 50:29, 50:46"
            },
            {
                "id": 15597,
                "topic": "Resurrection: after death",
                "verses": "23:116, 2:48-49, 5:110, 6:37, 17:50-52, 22:8, 39:68-71, 50:12, 71:19, 78:39-40"
            },
            {
                "id": 17926,
                "topic": "Trumpet: <i>Sur</i>",
                "verses": "23:102, 6:74, 18:100, 20:103, 27:88, 36:52, 39:69, 69:14, 78:19"
            }
        ],
        "ar": "وَ نُفِخَ فِی الصُّوۡرِ ؕ ذٰلِکَ یَوۡمُ الۡوَعِیۡدِ ﴿۲۱﴾ ",
        "ur": "اور صور میں پھونکا جائے گا۔ یہ ہے وہ اِنذار کا دِن۔",
        "v5": {
            "text": "[c]And the trumpet shall be blown: ‘This is the Day of Promise.’",
            "notes": [
                {
                    "ref": "c",
                    "note": "18:100; 23:102; 36:52; 39:69; 69:14."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 22,
        "v_": 21,
        "topics": [
            {
                "id": 15597,
                "topic": "Resurrection: after death",
                "verses": "23:116, 2:48-49, 5:110, 6:37, 17:50-52, 22:8, 39:68-71, 50:12, 71:19, 78:39-40"
            },
            {
                "id": 17007,
                "topic": "Soul: <i>Ruh</i>, spirit",
                "verses": "4:172, 2:49, 3:26, 3:146, 3:186, 6:152, 12:54, 16:3, 17:86, 19:18, 31:29, 58:23, 70:5, 75:3, 78:39, 86:5, 89:28-29, 97:5"
            },
            {
                "id": 18729,
                "topic": "Witness: Angels bear",
                "verses": "4:136, 3:19, 4:167, 43:20"
            }
        ],
        "ar": "وَ جَآءَتۡ کُلُّ نَفۡسٍ مَّعَہَا سَآئِقٌ وَّ شَہِیۡدٌ ﴿۲۲﴾ ",
        "ur": "اور ہر جان آئے گی اس حال میں کہ اس کے ساتھ ایک ہانکنے والا اور ایک گواہ ہوگا۔",
        "v5": {
            "text": "And every soul shall come forth <i>and</i> along with it there will be an <i>angel</i> to drive and <i>an angel</i> to bear witness.[3873]",
            "notes": [
                {
                    "ref": "3873",
                    "note": "<p><strong>Commentary:</strong></p><p>سائق (driver) may be the angel that sits on man’s left and records his bad deeds and as a punishment for them will drivehim to Hell, and شھید may be the angel that sits on his right and records his good actions and will bear witness in his favour. Or the two words metaphorically may stand for man’s misused limbs and faculties and those well and properly used. See also verse 18 above; 24:25 and 36:66.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 15597,
                "topic": "Resurrection: after death",
                "verses": "23:116, 2:48-49, 5:110, 6:37, 17:50-52, 22:8, 39:68-71, 50:12, 71:19, 78:39-40"
            },
            {
                "id": 18295,
                "topic": "Vision",
                "verses": null
            }
        ],
        "ar": "لَقَدۡ کُنۡتَ فِیۡ غَفۡلَۃٍ  مِّنۡ ہٰذَا فَکَشَفۡنَا عَنۡکَ غِطَآءَکَ فَبَصَرُکَ الۡیَوۡمَ حَدِیۡدٌ ﴿۲۳﴾ ",
        "ur": "یقیناً تُو اس بارہ میں غفلت میں رہا۔ پس ہم نے تجھ سے تیرا پردہ اٹھا دیا اور آج تیری نظر بہت تیز ہوگئی ہے۔",
        "v5": {
            "text": "<i>Then We shall say</i>, ‘Thou wast heedless of this; now We have removed from thee thy veil, and sharp is thy sight this day.’[3874]",
            "notes": [
                {
                    "ref": "3874",
                    "note": "<p><strong>Important Words:</strong></p><p>بصر (eye) means, eye; the light whereby the organ of sight perceives the things; knowledge; discernment; intelligence (Lane &amp; Aqrab).</p><p>حدید (sharp) is derived from حد which means, he turned away or averted a person from a thing. حد شیئا عن غیرہ means, he distinguished or separated by some mark a thing from another. حد السکین means, he sharpened the knife. حد بصرہ الیه means, he looked sharply or attentively at him. رجل حدید means, a man sharp of intellect or understanding (Lane).</p><p><strong>Commentary:</strong></p><p>The verse means that in the next world the veil will be lifted from the eyes of man and his vision and mental perception will become clearer and sharper. He will see the consequences of his actions in an embodied form which were hidden from his eyes in this world and will realize that which he used to regard merely as an illusion, was a hard and stark reality.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 24,
        "v_": 23,
        "topics": [
            {
                "id": 15597,
                "topic": "Resurrection: after death",
                "verses": "23:116, 2:48-49, 5:110, 6:37, 17:50-52, 22:8, 39:68-71, 50:12, 71:19, 78:39-40"
            }
        ],
        "ar": "وَ قَالَ قَرِیۡنُہٗ  ہٰذَا مَا لَدَیَّ عَتِیۡدٌ ﴿ؕ۲۴﴾ ",
        "ur": "اور اُس کا ساتھی کہے گا یہ ہے جو میرے پاس تیار پڑا ہے۔",
        "v5": {
            "text": "And his companion will say, ‘This is what I have ready <i>of his record</i>’.[3875]",
            "notes": [
                {
                    "ref": "3875",
                    "note": "<p><strong>Commentary:</strong></p><p>قرینه (his companion) may signify his evil companion, or the Satan, who has been called elsewhere in the Quran, man’s evil companion 4:39; 43:39, because it is at his instigation that man defies God’s commandments.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 25,
        "v_": 24,
        "topics": [
            {
                "id": 8790,
                "topic": "Hell: <i>Jahannam</i>: for those who disobey Allah, for evil-doers",
                "verses": "19:69, 10:28, 2:82, 2:276, 3:182, 4:11, 4:94, 4:116, 8:38, 11:17, 11:107, 13:26, 14:16-17, 16:30, 17:19, 19:87, 20:75, 21:99, 23:104-105, 27:91, 38:56-57, 39:61, 39:73, 40:44, 40:77, 43:75, 54:48-49, 55:44, 71:26, 72:16, 82:15, 85:11, 92:15-16, 101:9-10, 104:3"
            }
        ],
        "ar": "اَلۡقِیَا فِیۡ جَہَنَّمَ  کُلَّ  کَفَّارٍ عَنِیۡدٍ ﴿ۙ۲۵﴾ ",
        "ur": "(اے سائق اور اے گواہ!) تم دونوں ہر سخت ناشکری کرنے والے (اور حق کے) سخت مُعاند کو جہنّم میں جھونک دو۔",
        "v5": {
            "text": "<i>We shall say to his two Companions</i>, ‘Cast ye twain into Hell every ungrateful enemy <i>of truth</i>.[3876]",
            "notes": [
                {
                    "ref": "3876",
                    "note": "<p><strong>Important Words:</strong></p><p>عنید (enemy) is derived from عند which means, he went aside from it; he opposed and rejected what was true or just; he overstepped or transgressed the proper bound or limit; he acted immoderately or in rebellion. عنید is used here in all the senses of the root word (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The dual form in ألقیا is used either because the command is given to the two angels—the سائق and the شھید —or in order to impart emphasis to the command. This form of expression is also used in 23:100 where a plural verb is used for the subject in the singular. The plural form ارجعون in that verse is used to lend emphasis to the disbelievers’ desire to be sentback to this world, and represents the repetition of the singular form ارجعنی (<i>irj‘ini</i>).</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 26,
        "v_": 25,
        "topics": [
            {
                "id": 4682,
                "topic": "Bounds: transgressions",
                "verses": "5:78-79, 7:56, 9:10, 10:84, 17:34, 20:25, 20:46, 21:10, 36:20, 40:29, 42:43, 43:6, 49:10, 51:35, 68:13, 83:13, 96:7"
            },
            {
                "id": 8790,
                "topic": "Hell: <i>Jahannam</i>: for those who disobey Allah, for evil-doers",
                "verses": "19:69, 10:28, 2:82, 2:276, 3:182, 4:11, 4:94, 4:116, 8:38, 11:17, 11:107, 13:26, 14:16-17, 16:30, 17:19, 19:87, 20:75, 21:99, 23:104-105, 27:91, 38:56-57, 39:61, 39:73, 40:44, 40:77, 43:75, 54:48-49, 55:44, 71:26, 72:16, 82:15, 85:11, 92:15-16, 101:9-10, 104:3"
            }
        ],
        "ar": "مَّنَّاعٍ  لِّلۡخَیۡرِ  مُعۡتَدٍ  مُّرِیۡبِ ۣ﴿ۙ۲۶﴾ ",
        "ur": "ہر اچھی بات سے روکنے والے، حَد سے تجاوز کرنے والے اور شک میں مبتلا کرنے والے کو۔",
        "v5": {
            "text": "[a]‘Hinderer of good, transgressor, doubter,",
            "notes": [
                {
                    "ref": "a",
                    "note": "68:13."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 27,
        "v_": 26,
        "topics": [
            {
                "id": 8744,
                "topic": "Hell: <i>Jahannam</i>: for disobedient",
                "verses": "19:69, 2:207, 3:163, 4:15, 4:56, 9:63, 10:8-9, 13:19, 14:29-30, 21:30, 21:99, 40:61, 40:71-73, 72:24"
            }
        ],
        "ar": "الَّذِیۡ جَعَلَ مَعَ  اللّٰہِ  اِلٰـہًا اٰخَرَ فَاَلۡقِیٰہُ فِی الۡعَذَابِ الشَّدِیۡدِ  ﴿۲۷﴾ ",
        "ur": "وہ جس نے اللہ کے ساتھ کوئی دوسرا معبود  بنا رکھا تھا۔ پس تم دونوں اسے سخت عذاب میں جھونک دو۔",
        "v5": {
            "text": "‘Who sets up another God beside Allah. So do ye twain cast him into the dreadful torment.’",
            "notes": null
        }
    },
    {
        "ch": 50,
        "v": 28,
        "v_": 27,
        "topics": [],
        "ar": "قَالَ  قَرِیۡنُہٗ  رَبَّنَا مَاۤ  اَطۡغَیۡتُہٗ  وَ لٰکِنۡ  کَانَ  فِیۡ ضَلٰلٍۭ بَعِیۡدٍ ﴿۲۸﴾",
        "ur": "اس کے ساتھی نے کہا اے ہمارے ربّ! میں نے تو اسے سرکش نہیں کیا لیکن وہ خود ہی ایک دُور کی گمراہی میں مبتلا تھا۔",
        "v5": {
            "text": "[b]His associate will say, ‘O our Lord, it was not I that caused him to rebel; but he <i>himself</i> was too far gone in error.’",
            "notes": [
                {
                    "ref": "b",
                    "note": "14:23."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 29,
        "v_": 28,
        "topics": [
            {
                "id": 14361,
                "topic": "Promise: warning, <i>Wa‘id</i>",
                "verses": "14:15, 20:114, 50:15, 50:21, 50:46"
            }
        ],
        "ar": "قَالَ  لَا تَخۡتَصِمُوۡا لَدَیَّ وَ قَدۡ قَدَّمۡتُ اِلَیۡکُمۡ  بِالۡوَعِیۡدِ ﴿۲۹﴾ ",
        "ur": "وہ کہے گا میرے حضور جھگڑا نہ کرو۔ میں پہلے ہی تمہاری طرف انذار بھیج چکا ہوں۔",
        "v5": {
            "text": "God will say, ‘Quarrel not in My presence, I gave you the warning beforehand.’[3877]",
            "notes": [
                {
                    "ref": "3877",
                    "note": "<p><strong>Commentary:</strong></p><p>It is human nature that when an evildoer is confronted with the evil consequences of his deeds, he seeks to shift his responsibility to others. It is this state of mind of the disbeliever which is depicted in this verse. He will hold the Satan responsible for his own transgressions and sins. See also 2:167-168.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 30,
        "v_": 29,
        "topics": [
            {
                "id": 1828,
                "topic": "Allah: is not unjust to His servants",
                "verses": "3:183, 8:52, 17:72, 22:11, 24:51, 26:210, 41:47"
            },
            {
                "id": 2068,
                "topic": "Allah: none can change word of",
                "verses": "6:35, 6:116, 10:65, 18:28"
            }
        ],
        "ar": "مَا یُبَدَّلُ  الۡقَوۡلُ  لَدَیَّ وَ مَاۤ  اَنَا بِظَلَّامٍ  لِّلۡعَبِیۡدِ ﴿٪۳۰﴾ ",
        "ur": "میرے ہاں فرمان تبدیل نہیں کیا جاتا اور میں ہرگز بےچارے بندوں پر ظلم کرنے والا نہیں۔",
        "v5": {
            "text": "‘The sentence <i>passed by</i> Me cannot be changed, [c]and I am not in the least unjust to <i>My</i> servants.’[3878]",
            "notes": [
                {
                    "ref": "c",
                    "note": "3:183; 8:52; 22:11; 41:47."
                },
                {
                    "ref": "3878",
                    "note": "<p><strong>Commentary:</strong></p><p>God admonishes both the parties to stop wrangling and quarrelling and shifting the responsibility to one another as His sentence has already been pronounced and His Word never changes.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 31,
        "v_": 30,
        "topics": [
            {
                "id": 2805,
                "topic": "Arabic",
                "verses": "12:3, 13:38, 16:104, 20:114, 26:196, 39:29, 41:4, 41:45, 42:8, 43:4, 46:13"
            }
        ],
        "ar": "یَوۡمَ نَقُوۡلُ لِجَہَنَّمَ ہَلِ امۡتَلَاۡتِ وَ تَقُوۡلُ ہَلۡ  مِنۡ مَّزِیۡدٍ ﴿۳۱﴾ ",
        "ur": "(یاد کرو) وہ دن جب ہم جہنّم سے پوچھیں گے کیا تُو بھر گئی ہے؟ اور وہ جواب دے گی کیا کچھ اور بھی ہے؟",
        "v5": {
            "text": "On that day We will say to Hell, ‘Art thou filled up?’, and it will answer, ‘Is there any more?’[3879]",
            "notes": [
                {
                    "ref": "3879",
                    "note": "<p><strong>Commentary:</strong></p><p>The dialogue is metaphorical. Hell has been personified here and words are put in its mouth to express its state or condition and not that it will actually speak or, for that matter, it can speak. The word قال has been used in this sense in 41:12 also where the heaven and the earth have been described as saying that they obey divine laws willingly. It is one of the peculiarities and beauties of the Arabic language that it uses words and expressions for inanimate things which are used for human beings.</p><p>There is a famous Arabic proverb:</p><p>قال الجدار للوتد لم تشقنی قالت سل من یدقنی</p><p>i.e. the wall said to the peg \"why dost thou pierce me?\" It said, \"Ask him who strikes me from behind.\" Similarly, a famous Arab poet says:</p><p>یرید الرمح صدر أبی براء</p><p>و یعدل عن دماء بنی عقیل</p><p>i.e. the spear intends to pierce the breast of Abu Bara’, but it turns away from the blood of the sons of ‘Uqail. (Lane).</p><p>The expression ھل من مزید in fact, points to man’s unlimited capacity for committing sins and his inordinate desire for worldly comforts which pave his way to Hell.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 32,
        "v_": 31,
        "topics": [
            {
                "id": 5882,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: believers on the",
                "verses": "37:21, 39:74, 2:213, 19:73, 19:86, 23:103, 26:91, 43:36, 43:68, 44:52, 101:7-8"
            },
            {
                "id": 10370,
                "topic": "Latter Days",
                "verses": "81:14, 26:91"
            },
            {
                "id": 13634,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 13658,
                "topic": "Paradise: <i>Jannah</i>: will be brought near",
                "verses": "26:91, 81:14"
            },
            {
                "id": 15875,
                "topic": "Righteous: <i>Salihin</i>: rewarded",
                "verses": "13:36, 3:126, 3:134-135, 3:173, 3:180, 7:157, 7:170-171, 7:197, 9:4, 9:123, 11:116, 15:46, 16:32, 19:86, 22:24, 25:16, 25:71, 26:91, 29:8, 29:10, 29:28, 29:59, 30:16, 30:45-46, 34:5, 35:8, 38:50, 39:62, 39:74-75, 41:9, 41:19, 43:36, 44:52-57, 45:20, 45:31, 47:3, 47:16, 47:18, 47:37, 49:4, 51:16, 52:18, 54:55, 64:10, 65:12, 68:51, 77:42, 78:32-37, 83:23, 98:8"
            }
        ],
        "ar": "وَ اُزۡلِفَتِ الۡجَنَّۃُ  لِلۡمُتَّقِیۡنَ غَیۡرَ  بَعِیۡدٍ ﴿۳۲﴾ ",
        "ur": "اور جب جنت متقیوں کی خاطر قریب کردی جائے گی، کچھ دُور نہ ہوگی۔",
        "v5": {
            "text": "[a]And Heaven will be brought near to the righteous, no longer remote.[3880]",
            "notes": [
                {
                    "ref": "a",
                    "note": "26:91; 81:14."
                },
                {
                    "ref": "3880",
                    "note": "<p><strong>Commentary:</strong></p><p>If, as mentioned in the preceding verse, more and more sinners will be thrown into Hell for being purged and purified of their spiritual maladies, the present verse says, that Heaven will also be brought near for the righteous and the God-fearing.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 33,
        "v_": 32,
        "topics": [
            {
                "id": 13634,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 14318,
                "topic": "Promise: of Allah",
                "verses": "24:56, 2:269, 3:153, 4:96, 5:10, 8:8, 9:72, 9:111, 13:36, 18:49, 19:62, 19:88, 21:102, 21:104-105, 23:36, 25:16-17, 28:62, 30:7, 33:23, 34:31, 38:54, 39:75, 41:31, 46:17, 47:16, 48:22, 48:30, 51:23, 57:11, 85:3"
            }
        ],
        "ar": "ہٰذَا مَا تُوۡعَدُوۡنَ لِکُلِّ اَوَّابٍ حَفِیۡظٍ ﴿ۚ۳۳﴾ ",
        "ur": "یہ ہے وہ جس کا تم وعدہ دیئے جاتے ہو ہر رجوع کرنے والے، نگران رہنے والے کی خاطر۔ ",
        "v5": {
            "text": "<i>And it will be said</i>, ‘This is what was promised to you—to everyone who always turned to God and was watchful <i>of his actions.</i>",
            "notes": null
        }
    },
    {
        "ch": 50,
        "v": 34,
        "v_": 33,
        "topics": [
            {
                "id": 3527,
                "topic": "Attributes of Allah: Ar-Rahman (The Gracious, Beneficent)",
                "verses": "1:1, 1:3, 12:65, 13:31, 17:111, 19:45, 19:46, 19:59, 19:62, 19:86, 21:113, 25:61, 26:6, 27:31, 36:53, 41:3, 55:2, 59:23, 67:30, 78:39"
            },
            {
                "id": 4309,
                "topic": "Believers: <i>Mu’min</i>: fear Allah",
                "verses": "79:41, 3:18, 3:22, 5:95, 14:15, 20:4, 21:50, 23:58, 24:53, 33:36, 33:40, 35:19, 36:12, 39:10, 42:39, 55:47, 67:13, 79:46, 98:9"
            },
            {
                "id": 7459,
                "topic": "Fear: of Allah, <i>Khashi‘ah</i>",
                "verses": "8:49, 2:151, 5:4, 5:29, 5:45, 7:57, 9:13, 9:18, 9:109, 12:110, 13:22, 14:15, 16:52, 17:58, 20:4, 21:50, 23:3, 23:58, 23:61, 24:53, 33:38, 33:40, 35:19, 35:29-30, 36:12, 39:11, 39:21, 39:24, 49:2, 55:47, 59:17, 67:13, 79:27, 79:41, 79:46, 80:10, 87:11, 98:9"
            },
            {
                "id": 13634,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 18212,
                "topic": "Unseen: secret, hidden",
                "verses": "2:4, 6:104, 19:62, 21:50, 35:19, 36:12, 57:26, 67:13"
            },
            {
                "id": 18245,
                "topic": "Unseen: secret, hidden: believers fear the",
                "verses": "2:4, 5:95, 2:4, 21:50, 35:19, 36:12, 67:13"
            }
        ],
        "ar": "مَنۡ خَشِیَ الرَّحۡمٰنَ بِالۡغَیۡبِ وَ جَآءَ بِقَلۡبٍ مُّنِیۡبِ ۣ﴿ۙ۳۴﴾ ",
        "ur": "جو رحمان سے غیب میں ڈرتا رہا اور ایک جھکنے والا دل لئے ہوئے آیا ہے۔",
        "v5": {
            "text": "‘Who feared the Gracious God in private and came <i>to Him</i> with a penitent heart.",
            "notes": null
        }
    },
    {
        "ch": 50,
        "v": 35,
        "v_": 34,
        "topics": [
            {
                "id": 941,
                "topic": "Afterlife: <i>Akhirah</i>: greetings of peace in",
                "verses": "10:11, 13:25, 14:24, 15:47, 33:45, 36:59, 39:74"
            },
            {
                "id": 5775,
                "topic": "Day of Eternity: <i>Yaumul-Khuld</i>",
                "verses": null
            },
            {
                "id": 7224,
                "topic": "Eternal: abode",
                "verses": "32:20, 11:8, 44:57, 53:16, 54:56"
            },
            {
                "id": 13592,
                "topic": "Paradise: <i>Jannah</i>: peace of",
                "verses": "10:11, 10:26, 13:25, 14:24, 15:47, 19:63, 36:59, 39:74, 56:26-27"
            },
            {
                "id": 13634,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 16048,
                "topic": "Salam: peace",
                "verses": "15:46-47, 5:17, 6:55, 6:128, 10:26, 20:48, 21:70, 27:60, 97:6"
            }
        ],
        "ar": "ادۡخُلُوۡہَا بِسَلٰمٍ ؕ ذٰلِکَ یَوۡمُ الۡخُلُوۡدِ ﴿۳۵﴾ ",
        "ur": "سلامتی کے ساتھ اس میں داخل ہوجاؤ۔ یہی وہ ہمیشہ رہنے والا دن ہے۔",
        "v5": {
            "text": "[a]‘Enter ye therein in peace. This is the Day of Eternity.’[3881]",
            "notes": [
                {
                    "ref": "a",
                    "note": "14:24; 15:47; 36:59."
                },
                {
                    "ref": "3881",
                    "note": "<p><strong>Commentary:</strong></p><p>However dreadful its punishments may appear, Hell, according to the Quran, is a temporary penitentiary, while Heaven is an eternal abode; its blessings know no limit or end (11:109).</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 36,
        "v_": 35,
        "topics": [
            {
                "id": 919,
                "topic": "Afterlife: <i>Akhirah</i>: description of rewards in",
                "verses": "36:56-59, 15:46-49, 44:52-58, 52:18-29, 55:47-77, 56:13-38, 77:42-45, 78:32-37, 83:23-29"
            },
            {
                "id": 13507,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13634,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "لَہُمۡ  مَّا یَشَآءُوۡنَ  فِیۡہَا وَلَدَیۡنَا مَزِیۡدٌ ﴿۳۶﴾ ",
        "ur": "ان کے لئے اُس میں جو وہ چاہیں گے ہوگا اور ہمارے پاس مزید بھی ہے۔",
        "v5": {
            "text": "[b]They will have therein whatever they desire, and with Us is a good deal more.[3882]",
            "notes": [
                {
                    "ref": "b",
                    "note": "10:27."
                },
                {
                    "ref": "3882",
                    "note": "<p><strong>Commentary:</strong></p><p>The righteous will have in Paradise what they desire, to their hearts’ content, but as man’s desires at best are limited, they will be given much more than what they desire or deserve, much more than what they would even contemplate or conceive. They will see the beautiful face of God and will bask in the warmth of His countenance. This beautiful vision in which the veil which divides man from Allah will be lifted and His Heavenly Glory disclosed to the soul, untrammelled by its earthy raiments is, according to some authorities, what is meant by the words ولدینا مزید i.e. and with Us is a good deal more.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 37,
        "v_": 36,
        "topics": [
            {
                "id": 7217,
                "topic": "Escape: from Allah’s punishment",
                "verses": "10:51, 10:18, 10:54, 14:22, 15:6, 17:52, 18:54, 29:5, 34:52, 38:4, 39:52, 41:49, 72:13"
            },
            {
                "id": 15429,
                "topic": "Refuge: <i>A‘udh</i>: on earth",
                "verses": "4:101, 9:57, 11:44, 18:11, 18:17"
            }
        ],
        "ar": "وَ کَمۡ  اَہۡلَکۡنَا قَبۡلَہُمۡ  مِّنۡ قَرۡنٍ ہُمۡ اَشَدُّ مِنۡہُمۡ  بَطۡشًا فَنَقَّبُوۡا فِی الۡبِلَادِ ؕ ہَلۡ  مِنۡ  مَّحِیۡصٍ ﴿۳۷﴾ ",
        "ur": "اور کتنی ہی قومیں ہم نے اُن سے پہلے ہلاک کردیں جو گرفت میں ان سے زیادہ سخت تھیں۔ پس انہوں نے زمین میں غاریں بنا لیں (مگر) کیا کوئی پناہ کی جگہ تھی؟",
        "v5": {
            "text": "[c]And how many a generation, who were greater than they in power, have We destroyed before them. They went about the lands <i>devising means to escape the punishment</i>. Was there any place of refuge for them?[3883]",
            "notes": [
                {
                    "ref": "c",
                    "note": "17:18; 19:75; 21:12; 36:32."
                },
                {
                    "ref": "3883",
                    "note": "<p><strong>Important Words:</strong></p><p>نقبوا (went about) is the intensive form of نقب (<i>naqaba</i>) which means, he made a hole through a wall; he perforated, pierced or made a hole through anything. نقب فی الارض means, he went or went away through the land or country or journeyed or traversed through the land.</p><p><strong>Commentary:</strong></p><p>Divine punishment, when it comes, is overwhelming and all-encompassing. There is no escape or refuge from it, however one may try.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 38,
        "v_": 37,
        "topics": [
            {
                "id": 5273,
                "topic": "Conscience",
                "verses": "8:40, 2:194, 3:21, 7:52, 7:89, 14:25, 18:30, 22:39, 22:41, 22:72, 27:63, 47:5, 67:11, 69:40, 75:3"
            }
        ],
        "ar": "اِنَّ  فِیۡ  ذٰلِکَ لَذِکۡرٰی لِمَنۡ کَانَ لَہٗ  قَلۡبٌ اَوۡ  اَلۡقَی  السَّمۡعَ وَ  ہُوَ  شَہِیۡدٌ ﴿۳۸﴾ ",
        "ur": "یقیناً اس میں بہت بڑی عبرت ہے اس کے لئے جو دل رکھتا ہو یا کان دھرے اور وہ دیکھنے والا ہو۔",
        "v5": {
            "text": "Therein, verily, is a reminder for him who has a heart, or who gives ear, and is attentive.[3884]",
            "notes": [
                {
                    "ref": "3884",
                    "note": "<p><strong>Important Words:</strong></p><p>قلب (heart) means, heart, the soul; the conscience; the mind, meaning the intellect; the endeavour to understand, and consideration. They say ماله قلب i.e. he has no intellect or intelligence; the purest or best or choicest part of a thing; قلب الجیش means, the main body of the army; as distinguished from the van and the rear and the two wings. The word also signifies, a man genuine or pure in respect of origin or lineage, holding a middle place among his people (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 39,
        "v_": 38,
        "topics": [
            {
                "id": 1333,
                "topic": "Allah: created Heavens and earth",
                "verses": "41:10-13, 2:165, 3:191, 6:2, 7:55, 10:4, 10:7, 11:8, 14:33, 25:3, 25:60, 29:62, 30:23, 31:11, 32:5, 35:4, 38:28, 39:63, 40:63, 43:10, 44:39, 46:4, 50:7-8, 57:5, 65:13, 67:4, 71:16-18"
            },
            {
                "id": 2094,
                "topic": "Allah: not wearied by the care of Heavens and earth",
                "verses": "2:256, 46:34, 50:16"
            },
            {
                "id": 3858,
                "topic": "Ayyam: periods",
                "verses": "7:55, 10:4, 11:8, 41:10-11"
            },
            {
                "id": 8585,
                "topic": "Heaven: <i>Sama’</i>: creation of",
                "verses": "41:12-13, 2:30, 2:118, 2:165, 3:192, 6:2, 6:74, 7:55, 9:36, 10:4, 11:8, 14:20, 15:86, 16:4, 17:100, 21:17, 21:31, 25:60, 29:45, 30:23, 31:26, 32:5, 36:82, 39:6, 39:39, 40:58, 42:30, 43:10, 44:39, 45:23, 46:4, 46:34, 51:48, 57:5, 65:13, 67:4, 71:16, 79:28"
            },
            {
                "id": 9318,
                "topic": "Infallibility: <i>‘Ismah</i>, impeccability, sinlessness",
                "verses": "48:3, 2:130, 3:165, 6:163, 7:158, 8:25, 12:25, 21:28, 33:22, 48:11, 53:3-4, 68:5, 81:20-22"
            },
            {
                "id": 16336,
                "topic": "Science: interplanetary creations",
                "verses": "20:7, 25:60, 32:5"
            }
        ],
        "ar": "وَ لَقَدۡ خَلَقۡنَا السَّمٰوٰتِ وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَا فِیۡ سِتَّۃِ  اَیَّامٍ ٭ۖ وَّ مَا مَسَّنَا مِنۡ  لُّغُوۡبٍ ﴿۳۹﴾ ",
        "ur": "اور یقیناً ہم نے آسمانوں اور زمین کو اور اسے بھی جو اِن کے درمیان ہے چھ دنوں میں پیدا کیا اور ہمیں کوئی تکان چھوئی تک نہیں۔",
        "v5": {
            "text": "[a]And verily, We created the heavens and the earth and all that is between them in six periods and [b]no weariness touched Us.[3885]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:55; 10:4; 11:8; 25:60."
                },
                {
                    "ref": "b",
                    "note": "50:16."
                },
                {
                    "ref": "3885",
                    "note": "<p><strong>Important Words:</strong></p><p>أیام (periods) is the plural of یوم which properly means, time absolutely (1:4) or indefinite period or stage in the development of a thing. It does not always denote the day as determined by the rising and setting of the sun. In the Quran یوم has been spoken of as equal to one or even fifty thousand years (22:48; 70:5). Elsewhere in the Quran the division of these six days has been described in this wise; the making of the earth took two days; it took two more days for mountains, rivers, etc., to be placed upon it, and another two days for the growth of vegetable and animal life on it. See also 10:4; 41:10-13.</p><p>لغوب (weariness) is infinitive noun from لغب which means, he was fatigued, tired or wearied to the utmost; he was languid in consequence of fatigue; he was wearied in spirit or mind (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>It is a characteristic of the Quran that not only does it exonerate God’s noble Prophets from all the vices and immoralities imputed to them in the Bible, but it also clears the Divine Being of the flaws and defects that are inconsistent with His Majesty and Holiness. The Bible depicts God as \"having rested on the seventh day from all His work which He had made\" (Gen. 2:2) but according to the Quran no weariness can touch Him.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 40,
        "v_": 39,
        "topics": [
            {
                "id": 725,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:14, 13:16, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 22:78, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 37:167, 38:19, 39:10, 39:76, 41:38-39, 48:10, 55:7, 59:25, 61:2, 62:2, 64:2, 87:2, 96:20, 110:4"
            },
            {
                "id": 11880,
                "topic": "Moral Traits: patience",
                "verses": "2:46, 2:156, 2:178, 3:187, 6:35, 6:85, 7:88, 12:19, 12:84, 14:13, 14:22, 16:127-128, 18:68-69, 18:73, 18:79, 18:83, 21:86, 40:56, 42:44, 46:36, 52:17, 54:28, 70:6"
            },
            {
                "id": 13722,
                "topic": "Patience: <i>sabr</i>: Holy Prophet<sup>(sa)</sup> and",
                "verses": "16:127-128, 10:110, 11:50, 11:116, 18:68-69, 18:73, 20:131, 30:61, 38:18, 40:56, 40:78, 46:36, 52:49, 68:49, 70:6, 73:11, 74:8, 76:25"
            },
            {
                "id": 16111,
                "topic": "Salah: timing of",
                "verses": "2:190, 2:239, 4:104, 7:206, 11:115, 20:131, 30:18-19, 52:49-50, 76:26-27"
            }
        ],
        "ar": "فَاصۡبِرۡ عَلٰی مَا یَقُوۡلُوۡنَ وَ سَبِّحۡ بِحَمۡدِ رَبِّکَ قَبۡلَ طُلُوۡعِ الشَّمۡسِ وَ قَبۡلَ الۡغُرُوۡبِ ﴿ۚ۴۰﴾ ",
        "ur": "پس صبر کر اس پر جو وہ کہتے ہیں اور اپنے ربّ کی حمد کے ساتھ( اُس کی) تسبیح کر سورج کے طلوع سے پہلے اور غروب سے پہلے بھی",
        "v5": {
            "text": "So bear with patience what they say, and [c]glorify thy Lord with His praise, before the rising of the sun and before its setting;",
            "notes": [
                {
                    "ref": "c",
                    "note": "15:99; 17:79; 20:131; 40:56; 110:4."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 41,
        "v_": 40,
        "topics": [
            {
                "id": 725,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:14, 13:16, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 22:78, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 37:167, 38:19, 39:10, 39:76, 41:38-39, 48:10, 55:7, 59:25, 61:2, 62:2, 64:2, 87:2, 96:20, 110:4"
            },
            {
                "id": 12990,
                "topic": "Night: for prayers",
                "verses": "73:7, 3:114, 11:115, 16:76, 17:79-80, 20:131, 21:21, 21:43, 25:65, 39:10, 41:39, 51:18, 52:50, 73:3, 73:21, 76:27"
            },
            {
                "id": 16117,
                "topic": "Salah: <i>Tahajjud</i>",
                "verses": "17:80, 32:17, 73:3-9, 73:21"
            }
        ],
        "ar": "وَ مِنَ الَّیۡلِ فَسَبِّحۡہُ  وَ اَدۡبَارَ السُّجُوۡدِ ﴿۴۱﴾ ",
        "ur": "اور رات کے ایک حصہ میں بھی اس کی تسبیح کر اور سجدوں کے بعد بھی۔",
        "v5": {
            "text": "[a]And in a part of the night also do thou glorify Him, and after <i>prescribed</i> prostrations.",
            "notes": [
                {
                    "ref": "a",
                    "note": "17:80; 52:50; 73:3-5."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 42,
        "v_": 41,
        "topics": [],
        "ar": "وَ اسۡتَمِعۡ یَوۡمَ یُنَادِ  الۡمُنَادِ مِنۡ مَّکَانٍ قَرِیۡبٍ ﴿ۙ۴۲﴾ ",
        "ur": "اور غور سے سُن! جس دن ایک پکارنے والا قریب کے مقام سے پکارے گا۔",
        "v5": {
            "text": "And listen, on the day when the crier will cry from a place nearby.[3886]",
            "notes": [
                {
                    "ref": "3886",
                    "note": "<p><strong>Commentary:</strong></p><p>The \"crier\" may refer to the Holy Prophet. The context supports this, as the next few verses seem to refer to the spiritual resurrection brought about by the Holy Prophet among his people who at his call rose, as it were, from their graves, as the next verse implies.</p><p>The words \"from a place nearby\" may also signify that the call of the Holy Prophet will not remain a call in the wilderness, a distant cry. It will be listened to and accepted.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 43,
        "v_": 42,
        "topics": [
            {
                "id": 5784,
                "topic": "Day of coming forth from Graves: <i>Yaumul-Khuruj</i>",
                "verses": null
            },
            {
                "id": 5931,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: heaven and earth on",
                "verses": "37:21, 39:68, 27:88-89, 36:52, 39:69, 50:45, 52:10-17, 75:7-12"
            }
        ],
        "ar": "یَّوۡمَ  یَسۡمَعُوۡنَ الصَّیۡحَۃَ  بِالۡحَقِّ ؕ ذٰلِکَ یَوۡمُ  الۡخُرُوۡجِ ﴿۴۳﴾ ",
        "ur": "جس دن وہ ایک ہولناک برحق آواز سنیں گے۔ یہ نکل کھڑے ہونے کا دن ہے۔",
        "v5": {
            "text": "The day when they will hear the blast in truth; that will be the day of coming forth <i>from the graves</i>.[3887]",
            "notes": [
                {
                    "ref": "3887",
                    "note": "<p><strong>Commentary:</strong></p><p>\"The blast\" may also signify the stentorian call to truth of the Holy Prophet.</p>"
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 44,
        "v_": 43,
        "topics": [
            {
                "id": 1158,
                "topic": "Allah: alone creates life, causes death",
                "verses": "15:24, 2:29, 13:17, 22:67, 30:41, 40:12, 40:69, 45:27, 53:45"
            },
            {
                "id": 3413,
                "topic": "Attributes of Allah: Al-Mumit (Causes death)",
                "verses": "57:3, 3:157, 7:159, 15:24, 40:69, 44:9"
            },
            {
                "id": 6113,
                "topic": "Dead, Death: <i>Maut</i>: Allah alone causes",
                "verses": "15:24, 2:29, 2:259, 3:157, 6:96, 13:17, 16:71, 22:67, 30:41, 40:12, 40:69, 45:27, 53:45, 57:3"
            }
        ],
        "ar": "اِنَّا نَحۡنُ نُحۡیٖ وَ نُمِیۡتُ وَ  اِلَیۡنَا الۡمَصِیۡرُ ﴿ۙ۴۴﴾ ",
        "ur": "یقیناً ہم ہی زندہ کرتے اور مارتے ہیں اور ہماری طرف ہی لَوٹ کر آنا ہے۔ ",
        "v5": {
            "text": "[b]Verily, it is We Who give life and cause death, and to Us is the final return.",
            "notes": [
                {
                    "ref": "b",
                    "note": "15:24."
                }
            ]
        }
    },
    {
        "ch": 50,
        "v": 45,
        "v_": 44,
        "topics": [
            {
                "id": 5846,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>",
                "verses": "37:21, 1:4, 2:9, 2:49, 2:86, 2:114, 2:127, 3:78, 3:115, 4:40, 4:142, 5:70, 6:13, 9:18, 11:27, 14:32, 14:43, 15:36, 23:102, 24:3, 24:38, 25:27, 26:83, 26:88, 29:37, 30:57, 33:22, 38:80, 43:66, 44:17, 51:13, 60:4, 70:9, 74:9-10, 75:2-3, 82:17-18, 83:11-12, 86:10"
            },
            {
                "id": 5902,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: face of disbelievers on the",
                "verses": "37:21, 67:28, 3:107, 10:28, 14:49, 14:51, 21:40, 21:105, 23:105, 25:26, 27:89, 36:52, 39:61, 39:68, 39:69, 52:11, 54:8, 55:38, 56:6-7, 69:15, 69:17, 70:9-10, 73:15, 73:19, 75:9-10, 75:25, 77:10-11, 78:20-21, 80:41-42, 81:2, 81:4, 81:12, 82:2, 84:2, 84:4-5, 88:3-4, 89:22, 99:2-7, 101:5"
            },
            {
                "id": 5932,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: heaven and earth on",
                "verses": "37:21, 39:68, 27:88-89, 36:52, 39:69, 50:43, 52:10-17, 75:7-12"
            },
            {
                "id": 5993,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: on that day",
                "verses": "37:21, 27:88, 2:282, 3:26, 3:162, 3:186, 4:88, 6:13, 6:23, 6:74, 10:46, 10:55, 15:26, 17:14, 17:72, 18:49, 18:50, 19:69, 19:72, 19:73, 19:96, 20:109, 21:48, 22:57, 23:102, 25:27, 30:13, 30:15, 36:50, 36:51, 36:55, 39:69, 40:17, 40:18, 45:27-29, 46:20, 52:17, 54:7-9, 56:2-12, 66:8, 70:44-45, 101:5"
            },
            {
                "id": 7024,
                "topic": "Earth: <i>Al-Ard</i>: destruction of",
                "verses": "56:5, 14:49, 39:69-70, 69:15, 73:15, 84:4-5, 89:22, 9:2-4, 101:5"
            }
        ],
        "ar": "یَوۡمَ تَشَقَّقُ الۡاَرۡضُ عَنۡہُمۡ سِرَاعًا ؕ ذٰلِکَ  حَشۡرٌ  عَلَیۡنَا یَسِیۡرٌ ﴿۴۵﴾ ",
        "ur": "جس دن زمین ان کے اوپر سے بسرعت حرکت کی وجہ سے پھٹ جائے گی۔ یہ وہ عظیم حشر ہے جو ہم پر آسان ہے۔",
        "v5": {
            "text": "[c]On the day when the earth will cleave asunder <i>in consequence of their misdeeds</i> and they will come forth hastening—that will be a gathering, quite easy for Us.",
            "notes": [
                {
                    "ref": "c",
                    "note": "84:4."
                }
            ]
        }
    }
]
