[
    {
        "ch": 105,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 105,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 222,
                "topic": "Abrahah: destruction of",
                "verses": null
            },
            {
                "id": 10082,
                "topic": "Ka‘bah: place of security",
                "verses": "17:2, 2:126, 5:3, 29:68"
            },
            {
                "id": 13348,
                "topic": "Owners of the Elephant: <i>Ashabul-Fil</i>",
                "verses": null
            },
            {
                "id": 13964,
                "topic": "Plague",
                "verses": "27:83, 7:134-135, 27:13"
            }
        ],
        "ar": "اَلَمۡ  تَرَ کَیۡفَ فَعَلَ رَبُّکَ  بِاَصۡحٰبِ الۡفِیۡلِ ؕ﴿۲﴾ ",
        "ur": "کیا تُو نہیں جانتا کہ تیرے ربّ نے ہاتھی والوں سے کیا سلوک کیا؟",
        "v5": {
            "text": "Hast thou not seen how thy Lord dealt with the People of the Elephant?[4842]",
            "notes": [
                {
                    "ref": "4842",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse refers to Abraha, who marched on Mecca with a large army in 570 A.D., the year of the Holy Prophet’s birth, in order to destroy the Ka‘bah. The Holy Prophet’s birth taking place in the year of Abraha’s attack on the Ka‘bah and the utter destruction of his army implied a Divine hint that because the great Prophet for whose sake the Ka‘bah had been built and who was to preach the Last Heavenly Message from there was about to be born, it militated against God’s eternal plan that it should suffer destruction at the hands of an arch-infidel. Abraha had a number of elephants with him. They were destroyed by a plague or epidemic, of the nature of smallpox, and their rotting bodies were eaten up by swarms of birds. For a detailed account of this incident see Introduction.</p><p>The expression کیف فعل refers more to the dreadfulness of the scourge which destroyed Abraha’s army than to the manner of their destruction.</p>"
                }
            ]
        }
    },
    {
        "ch": 105,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 10082,
                "topic": "Ka‘bah: place of security",
                "verses": "17:2, 2:126, 5:3, 29:68"
            }
        ],
        "ar": "اَلَمۡ  یَجۡعَلۡ  کَیۡدَہُمۡ فِیۡ  تَضۡلِیۡلٍ ۙ﴿۳﴾ ",
        "ur": "کیا اُس نے اُن کی تدبیر کو رائیگاں نہیں کردیا؟",
        "v5": {
            "text": "Did He not cause their [b]plan to miscarry?[4843]",
            "notes": [
                {
                    "ref": "b",
                    "note": "27: 51-52."
                },
                {
                    "ref": "4843",
                    "note": "<p><strong>Commentary:</strong></p><p>How Abraha was foiled in his design is writ large on the pages of history.</p>"
                }
            ]
        }
    },
    {
        "ch": 105,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 4473,
                "topic": "Birds: destroyed <i>Ashabul-Fil</i>",
                "verses": null
            },
            {
                "id": 10082,
                "topic": "Ka‘bah: place of security",
                "verses": "17:2, 2:126, 5:3, 29:68"
            }
        ],
        "ar": "وَّ  اَرۡسَلَ عَلَیۡہِمۡ  طَیۡرًا  اَبَابِیۡلَ ۙ﴿۴﴾ ",
        "ur": "اور اُن پر غَول در غَول پرندے (نہیں) بھیجے؟",
        "v5": {
            "text": "And He sent against them swarms of birds,[4844]",
            "notes": [
                {
                    "ref": "4844",
                    "note": "<p><strong>Important Words:</strong></p><p>أبابیل (swarms): the word is said to have no singular. According to some its singular is أبول which means, a separate or distinct portion of a number of birds or horses or camels following one another. أبابیل signifies, according to some, a company in a state of dispersion, or dispersed companies following one another, or distinct or separate companies like camels. They say جاءت ابلک أبابیل i.e. thy camels came in distinct or separate companies. طیر أبابیل means, birds in separate flocks or bevies, or birds in companies from this or that quarter, or following one another, flock after flock (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>See Introduction.</p>"
                }
            ]
        }
    },
    {
        "ch": 105,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 4473,
                "topic": "Birds: destroyed <i>Ashabul-Fil</i>",
                "verses": null
            },
            {
                "id": 5120,
                "topic": "Clay: Tin, <i>Sijjil</i>",
                "verses": "23:13, 3:50, 5:111, 6:3, 7:13, 11:83, 15:75, 17:62, 28:39, 32:8, 37:12, 38:72, 38:77, 51:34"
            },
            {
                "id": 10082,
                "topic": "Ka‘bah: place of security",
                "verses": "17:2, 2:126, 5:3, 29:68"
            }
        ],
        "ar": "تَرۡمِیۡہِمۡ  بِحِجَارَۃٍ  مِّنۡ سِجِّیۡلٍ ۪ۙ﴿۵﴾ ",
        "ur": "وہ اُن پر کنکر ملی خشک مٹی کے ڈھیلوں سے پتھراؤ کر رہے تھے۔",
        "v5": {
            "text": "<i>Which ate their carrion</i>, striking them against stones of clay.[4845]",
            "notes": [
                {
                    "ref": "4845",
                    "note": "<p><strong>Important Words:</strong></p><p>ب (against). Among a variety meanings, this particle is syn. with علی meaning, over, upon, at, or against. An Arab poet says:</p><p>أ رب یبول الثعلبان برأسه</p><p>لقد ھان من بالت علیه الثعالب</p><p>i.e. how can he be رب (Lord) upon whose head jackals make water and how base he is (Al-Yawaqit wal-Jawahir, vol. 1).</p><p>In the Quran we have منھم من ان تأمنه بدینار i.e. \"of them is he that if thou give him charge over a dinar (3:76).\"</p><p><strong>Commentary:</strong></p><p>Swarms of birds feasted themselves upon dead bodies of the invaders, striking the severed pieces against stones, as birds generally do when eating the small and severed pieces of the dead body of an animal.</p>"
                }
            ]
        }
    }
]
