[
    {
        "ch": 8,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[1092]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                },
                {
                    "ref": "1092",
                    "note": "<p><strong>Commentary:</strong></p><p>See 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 2101,
                "topic": "Allah: obey and His Messenger",
                "verses": "4:60, 3:33, 3:133, 4:14, 4:81, 5:93, 8:21, 8:47, 24:53, 24:55, 33:72, 47:34, 48:18, 58:14"
            },
            {
                "id": 4319,
                "topic": "Believers: <i>Mu’min</i>: obey Allah, Messenger",
                "verses": "4:14, 3:173, 4:70, 4:81, 9:18, 9:71"
            },
            {
                "id": 13211,
                "topic": "Obey: Allah, Messenger",
                "verses": "24:48-55, 3:21, 3:33, 3:51, 3:133, 4:14, 4:60, 4:65, 4:70, 4:81, 5:93, 8:21, 8:47, 24:57, 26:108-109, 26:127, 26:145, 26:164, 26:180, 33:34, 33:36-37, 33:72, 43:64, 47:34, 48:18, 58:14, 64:13, 64:17"
            },
            {
                "id": 17132,
                "topic": "Spoils: <i>Anfal</i>",
                "verses": "3:162, 8:42, 48:16, 59:7-9, 60:12"
            },
            {
                "id": 17506,
                "topic": "Taqwa: fear of God",
                "verses": "2:3, 2:190, 2:197-198, 2:204, 2:213, 2:224, 2:232, 2:234, 2:238, 2:279, 2:283-284, 3:16, 3:51, 3:77, 3:103, 3:131, 3:201, 4:2, 4:10, 4:132, 5:3, 5:5, 5:8-9, 5:12, 5:36, 5:58, 5:89, 5:94, 5:97, 5:113, 6:70, 6:73, 7:27, 7:36, 7:66, 8:70, 9:7, 9:108, 9:109, 11:79, 15:70, 20:133, 22:2, 22:33, 22:38, 26:109, 26:133, 26:185, 33:56, 33:71, 43:64, 47:18, 48:27, 49:4, 49:11, 49:13, 57:29, 58:10, 59:8, 59:19, 60:12, 65:2, 65:11, 74:57, 78:32, 96:13"
            },
            {
                "id": 18390,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "59:7-11, 8:42, 8:70, 33:51"
            }
        ],
        "ar": "یَسۡـَٔلُوۡنَکَ عَنِ الۡاَنۡفَالِ ؕ قُلِ الۡاَنۡفَالُ لِلّٰہِ وَ الرَّسُوۡلِ ۚ فَاتَّقُوا اللّٰہَ وَ اَصۡلِحُوۡا ذَاتَ بَیۡنِکُمۡ ۪ وَ اَطِیۡعُوا اللّٰہَ وَ رَسُوۡلَہٗۤ  اِنۡ   کُنۡتُمۡ  مُّؤۡمِنِیۡنَ ﴿۲﴾",
        "ur": "وہ تجھ سے اموالِ غنیمت سے متعلق سوال کرتے ہیں۔ تو کہہ دے کہ اموالِ غنیمت اللہ اور رسول کے ہیں۔پس اللہ کا تقویٰ اختیار کرو اور اپنے درمیان اصلاح کرو اور اللہ کی اور اس کے رسول کی اطاعت کرو اگر تم مومن ہو۔",
        "v5": {
            "text": "They Ask thee concerning the spoils of war. Say, ‘The spoils <i>of war</i> belong to Allah and the Messenger. So fear Allah, and set things right among yourselves, and [b]obey Allah and His Messenger, if you are believers.’[1092A]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:33; 4:60; 8:47; 9:71; 24:55."
                },
                {
                    "ref": "1092A",
                    "note": "<p><strong>Important Words:</strong></p><p>انفال (spoils) is the plural of النفل which is derived from نفل. They say نفل الرجل فلانا i.e. the man gave to such a one a gift for which he expected no return. نفل الامام الجند means, the leader allotted the spoils to the soldiers. نفله النفل or انفله النفل means, he gave him the spoils of war. نفله also means, he gave him more than his portion or more than his due. انفله (of which the plural is النوافل means, spoils of war; gift or a voluntary gift; something done or recommended to be done voluntarily without its being obligatory; a grandchild, because he or she is over and above one’s own children. نفل —<i>nafal</i> (of which the plural is انفال) means, spoils of war; a free gift; something extra or additional or in excess. النفل—<i>nafl</i> (of which the plural is النوافل) means, an act performed voluntarily, without its being obligatory (Aqrab). النفل (plural انفال) also means, such spoil or gain as comes in the form of God’s favour without one having laboured for it or deserved it (Mufradat).</p><p><strong>Commentary:</strong></p><p>This verse does not relate to the division of spoils. The law with regard to that is to be found in 8:42 below. The present verse relates only to the attainment of gains and spoils and not to their division. It was revealed after the Battle of Badr. Before that battle, God had promised the Muslims victory over one of the two parties of idolaters, either the caravan which was returning from Syria under the leadership of Abu Sufyan, or the Meccan army that had, under the leadership of Abu Jahl, marched out of Mecca to fight the Muslims. The Muslims were very weak at that time; and, considering their extreme weakness, they naturally asked whether, in spite of the great disparity in numbers and resources between them and their enemy, they were to gain victory over the enemy and win spoils. The question was similar to that of Zachariah who, when given the glad tidings of a son, asked: <i>My Lord, how shall I have a son, when old age has overtaken me, and my wife is barren</i> (3:41)? The question asked by Muslims in the verse under comment pertained not only to the encounter which took place at Badr but also to subsequent encounters which were sure to take place between the two parties. The Quran answers the question by saying, <i>the spoils belong to Allah and the Messenger</i>, meaning that God has decreed that Muslims should secure victories against their enemy and nothing can stop it.</p><p>The words: <i>So fear Allah and set things right among yourselves and obey Allah and His Messenger</i>, signify that though victories and spoils will come, yet there are three conditions for the fulfilment of this promise of victory. The first condition requires Muslims to be God-fearing; the second lays down that their mutual relations should be cordial and they should live at peace and amity with one another; the third calls upon them to obey God and follow the instructions of the Holy Prophet. If Muslims fulfilled these three conditions, God would undoubtedly fulfil His promise of victory.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 1713,
                "topic": "Allah: hearts tremble when name of mentioned",
                "verses": "22:36, 39:24"
            },
            {
                "id": 3848,
                "topic": "Ayah: verses",
                "verses": "8:55, 2:42, 3:114, 13:2, 16:102, 19:59, 22:17, 39:72"
            },
            {
                "id": 8464,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: fear in their",
                "verses": "53:12, 22:36, 23:61, 33:11, 39:24, 40:19"
            },
            {
                "id": 16675,
                "topic": "Signs: and true believers",
                "verses": "19:59, 22:33, 25:74, 32:16"
            },
            {
                "id": 17549,
                "topic": "Tawakkul ‘Alallah: trust in Allah",
                "verses": "3:123, 3:160-161, 4:82, 4:133, 4:172, 5:12, 5:24, 7:90, 8:50, 8:62, 9:51, 9:129, 10:72, 10:85-86, 11:57, 11:89, 11:124, 12:68, 13:31, 14:12-13, 16:43, 16:100, 25:59, 26:218, 27:80, 29:60, 33:4, 33:49, 39:39, 42:11, 58:11, 60:5, 64:14, 65:4, 67:30"
            }
        ],
        "ar": "اِنَّمَا الۡمُؤۡمِنُوۡنَ الَّذِیۡنَ اِذَا ذُکِرَ اللّٰہُ وَجِلَتۡ قُلُوۡبُہُمۡ وَ اِذَا تُلِیَتۡ عَلَیۡہِمۡ اٰیٰتُہٗ زَادَتۡہُمۡ  اِیۡمَانًا وَّ عَلٰی رَبِّہِمۡ یَتَوَکَّلُوۡنَ ۚ﴿ۖ۳﴾ ",
        "ur": "مومن صرف وہی ہیں کہ جب اللہ کا ذکر کیا جاتا ہے تو ان کے دل ڈر جاتے ہیں اور جب ان پر اُس کی آیات پڑھی جاتی ہیں تو وہ ان کو ایمان میں بڑھا دیتی ہیں اور وہ اپنے ربّ پر ہی توکل کرتے ہیں۔",
        "v5": {
            "text": "[a]<i>True</i> believers are only those whose hearts tremble [b]when <i>the</i> <i>name of</i> Allah is mentioned, and when His Signs are recited to them, have their faith increased thereby, and who put their trust in their Lord,[1093]",
            "notes": [
                {
                    "ref": "a",
                    "note": "22:36."
                },
                {
                    "ref": "b",
                    "note": "9:124."
                },
                {
                    "ref": "1093",
                    "note": "<p><strong>Commentary:</strong></p><p>The preceding verse ended with the words, <i>if you are believers</i>, and the present fittingly describes a sure sign of true belief necessary for the fulfilment of the promise of victory contained in the previous verse. If a person claims to be a believer in God, but in practical life the name of God means nothing to him and quickens no chords in his heart, his belief is not a true one. Belief should be something real and living.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 2373,
                "topic": "Allah: spend in the way of",
                "verses": "2:268, 2:4, 2:196, 2:216, 2:220, 2:246, 2:255, 2:263, 2:265, 2:273, 2:275, 3:93, 8:61, 9:20, 9:34, 9:41, 9:99, 9:111, 13:23, 14:32, 16:76, 22:36, 24:38-39, 28:55, 32:17, 35:30, 42:39, 47:39, 57:8, 57:11, 61:12, 63:11, 64:17-18, 65:8, 73:21"
            },
            {
                "id": 4327,
                "topic": "Believers: <i>Mu’min</i>: observe prayers",
                "verses": "4:163, 2:4, 2:178, 4:104, 5:56, 9:18, 13:23, 14:32, 17:110, 19:59, 22:36, 22:42, 23:3, 23:10, 24:38, 27:4, 31:5, 32:16, 35:30, 42:39, 70:24, 70:35, 73:21, 98:6"
            },
            {
                "id": 16078,
                "topic": "Salah: enjoined",
                "verses": "2:44, 2:84, 2:111, 2:133, 2:153, 2:154, 4:78, 4:104, 5:56, 6:73, 6:93, 6:163, 9:71, 14:32, 20:133, 22:79, 23:3, 23:10, 24:57, 27:4, 31:5, 31:18, 62:10, 70:24, 98:6"
            }
        ],
        "ar": "الَّذِیۡنَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ مِمَّا رَزَقۡنٰہُمۡ  یُنۡفِقُوۡنَ ؕ﴿۴﴾ ",
        "ur": "وہ لوگ جو نماز قائم کرتے ہیں اور اُس میں سے ہی جو ہم نے اُن کو عطا کیا وہ خرچ کرتے ہیں۔",
        "v5": {
            "text": "[c]Who observe Prayer and [d]spend out of that which We have provided for them.[1094]",
            "notes": [
                {
                    "ref": "c",
                    "note": "5:56; 9:71; 27:4; 31:5; 73:21."
                },
                {
                    "ref": "d",
                    "note": "See 2:4."
                },
                {
                    "ref": "1094",
                    "note": "<p><strong>Commentary:</strong></p><p>This and the previous verse mention some of the qualities of true believers to whom God has promised victory in 8:2 above. God will grant them victories, provided they, on their part, answer the description given in these verses. See also 2:4.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 2159,
                "topic": "Allah: promised forgiveness, reward",
                "verses": "48:30, 2:269, 3:137, 22:51, 24:27, 33:36, 34:5, 35:8, 36:12, 47:16, 49:4, 67:13"
            },
            {
                "id": 7738,
                "topic": "Forgiveness: <i>‘Afw</i>: Allah grants",
                "verses": "3:136-137, 2:222, 2:269, 3:133, 4:97, 22:51, 24:27, 33:36, 34:5, 35:8, 36:12, 47:16, 48:30, 49:4, 67:13"
            },
            {
                "id": 7790,
                "topic": "Forgiveness: <i>‘Afw</i>: promised",
                "verses": "48:30, 2:269, 3:137, 22:51, 24:27, 33:36, 34:5, 35:8, 36:12, 47:16, 49:4, 67:13"
            },
            {
                "id": 8951,
                "topic": "Honour: of believers",
                "verses": "49:14, 4:32, 4:140, 4:176, 8:75, 10:3, 19:86, 22:51, 30:16, 57:19, 70:35-36, 89:16, 89:18"
            },
            {
                "id": 14683,
                "topic": "Provisions: worldly",
                "verses": "20:132, 2:241, 2:237, 3:15, 5:97, 8:75, 10:60, 10:99, 11:4, 11:7, 11:89, 12:60, 12:66, 14:31, 16:72, 16:76, 17:19, 20:132-133, 22:51, 22:59, 24:27, 28:58, 33:32, 33:50, 34:5, 34:16, 40:40, 42:37, 43:30, 43:36, 45:6, 50:12, 67:16, 67:22, 79:34"
            },
            {
                "id": 15332,
                "topic": "Rank: <i>Darajah</i>: according to deeds",
                "verses": "3:164, 4:97, 6:84, 6:133, 6:166, 12:77, 17:22, 20:76, 43:33, 46:20, 58:12"
            }
        ],
        "ar": "اُولٰٓئِکَ ہُمُ الۡمُؤۡمِنُوۡنَ حَقًّا ؕ لَہُمۡ دَرَجٰتٌ عِنۡدَ رَبِّہِمۡ وَ مَغۡفِرَۃٌ وَّ رِزۡقٌ کَرِیۡمٌ ۚ﴿۵﴾ ",
        "ur": "یہی ہیں جو (کھرے اور) سچے مومن ہیں۔ ان کے لئے ان کے ربّ کے حضور بڑے درجات ہیں اور مغفرت ہے اور بہت عزت والا رزق بھی۔",
        "v5": {
            "text": "[a]These it is who are true believers. They have grades <i>of</i> <i>rank</i> with their Lord, as well as forgiveness and an honourable provision.[1095]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:75."
                },
                {
                    "ref": "1095",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse declares that only those who possess the qualities, mentioned in the foregoing two verses, are true believers in the sight of God, and then proceeds to say that true believers never go unrewarded. They will surely attain three things: (1) grades of rank with their Lord; (2) forgiveness of sins; and (3) an honourable provision.</p><p>The verse also hints that the booty obtained during the war need not be consigned to flames, as the Law of Moses enjoined, but may be gladly consumed, for spoils lawfully obtained form \"an honourable prov-ision.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 3894,
                "topic": "Badr: Battle of: aversion of believers to fight at",
                "verses": "3:124"
            },
            {
                "id": 11152,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 12400,
                "topic": "Muhammad<sup>(sa)</sup>: companions of",
                "verses": "24:38-39, 3:160, 5:23, 7:158, 9:100, 9:117, 9:128, 26:220, 33:24, 47:5, 48:30, 66:9, 77:2-7, 79:2-6, 92:4, 100:2-12"
            },
            {
                "id": 12627,
                "topic": "Muhammad<sup>(sa)</sup>: protection of",
                "verses": "5:68, 13:12, 33:2, 47:14, 52:49, 93:4-5"
            }
        ],
        "ar": "کَمَاۤ اَخۡرَجَکَ رَبُّکَ مِنۡۢ بَیۡتِکَ بِالۡحَقِّ ۪ وَ اِنَّ فَرِیۡقًا مِّنَ الۡمُؤۡمِنِیۡنَ لَکٰرِہُوۡنَ ۙ﴿۶﴾ ",
        "ur": "(اُن کا ایمان ایسا ہی حق ہے) جیسے تیرے ربّ نے تجھے حق کے ساتھ تیرے گھر سے نکالا تھا حالانکہ مومنوں میں سے ایک گروہ اسے یقیناً ناپسند کرتا تھا۔",
        "v5": {
            "text": "As <i>it was</i> thy Lord <i>Who</i> rightfully brought thee forth from thy house, while a party of the believers were averse, <i>therefore</i> <i>He helped thee against thy enemy.</i>[1096]",
            "notes": [
                {
                    "ref": "1096",
                    "note": "<p><strong>Important Words:</strong></p><p>The particle کما (as) ordinarily meaning \"just as\" or \"like unto\" is also sometimes used in the sense of \"as\" or \"since\" or \"because.\" The Arabs say کما تطیع اللّٰہ ید خلك الجنة i.e. as you obey Allah, so He will make you enter Heaven (Muhit).</p><p><strong>Commentary:</strong></p><p>There has been much difference of opinion about the significance of the word کما (as) occurring in the beginning of this verse and briefly treated under Important Words above. Preferably the word has been used here in the sense of \"as\" or \"since\" in which case the words نصرك علی اعدائك (therefore He helped thee against thy enemies) would be taken to be understood at the end of the verse, as shown in the text. If, however, the word is taken in its ordinary sense of \"just as,\" then the verse would be interpreted as providing an illustration of how God grants victories to His servants and bestows spoils and honourable provision on them (see the promises contained in 8:2, 5 above). In this case the verse could be rendered as: \"God grants victories and spoils to His servants and bestows on them honourable provision just as He did when He brought thee forth from thy house, etc.\"</p><p>The expression بالحق (rightfully) refers to the fact that it was by Divine command, and under Divine revelation, that the Holy Prophet went forth from Medina to meet the enemy.</p><p>The verse thus signifies that, as the Holy Prophet had come forth by God’s own command, and under His special revelation, therefore God could not forsake him; so He helped him against the enemy.</p><p>The verse relates to the Battle of Badr. When Muslims came forth from Medina, they did not know that they would have to fight a Meccan army. So they did not come fully prepared for battle. Hence, when, on the way, the Holy Prophet revealed to them the fact that they would have to fight the Meccan army, they asked him why he had not told them so at Medina, so that they might have come prepared to meet the enemy. Their anxiety was not for themselves but for the Holy Prophet, whom they loved more than their lives. Hence, in their condition of unpreparedness, they were unwilling to expose him to danger. That the Muslims were anxious for the sake of the Holy Prophet and not for themselves and that it was his going forth that they did not like is clear from the verse itself which uses the words \"brought thee forth\" and not \"brought you forth.\" The verse thus implies that when the Companions of the Holy Prophet were so anxious about their beloved Master—God, Whose Messenger he was—could not leave him unprotected; His love for him was certainly greater than that of his Companions.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 6631,
                "topic": "Dispute",
                "verses": "2:85, 2:140, 3:21, 3:62, 3:66, 3:153, 4:66, 4:106, 7:72, 8:47, 11:33, 13:14, 16:5, 18:22, 22:4, 22:9, 22:20, 22:68, 31:21, 40:5-6, 40:36, 40:48, 40:70, 42:17, 42:19, 42:36, 49:11, 53:13"
            }
        ],
        "ar": "یُجَادِلُوۡنَکَ فِی الۡحَقِّ بَعۡدَ مَا تَبَیَّنَ کَاَنَّمَا یُسَاقُوۡنَ اِلَی الۡمَوۡتِ وَ ہُمۡ یَنۡظُرُوۡنَ ؕ﴿۷﴾ ",
        "ur": "وہ حق کے بارہ میں تجھ سے بحث کررہے تھے بعد اس کے کہ حق (ان پر) کھل چکا تھا۔ گویا انہیں موت کی طرف ہانک کے لے جایا جا رہا تھا اور وہ (اسے اپنی آنکھوں سے) دیکھ رہے تھے۔",
        "v5": {
            "text": "They dispute with thee concerning the truth after it has become manifest, as though they are being driven to death while they actually see <i>it</i>.[1097]",
            "notes": [
                {
                    "ref": "1097",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse refers not to the Companions of the Holy Prophet, as wrongly understood by some commentators, but to his enemies. There is absolutely no evidence in history to show that the Holy Prophet’s Companions disputed with him with regard to fighting the enemy. On the contrary, it is expressly related that when before the Battle of Badr he consulted them, they all expressed their readiness and even eagerness to accompany him and fight the enemy wherever he might take them (Hisham, ii. 13). Even the disbelievers who came out to fight the Muslims admitted that the latter looked like so many \"seekers after death\" on the field of battle (Tabari). What the verse, therefore, means is simply this that as the enemies of Islam abhorred the truth as one abhors death, so, as a result of this, they were going to be punished with death itself.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 3901,
                "topic": "Badr: Battle of: victory at",
                "verses": "3:124, 2:211, 3:14, 3:124, 8:18, 32:30"
            },
            {
                "id": 10104,
                "topic": "Kalimat: words",
                "verses": "3:46, 2:38, 2:125, 3:40, 3:65, 4:172, 6:35, 6:116, 7:138, 7:159, 9:40, 9:74, 10:20, 10:34, 10:65, 10:97, 11:111, 14:25, 14:27, 18:6, 18:28, 18:110, 20:130, 23:101, 31:28, 37:172, 39:20, 39:72, 40:7, 42:15, 42:22, 43:29, 48:27, 66:13"
            },
            {
                "id": 14296,
                "topic": "Promise: of Allah",
                "verses": "24:56, 2:269, 3:153, 4:96, 5:10, 9:72, 9:111, 13:36, 18:49, 19:62, 19:88, 21:102, 21:104-105, 23:36, 25:16-17, 28:62, 30:7, 33:23, 34:31, 38:54, 39:75, 41:31, 46:17, 47:16, 48:22, 48:30, 50:33, 51:23, 57:11, 85:3"
            }
        ],
        "ar": "وَ اِذۡ یَعِدُکُمُ اللّٰہُ اِحۡدَی الطَّآئِفَتَیۡنِ اَنَّہَا لَکُمۡ وَ تَوَدُّوۡنَ اَنَّ غَیۡرَ ذَاتِ الشَّوۡکَۃِ تَکُوۡنُ لَکُمۡ  وَ یُرِیۡدُ  اللّٰہُ  اَنۡ یُّحِقَّ الۡحَقَّ بِکَلِمٰتِہٖ وَ یَقۡطَعَ دَابِرَ الۡکٰفِرِیۡنَ ۙ﴿۸﴾ ",
        "ur": "اور (یاد کرو) جب اللہ تمہیں دو گروہوں میں سے ایک کا وعدہ دے رہا تھا کہ وہ تمہارے لئے ہے اور تم چاہتے تھے کہ تمہارے حصہ میں وہ آئے جس میں ضرر پہنچانے کی صلاحیت نہ ہو۔ اور اللہ چاہتا تھا کہ وہ اپنے کلمات کے ذریعہ حق کو ثابت کر دکھائے اور کافروں کی جڑ کاٹ دے۔",
        "v5": {
            "text": "And [a]<i>remember the time</i> when Allah promised you one of the two parties that it should be yours, and you wished that the one without sting should be yours, but Allah desired to establish the truth by His words and to cut off the root of the disbelievers,[1098]",
            "notes": [
                {
                    "ref": "1098",
                    "note": "<p><strong>Important Words:</strong></p><p>الشوکة (sting) is derived from شاك. They say شاکنی الشوك i.e. the thorn hurt or wounded me or it pierced my body. الشوکة is both the noun-infinitive from شاك and the singular of الشوك (thorns, spines, etc.). الشوکة means, thorn; sting; point of a spear, etc.; any weapon or weapons; sharpness of weapons; strength or might or vehemence thereof in war and fighting (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The \"two parties\" mentioned in the verse refer to (1) the Meccan army that had come forth to fight the Muslims, and (2) the Meccan caravan that was returning from the north and proceeding home. The former, besides being much larger in number, was heavily armed and very well-equipped; while the caravan was only lightly armed. Both belonged to Mecca and were equally hostile to Islam.</p><p>The verse signifies that as Allah had already made a promise to the Holy Prophet that He would give victory to Muslims over one of the two Meccan parties, viz. the caravan or the army, so against all hope He granted them victory in fulfilment of His promise. This shows that while yet at Medina, the Holy Prophet had been informed by God of the possible attack by the Meccan army, for without this Allah could not refer to \"one of the two parties,\" but that the Holy Prophet kept the matter secret. The words, <i>thy Lord Who rightfully brought thee forth from thy house, while a party of the believers were averse</i> (8:6 above), also show that at Medina the Holy Prophet had undoubtedly received Divine revelation informing him of the coming attack by the enemy and that it was God Who had ordered the Holy Prophet to come forth. The above-quoted words also hint that the Holy Prophet kept this information secret, revealing it to only a few of his chosen comrades.</p><p>The words غیر ذات الشوکة (without sting) imply that the Muslims wanted to meet the party that was without sting, (i.e. the caravan) which they could easily overcome but that God desired to bring about an encounter with the army which could not be easily conquered, and His object in doing so was <i>to establish the truth by His words and to cut off the root of the disbelievers</i>, so that the prophecies with regard to the destruction of the enemy might be fulfilled that day, and their fulfilment against all hope might become the means of establishing the truth of Islam. For a more detailed account of the Battle of Badr see notes on 3:14 &amp; 8:42-45.</p>"
                },
                {
                    "ref": "a",
                    "note": "8:43."
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 3901,
                "topic": "Badr: Battle of: victory at",
                "verses": "3:124, 2:211, 3:14, 3:124, 8:18, 32:30"
            },
            {
                "id": 7334,
                "topic": "Falsehood: <i>Batil</i>",
                "verses": "17:82, 2:43, 2:189, 3:72, 3:192, 4:30, 5:43, 10:83, 13:18, 21:19, 34:49-50, 38:28"
            }
        ],
        "ar": "لِیُحِقَّ الۡحَقَّ وَ یُبۡطِلَ الۡبَاطِلَ وَ لَوۡ  کَرِہَ الۡمُجۡرِمُوۡنَ ۚ﴿۹﴾ ",
        "ur": "تاکہ وہ حق کو ثابت کر دے اور باطل کا بطلان کردے خواہ مجرم لوگ کیسا ہی ناپسند کریں۔",
        "v5": {
            "text": "[a]That He might establish the truth and bring to naught that which is false, although the guilty might dislike it.[1099]",
            "notes": [
                {
                    "ref": "a",
                    "note": "10:83."
                },
                {
                    "ref": "1099",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, <i>establish the truth</i>, used in the preceding verse have been repeated here for the sake of emphasis and for vividly contrasting the idea contained in these words with that of those that follow, i.e. <i>bring to naught that which is false</i>.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 1186,
                "topic": "Allah: answering of prayer by",
                "verses": "2:187, 3:39, 3:196, 6:42, 11:62, 12:35, 14:40, 21:85, 21:89, 21:91, 27:63, 34:51, 40:61, 50:17"
            },
            {
                "id": 2604,
                "topic": "Angels: <i>Mala’ikah</i>: help the believers",
                "verses": "2:211, 3:124-127, 8:13, 41:31-32"
            },
            {
                "id": 3901,
                "topic": "Badr: Battle of: victory at",
                "verses": "3:124, 2:211, 3:14, 3:124, 8:18, 32:30"
            }
        ],
        "ar": "اِذۡ تَسۡتَغِیۡثُوۡنَ رَبَّکُمۡ فَاسۡتَجَابَ لَکُمۡ اَنِّیۡ مُمِدُّکُمۡ بِاَلۡفٍ مِّنَ الۡمَلٰٓئِکَۃِ  مُرۡدِفِیۡنَ ﴿۱۰﴾ ",
        "ur": "(یاد کرو) جب تم اپنے ربّ سے فریاد کر رہے تھے تو اس نے تمہاری التجا کو قبول کرلیا (اس وعدہ کے ساتھ) کہ میں ضرور ایک ہزار قطار در قطار فرشتوں سے تمہاری مدد کروں گا۔",
        "v5": {
            "text": "[b]When you implored the assistance of your Lord, and He answered you, <i>saying</i>, ‘I will assist you with a thousand of the angels, following one another.’[1100]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:124."
                },
                {
                    "ref": "1100",
                    "note": "<p><strong>Important Words:</strong></p><p>تستغیثون (you implored the assistance) is derived from غاث. They say غاثه, or اغاثه i.e. he helped, assisted or succoured him; He (God) removed from him trouble or affliction. غوث or غواث means, a cry for aid or succour. غیاث means, aid or succour; deliverance from difficulty or distress. استغاثه means, he sought or desired aid or succour of him; or he called for his aid or succour or assistance (Lane &amp; Aqrab).</p><p>مردفین (following one another) is derived from اردف which is derived from ردف. They say اردفه i.e. he rode behind him on the same beast; or it followed or came after him or it. اردف signifies the same as ردف. They say اردفه امر i.e. an event happened to him afterwards; or an event came upon him suddenly and unexpectedly so as to overwhelm him. اردف الشیء بشیء means, he made the thing follow another thing. ردیف means, one who rides behind another on the same beast; a star which is rising when its opposite star is setting or vice versa. ردف means, sequence or consequence of a thing or event; followers or assistants or auxiliaries; night and day following each other; the star that follows another star. So مردفین means, following one another (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>For the advent of angels, see 3:125-127 and 6:159. Also see 2:31.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 3901,
                "topic": "Badr: Battle of: victory at",
                "verses": "3:124, 2:211, 3:14, 3:124, 8:18, 32:30"
            },
            {
                "id": 8525,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: tranquility of, peace of",
                "verses": "53:12, 48:19, 2:249, 2:261, 3:127, 5:114, 9:26, 9:40, 13:29, 16:107, 48:5, 48:27"
            },
            {
                "id": 9399,
                "topic": "Intermediary: <i>Wasilah</i>",
                "verses": "5:36, 10:19, 42:52"
            },
            {
                "id": 9630,
                "topic": "Itminan: satisfaction",
                "verses": "2:261, 3:127, 4:104, 5:114, 10:8, 13:29, 16:107, 16:113, 17:96, 22:12, 89:28"
            }
        ],
        "ar": "وَ مَا جَعَلَہُ اللّٰہُ  اِلَّا بُشۡرٰی وَ لِتَطۡمَئِنَّ بِہٖ قُلُوۡبُکُمۡ ۚ وَ مَا النَّصۡرُ اِلَّا مِنۡ عِنۡدِ اللّٰہِ ؕ اِنَّ  اللّٰہَ  عَزِیۡزٌ  حَکِیۡمٌ ﴿٪۱۱﴾ ",
        "ur": "اور اللہ نے اُسے (تمہارے لئے) محض ایک بشارت بنایا تھا اور اس لئے کہ تمہارے دل اس سے مطمئن ہو جائیں جبکہ کوئی مدد نہیں (آتی) مگر اللہ ہی کی طرف سے۔ یقیناً اللہ کامل غلبہ والا (اور) بہت حکمت والا ہے۔",
        "v5": {
            "text": "And [a]Allah made it only as glad tidings, and that your hearts might thereby be set at rest. But help comes from Allah alone; surely, Allah is Mighty, Wise.[1101]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:127."
                },
                {
                    "ref": "1101",
                    "note": "<p><strong>Commentary:</strong></p><p>See note on 3:127. As an intermediary means is sometimes likely to be confused with the real source of help which is God Almighty, the Quran takes particular care to remind Muslims that the real source of all help and all power is God alone.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 3901,
                "topic": "Badr: Battle of: victory at",
                "verses": "3:124, 2:211, 3:14, 3:124, 8:18, 32:30"
            },
            {
                "id": 6302,
                "topic": "Descend: <i>Nuzul</i>",
                "verses": "57:26, 2:58, 2:158, 6:8, 7:27, 7:161, 10:60, 15:9, 20:81, 23:19, 27:61, 31:11, 34:3, 39:7, 40:14, 65:11-12"
            },
            {
                "id": 8517,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: strengthened",
                "verses": "53:12, 18:15, 11:121, 28:11"
            },
            {
                "id": 8630,
                "topic": "Heaven: <i>Sama’</i>: Sustenance, water, from",
                "verses": "40:14, 2:23, 2:165, 6:7, 6:100, 10:32, 11:53, 13:18, 14:33, 15:23, 16:11, 16:66, 23:19, 27:61, 27:65, 34:25, 51:23, 52:6"
            },
            {
                "id": 18468,
                "topic": "Water: <i>Ma’</i>: sent from heaven",
                "verses": "16:11-12, 2:23, 2:165, 6:100, 7:58, 10:25, 13:18, 14:33, 15:23, 16:66, 18:46, 22:6, 22:64, 23:19, 27:61, 30:25, 32:28, 35:28, 37:68, 38:58, 39:22, 41:40, 43:12, 50:10, 55:45, 78:15, 88:6"
            }
        ],
        "ar": "اِذۡ یُغَشِّیۡکُمُ النُّعَاسَ اَمَنَۃً مِّنۡہُ وَ یُنَزِّلُ عَلَیۡکُمۡ مِّنَ السَّمَآءِ مَآءً  لِّیُطَہِّرَکُمۡ بِہٖ وَ یُذۡہِبَ عَنۡکُمۡ رِجۡزَ الشَّیۡطٰنِ وَ لِیَرۡبِطَ عَلٰی قُلُوۡبِکُمۡ وَ یُثَبِّتَ بِہِ  الۡاَقۡدَامَ ﴿ؕ۱۲﴾ ",
        "ur": "(اور یاد کرو) جب وہ اپنی طرف سے تم پر اَمن دیتے ہوئے اونگھ طاری کر رہا تھااور تمہارے لئے آسمان سے ایک پانی اتار رہا تھا تاکہ وہ تمہیں اُس کے ذریعہ خوب پاک کردے اور شیطان کی پلیدی تم سے دور کر دے اور تاکہ وہ تمہارے دلوں کو تقویت بخشے اور اِس سے قدموں کو ثبات بخشے۔",
        "v5": {
            "text": "[b]When He caused sleep to come upon you as <i>a sign of</i> security from Him, and He sent down water upon you from the clouds, that thereby He might purify you, and remove from you the filth of Satan, and that He might strengthen your hearts and make <i>your</i> steps firm therewith.[1102]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:155."
                },
                {
                    "ref": "1102",
                    "note": "<p><strong>Important Words:</strong></p><p>رجز (filth) is derived from رجز. They say رجز الناقة i.e. the she-camel had the disease of convulsive motion in the legs or thighs. رجزت الریح means, the wind was continuous or lasting. رجز means, commotion or agitation or convulsion; consecutiveness of motion; punishment that agitates by its vehemence and occasions vehement consecutive commotions; conduct that leads to punishment; sin; uncleanness or filth; polytheism or worship of idols; the Devil and his suggestions; plague or pestilence (Lane).</p><p><strong>Commentary:</strong></p><p>Before a battle, especially an important one, begins, there is generally great uneasiness and disquietude among the contestants; their hearts throb with anxiety, and sleep vanishes. So the verse mentions the coming of sleep on the battlefield of Badr as a sign of God’s favour. God caused sleep to come upon Muslims with the result that their anxiety was removed, that they were inspired with a feeling of confidence and security and that it had a soothing effect on their minds. This mental state proved highly helpful and materially contributed to their success.</p><p>The second favour mentioned in the verse pertains to the falling of rain. God caused rain to fall, which, as the verse points out, served four useful purposes: Firstly, it purified the Muslims because, seeing this token of God’s help, their faith in God was strengthened, with the result that their hearts, being filled with faith, were purified. Secondly, it dispelled from them the filth of Satan, i.e. thirst. In the Quran, thirst has been figuratively described as a pang due to Satan or the Devil; for instance, it is related that when Job was stricken with the pangs of thirst, he prayed to God, saying: <i>Satan has smitten me with affliction and torment</i> (38:42), whereupon God accepted his prayer, saying: <i>Strike thy riding beast with thy foot. Here is cool water to wash with and a drink</i> (38:43). So the removal of “the filth of Satan” signifies removal of thirst or the pangs of extreme thirst. The word \"Satan\" may also signify \"those who are of Satan,\" i.e. the friends or associates of Satan. Taken in this sense, the clause would mean: \"God dispelled from you the attack of the wicked people,\" the hint being that the rain proved a means of dispelling the attack of the Quraish, inasmuch as it rendered the hard ground occupied by the Meccan army slippery, thus preventing the enemy from making a successful attack on the Muslims. Thirdly, the rain strengthened the hearts of the Faithful. This was due to their faith being reinforced by witnessing signs of God’s special assistance. Fourthly, the rain helped to make the steps of the Muslims firm for, as mentioned in books of history, the ground occupied by the Muslims was sandy, so the rain made it hard, and the Muslims were able to tread it with firm steps. All these factors contributed to the success of the Muslims.</p><p>The reader should note the beautiful order in the words of this verse. It begins with the purification of the heart (the first purpose served by the rain) and ends with the establishing of the steps and making them firm (the fourth purpose served by the rain), i.e. the favour of God descended on the <i>heart</i> and then, as it were, travelled down to the <i>feet</i>.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 2607,
                "topic": "Angels: <i>Mala’ikah</i>: help the believers",
                "verses": "8:10, 2:211, 3:124-127, 41:31-32"
            },
            {
                "id": 3886,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:16, 8:18, 8:42-45, 8:49, 25:27, 54:46, 54:51"
            },
            {
                "id": 3901,
                "topic": "Badr: Battle of: victory at",
                "verses": "3:124, 2:211, 3:14, 3:124, 8:18, 32:30"
            },
            {
                "id": 7501,
                "topic": "Fear: cast into disbelievers",
                "verses": "2:20, 2:67, 2:207, 3:176, 8:27, 8:57, 33:20, 34:52, 42:23, 106:5"
            },
            {
                "id": 8449,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: cast terror in their",
                "verses": "53:12, 3:152, 33:27, 59:3"
            },
            {
                "id": 15705,
                "topic": "Revelation: to Prophets<sup>(as)</sup>",
                "verses": "42:52, 2:54, 3:180, 4:164-165, 5:49, 11:37, 12:16, 12:110, 14:5, 16:3, 16:44, 20:14, 26:53, 36:5-6, 42:4, 53:5-6"
            }
        ],
        "ar": "اِذۡ یُوۡحِیۡ رَبُّکَ اِلَی الۡمَلٰٓئِکَۃِ اَنِّیۡ مَعَکُمۡ فَثَبِّتُوا الَّذِیۡنَ اٰمَنُوۡا ؕ سَاُلۡقِیۡ فِیۡ قُلُوۡبِ الَّذِیۡنَ  کَفَرُوا الرُّعۡبَ فَاضۡرِبُوۡا فَوۡقَ الۡاَعۡنَاقِ وَ اضۡرِبُوۡا مِنۡہُمۡ  کُلَّ  بَنَانٍ ﴿ؕ۱۳﴾ ",
        "ur": "(یاد کرو) جب تیرا ربّ فرشتوں کی طرف وحی کر رہا تھا کہ میں تمہارے ساتھ ہوں۔ پس وہ لوگ جو ایمان لائے ہیں انہیں ثبات بخشو۔ میں ضرور ان لوگوں کے دلوں میں جنہوں نے کفر کیا رعب ڈال دوں گا۔ پس (ان کی) گردنوں پر مارو اور ان کے جوڑ جوڑ پر ضربیں لگاؤ۔",
        "v5": {
            "text": "When thy Lord revealed to the angels, saying, ‘I am with you; so give firmness to those who believe. I will cast terror into the hearts of those who disbelieve. Smite, then, the upper parts of their necks, and smite off all finger-tips.’[1103]",
            "notes": [
                {
                    "ref": "1103",
                    "note": "<p><strong>Important Words:</strong></p><p>فوق (upper part) is derived from فاق. They say فاقھم i.e. he was or became above them. So فوق means, the location or place that is above or over a person or a thing. They say فوقه رأسه i.e. his upper part is his head (Lane).</p><p><strong>Commentary:</strong></p><p>This verse shows that the angels are, as it were, intermediaries between God and men. It is through them that God’sassistance comes to men.</p><p>The verse also hints that there are some angels whose function is to strengthen the hearts of good men and make them firm, while there are others who are deputed to cast terror into the hearts of wicked men. So God bade the former class of angels to strengthen the hearts of the believers and told them that He would cast terror into the hearts of the disbelievers through the other class of angels.</p><p>God instructed the believers to strike the disbelievers at \"the upper parts of their necks\" because the upper part of the neck, i.e. that which is just below the head, is considered to be the best point for dealing an effective blow with the sword. This order related to such of the enemy as deserved to be killed and without killing whom the Muslims could not defend themselves. The striking on the “finger-tips” was meant to incapacitate the enemy and make them unfit for fighting. This order thus related to those of the enemy who, so far as possible, were to be spared with the infliction of minimum injury. Both these orders were faithfully carried out, for although the Muslims were very weak at Badr, they were able to kill seventy of the disbelievers, mostly leaders, and take as many prisoners, while the enemy could kill only fourteen of them.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 15647,
                "topic": "Retribution: and Allah",
                "verses": "7:168, 2:197, 2:212, 3:5, 5:96, 7:127, 13:7, 14:48, 32:23, 39:38, 40:6, 43:26, 44:17, 59:5, 59:8"
            }
        ],
        "ar": "ذٰلِکَ بِاَنَّہُمۡ شَآقُّوا اللّٰہَ  وَ رَسُوۡلَہٗ ۚ وَ مَنۡ یُّشَاقِقِ اللّٰہَ وَ رَسُوۡلَہٗ  فَاِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ  ﴿۱۴﴾",
        "ur": "یہ اس لئے ہے کہ انہوں نے اللہ اور اس کے رسول کی سخت مخالفت کی اور جو بھی اللہ اور اس کے رسول کی مخالفت کرتا ہے تو یقیناً اللہ سزا دینے میں بہت سخت ہے۔",
        "v5": {
            "text": "[a]That is because they have opposed Allah and His Messenger. And whoso opposes Allah and His Messenger, then Allah is surely severe in retribution.",
            "notes": [
                {
                    "ref": "a",
                    "note": "4:116; 47:33; 59:5."
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 6477,
                "topic": "Disbelief: <i>Kufr</i>: punishment of a",
                "verses": "2:7-21, 2:25, 2:40, 2:91, 2:105, 2:127, 2:176, 3:11, 3:23, 3:57, 3:92, 3:132, 3:142, 4:19, 4:38, 4:57, 4:141, 4:152, 4:162, 5:11, 5:87, 6:31, 6:111, 7:51, 8:37, 9:26, 9:49, 9:68, 13:36, 14:3, 16:28, 17:9, 18:103, 18:107, 21:40, 22:20, 22:73, 29:55, 33:65-66, 34:34, 35:37, 36:64-65, 38:28, 39:33, 39:72, 41:51, 48:14, 67:7, 70:2-3, 76:5, 98:7"
            },
            {
                "id": 7598,
                "topic": "Fire: <i>An-Nar</i>: of Hell",
                "verses": "52:14, 2:25, 2:40, 2:81, 2:82, 2:127, 2:168, 2:175-176, 2:202, 2:218, 2:222, 2:258, 3:11, 3:17, 3:25, 3:103, 3:117, 3:132, 3:152, 3:186, 3:192-193, 4:15, 4:31, 5:30, 7:37, 7:39, 9:17, 10:9, 11:17, 13:6, 14:31, 16:63, 18:30, 21:40, 22:20, 23:105, 24:58, 28:42, 29:26, 66:7, 111:4"
            }
        ],
        "ar": "ذٰلِکُمۡ فَذُوۡقُوۡہُ وَ اَنَّ لِلۡکٰفِرِیۡنَ عَذَابَ النَّارِ ﴿۱۵﴾ ",
        "ur": "یہ ہے (تمہاری پاداش) پس اسے چکھو اور (جان لو) کہ یقیناً کافروں کے لئے آگ کا عذاب ہے۔",
        "v5": {
            "text": "[a]That is your punishment, taste it then; and know that for disbelievers there is the punishment of the Fire.[1104]",
            "notes": [
                {
                    "ref": "a",
                    "note": "22:23; 34:43."
                },
                {
                    "ref": "1104",
                    "note": "<p><strong>Commentary:</strong></p><p>In this verse God refers to two punishments for disbelievers, one in this life, and the other in the life to come. When the threat with regard to the punishment of this life had come to pass, it was quite reasonable to expect that the threat with regard to the punishment in the next life would also come to pass. Similarly, God had made two promises to believers: firstly, the promise of victory and success in this life; secondly, the promise of bliss in the life to come. When the former had been fulfilled in a most amazing manner, the latter would also be similarly fulfilled.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 3887,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:13, 8:18, 8:42-45, 8:49, 25:27, 54:46, 54:51"
            },
            {
                "id": 18368,
                "topic": "War: <i>Qital</i>: Muslim warriors",
                "verses": "100:2-6, 3:144, 4:72, 8:58, 8:61, 8:66, 9:52, 48:17-18, 61:5"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا  اِذَا لَقِیۡتُمُ  الَّذِیۡنَ کَفَرُوۡا  زَحۡفًا  فَلَا  تُوَلُّوۡہُمُ  الۡاَدۡبَارَ ﴿ۚ۱۶﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! جب اُن کے کسی بھاری لشکر سے جنہوں نے کفر کیا تمہاری مڈھ بھیڑ ہو تو انہیں پیٹھ نہ دکھاؤ۔",
        "v5": {
            "text": "O ye who believe! [b]when you meet those who disbelieve, advancing in force, turn not <i>your</i> backs to them.[1105]",
            "notes": [
                {
                    "ref": "b",
                    "note": "8:46; 47:5."
                },
                {
                    "ref": "1105",
                    "note": "<p><strong>Important Words:</strong></p><p>زحفا (advancing in force) is derived from زحف i.e. he walked, marched or went on foot little by little; he crept or crawled along; or he went leisurely or heavily; or he walked or moved with an effort; or he dragged himself along upon the ground. They say زحف العسکر meaning, the army moved heavily on account of its great numbers. زحف means, an army or military force marching slowly or heavily by reason of their multitude; a numerous army (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The word زحفا (advancing in force) qualifies and refers to the believers and not the disbelievers, as supposed by some commentators. The following verse, as well as the wording of the present one, makes the reference positively clear.</p><p>When a Muslim army (not a small detachment) meets the enemy, they are strictly forbidden to flee from the field of battle. They must fight and go on fighting till they win or die; there is no third course open to them. This command constitutes a great secret of success, besides being a sure source of self-discipline.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 167,
                "topic": "Abode: in Hell, in fire, <i>Ma’wa</i>, <i>Mathwa</i>",
                "verses": "3:163, 3:152, 3:198, 4:98, 5:73, 6:129, 9:73, 9:95, 10:9, 13:19, 16:30, 17:98, 24:58, 25:67, 29:26, 29:69, 39:33, 39:61, 39:73, 40:77, 41:25, 45:35, 47:13, 57:16, 66:10, 79:40"
            },
            {
                "id": 2654,
                "topic": "Anger: <i>Ghadab</i>: Allah’s wrath",
                "verses": "43:56, 2:62, 2:91, 3:113, 4:94, 5:61, 16:107, 43:56, 48:7, 60:14"
            },
            {
                "id": 18368,
                "topic": "War: <i>Qital</i>: Muslim warriors",
                "verses": "100:2-6, 3:144, 4:72, 8:58, 8:61, 8:66, 9:52, 48:17-18, 61:5"
            }
        ],
        "ar": "وَ مَنۡ یُّوَلِّہِمۡ یَوۡمَئِذٍ دُبُرَہٗۤ  اِلَّا مُتَحَرِّفًا لِّقِتَالٍ اَوۡ مُتَحَیِّزًا اِلٰی فِئَۃٍ فَقَدۡ بَآءَ بِغَضَبٍ مِّنَ اللّٰہِ وَ مَاۡوٰٮہُ جَہَنَّمُ ؕ وَ بِئۡسَ  الۡمَصِیۡرُ ﴿۱۷﴾ ",
        "ur": "اور جو اُس دن اُنہیں پیٹھ دکھائے گا، سوائے اس کے کہ جنگی چال کے طور پر پہلو بدل رہا ہو یا (اپنے ہی) کسی گروہ سے ملنے کی کوشش کر رہا ہو، تو یقیناً وہ اللہ کے غضب کے ساتھ واپس لوٹے گا اور اس کا ٹھکانا جہنم ہوگا اور بہت ہی برا ٹھکانا ہے۔",
        "v5": {
            "text": "And whoso turns his back to them on such a day, unless manoeuvring for battle or turning to <i>join another</i> company, he indeed draws upon himself the wrath of Allah, and Hell shall be his abode. And an evil resort it is.[1106]",
            "notes": [
                {
                    "ref": "1106",
                    "note": "<p><strong>Important Words:</strong></p><p>متحیزا (turning) is derived from تحیز which is derived from حاز. They say حازہ i.e. he drew, collected or gathered it together. حاز الابل means, he drove the camels. تحیز or تحوز means, he or it writhed or twisted about and turned over and over; or he or it was restless, not remaining still on the ground; or he withdrew or retired to a distance; or he drew back. تحیز الیھم means, he turned or withdrew or retired or joined himself to them (company of men). تحیز also means, he turned aside or withdrew to his place or his proper place. حیز means, a place in which a thing is; the proper or natural place of a thing; the container or receptacle of anything (Lane).</p><p>فئة (company) is derived either from فاو i.e. he struck or smote or clove, or from فاء i.e. he returned, or he returned to a good state or condition. The word فئة means, a party, division or distinct body; or a company or congregated body of men; or a party or division of men; or a company of soldiers who fight in the rear of another party or company and to whom the latter has recourse in the case of fear or defeat; or a company of men who (in war) have recourse for aid, one to another (Lane).</p><p><strong>Commentary:</strong></p><p>The verse is important inasmuch as it defines and describes the circumstances in which an apparent retreat or withdrawal of a Muslim force against an enemy force is allowable. Such a retreat is allowed only on two distinct conditions: firstly, as a war strategy or a battle manoeuvre when a fighting force shifts its position not to fly but to hoodwink the enemy or to occupy a better position; secondly, when a force decides to fall back to join the main army or another Muslim force before giving battle to the enemy. No other retreat or withdrawal is allowed. Muslims must either win or die. Those who turn their backs incur the wrath of God and \"Hell shall be their abode.\"</p><p>The words, <i>and Hell shall be his abode</i>, have a double significance: (1) that those who turn back from the battlefield, except in the circumstances stated above, shall be awarded the punishment of Hellfire in the Hereafter; (2) that although such runaways think that by turning back from the field of battle they will find security from danger, the truth is that they will thereby be running into the very jaws of fire, for such ignom-inious defeat will embolden the enemy against them and will open the doors of their persecution wider still.</p><p>A fight that begins with a single individual, (a Divine Messenger), arrayed against the entire forces of the world, cannot possibly allow at a later stage the retreat of a believing party against a disbelieving host on the basis of disparity in numbers. Where true faith comes in, numbers do not and indeed cannot count. It must be a fight to the finish, for what does a believer await except one of the two good things—victory or martyrdom (9:52)?</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 18,
        "v_": 17,
        "topics": [
            {
                "id": 1673,
                "topic": "Allah: hand of",
                "verses": "48:11, 3:74"
            },
            {
                "id": 3588,
                "topic": "Attributes of Allah: As-Sami‘ (The All-Hearing)",
                "verses": "2:182, 2:128, 2:138, 2:228, 2:245, 2:257, 4:59, 4:135, 4:149, 6:14, 6:116, 8:43, 22:62, 24:22, 24:61, 40:21, 42:12, 49:2"
            },
            {
                "id": 3888,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:13, 8:16, 8:42-45, 8:49, 25:27, 54:46, 54:51"
            },
            {
                "id": 3902,
                "topic": "Badr: Battle of: victory at",
                "verses": "3:124, 2:211, 3:14, 3:124, 8:8-13, 32:30"
            },
            {
                "id": 11442,
                "topic": "Miracles",
                "verses": "7:108, 8:44, 9:25-26, 54:2"
            },
            {
                "id": 11448,
                "topic": "Miracles: of Holy Prophet<sup>(sa)</sup>",
                "verses": "7:108, 17:91-94, 9:25-26, 10:21, 13:8, 54:2, 85:4"
            },
            {
                "id": 12537,
                "topic": "Muhammad<sup>(sa)</sup>: miracles of",
                "verses": "54:2"
            },
            {
                "id": 15939,
                "topic": "Rod: <i>‘Asa</i>",
                "verses": "7:108, 2:61, 7:118, 7:161, 17:102, 20:19-22, 20:70, 20:78, 26:33, 26:46, 26:64, 27:11, 28:32"
            }
        ],
        "ar": "فَلَمۡ تَقۡتُلُوۡہُمۡ وَلٰکِنَّ اللّٰہَ  قَتَلَہُمۡ ۪ وَ مَا رَمَیۡتَ اِذۡ رَمَیۡتَ وَ لٰکِنَّ اللّٰہَ رَمٰی ۚ وَ لِیُبۡلِیَ  الۡمُؤۡمِنِیۡنَ  مِنۡہُ  بَلَآءً  حَسَنًا ؕ اِنَّ اللّٰہَ  سَمِیۡعٌ  عَلِیۡمٌ ﴿۱۸﴾",
        "ur": "پس تم نے انہیں قتل نہیں کیا بلکہ اللہ ہے جس نے انہیں قتل کیا ہے اور (اے محمد!) جب تُو نے (ان کی طرف کنکر) پھینکے تو تُو نے نہیں پھینکے بلکہ اللہ ہے جس نے پھینکے۔ اور یہ اس لئے ہوا کہ وہ اپنی طرف سے مومنوں کو ایک اچھی آزمائش میں مبتلا کرے۔ یقیناً اللہ بہت سننے والا (اور) دائمی علم رکھنے والا ہے۔",
        "v5": {
            "text": "So you killed them not, but it was Allah Who killed them. And thou threwest not when thou didst throw, <i>but</i> it was Allah Who threw, <i>that </i>[a]<i>He might overthrow the disbelievers</i> and that He might confer on the believers a great favour from Himself. Surely, Allah is All-Hearing, All-Knowing.[1107]",
            "notes": [
                {
                    "ref": "a",
                    "note": "33:12."
                },
                {
                    "ref": "1107",
                    "note": "<p><strong>Important Words:</strong></p><p>لیبلی (that He might confer). یبلی is derived from ابلا which is derived from بلاء . They say بلاہ or ابتلاہ i.e. he tried, proved or tested him with something good or evil. ابلاہ اللّٰه بلاء حسنا means, God did to him a good deed. ابلیته معروفا means, I conferred upon him a favour or benefit. بلاء means, the act of trying or testing; a trial or a test; an affliction of any kind by which one’s patience or any other virtue is tried or proved or tested; a benefit, favour or blessing; grief; imposition of a difficult or troublesome thing. بلاء حسن means, a great benefit or favour or blessing of God or a good gift of God. الابتلاءsignifies trying, proving or testing with something; seeking and desiring; choosing or selecting (Lane).</p><p><strong>Commentary:</strong></p><p>The words, <i>So you killed them not, but it was Allah Who killed them</i>, signify that the victory at Badr was not due to any effort on the part of the Muslims; it was purely an act of God. Thus, as enjoined in the preceding verse, there is no justification for Muslims to flee from a battlefield.</p><p>The Battle of Badr, fought in the second year of Hijrah, began with single combats; then there was a general attack. At this juncture the Holy Prophet took a handful of pebbles and cast them towards the enemy. That was a token for the help of God to come, just as striking the water of the sea with the rod by Moses was a signal for God’s aid to arrive. When the Holy Prophet cast the pebbles, there rose a strong gale which, blowing directly in the direction of the enemy, blinded their eyes with sand and thus contributed to their discomfiture and the victory of the Muslims. It is to this incident that the words, <i>it was Allah Who threw</i>, refer, hinting that really it was the hand of God, and not the hand of the Prophet, which cast the pebbles, and that the victory was due to the fact that God had come to the help of the Muslims.</p><p>The reader should note that while speaking of the Companions of the Holy Prophet in the words, <i>you killed them not</i>, the verse ascribes no act to the Companions, but simply denies their having killed the enemy, whereas in the case of the throwing of the pebbles by the Holy Prophet the verse says, <i>thou threwest not when thou didst throw, but it was Allah Who threw</i>, thus hinting that although victory came from God, yet the Holy Prophet also had a share in the affair. He contributed his share in the form of earnest prayers which drew the help of God.</p><p>The throwing of a handful of pebbles and sand by the Holy Prophet bears a remarkable resemblance to the striking of the waters by Moses with the rod. Just as in the latter case the act of Moses was a signal for the wind to blow, which led to the drowning of Pharaoh and his hosts in the sea, similarly, the throwing of a handful of pebbles by the Holy Prophet was a signal for a strong wind to blow which led to the destruction of Abu Jahl (of whom the Holy Prophet spoke as the Pharaoh of his people) and his host in the desert. Again, after the Battle of Badr, the bodies of Abu Jahl and other leaders of the Quraish were cast into the bottom of a pit or an old well, and thus the similarity of the fate of Abu Jahl with that of Pharaoh was completed; for, just as the latter together with his host was drowned into the depths of the sea, so was the former with his comrades cast into the bottom of a well.</p><p>The reference in the words, <i>Allah is All-Hearing All-Knowing</i>, is to the prayers of the Holy Prophet which God heard and accepted and in response to which He conferred such a signal victory on the Muslims.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 19,
        "v_": 18,
        "topics": [],
        "ar": "ذٰلِکُمۡ وَ اَنَّ اللّٰہَ  مُوۡہِنُ کَیۡدِ الۡکٰفِرِیۡنَ ﴿۱۹﴾ ",
        "ur": "یہ تھا تمہارا حال اور یہ (بھی حق ہے) کہ اللہ ہی کافروں کی تدبیر کو کمزور کرنے والا ہے۔",
        "v5": {
            "text": "That <i>is</i> <i>what happened</i>; and <i>know</i> that Allah is He Who weakens the design of the disbelievers.",
            "notes": null
        }
    },
    {
        "ch": 8,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 6546,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:26, 8:40, 8:74, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 13:26, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:5, 28:78, 28:84, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 11477,
                "topic": "Mischief: of disbelievers",
                "verses": "2:74, 3:64, 8:74, 10:41, 27:49, 33:61, 44:16, 59:16"
            },
            {
                "id": 13290,
                "topic": "Open: <i>Fataha</i>: adjudicate",
                "verses": "7:90, 26:119, 34:27"
            }
        ],
        "ar": "اِنۡ تَسۡتَفۡتِحُوۡا فَقَدۡ جَآءَکُمُ الۡفَتۡحُ ۚ وَ اِنۡ تَنۡتَہُوۡا فَہُوَ خَیۡرٌ  لَّکُمۡ ۚ وَ اِنۡ تَعُوۡدُوۡا نَعُدۡ ۚ وَ لَنۡ تُغۡنِیَ عَنۡکُمۡ فِئَتُکُمۡ شَیۡئًا وَّ لَوۡ  کَثُرَتۡ ۙ وَ اَنَّ اللّٰہَ مَعَ  الۡمُؤۡمِنِیۡنَ ﴿٪۲۰﴾ ",
        "ur": "(پس اے مومنو!) اگر تم فتح طلب کیا کرتے تھے تو فتح تو تمہارے پاس آ گئی۔ اور (اے منکرو! اب بھی) اگر تم باز آ جاؤ تو تمہارے لئے بہتر ہے اور اگر تم (شرارت کا) اِعادہ کرو گے تو ہم بھی (عذاب کا) اِعادہ کریں گے اور تمہارا جتھا تمہارے کسی کام نہ آئے گا خواہ کتنا ہی  زیادہ ہو اور یہ (جان لو) کہ اللہ مومنوں کے ساتھ ہے۔",
        "v5": {
            "text": "[a]If you sought a judgement, then judgement has indeed come to you. And if you desist, it will be better for you; but if you return <i>to hostility</i>, We <i>too</i> will return. And your party shall be of no avail at all to you, however numerous it be, and <i>know</i> that Allah is with the believers.[1108]",
            "notes": [
                {
                    "ref": "a",
                    "note": "32:29."
                },
                {
                    "ref": "1108",
                    "note": "<p><strong>Important Words:</strong></p><p>تستفتحوا (if you sought a judgement) is derived from استفتح which again is derived from فتح which means, he opened or he unlocked. فتح الحاکم بین الناس means, the judge or magistrate judged between the people. استفتح means, he asked or sought or demanded victory; or he asked or sought or demanded judgement (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse is addressed to the disbelievers who demanded the sign of victory or God’s judgement from the Holy Prophet. They said, \"If you are a true Messenger of God, why does He not help you and grant you victory?\" They are here told that God’s judgement in the form of victory has indeed come and that if they now desist from fighting, it will be well for them; but if they return to war, God will show them further signs of victory and they shall be defeated and brought low in spite of their great superiority in numbers and resources, for <i>Allah is with the believers.</i></p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 2102,
                "topic": "Allah: obey and His Messenger",
                "verses": "4:60, 3:33, 3:133, 4:14, 4:81, 5:93, 8:2, 8:47, 24:53, 24:55, 33:72, 47:34, 48:18, 58:14"
            },
            {
                "id": 13212,
                "topic": "Obey: Allah, Messenger",
                "verses": "24:48-55, 3:21, 3:33, 3:51, 3:133, 4:14, 4:60, 4:65, 4:70, 4:81, 5:93, 8:2, 8:47, 24:57, 26:108-109, 26:127, 26:145, 26:164, 26:180, 33:34, 33:36-37, 33:72, 43:64, 47:34, 48:18, 58:14, 64:13, 64:17"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَطِیۡعُوا اللّٰہَ وَ رَسُوۡلَہٗ  وَ لَا تَوَلَّوۡا عَنۡہُ وَ اَنۡتُمۡ تَسۡمَعُوۡنَ ﴿ۚۖ۲۱﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! اللہ اور اس کے رسول کی اطاعت کرو اور اِس کے باوجود اُس سے روگردانی نہ کرو کہ تم سن رہے ہو۔",
        "v5": {
            "text": "O ye who believe! obey [a]Allah and His Messenger, and do not turn away from him while you hear <i>him speak</i>.[1109]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:33; 4:60; 8:47; 24:55."
                },
                {
                    "ref": "1109",
                    "note": "<p><strong>Commentary:</strong></p><p>As God was the source of all strength and the Prophet was a means thereof, so the Faithful are here enjoined to obey God and His Messenger. Muslims had by this time witnessed many signs of God; they had only just witnessed a mighty sign in the Battle of Badr. Having witnessed so many signs, it was incumbent on them to be obedient to God and His Messenger. Those who had taken part in the Battle of Badr were all true Muslims; there was no hypocrite among them except perhaps one. But in future battles, there were to be hypocrites also; hence there was the greater need for Muslims to be on their guard and to be more careful in the matter of obedience. The fact is that until the Battle of Badr, ‘Abdullah bin Ubayy, the arch-hypocrite, and his confederates had been under the delusion that Islam was only a passing show and that the little group of Muslims would soon disappear. The victory at Badr, therefore, came to them as a severe shock, and their false hopes were shattered. So from this time onward, they became increasingly more active in their machinations against Islam and the Holy Prophet. Hence, the need of an exhortation to Muslims to be ever obedient to God and His Messenger, for it was in obedience and in unity that lay the secret of their future success and prosperity.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 22,
        "v_": 21,
        "topics": [],
        "ar": "وَ لَا تَکُوۡنُوۡا کَالَّذِیۡنَ قَالُوۡا سَمِعۡنَا وَ ہُمۡ لَا  یَسۡمَعُوۡنَ ﴿۲۲﴾ ",
        "ur": "اور ان لوگوں کی طرح نہ ہو جنہوں نے کہا تھا ہم نے سن لیا جبکہ درحقیقت وہ سن نہیں رہے تھے۔",
        "v5": {
            "text": "And be not like those [a]who say, ‘We hear,’ but they hear not.[1110]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:94; 4:47."
                },
                {
                    "ref": "1110",
                    "note": "<p><strong>Commentary:</strong></p><p>True Muslims are here warned against following the example of hypocrites, who say they listen but they listen not.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 1719,
                "topic": "Allah: has made them apes, swine, beasts",
                "verses": "2:66, 5:61, 7:167, 8:56, 98:7"
            },
            {
                "id": 5545,
                "topic": "Dabbatul-Ard: creatures, beasts",
                "verses": "27:83, 2:165, 6:39, 8:56, 11:7, 11:57, 16:50, 16:62, 22:19, 31:11, 34:15, 35:29, 35:46, 42:30, 45:5, 81:6"
            },
            {
                "id": 6084,
                "topic": "Deaf",
                "verses": "18:58, 2:19, 2:179, 5:72, 6:26, 6:40, 11:25, 17:47, 17:98, 21:46, 25:74, 27:81, 41:45, 43:41, 47:24"
            }
        ],
        "ar": "اِنَّ شَرَّ الدَّوَآبِّ عِنۡدَ اللّٰہِ الصُّمُّ الۡبُکۡمُ  الَّذِیۡنَ  لَا  یَعۡقِلُوۡنَ ﴿۲۳﴾ ",
        "ur": "یقیناً خدا کے نزدیک تمام جانداروں میں بدترین وہ بہرے اور گونگے ہیں جو عقل نہیں کرتے۔",
        "v5": {
            "text": "Surely, [b]the worst of beasts in the sight of Allah are the deaf <i>and</i> the dumb, who have no sense.[1111]",
            "notes": [
                {
                    "ref": "b",
                    "note": "8:56; 98:7."
                },
                {
                    "ref": "1111",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse primarily refers to the hypocrites. They have ears but they listen not to the Word of God, so truly speaking they are deaf; they have tongues, but they do not seek after and inquire about the truth, so they are dumb; they have hearts, but they do not ponder over the truth, so they have no sense and do not understand. Indeed, if the gifts of hearing and of speaking and of thinking are taken away from man, he is left no better than a beast. Nay, he virtually becomes \"the worst of beasts\" for, in spite of possessing the faculty and power of hearing and speaking and thinking, he does not use these powers.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 24,
        "v_": 23,
        "topics": [],
        "ar": "وَ لَوۡ عَلِمَ اللّٰہُ  فِیۡہِمۡ خَیۡرًا لَّاَسۡمَعَہُمۡ ؕ وَ لَوۡ  اَسۡمَعَہُمۡ  لَتَوَلَّوۡا  وَّ ہُمۡ  مُّعۡرِضُوۡنَ ﴿۲۴﴾ ",
        "ur": "اور اگر اللہ ان کے اندر کوئی بھی اچھی بات دیکھتا تو انہیں ضرور سنا دیتا۔ اور اگرانہیں سنا بھی دیتا تو ضرور اِعراض کرتے ہوئے وہ پیٹھ پھیر جاتے۔",
        "v5": {
            "text": "And if Allah had known any good in them, He would certainly have made them hear. And if He <i>now</i> makes them hear, they will turn away, in aversion.[1112]",
            "notes": [
                {
                    "ref": "1112",
                    "note": "<p><strong>Commentary:</strong></p><p>The expression اسمعھم (made them hear) in the first place mean that if God had known any good in them, He would have made them hear and accept the truth. The verse thus shows that it is only those whose hearts are wholly corrupt that are caused or allowed to go astray by God. Those in whose hearts there is any good are always led by God to the acceptance of the truth.</p><p>The second clause of the verse indicates that while Allah makes good men accept and follow guidance, He never forces anyone to go astray. The expression اسمعھم (made them hear) in the second place, therefore, means that if in their present condition God should force them to accept the truth, the result would be that their hearts would remain unconverted and they would never become true Muslims.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 25,
        "v_": 24,
        "topics": [
            {
                "id": 2251,
                "topic": "Allah: respond to, and His Messenger",
                "verses": "3:173, 46:32"
            },
            {
                "id": 2850,
                "topic": "Arguments for: <i>Burhan</i>: Holy Prophet<sup>(sa)</sup> free from shortcomings",
                "verses": "2:112, 48:3, 3:32, 3:165, 21:28, 33:22, 48:11, 53:3-6, 68:5, 81:20"
            },
            {
                "id": 6156,
                "topic": "Dead, Death: <i>Maut</i>: God restores to life",
                "verses": "2:260-261, 2:57, 2:74, 2:244, 6:37, 8:43, 22:7, 22:67, 26:82, 30:20, 30:25, 30:51, 36:13, 36:34, 40:12, 41:40, 42:10, 43:12, 46:34, 50:12, 75:41"
            },
            {
                "id": 9313,
                "topic": "Infallibility: <i>‘Ismah</i>, impeccability, sinlessness",
                "verses": "48:3, 2:130, 3:165, 6:163, 7:158, 12:25, 21:28, 33:22, 48:11, 50:39, 53:3-4, 68:5, 81:20-22"
            },
            {
                "id": 12519,
                "topic": "Muhammad<sup>(sa)</sup>: message of",
                "verses": "5:68, 6:20, 6:51, 6:107, 6:163-164, 7:158-159, 7:204, 10:16, 10:110, 21:46, 22:68, 23:74-75, 25:2, 25:53, 29:19, 33:3, 34:44, 34:47, 36:2-8, 42:53, 43:44, 46:10, 53:3, 62:3"
            },
            {
                "id": 15629,
                "topic": "Resurrection: spiritual",
                "verses": "6:37, 2:57, 2:74, 2:261, 5:111, 7:15, 7:58, 22:6, 30:51, 41:40, 56:2-7, 69:14-17, 75:41"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اسۡتَجِیۡبُوۡا لِلّٰہِ وَ لِلرَّسُوۡلِ  اِذَا دَعَاکُمۡ  لِمَا یُحۡیِیۡکُمۡ ۚ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ یَحُوۡلُ بَیۡنَ الۡمَرۡءِ وَ قَلۡبِہٖ  وَ اَنَّہٗۤ   اِلَیۡہِ  تُحۡشَرُوۡنَ ﴿۲۵﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! اللہ اور رسول کی آواز پر لبیک کہا کرو جب وہ تمہیں بلائے تاکہ وہ تمہیں زندہ کرے اور جان لو کہ اللہ انسان اور اس کے دل کے درمیان حائل ہوتا ہے اور یہ بھی (جان لو) کہ تم اسی کی طرف اکٹھے کئے جاؤ گے۔",
        "v5": {
            "text": "O ye who believe! [a]respond to Allah, and the Messenger when he calls you that he may give you life, and know that Allah comes in between a man and his heart, and that He it is unto Whom you will be gathered.[1113]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:33; 4:60; 8:47; 24:55."
                },
                {
                    "ref": "1113",
                    "note": "<p><strong>Commentary:</strong></p><p>Though the verse enjoins the Faithful to respond to both Allah and His Messenger, it does not say \"when they (Allah and His Messenger) call you\" but simply \"when he calls you.\" The pronoun \"he\" obviously refers to the Messenger, for it is the Messenger who actually calls. Calling by God is also through His Messenger. Or the singular pronoun \"he\" may be taken to refer to both Allah and the Messenger taken separately, i.e. when Allah calls you or when the Messenger calls you.</p><p>The words, <i>that he may give you life</i>, embody a great truth. The calling of the Messenger is always for the purpose of giving life to those who believe. It must, however, be remembered that when the quickening of, or the giving of life to, the dead is ascribed to a Prophet of God, the words should be taken not in their physical but in their spiritual sense.</p><p>The words, <i>know that Allah comes in between a man and his heart</i>, are important. There are two powers in men, firstly, the will-power of the \"I\". This power has its seat in the mind and has, therefore, been referred to in the verse as \"man\". The second power lies in the heart. The \"I\" or the will-power, or in other words \"the man,\" issues its command and it is for the heart to obey it. But an unpurified heart does not always obey the command emanating from the mind. The words, <i>Allah comes in between a man and his heart</i>, therefore, signify that God has His position between the \"I\" and the heart. Man has not the power to purify his heart, i.e. he cannot make it obey the dictates of the \"I\", for he has no control over it. But God controls the heart and can purify it. So we should obey God that He may purify our heart and make it follow the will of the \"I\". The expression is figurative and means that it is God alone Who can make the dictates of the \"I\" have the desired effect on the heart.</p><p>The verse also hints that one should always hasten to hear and obey a good call; for if one delays doing so, the law of God, meant for those who hesitate to accept the truth and keep back from it, is likely to come in, and make the heart rusty, with the result that it becomes all the more disinclined to accept the truth.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 26,
        "v_": 25,
        "topics": [
            {
                "id": 840,
                "topic": "Affliction: <i>Bala’</i>",
                "verses": "2:156-158, 2:50, 2:125, 2:178, 2:215, 2:250, 3:143, 3:155, 4:63, 6:18, 7:142, 7:164, 7:169, 16:28, 16:54-55, 17:57, 17:74, 21:84, 21:88, 22:36, 23:31, 28:48, 29:11, 30:34, 30:37, 38:42, 39:9, 41:51, 47:32, 64:12, 68:7"
            },
            {
                "id": 6547,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:20, 8:40, 8:74, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 13:26, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:5, 28:78, 28:84, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 7170,
                "topic": "Environment: <i>Mahaul</i>",
                "verses": "2:52, 2:18, 4:98, 4:101, 5:101, 11:104, 17:2, 30:31, 113:2"
            }
        ],
        "ar": "وَ اتَّقُوۡا فِتۡنَۃً لَّا تُصِیۡبَنَّ الَّذِیۡنَ ظَلَمُوۡا مِنۡکُمۡ خَآصَّۃً ۚ وَ اعۡلَمُوۡۤا  اَنَّ اللّٰہَ  شَدِیۡدُ  الۡعِقَابِ ﴿۲۶﴾ ",
        "ur": "اور اس فتنہ سے ڈرو جو محض ان لوگوں کو ہی نہیں پہنچے گا جنہوں نے تم میں سے ظلم کیا اور جان لو کہ اللہ عقوبت میں بہت سخت ہے۔",
        "v5": {
            "text": "And [a]beware of an affliction which will surely not smite those among you exclusively who have done wrong. And know that Allah is severe in requiting.[1114]",
            "notes": [
                {
                    "ref": "a",
                    "note": "11:114."
                },
                {
                    "ref": "1114",
                    "note": "<p><strong>Important Words:</strong></p><p>فتنة (affliction). See 2:192.</p><p><strong>Commentary:</strong></p><p>The verse embodies a great and important truth. It is not enough that you should become good yourselves. If you are surrounded by wicked and ungodly persons, you cannot escape the contagion and its consequences. Thus, even a good man may sometimes be overtaken by Divine punishment, if he is living among wicked people and does not shun their society. Hence, we should not only try to lead righteous lives ourselves, but should also endeavour to make others do the same. We should not only reform ourselves but try to reform the society in which we move and the people among whom we live. We cannot long enjoy safety if the houses surrounding ours are on fire.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 27,
        "v_": 26,
        "topics": [
            {
                "id": 2177,
                "topic": "Allah: provides and feeds",
                "verses": "11:7, 2:23, 2:61, 6:15, 6:152, 10:32, 10:60, 10:94, 15:21, 16:73, 16:115, 17:31-32, 17:71, 20:133, 27:65, 29:61, 35:4, 40:65, 42:20"
            },
            {
                "id": 7506,
                "topic": "Fear: cast into disbelievers",
                "verses": "8:13, 2:20, 2:67, 2:207, 3:176, 8:57, 33:20, 34:52, 42:23, 106:5"
            },
            {
                "id": 13301,
                "topic": "Oppressed: weak, <i>da‘if</i>",
                "verses": "14:22, 2:267, 2:283, 4:10, 4:76, 4:98-99, 7:76, 9:91, 11:92, 28:5-6, 34:32-33, 40:48"
            },
            {
                "id": 17603,
                "topic": "Tayyib: good things, <i>Tayyibat</i>",
                "verses": "5:101, 2:58, 2:173, 2:268, 4:3, 4:44, 4:161, 5:5-6, 5:88, 7:33, 7:158, 7:161, 8:70, 10:94, 16:73, 17:71, 20:82, 22:25, 24:27, 35:11, 45:17, 46:21"
            }
        ],
        "ar": "وَ اذۡکُرُوۡۤا اِذۡ  اَنۡتُمۡ  قَلِیۡلٌ  مُّسۡتَضۡعَفُوۡنَ فِی الۡاَرۡضِ تَخَافُوۡنَ  اَنۡ  یَّتَخَطَّفَکُمُ النَّاسُ فَاٰوٰٮکُمۡ وَ اَیَّدَکُمۡ بِنَصۡرِہٖ وَ رَزَقَکُمۡ مِّنَ الطَّیِّبٰتِ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۲۷﴾ ",
        "ur": "اور یاد کرو جب تم بہت تھوڑے تھے (اور) زمین میں کمزور شمار کئے جاتے تھے (اور) ڈرا کرتے تھے کہ کہیں لوگ تمہیں اُچک نہ لے جائیں تو اس نے تمہیں پناہ دی اور اپنی نصرت سے تمہاری تائید کی اور تمہیں پاکیزہ چیزوں میں سے رزق دیا تاکہ تم شکرگزار بنو۔",
        "v5": {
            "text": "And [b]remember <i>the time</i> when you were few <i>and</i> deemed weak in the land, <i>and</i> were in fear lest people should snatch you away, but He sheltered you and strengthened you with His help, and provided you with good things that you might be thankful.[1115]",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:87."
                },
                {
                    "ref": "1115",
                    "note": "<p><strong>Commentary:</strong></p><p>Muslims are here told that as God saved them when they were weak in the land and were surrounded by wicked and mischievous people, so they should strive to save those who are weak and surrounded by dangers. The verse also hints that as Muslims will soon prosper and attain power, they should never forget the days of hardships through which they have passed, i.e. in the days of their power, they should never oppress the weak creatures of God but should always treat them with justice and mercy.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 28,
        "v_": 27,
        "topics": [
            {
                "id": 2171,
                "topic": "Allah: prove loyalty to",
                "verses": null
            },
            {
                "id": 4382,
                "topic": "Betray",
                "verses": "2:188, 4:108, 5:14, 8:59, 8:72, 12:53, 22:39, 40:20"
            },
            {
                "id": 6517,
                "topic": "Dishonesty: <i>Khiyanah</i>",
                "verses": "3:162, 4:106, 4:108, 8:59, 12:53, 22:39, 40:20, 66:11"
            },
            {
                "id": 11999,
                "topic": "Moral Traits: trustworthiness",
                "verses": "4:59, 2:284, 23:9, 70:33-34"
            },
            {
                "id": 17933,
                "topic": "Trusts: <i>Amanah</i>",
                "verses": "4:59, 2:284, 3:76, 5:68, 23:9, 33:73, 51:20, 70:33"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَخُوۡنُوا اللّٰہَ وَ الرَّسُوۡلَ وَ تَخُوۡنُوۡۤا اَمٰنٰتِکُمۡ وَ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿۲۸﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! اللہ اور (اس کے) رسول سے خیانت نہ کرو ورنہ تم اس کے نتیجہ میں خود اپنی امانتوں سے خیانت کرنے لگو گے جبکہ تم (اس خیانت کو) جانتے ہوگے۔",
        "v5": {
            "text": "O ye who believe! prove not false to Allah and the Messenger, nor prove false to your trusts knowingly.[1116]",
            "notes": [
                {
                    "ref": "1116",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse enjoins Muslims not to act faithlessly with regard to either the commandments of God or the rights of one another. Indeed, a Muslim should always be true to God and true to his fellow beings.</p><p>It is significant that when speaking of being true to God, the verse directly says, <i>prove not false to Allah</i>, but when speaking of men the words used are, <i>prove not false to your trusts</i>.</p><p>This is to point out that whereas faithfulness to God is absolute and eternal, being based on the very creation of man, faithfulness to man springs from the trusts and obligations that he may form or enter into.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 29,
        "v_": 28,
        "topics": [
            {
                "id": 2453,
                "topic": "Allah: tries you with wealth and your children",
                "verses": "24:38, 63:10, 64:16, 102:2"
            },
            {
                "id": 5016,
                "topic": "Children: are a trial",
                "verses": "16:59-60, 19:78, 34:36, 57:21, 64:15"
            },
            {
                "id": 9695,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 10900,
                "topic": "Man: trial on earth",
                "verses": "2:156-157, 2:103, 3:187, 6:166, 10:86, 14:7, 21:36, 21:112, 22:12, 22:54, 25:29, 39:50, 54:28, 64:16, 94:16"
            },
            {
                "id": 14364,
                "topic": "Property: &amp; children a trial",
                "verses": null
            },
            {
                "id": 15740,
                "topic": "Reward: <i>Jaza’</i>, Ajr",
                "verses": "28:85, 4:41, 4:115, 4:125, 4:135, 4:163, 5:10, 6:161, 10:73, 11:109, 12:57, 17:10, 26:110, 32:20-23"
            },
            {
                "id": 17881,
                "topic": "Trial: children, wealth, a",
                "verses": "2:156, 63:10, 64:16"
            },
            {
                "id": 17892,
                "topic": "Trial: Fitnah",
                "verses": "7:156, 2:103, 5:72, 8:74, 9:49, 10:86, 17:61, 21:36, 21:112, 22:12, 22:54, 24:64, 25:21, 29:11, 37:64, 39:50, 54:28, 60:6, 64:16, 74:32"
            }
        ],
        "ar": "وَ اعۡلَمُوۡۤا  اَنَّمَاۤ   اَمۡوَالُکُمۡ  وَ اَوۡلَادُکُمۡ  فِتۡنَۃٌ ۙ وَّ اَنَّ اللّٰہَ عِنۡدَہٗۤ  اَجۡرٌ  عَظِیۡمٌ ﴿٪۲۹﴾ ",
        "ur": "اور جان لو کہ تمہارے اموال اور تمہاری اولاد محض ایک آزمائش ہیں اور یہ (بھی) کہ اللہ کے پاس ایک بہت بڑا اَجر ہے۔",
        "v5": {
            "text": "And know that [a]your possessions and your children are but a trial and that it is Allah with Whom is a great reward.[1117]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:187; 64:16."
                },
                {
                    "ref": "1117",
                    "note": "<p><strong>Important Words:</strong></p><p>فتنة (trial) is derived from فتن . They say فتنه i.e. he tried or proved or tested him. So فتنه means, a trial meant to separate the good from the bad. See also 2:103, 192; 4:92 &amp; 5:50,72. Thus فتنة is anything that is a means of purification and advancement for the good and a means of exposure and downfall for the wicked.</p><p><strong>Commentary:</strong></p><p>As فتنة (trial) is a means of purification, our possessions and our children are called a \"trial\" because they are a means of our spiritual purification. It is by means of them that we are able to make sacrifices in the cause of religion and humanity. If we have no wealth, we cannot give it away in the service of God or of our fellow-creatures. If we have no children, we will not be in a position to train them as good and pious men for the service of God and mankind. Moreover, if we have no children, we shall be free and shall have no obstacle to overcome; and, therefore, our spending money in the cause of God will, in that case, not give us as much credit as it would do if we spent it while we had children. Thus, both our possessions and our children enable us to make sacrifices in the cause of God and our fellow beings; they are, therefore, a blessing, not a curse. But they may become a curse for the wicked, for whom the love of wealth and children proves a great stumbling block.</p><p>The words, <i>a great reward</i>, signify that when God has conferred on us blessings like wealth and children without any endeavour on our part, He can bestow on us far greater rewards, if we strive in His cause and try to win His favour. But if the word فتنة (trial) is taken in a bad sense, i.e. a stumbling block, then the words \"a great reward\" would signify that if our wealth and children prove a stumbling block for us, we should not allow them to stand in our way, but should turn to God with Whom we will find a great reward for this sacrifice of ours.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 30,
        "v_": 29,
        "topics": [
            {
                "id": 3715,
                "topic": "Attributes of Allah: Dhul-Fadl (Lord of bounty)",
                "verses": "2:106, 2:252, 3:75, 3:153, 3:175, 10:61, 27:74, 40:62, 57:30, 62:5"
            },
            {
                "id": 6581,
                "topic": "Discrimination: <i>Furqan</i>",
                "verses": "25:2, 2:54, 2:186, 3:5, 8:42, 21:49"
            },
            {
                "id": 6850,
                "topic": "Duty: towards Allah",
                "verses": "5:101, 9:44, 59:19, 64:17, 71:4"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنۡ تَتَّقُوا اللّٰہَ یَجۡعَلۡ لَّکُمۡ فُرۡقَانًا وَّ یُکَفِّرۡ عَنۡکُمۡ سَیِّاٰتِکُمۡ وَ یَغۡفِرۡ لَکُمۡ ؕ وَ اللّٰہُ  ذُو الۡفَضۡلِ  الۡعَظِیۡمِ ﴿۳۰﴾ ",
        "ur": "اے لوگو جو ایمان لائے ہو! اگر تم اللہ سے ڈرو تو وہ تمہارے لئے ایک امتیازی نشان بنادے گا اور تم سے تمہاری برائیاں دور کر دے گا اور تمہیں بخش دے گا اور اللہ فضل عظیم کا مالک ہے۔",
        "v5": {
            "text": "O ye who believe! [a]if you fear Allah, He will grant you a distinction and will remove your evils from you and will forgive you; and Allah is <i>Lord</i> of great bounty.[1118]",
            "notes": [
                {
                    "ref": "a",
                    "note": "48:6; 64:10; 66:9."
                },
                {
                    "ref": "1118",
                    "note": "<p><strong>Important Words:</strong></p><p>فرقان (distinction) means: (1) that which enables one to distinguish between truth and falsehood and right and wrong; (2) proof or evidence or argument; (3) aid or victory; (4) dawn (Lane). See also 2:54.</p><p><strong>Commentary:</strong></p><p>The word فرقان (distinction) may be taken here in all the four senses mentioned under Important Words above. Firstly, if a man becomes God-fearing, he is given a light by means of which he is able to distinguish between right and wrong. Secondly, the righteous and the God-fearing are taught and vouchsafed proofs and arguments by God. They do not blindly believe in the truth of their religion but they are granted proofs and arguments for what they believe. Thirdly, God-fearing men receive aid and victory from God. Fourthly, God removes from them the darkness of hardships and there dawns upon them the day of happiness and bliss.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 31,
        "v_": 30,
        "topics": [
            {
                "id": 3751,
                "topic": "Attributes of Allah: Khairul-Makirin (Best of Planners)",
                "verses": "3:55"
            },
            {
                "id": 8880,
                "topic": "Hijrah",
                "verses": null
            },
            {
                "id": 11153,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 11185,
                "topic": "Medinah: <i>Yathrib</i>",
                "verses": "59:12-16, 9:74, 9:101, 9:120, 17:81, 33:14, 33:61, 63:9"
            },
            {
                "id": 11428,
                "topic": "Migration: <i>Hijrah</i>: of Holy Prophet<sup>(sa)</sup>",
                "verses": "28:86, 9:40, 17:2, 89:2"
            },
            {
                "id": 12280,
                "topic": "Muhammad<sup>(sa)</sup>: and disbelievers",
                "verses": "15:89-98, 2:7, 2:110, 2:119, 2:192, 2:218, 3:33, 3:128, 3:177, 3:197, 4:91, 4:103, 5:42, 5:55, 6:34, 9:2, 9:4, 9:32, 9:40, 9:73, 9:123, 10:66, 11:13, 13:28, 15:3, 16:128, 18:7, 20:134, 22:16, 25:5, 26:4, 27:71, 28:57, 29:51, 35:5, 35:9, 36:77, 41:6, 48:30, 52:34, 66:10, 68:52, 73:11, 93:6, 94:2-4"
            },
            {
                "id": 12427,
                "topic": "Muhammad<sup>(sa)</sup>: enemies of,",
                "verses": "4:114-116, 6:22, 8:34, 9:61, 13:11-12, 23:94-99, 27:49-52"
            },
            {
                "id": 13982,
                "topic": "Plot: Plan, <i>Makar</i>",
                "verses": "3:55, 4:109, 6:124, 7:100, 7:124, 10:22, 12:6, 13:34, 13:43, 14:47, 16:27, 16:46, 27:51-52, 34:34, 35:11, 35:44, 40:46, 52:43, 71:23"
            },
            {
                "id": 14942,
                "topic": "Quraysh",
                "verses": "106:2, 2:74, 2:130, 2:218, 3:126, 12:93, 21:41, 23:95, 26:215, 27:49, 30:5, 33:10, 48:2, 48:12, 53:21, 54:2, 54:10, 59:3, 59:15, 60:2, 80:2, 106:5"
            },
            {
                "id": 17670,
                "topic": "Thaur: cave of",
                "verses": "9:40, 93:3"
            }
        ],
        "ar": "وَ اِذۡ یَمۡکُرُ بِکَ الَّذِیۡنَ کَفَرُوۡا لِیُثۡبِتُوۡکَ اَوۡ یَقۡتُلُوۡکَ اَوۡ یُخۡرِجُوۡکَ ؕ وَ یَمۡکُرُوۡنَ وَ یَمۡکُرُ  اللّٰہُ  ؕ وَ اللّٰہُ خَیۡرُ الۡمٰکِرِیۡنَ ﴿۳۱﴾ ",
        "ur": "اور (یاد کرو) جب وہ لوگ جو کافر ہوئے تیرے متعلق سازشیں کر رہے تھے تاکہ تجھے (ایک ہی جگہ) پابند کر دیں یا تجھے قتل کر دیں یا تجھے (وطن سے) نکال دیں۔ اور وہ مکر میں مصروف تھے اور اللہ بھی ان کے مکر کا توڑ کر رہا تھا اوراللہ مکر کرنے والوں میں سب سے بہتر ہے۔",
        "v5": {
            "text": "And <i>remember the time</i> when the disbelievers plotted against thee that they might imprison thee or kill thee or expel thee. And [a]they planned and Allah <i>also</i> planned, and Allah is the best of planners.[1119]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:55; 27:51."
                },
                {
                    "ref": "1119",
                    "note": "<p><strong>Important Words:</strong></p><p>یثبتوك (imprison thee) is derived from اثبت which is derived from ثبت which means, it continued or subsisted or endured; or it remained fixed or stationary; or it was or became constant, fast or established. اثبته means, he made it to continue or subsist or endure; or he made it to remain fixed or stationary. They say اثبته جراحة i.e. wound rendered him unable to move. ضربوہ حتی اثبتوه means, they beat him so as to render him motionless. اثبته بوثاق means, he made him fast with a bond so that he could not move. So لیثبتوك (<i>liyuthbituka</i>) or لیثبتوك (<i>liyuthabbituka</i>), which is another reading of the word, means, that they might inflict upon thee a wound by reason of which thou shouldst not be able to rise or move about; or that they might confine thee to thy place, i.e. imprison thee and prevent thy moving about (Lane).</p><p><strong>Commentary:</strong></p><p>The Holy Prophet bore resemblance to all Prophets of God. At the Battle of Badr, God showed a miracle, similar to the miracle of Moses (see 8:18 above), while the present verse refers to a sign which was like the signs of Jonah and Jesus. At Mecca, the Quraish had a council-room called <i>Darun-Nadwah</i>. There they used to hold their consultations against the Holy Prophet. When they learnt that Islam had spread to Medina, where converts to the new Faith were fleeing for refuge, Abu Jahl and other leaders of the Quraish held a meeting at <i>Darun-Nadwah</i> in order to consider some decisive step to put an end to the new Movement. Various proposals were made at the meeting. One was that the Holy Prophet should be put under confinement, i.e. imprisoned; another was that he should be expelled from the city; yet another was that suitable men belonging to all the different tribes of the Quraish should be selected, and these should make a joint attack on the Holy Prophet and slay him. This last proposal was finally agreed upon, and the Holy Prophet’s house was surrounded one dark night with the object of attacking him as soon as he came forth. But, being apprised by God of the coming danger, the Holy Prophet had already made arrangements with Abu Bakr to flee from Mecca that very night. He, therefore, caused his nephew ‘Ali to lie in his bed and prepared himself to leave. Those who had laid siege to the house occasionally peeped into the house and, mistaking ‘Ali for the Holy Prophet, waited patiently for him outside. While thus waiting, it so happened that the watchers were overpowered by sleep, and the Holy Prophet, availing himself of the opportunity, departed from the house unnoticed. Abu Bakr was already waiting for him at some distance, and the two, bidding farewell to their beloved city, repaired, according to a pre-arranged plan, to a cave in a difficult mountain-top outside Mecca, where they took shelter. When the bloodthirsty Meccans knew of his escape, they quickly prepared to pursue him. They actually followed him, tracing his steps, till they reached the very cave where the Holy Prophet and Abu Bakr were in hiding; but, as the report says, already a spider had spun its cobweb across the mouth of the cave. Thus confronted, it never occurred to them that the Holy Prophet had taken shelter in that out-of-the-way cave whose entrance looked as if it had not been used for a long time. They argued that the tracer who had brought them to the mouth of the cave was at fault and it so happened that none of them so much as glanced into the cave to make sure whether or not anybody was inside. Thus it was that God saved His beloved servant from the clutches of the ravenous wolves that so savagely pursued him. Being unable to find any further trace of him, they returned to Mecca. As, however, a heavy price was set on his head, and it was announced that whoever brought him, dead or alive, would have a reward of 100 camels, people pursued him in all directions; but here, too, God came to his help and none could lay hands on him. After remaining hidden in the cave for three days, the Holy Prophet and his devoted Companion resumed their flight to Medina and, avoiding the better-known tracks, hastened to their destination where the Muslim community of the <i>Ansar</i> and such of the <i>Muhajirin</i> as had already reached there accorded them a most cordial welcome.</p><p>Thus, the Quraish practically resorted to all the three plans that have been mentioned in the verse under comment: (1) they confined the Holy Prophet when they laid siege to his house at night; (2) they drove him from his native city; and (3) they attempted to carry out their resolution of <i>Darun-Nadwah</i> to put him to death. But God baffled every attempt of theirs, and he, who had fled from their town as a helpless fugitive, returned to them eight years later as an illustrious victor, at whose hands they cringingly sought, and readily obtained, pardon. They planned and plotted against him, as the verse says; but their plans and intrigues led to their own ruin. They drove him from their city, but his very flight led him to power and prosperity and proved the cause of their destruction. Sometime after the flight, a Meccan army proudly issued forth from Mecca and proceeded to Badr, a place near Medina, little dreaming that it was going to its own ruin. All this was arranged and decreed by God, Who is <i>the best of planners</i>. He so arranged that the army which had come forth with such pomp and display of power returned from Badr an utterly routed and disorderly rabble, leaving its proud leaders either dead on the battlefield or captives in the hands of those whom they hated and despised.</p><p>It should be noted that the word مکر (plan) used in this verse does not necessarily mean an evil plot. It is general in its significance, comprising both good and evil planning, according to the purpose for which it is contrived. The plots of the enemies of truth were, of course, evil; but God never has recourse to evil design. He planned things in such a way as to frustrate the evil designs of the enemy and make the cause of Islam triumph. The very fact that the Quran prefixes the word خیر (best) to the word ماکرین (planners) shows that the word has been used in a good sense with respect to God; for the word خیر (meaning good, better or best) is invariably prefixed to words which are used in a good sense. See also 3:55.</p><p>The present verse has been placed most fittingly between the verses relating to the Battle of Badr; for after speaking of that great battle, the Quran reminds the Holy Prophet and his Companions of the plots of the enemy against him and draws his attention to the wonderful way in which God had helped him at the time of his flight, frustrating the designs of the enemy and turning them to the advantage of Islam. He would do it again when needed and the Battle of Badr was another instance of the kind.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 32,
        "v_": 31,
        "topics": [
            {
                "id": 6435,
                "topic": "Disbelief: <i>Kufr</i>: challenge to",
                "verses": "2:7-21, 2:24, 10:39, 11:13-14, 17:89, 22:16, 52:34-35"
            },
            {
                "id": 15040,
                "topic": "Qur’an: excellence, perfection of, <i>Ummul-Kitab</i>",
                "verses": "2:24, 2:3, 5:4, 6:156, 10:38-40, 11:2, 11:14-15, 13:32, 14:25-26, 15:2, 17:89, 18:110, 21:11, 21:25, 25:2, 27:2, 29:52, 38:2, 38:30, 39:24, 43:5, 52:34-35, 59:22, 73:6"
            },
            {
                "id": 15126,
                "topic": "Qur’an: objections to",
                "verses": "25:33-34, 3:8, 4:83, 6:26, 10:40, 11:2, 16:25, 16:104, 17:94, 18:110, 21:3-6, 23:84, 25:5-6, 27:7, 27:69, 34:44, 41:27, 43:31-32, 46:8, 46:18, 52:34, 68:16, 74:25, 83:14, 87:6"
            }
        ],
        "ar": "وَ اِذَا تُتۡلٰی عَلَیۡہِمۡ اٰیٰتُنَا قَالُوۡا قَدۡ سَمِعۡنَا لَوۡ  نَشَآءُ   لَقُلۡنَا مِثۡلَ  ہٰذَاۤ  ۙ اِنۡ  ہٰذَاۤ   اِلَّاۤ   اَسَاطِیۡرُ  الۡاَوَّلِیۡنَ ﴿۳۲﴾ ",
        "ur": "اور جب ہماری آیات ان پر پڑھی جاتی ہیں تو وہ کہتے ہیں بس ہم سُن چکے۔ ہم بھی اگر چاہیں تو ایسی ہی باتیں کر سکتے ہیں۔ یہ تو کچھ بھی نہیں مگر پرانے لوگوں کی کہانیاں ہیں۔",
        "v5": {
            "text": "And [a]when Our verses are recited to them, they say, ‘We have heard. If we wished we could certainly utter the like of this. This is nothing but <i>mere</i> tales of the ancients.’[1120]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:26; 68:16; 83:14."
                },
                {
                    "ref": "1120",
                    "note": "<p><strong>Commentary:</strong></p><p>The disbelievers alleged that they could produce a composition like that of the Quran. It was, however, nothing but an empty boast on their part, which they never attempted to carry into effect; and the challenge of the Quran, which declared that they would never be able to produce even a short chapter like any chapter of the Quran, has ever remained unanswered. The disbelievers also thought that the Quran contained nothing but the tales of the ancients. The verse under comment contradicts this assertion by drawing their attention to the powerful prophecies contained in the Quran which unmistakably prove it to be the Word of God, it being beyond the power of man to produce a composition containing such powerful prophecies. The Battle of Badr, for instance, fulfilled many a mighty prophecy, foretold by the Quran (e.g 54:45-47; 34:30, 31)—a fact which rendered it impossible for man to imitate a production like it, and which fully exposed the absurdity of the assertion that the Quran was nothing but tales of the ancients.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 33,
        "v_": 32,
        "topics": [
            {
                "id": 382,
                "topic": "Abu Jahl: punishment of",
                "verses": null
            },
            {
                "id": 8602,
                "topic": "Heaven: <i>Sama’</i>: descent from",
                "verses": "5:113, 4:154, 5:115, 36:29"
            },
            {
                "id": 8604,
                "topic": "Heaven: <i>Sama’</i>: punishment from",
                "verses": "2:60, 6:9, 7:163, 7:188, 11:83, 15:18, 17:16, 17:93, 26:188, 29:35, 29:41, 34:10, 39:68, 52:45, 55:38, 67:6, 67:18, 70:9-10, 77:10, 82:2"
            },
            {
                "id": 15241,
                "topic": "Rain",
                "verses": "4:103, 2:20, 2:266, 4:103, 6:7, 7:85, 11:53, 11:83-84, 15:75, 20:54, 24:44, 25:41, 26:174, 27:59, 30:49, 46:25"
            }
        ],
        "ar": "وَ  اِذۡ  قَالُوا اللّٰہُمَّ  اِنۡ کَانَ ہٰذَا ہُوَ الۡحَقَّ مِنۡ عِنۡدِکَ فَاَمۡطِرۡ عَلَیۡنَا حِجَارَۃً مِّنَ السَّمَآءِ اَوِ ائۡتِنَا بِعَذَابٍ اَلِیۡمٍ ﴿۳۳﴾ ",
        "ur": "اور (یاد کرو) جب وہ کہہ رہے تھے کہ اے اللہ! اگر یہی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھروں کی بارش برسا یا ہم پر ایک دردناک عذاب لے آ۔",
        "v5": {
            "text": "And <i>remember the time</i> when they said, ‘O Allah, if this be indeed the truth from Thee, then rain down upon us stones from heaven or bring down upon us a grievous punishment.’[1121]",
            "notes": [
                {
                    "ref": "1121",
                    "note": "<p><strong>Commentary:</strong></p><p>This was the prayer which Abu Jahl, the leader of the disbelievers, offered to God at Badr and it was accepted. He prayed on that memorable day that God might destroy him and his party if the Prophet was in the right (Bukhari, ch. on <i>Tafsir</i>). Strange to say, not only were Abu Jahl and his companions punished at Badr by God but, as prayed for by Abu Jahl, even stones were rained down upon them; for, when at the throwing of a handful of pebbles by the Holy Prophet (8:18), there arose a strong wind, it literally rained upon the disbelieving host hard pebbles from the desert.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 34,
        "v_": 33,
        "topics": [
            {
                "id": 2333,
                "topic": "Allah: seeking forgiveness of",
                "verses": "11:53, 4:65, 11:4, 66:9, 71:11"
            },
            {
                "id": 7807,
                "topic": "Forgiveness: <i>‘Afw</i>: seek of Allah",
                "verses": "11:53, 2:200, 3:136, 4:65, 4:107, 4:111, 5:75, 11:4, 11:91, 40:56, 41:7, 47:20, 66:9, 71:11, 73:21, 110:4"
            },
            {
                "id": 11154,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 12430,
                "topic": "Muhammad<sup>(sa)</sup>: enemies of,",
                "verses": "8:31, 4:114-116, 6:22, 9:61, 13:11-12, 23:94-99, 27:49-52"
            },
            {
                "id": 14749,
                "topic": "Punishment: shield against",
                "verses": "23:33, 24:53"
            }
        ],
        "ar": "وَ مَا کَانَ اللّٰہُ  لِیُعَذِّبَہُمۡ  وَ اَنۡتَ فِیۡہِمۡ ؕ وَ مَا کَانَ اللّٰہُ مُعَذِّبَہُمۡ وَ ہُمۡ یَسۡتَغۡفِرُوۡنَ ﴿۳۴﴾ ",
        "ur": "اور اللہ ایسا نہیں کہ انہیں عذاب دے جب کہ تُو ان میں موجود ہو اور اللہ ایسا نہیں کہ انہیں عذاب دے جبکہ وہ بخشش طلب کرتے ہوں۔",
        "v5": {
            "text": "But Allah would not punish them while thou wast among them, and [a]Allah would not punish them while they sought forgiveness.[1122]",
            "notes": [
                {
                    "ref": "a",
                    "note": "11:4."
                },
                {
                    "ref": "1122",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse embodies two basic protections against Divine punishment: (1) a people are not punished when they have a God’s Messenger living among them; and (2) they are not punished when they are seeking forgiveness of God. At the Battle of Badr, the Holy Prophet was not \"among\" the disbelievers, for the believers and the disbelievers formed two distinct and opposite parties. At Mecca, however, he was \"among\" them, for both he and his opponents lived under the same conditions and the same laws. Nor did the Quraish of Mecca enjoy the second protection at the Battle of Badr for, instead of asking forgiveness of God, they prayed that if Islam was a true religion, God might destroy them with a grievous punishment. The verse, therefore, hints that the Battle of Badr was the proper occasion for punishing the enemies of Islam.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 35,
        "v_": 34,
        "topics": [
            {
                "id": 8394,
                "topic": "Haram: Sacred",
                "verses": "2:150-151, 2:145, 2:192, 2:195, 2:197, 2:199, 2:218, 5:3, 5:98, 9:7, 9:19, 9:28, 9:36-37, 14:38, 17:2, 22:26, 22:31, 22:33, 22:37, 27:92, 48:26, 48:28"
            },
            {
                "id": 10075,
                "topic": "Ka‘bah: for Allah only",
                "verses": "17:2, 9:3, 9:18-19, 9:28, 22:27"
            },
            {
                "id": 12141,
                "topic": "Mosque",
                "verses": "2:115, 2:145, 2:151, 2:188, 2:192, 2:218, 5:3, 7:30, 7:32, 9:17-19, 9:108, 17:2, 22:26, 48:26, 48:28, 72:19"
            }
        ],
        "ar": "وَ مَا لَہُمۡ  اَلَّا یُعَذِّبَہُمُ اللّٰہُ  وَ ہُمۡ  یَصُدُّوۡنَ عَنِ الۡمَسۡجِدِ الۡحَرَامِ وَ مَا کَانُوۡۤا اَوۡلِیَآءَہٗ ؕ اِنۡ  اَوۡلِیَآؤُہٗۤ  اِلَّا الۡمُتَّقُوۡنَ وَ لٰکِنَّ  اَکۡثَرَہُمۡ  لَا  یَعۡلَمُوۡنَ ﴿۳۵﴾",
        "ur": "اور آخر اُن میں کیا بات ہے جو اللہ انہیں عذاب نہ دے جبکہ وہ حرمت والی مسجد سے لوگوں کو روکتے ہیں حالانکہ وہ اس کے (حقیقی) والی نہیں۔ اس کے (حقیقی) والی تو متقیوں کے سوا اور کوئی نہیں لیکن ان میں سے اکثر نہیں جانتے۔",
        "v5": {
            "text": "And [a]what excuse have they <i>now</i> that Allah should not punish them, when they hinder <i>men</i> from the Sacred Mosque, and they are not its <i>true</i> guardians? [b]Its <i>true</i> guardians are only those who are righteous, but most of them know not.[1123]",
            "notes": [
                {
                    "ref": "a",
                    "note": "22:26."
                },
                {
                    "ref": "b",
                    "note": "10:63, 64."
                },
                {
                    "ref": "1123",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that when the Quraish did not enjoy either of the two basic protections against Divine punishment (see preceding verse), they were being rightly punished for their false beliefs and wicked deeds. The verse also says that the Quraish have no right to act as guardians of the Sacred Mosque. As guardians thereof, they ought to have been worshippers of the One True God; but they have put idols even in the Sacred Mosque; hence, far from having any right to act as its guardians, they deserve to be expelled therefrom and punished for the sacrilege.</p><p>The words, <i>Its true guardians are only those who are righteous</i>, contain a prophecy to the effect that Muslims would soon become guardians of the Sacred Mosque, the words, <i>most of them know not</i>, signifying that although most of the disbelievers do not at present think this announcement to be true, yet it would surely come to pass.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 36,
        "v_": 35,
        "topics": [
            {
                "id": 3940,
                "topic": "Baitul-Haram: <i>Ka‘bah</i>",
                "verses": "17:2, 2:126, 2:128, 2:159, 5:3, 5:98, 14:38, 22:27, 22:30, 28:58, 106:4-5"
            },
            {
                "id": 10075,
                "topic": "Ka‘bah: for Allah only",
                "verses": "17:2, 9:3, 9:18-19, 9:28, 22:27"
            }
        ],
        "ar": "وَ مَا کَانَ صَلَاتُہُمۡ عِنۡدَ الۡبَیۡتِ اِلَّا مُکَآءً   وَّ تَصۡدِیَۃً ؕ فَذُوۡقُوا الۡعَذَابَ بِمَا کُنۡتُمۡ  تَکۡفُرُوۡنَ ﴿۳۶﴾ ",
        "ur": "اور (اللہ کے) گھر کے پاس ان کی عبادت سیٹیوں اور تالیوں کے سوا کچھ نہیں۔ پس عذاب کو چکھو بسبب اس کے کہ تم انکار کیا کرتے تھے۔",
        "v5": {
            "text": "And their prayer at the House is nothing but whistling and clapping of hands. ‘Taste then the punishment because you disbelieved.’[1124]",
            "notes": [
                {
                    "ref": "1124",
                    "note": "<p><strong>Important Words:</strong></p><p>مکاء (whistling) is the noun-infinitive from مکا (with واو as the last root letter). They say مکا الرجل i.e. the man whistled with his mouth; or he brought together his fingers and blew through them, producing a whistling sound (Aqrab).</p><p>تصدیة (clapping of hands) is derived from صدی (<i>sadda</i>). They say صدی بیدیه i.e. he clapped with his hands. So تصدیة means, clapping with the hands. الصدی means, the sound or cry returned by a mountain, etc., when one shouts at it; echo (Lane under صدی). Some authorities derive the word تصدیة from the root صد (he turned away), the word الصد signifying the face or front of the hand (Lane under صد).</p><p><strong>Commentary:</strong></p><p>The verse describes the sacrilegious use of the Sacred Mosque by idolaters. Instead of using it for worship and devotion, they used it for talking and gossiping and for whistling and the clapping of hands.</p><p>The words, <i>And their prayer at the House is nothing but whistling</i>, etc. mean: (1) that even their acts of worship consisted of nothing but whistling, etc.; or (2) instead of praying and performing acts of devotion, they passed their time in whistling, etc.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 37,
        "v_": 36,
        "topics": [
            {
                "id": 6478,
                "topic": "Disbelief: <i>Kufr</i>: punishment of a",
                "verses": "2:7-21, 2:25, 2:40, 2:91, 2:105, 2:127, 2:176, 3:11, 3:23, 3:57, 3:92, 3:132, 3:142, 4:19, 4:38, 4:57, 4:141, 4:152, 4:162, 5:11, 5:87, 6:31, 6:111, 7:51, 8:15, 9:26, 9:49, 9:68, 13:36, 14:3, 16:28, 17:9, 18:103, 18:107, 21:40, 22:20, 22:73, 29:55, 33:65-66, 34:34, 35:37, 36:64-65, 38:28, 39:33, 39:72, 41:51, 48:14, 67:7, 70:2-3, 76:5, 98:7"
            },
            {
                "id": 8719,
                "topic": "Hell: <i>Jahannam</i>: for disbelievers, hypocrites, idolaters",
                "verses": "19:69, 29:55, 2:25, 2:40, 2:127, 2:258, 3:11, 3:13, 3:132, 4:141, 4:146, 5:73, 19:87, 25:12, 38:60, 41:20, 44:48, 67:7, 78:22, 79:37, 83:16-18, 88:5, 89:24, 98:7"
            },
            {
                "id": 14391,
                "topic": "Prophecies in the Holy Qur’an: about: disbelievers, hypocrites",
                "verses": "9:82, 27:83"
            },
            {
                "id": 18512,
                "topic": "Way of: <i>Sabil</i>: hindering from the Allah",
                "verses": "3:100, 4:161, 4:168, 7:46, 7:87, 8:48, 9:34, 11:20, 14:4, 16:89, 16:95, 22:26, 47:2, 47:33, 47:35, 58:17"
            }
        ],
        "ar": "اِنَّ الَّذِیۡنَ کَفَرُوۡا یُنۡفِقُوۡنَ اَمۡوَالَہُمۡ لِیَصُدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ ؕ فَسَیُنۡفِقُوۡنَہَا ثُمَّ تَکُوۡنُ عَلَیۡہِمۡ حَسۡرَۃً  ثُمَّ یُغۡلَبُوۡنَ ۬ؕ وَ الَّذِیۡنَ  کَفَرُوۡۤا اِلٰی  جَہَنَّمَ  یُحۡشَرُوۡنَ ﴿ۙ۳۷﴾ ",
        "ur": "یقیناً وہ لوگ جنہوں نے انکار کیا اپنے مال خرچ کرتے ہیں تاکہ اللہ کی راہ سے روکیں۔ پس وہ اُن کو (اسی طرح) خرچ کرتے رہیں گے پھر وہ (مال) اُن پر حسرت بن جائیں گے پھر وہ مغلوب کر دیئے جائیں گے۔اوروہ لوگ جنہوں نے کفر کیا جہنم کی طرف اکٹھے کرکے لے جائے جائیں گے۔",
        "v5": {
            "text": "Surely, those who disbelieve spend their wealth to turn <i>men</i> from the way of Allah. They will surely continue to spend it; <i>but</i> then shall it become a <i>source</i> <i>of</i> regret for them, <i>and</i> [a]then shall they be overcome. And the disbelievers shall be gathered unto Hell;[1125]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:13."
                },
                {
                    "ref": "1125",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse embodies two prophecies concerning disbelievers, firstly, that the wealth which the disbelievers were spending in their war against Islam would prove of no avail and would become a source of grief for them and they would suffer defeat; secondly, that in the life to come they would be put in Hell as a result of their evil deeds. The first prophecy which related to the present life was clearly fulfilled, thus serving as evidence of the fact that the second prophecy, i.e. the one with regard to the life to come, would also similarly come true.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 38,
        "v_": 37,
        "topics": [
            {
                "id": 208,
                "topic": "Abomination: indecency, wickedness, <i>Khaba’ith</i>, <i>Rijs</i>",
                "verses": "5:91, 2:268, 3:180, 4:3, 5:101, 6:122, 6:146, 6:152, 7:34, 7:81, 7:82, 7:158, 9:95, 14:27, 17:33, 21:75, 22:31, 24:27, 33:34, 74:6"
            },
            {
                "id": 8772,
                "topic": "Hell: <i>Jahannam</i>: for those who disobey Allah, for evil-doers",
                "verses": "19:69, 10:28, 2:82, 2:276, 3:182, 4:11, 4:94, 4:116, 11:17, 11:107, 13:26, 14:16-17, 16:30, 17:19, 19:87, 20:75, 21:99, 23:104-105, 27:91, 38:56-57, 39:61, 39:73, 40:44, 40:77, 43:75, 50:25-26, 54:48-49, 55:44, 71:26, 72:16, 82:15, 85:11, 92:15-16, 101:9-10, 104:3"
            },
            {
                "id": 10617,
                "topic": "Losers: <i>Khasirun</i>",
                "verses": "2:122, 2:28, 2:65, 3:86, 3:150, 4:120, 5:6, 5:22, 5:31, 5:54, 6:32, 6:141, 7:24, 7:91, 7:93, 7:100, 7:150, 7:179, 9:69, 10:46, 10:96, 11:23, 11:48, 12:15, 16:110, 18:104, 21:71, 22:12, 27:6, 29:53, 39:16, 39:64, 39:66, 40:79, 40:86, 41:24, 41:26, 42:46, 45:28, 46:19, 58:20, 63:10"
            },
            {
                "id": 17583,
                "topic": "Tayyib",
                "verses": "3:39, 3:180, 9:72, 10:23, 14:25, 16:33, 16:98, 24:62, 61:13"
            }
        ],
        "ar": "لِیَمِیۡزَ اللّٰہُ  الۡخَبِیۡثَ مِنَ الطَّیِّبِ وَ یَجۡعَلَ الۡخَبِیۡثَ بَعۡضَہٗ عَلٰی بَعۡضٍ فَیَرۡکُمَہٗ جَمِیۡعًا فَیَجۡعَلَہٗ  فِیۡ جَہَنَّمَ ؕ اُولٰٓئِکَ  ہُمُ  الۡخٰسِرُوۡنَ ﴿٪۳۸﴾ ",
        "ur": "تاکہ اللہ ناپاک کو پاک سے الگ کر دے اور خبیث کے ایک حصہ کو دوسرے پر ڈال دے پھر اس سارے کو (ڈھیر کی صورت میں) تہہ بہ تہہ اکٹھا کر دے پھر اسے جہنم میں جھونک دے۔ یہی لوگ ہیں جو گھاٹا کھانے والے ہیں۔",
        "v5": {
            "text": "[b]That God may separate the bad from the good, and put the bad, one upon another, and heap them up all together, <i>and</i> then cast them into Hell. These indeed are the losers.[1126]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:180."
                },
                {
                    "ref": "1126",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, <i>separate the bad from the good</i>, refer to the first part of the previous verse, giving the reason for the defeat and failure of the disbelievers. God would cause their war against Islam to end in their defeat so that He might distinguish the righteous from the unrighteous. Similarly, the latter part of this verse, viz. <i>put the bad, one upon another, and heap them up all together, and then cast them into Hell</i>, corresponds to the latter part of the previous verse, viz. <i>that the disbelievers shall be gathered into Hell. </i>The words,<i> heap them up all together</i>, imply that as the disbelievers made a common cause against Islam, they would, as it were, all be heaped up into a bundle and then thrown into the fire of Hell as one huge piece of fuel.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 39,
        "v_": 38,
        "topics": [],
        "ar": "قُلۡ  لِّلَّذِیۡنَ  کَفَرُوۡۤا  اِنۡ یَّنۡتَہُوۡا یُغۡفَرۡ لَہُمۡ مَّا قَدۡ سَلَفَ ۚ وَ اِنۡ یَّعُوۡدُوۡا فَقَدۡ مَضَتۡ سُنَّتُ  الۡاَوَّلِیۡنَ ﴿۳۹﴾ ",
        "ur": "جنہوں نے کفر کیا اُن سے کہہ دے کہ اگر وہ باز آجائیں تو جو کچھ گزر چکا وہ انہیں معاف کر دیا جائے گا لیکن اگر وہ (جرم کا) اِعادہ کریں تو یقیناً (اِن جیسے) پہلوں کی سنت گزر چکی ہے۔",
        "v5": {
            "text": "Say to those who disbelieve, if they desist, that which is past will be forgiven them; and if they return <i>thereto</i>, then verily the example of the former peoples has already gone <i>before them</i>.[1127]",
            "notes": [
                {
                    "ref": "1127",
                    "note": "<p><strong>Commentary:</strong></p><p>After the Battle of Badr, in which the opponents of Islam suffered a crushing defeat, they are once more invited to desist from fighting, and it is promised to them that if they cease hostilities against Islam, their past offences will be forgiven them. But they are at the same time warned that if they return to war, they will meet the same fate which the former opponents of truth met. See also 8:20 above.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 40,
        "v_": 39,
        "topics": [
            {
                "id": 5178,
                "topic": "Compulsion in Faith: <i>Ikrah fid-Din</i>",
                "verses": "2:257, 2:191, 2:194, 5:49, 5:93, 6:150, 7:89, 9:6, 10:100, 11:119, 13:32, 16:10, 18:21, 18:30, 22:39, 22:41, 25:58, 26:5, 50:46, 76:4, 90:11, 95:6, 109:7"
            },
            {
                "id": 5261,
                "topic": "Conscience",
                "verses": "2:194, 3:21, 7:52, 7:89, 14:25, 18:30, 22:39, 22:41, 22:72, 27:63, 47:5, 50:38, 67:11, 69:40, 75:3"
            },
            {
                "id": 6548,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:20, 8:26, 8:74, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 13:26, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:5, 28:78, 28:84, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 7557,
                "topic": "Fighting: war",
                "verses": "2:194, 4:84"
            },
            {
                "id": 9483,
                "topic": "Islam: no compulsion in",
                "verses": "2:257, 2:194, 6:105, 10:100-102, 18:30, 25:58"
            },
            {
                "id": 9953,
                "topic": "Jihad: waging",
                "verses": "2:191-194, 4:76, 6:105, 9:6, 9:8-13, 9:92, 16:127, 48:17, 66:10"
            },
            {
                "id": 13867,
                "topic": "Persecution",
                "verses": "2:191-194, 2:215, 2:218, 3:187, 9:5, 9:128, 23:95, 29:11, 33:22, 85:9"
            },
            {
                "id": 15472,
                "topic": "Religion: prescribed Islam as the true",
                "verses": "3:20, 2:133, 2:194, 3:74, 3:86, 4:126, 5:4, 7:30, 9:33, 42:14, 48:29, 61:10"
            },
            {
                "id": 17221,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:56-64, 9:1-16, 22:40-42"
            },
            {
                "id": 18335,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:46-47, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            },
            {
                "id": 18399,
                "topic": "War: <i>Qital</i>: to end disorder, and achieve peace",
                "verses": "49:10, 2:192, 2:194, 2:218, 4:91, 9:6, 9:12, 9:30"
            }
        ],
        "ar": "وَ قَاتِلُوۡہُمۡ حَتّٰی لَا تَکُوۡنَ فِتۡنَۃٌ وَّ یَکُوۡنَ الدِّیۡنُ کُلُّہٗ  لِلّٰہِ ۚ  فَاِنِ انۡتَہَوۡا فَاِنَّ اللّٰہَ  بِمَا یَعۡمَلُوۡنَ  بَصِیۡرٌ ﴿۴۰﴾ ",
        "ur": "اور تم ان سے قتال کرتے رہو یہاں تک کہ کوئی فتنہ باقی نہ رہے اور دین خالصۃً اللہ کے لئے ہوجائے۔ پس اگر وہ باز آ جائیں تو یقیناً اللہ اس پرجو وہ عمل کرتے ہیں گہری نظر رکھنے والا ہے۔",
        "v5": {
            "text": "And [a]fight them until there is no persecution and religion is wholly for Allah. But if they desist, then surely Allah is Watchful of what they do.[1128]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:194."
                },
                {
                    "ref": "1128",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse shows that fighting was to be continued only so long as there was persecution and men were not free to profess the religion they liked. If the opponents of Islam desisted from</p><p>fighting, Muslims were also to desist. Islam fought only to defend itself and to establish freedom of conscience. See also 2:194.</p><p>The words, <i>Allah is Watchful</i>, imply that Muslims should not feel afraid that the disbelievers may desist only ostensibly and temporarily, and that they may attack the Muslims again when a favourable opportunity offered itself. God was Watchful of all that they do, and He would surely help Muslims, if the disbelievers acted faithlessly towards them.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 41,
        "v_": 40,
        "topics": [
            {
                "id": 3440,
                "topic": "Attributes of Allah: An-Nasir (Helper)",
                "verses": "4:46, 2:108, 4:174, 25:32, 33:18, 47:14"
            },
            {
                "id": 3774,
                "topic": "Attributes of Allah: Ni‘mal-Maula (Excellent Master, Protector)",
                "verses": "22:79, 2:287, 3:151, 9:51"
            }
        ],
        "ar": "وَ  اِنۡ تَوَلَّوۡا  فَاعۡلَمُوۡۤا  اَنَّ اللّٰہَ مَوۡلٰٮکُمۡ ؕ نِعۡمَ  الۡمَوۡلٰی  وَ نِعۡمَ النَّصِیۡرُ ﴿۴۱﴾ ",
        "ur": "اور اگر وہ پیٹھ پھیر لیں تو جان لو کہ اللہ ہی تمہارا والی ہے۔ کیا ہی اچھا والی اور کیا ہی اچھا مدد کرنے والا ہے۔",
        "v5": {
            "text": "And [a]if they turn their backs, then know that Allah is your Protector. What an excellent Protector and what an excellent Helper![1129]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:151; 22:79; 47:12."
                },
                {
                    "ref": "1129",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, <i>if they turn their backs</i>, mean, \"if they turn their backs and refuse to accept the offer that was being made to them,\" i.e. if they return to hostilities. Thus God here promises to help Muslims if the enemy should again resort to war. Such promises (which always proved true) could only be given by the All-Powerful God, and they served as unmistakable evidence of the fact that the Quran was the Word of God and not the fabrication of man.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 42,
        "v_": 41,
        "topics": [
            {
                "id": 1752,
                "topic": "Allah: has the power to do all that He wills",
                "verses": "2:21, 2:110, 2:149, 2:260, 3:30, 3:166, 3:190, 5:18, 5:20, 5:41, 5:121, 9:39, 11:5, 16:78, 24:46, 29:21, 30:51, 35:2, 41:40, 42:10, 46:34, 48:22, 57:3, 59:7, 64:2, 67:2"
            },
            {
                "id": 3889,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:13, 8:16, 8:18, 8:49, 25:27, 54:46, 54:51"
            },
            {
                "id": 5777,
                "topic": "Day of Distinction: <i>Yaumul-Furqan</i>",
                "verses": null
            },
            {
                "id": 6582,
                "topic": "Discrimination: <i>Furqan</i>",
                "verses": "25:2, 2:54, 2:186, 3:5, 8:30, 21:49"
            },
            {
                "id": 13344,
                "topic": "Orphans: <i>Yatim</i>: welfare of",
                "verses": "2:221, 2:178, 2:216, 4:3-4, 4:128, 59:8, 76:9, 90:15-16"
            },
            {
                "id": 16558,
                "topic": "Servant: of God: Holy Prophet<sup>(sa)</sup>, ‘Abdullah",
                "verses": "25:64-77, 2:24, 17:2, 18:2, 25:2, 39:37, 53:11, 57:10, 72:20"
            },
            {
                "id": 16590,
                "topic": "Shi‘ah",
                "verses": "33:34, 3:62, 4:25, 9:100, 16:107"
            },
            {
                "id": 16987,
                "topic": "Son of…: <i>Ibnus-Sabil</i>, wayfarer",
                "verses": "2:178, 2:216, 4:37, 9:60, 17:27, 30:39, 59:8"
            },
            {
                "id": 17134,
                "topic": "Spoils: <i>Anfal</i>",
                "verses": "8:2, 3:162, 48:16, 59:7-9, 60:12"
            },
            {
                "id": 18391,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "59:7-11, 8:2, 8:70, 33:51"
            }
        ],
        "ar": "وَ اعۡلَمُوۡۤا اَنَّمَا غَنِمۡتُمۡ مِّنۡ شَیۡءٍ فَاَنَّ لِلّٰہِ خُمُسَہٗ وَ لِلرَّسُوۡلِ وَ لِذِی الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ  وَ  ابۡنِ السَّبِیۡلِ ۙ اِنۡ  کُنۡتُمۡ  اٰمَنۡتُمۡ بِاللّٰہِ وَ مَاۤ  اَنۡزَلۡنَا عَلٰی عَبۡدِنَا یَوۡمَ الۡفُرۡقَانِ  یَوۡمَ الۡتَقَی الۡجَمۡعٰنِ ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۴۲﴾ ",
        "ur": "اور تم جان لو کہ جو بھی مالِ غنیمت تمہارے ہاتھ لگے تو اس کا پانچواں حصہ اللہ (یعنی دین کے کاموں کے لئے) اور رسول کے لئے اور اقرباءکے لئے اور یتامیٰ اور مسکینوں اور مسافروں کے لئے ہے، اگر تم اللہ پر ایمان لاتے ہو اور اس پر جو ہم نے اپنے بندے پر فیصلہ کر دینے کے دن اتارا تھا جس دن دو جمعیتوں کا تصادم ہوا تھا۔ اور اللہ ہر چیز پر جسے وہ چاہے دائمی قدرت رکھتاہے۔",
        "v5": {
            "text": "And know that [b]whatever you take as spoil <i>in war</i>, a fifth thereof shall go to Allah and to the Messenger and to the kindred and orphans and the needy and the wayfarer, if you believe in Allah and in what We sent down to Our servant on the Day of Distinction—[c]the day when the two armies met—and Allah has the power to do all things.[1130]",
            "notes": [
                {
                    "ref": "b",
                    "note": "8:70."
                },
                {
                    "ref": "c",
                    "note": "3:14,167."
                },
                {
                    "ref": "1130",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse (see also 8:2) relates to the division of the spoils of war. One<i> fifth</i> of such property was to be set apart, and the remainder was to be divided among the soldiers (who received no pay). In pre-Islamic Arabia, the practice was that first of all the commander chose from the booty anything he liked. This was known as صفیة (<i>safiyyah</i>), i.e. the thing chosen. Of the remainder he took خمس (one-fifth) in addition to صفیة (the chosen thing). Islam abolished the practice of صفیة(<i>safiyyah</i>) and the fifth part also was not to go entirely to the commander, but was to be shared by others. In the lifetime of the Holy Prophet, the practice was that of the خمس i.e. the fifth part, the Prophet took only a portion, and divided the remainder among his kinsmen, the orphans, the poor and the wayfarers. By 'kinsmen' were meant the descendants of Hashim and ‘Abdul-Muttalib, the two near ancestors of the Holy Prophet. After the death of the Holy Prophet, the fifth part went to the Khalifah or Imam who was to divide it among himself, the kinsmen of the Holy Prophet, the orphans, the poor and the wayfarers. According to Imam Malik, the division need not necessarily be made into equal portions, but is to be left to the discretion of the Imam, who is to divide it as circumstances and the need of the hour demand. Such was also the practice of the Holy Prophet and his four rightly-guided Successors.</p><p>The words, <i>if you believe in Allah</i>, are meant for the Imam, or the commanders, and serve as a reminder to them that they are not to appropriate the whole خمس (fifth portion) for themselves but should also give to other classes of men their due, as directed in the verse.</p><p>The words, <i>if you believe in Allah and in what We sent down to Our servant on the Day of Distinction</i>, serve twofold purpose. Firstly, they are meant to show that the qualification implied in the words, <i>if you believe</i>, does not relate to the Holy Prophet. Secondly, they serve to remind Muslims that since God helped them against disbelievers at Badr, when all material factors were against them, they should trust in His help and accept all His commandments regarding the distribution of spoils, etc., willingly and cheerfully.</p><p>The Battle of Badr is called یوم الفرقان (Day of Distinction) because on that day God brought into being extraordinary circumstances to grant victory to His Prophet, and to make it clear which party was fighting in the cause of God and which in the cause of Satan. Thus, the words یوم الفرقان (Day of Distinction) are here intended to hint that when a Muslim commander or an Imam gains a victory over his enemies, he should bear in mind that it is due to God’s assistance, and, therefore, he should not hesitate to divide the booty in accordance with His command.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 43,
        "v_": 42,
        "topics": [
            {
                "id": 3589,
                "topic": "Attributes of Allah: As-Sami‘ (The All-Hearing)",
                "verses": "2:182, 2:128, 2:138, 2:228, 2:245, 2:257, 4:59, 4:135, 4:149, 6:14, 6:116, 8:18, 22:62, 24:22, 24:61, 40:21, 42:12, 49:2"
            },
            {
                "id": 3889,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:13, 8:16, 8:18, 8:49, 25:27, 54:46, 54:51"
            },
            {
                "id": 6157,
                "topic": "Dead, Death: <i>Maut</i>: God restores to life",
                "verses": "2:260-261, 2:57, 2:74, 2:244, 6:37, 8:25, 22:7, 22:67, 26:82, 30:20, 30:25, 30:51, 36:13, 36:34, 40:12, 41:40, 42:10, 43:12, 46:34, 50:12, 75:41"
            },
            {
                "id": 11155,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 13811,
                "topic": "Perish",
                "verses": "3:120, 4:89, 4:144, 7:100, 7:156, 7:171, 9:120, 11:61, 11:96, 11:116, 12:86, 17:103, 18:36, 20:17, 20:62, 20:82, 21:19, 28:89, 40:79, 40:86, 92:12, 111:2"
            },
            {
                "id": 14383,
                "topic": "Prophecies in the Holy Qur’an: about: battles",
                "verses": "30:5, 38:12, 48:22, 52:7, 54:46-49, 79:7-8"
            },
            {
                "id": 18348,
                "topic": "War: <i>Qital</i>: conduct of",
                "verses": "3:201"
            }
        ],
        "ar": "اِذۡ اَنۡتُمۡ بِالۡعُدۡوَۃِ الدُّنۡیَا وَ ہُمۡ  بِالۡعُدۡوَۃِ الۡقُصۡوٰی وَ الرَّکۡبُ اَسۡفَلَ  مِنۡکُمۡ ؕ وَ لَوۡ  تَوَاعَدۡتُّمۡ  لَاخۡتَلَفۡتُمۡ  فِی الۡمِیۡعٰدِ ۙ وَ لٰکِنۡ لِّیَقۡضِیَ اللّٰہُ اَمۡرًا کَانَ مَفۡعُوۡلًا ۬ۙ لِّیَہۡلِکَ مَنۡ ہَلَکَ عَنۡۢ بَیِّنَۃٍ وَّ یَحۡیٰی مَنۡ حَیَّ عَنۡۢ  بَیِّنَۃٍ ؕ وَ اِنَّ اللّٰہَ  لَسَمِیۡعٌ  عَلِیۡمٌ ﴿ۙ۴۳﴾",
        "ur": "(یاد کرو) جب تم (وادی کے) ورلے کنارے پر تھے اور وہ پرلے کنارے پر، اور قافلہ تم دونوں سے نیچے کی طرف تھا۔ اور اگر تم (کسی گروہ سے لڑائی کا) باہم پختہ عہد بھی کر لیتے تب بھی اس کا (وقت) معیّن کرنے میں تم اختلاف کرتے۔ لیکن یہ اس لئے(ہوا) کہ اللہ اس کام کا فیصلہ نپٹا دے جو بہرحال پورا ہوکر رہنے والا تھا۔ تاکہ کھلی کھلی حجت کی رُو سے جس کی ہلاکت کا جواز ہو وہی ہلاک ہو اور کھلی کھلی حجت کی رُو سے جسے زندہ رہنا چاہئے وہی زندہ رہے۔ اور یقیناً اللہ بہت سننے والا (اور) دائمی علم رکھنے والا ہے۔",
        "v5": {
            "text": "When you were on the nearer bank of the valley, and they were on the farther bank, and the caravan was below you. And if you had to make a mutual appointment, you would have certainly differed with regard to the appointment. But <i>the encounter was brought about</i> that Allah might accomplish the thing that was decreed; so that he who had <i>already</i> perished through a clear Sign might perish, and he who had <i>already</i> come to life through a clear Sign might live. And certainly Allah is All-Hearing, All-Knowing.[1131]",
            "notes": [
                {
                    "ref": "1131",
                    "note": "<p><strong>Commentary:</strong></p><p>In this verse and those that follow, the Quran describes how God arranged and planned to bring about an encounter at Badr between believers and disbelievers, so that He might thereby crush the power of the enemy and show a sign in support of Islam.</p><p>The verse begins with a graphic picture of the situation of the different parties at Badr and then proceeds to say that, if it had been left to the Muslims to appoint the time of the encounter, they would certainly have differed with regard to it and would have preferred to postpone the date of the first clash, for at that time they did not feel strong enough to meet their much more powerful and far better-equipped enemy in a field of battle. As, however, God’s object was to show a powerful sign, so He brought about the encounter at a time when the Muslims were still very weak and the enemy very strong. This was done so that the party, which had been proved to be in error and to be spiritually dead by means of clear reasons and arguments, might perish and the party, which had been proved to be spiritually alive and established on the firm basis of truth, might survive and live.</p><p>The Quran has mentioned, more than once, the Divine attribute of \"All-Hearing\" in connection with the Battle of Badr in order to allude to the fact that prayers had played a great part in bringing about the victory and that they can play a similar part again.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 44,
        "v_": 43,
        "topics": [
            {
                "id": 3889,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:13, 8:16, 8:18, 8:49, 25:27, 54:46, 54:51"
            },
            {
                "id": 6758,
                "topic": "Dream: <i>Ru’ya’, Manam</i>",
                "verses": "6:112, 12:5, 12:6, 12:37-38, 12:44-50, 12:101-102, 17:61, 21:6, 37:103, 37:106, 48:28"
            },
            {
                "id": 11443,
                "topic": "Miracles",
                "verses": "7:108, 8:18, 9:25-26, 54:2"
            },
            {
                "id": 18300,
                "topic": "Vision: of Holy Prophet<sup>(sa)</sup>",
                "verses": "50:23, 48:28, 17:2, 17:61, 38:46, 48:2, 48:28, 53:14, 54:2"
            },
            {
                "id": 18348,
                "topic": "War: <i>Qital</i>: conduct of",
                "verses": "3:201"
            }
        ],
        "ar": "اِذۡ یُرِیۡکَہُمُ اللّٰہُ فِیۡ مَنَامِکَ قَلِیۡلًا ؕ وَ لَوۡ اَرٰٮکَہُمۡ کَثِیۡرًا لَّفَشِلۡتُمۡ وَ لَتَنَازَعۡتُمۡ فِی الۡاَمۡرِ وَ لٰکِنَّ اللّٰہَ سَلَّمَ ؕ اِنَّہٗ  عَلِیۡمٌۢ  بِذَاتِ  الصُّدُوۡرِ ﴿۴۴﴾ ",
        "ur": "(یاد کرو) جب اللہ تجھے اُن کو تیری نیند کی حالت میں کم دکھا رہا تھا اور اگر وہ تجھے اُن کو کثیر تعداد میں دکھاتا تو (اے مومنو!) تم ضرور بزدلی دکھاتے اور اس اہم معاملہ میں اختلاف کرتے۔ لیکن اللہ نے (تمہیں) بچا لیا۔ یقیناً وہ سینوں کے رازوں کو خوب جانتا ہے۔",
        "v5": {
            "text": "[a]When Allah showed them to thee in thy dream as few; and if He had shown them to thee as many, you would have surely faltered and would have disagreed with one another about the matter; but Allah saved <i>you</i>. Surely, He has full knowledge of what is in <i>your</i> breasts.[1132]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:14."
                },
                {
                    "ref": "1132",
                    "note": "<p><strong>Important Words:</strong></p><p>منام (dream) is derived from نام i.e. he slept. منام means, sleep; place where one sleeps; dream (Aqrab).</p><p><strong>Commentary:</strong></p><p>While on his way to Badr, the Holy Prophet was shown the Meccan army in a dream to be less in number than they actually were (Tabari, x. 9). In the language of dreams, this meant that the Meccan force, in spite of their superior numbers and equip-ment, would be overcome by the Muslims. On the other hand, if the enemy had been shown in a dream to be in large numbers, the interpretation of the dream would have been that the party to which the dreamer belonged would lose heart and would be overpowered by the enemy.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 45,
        "v_": 44,
        "topics": [
            {
                "id": 3889,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:13, 8:16, 8:18, 8:49, 25:27, 54:46, 54:51"
            },
            {
                "id": 6235,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4, 97:2-5"
            },
            {
                "id": 18348,
                "topic": "War: <i>Qital</i>: conduct of",
                "verses": "3:201"
            }
        ],
        "ar": "وَ اِذۡ یُرِیۡکُمُوۡہُمۡ  اِذِ الۡتَقَیۡتُمۡ فِیۡۤ اَعۡیُنِکُمۡ قَلِیۡلًا وَّ یُقَلِّلُکُمۡ فِیۡۤ  اَعۡیُنِہِمۡ لِیَقۡضِیَ اللّٰہُ اَمۡرًا کَانَ مَفۡعُوۡلًا ؕ وَ  اِلَی اللّٰہِ تُرۡجَعُ الۡاُمُوۡرُ ﴿٪۴۵﴾ ",
        "ur": "اور (یاد کرو) جب وہ تمہیں ان کو، جب تمہاری اُن سے مڈھ بھیڑ ہوئی، تمہاری نظروں میں کم دکھا رہا تھا اور تمہیں ان کی نظروں میں بہت کم دکھا رہا تھا تاکہ اللہ اس کام کا فیصلہ نپٹا دے جو بہرحال پورا ہوکر رہنے والا تھا۔ اور اللہ ہی کی طرف تمام امور لوٹائے جاتے ہیں۔",
        "v5": {
            "text": "And [a]when at the time of your meeting <i>in battle</i>, He made them appear to you as few in your eyes, and made you appear as few in their eyes, that Allah might bring about the thing that was decreed. And [b]to Allah are all affairs referred <i>for final decision</i>.[1133]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:14."
                },
                {
                    "ref": "b",
                    "note": "2:211; 3:110; 35:5."
                },
                {
                    "ref": "1133",
                    "note": "<p><strong>Commentary:</strong></p><p>Whereas the preceding verse referred to the appearance of the enemy in a dream, the present verse refers to its actual appearance on the battlefield. What happened was that the enemy had kept one-third of their number behind mounds so that, when both parties came face to face, Muslims saw only two-thirds of their army. The Meccan army, about 1,000 strong, was more than three times the number of the Muslims who were only 313, but it so happened that the latter saw them to be only twice their own number. This naturally made the Faithful more hopeful. As hinted above, the enemy had concealed one-third of their number from the Muslims so that (as they thought) the latter might not be overawed and flee from the battlefield. This ruse was meant by them as an enticement to the Muslims so that the latter might be encouraged to give them battle and consequently be annihilated. Indeed, the Muslims were so weak at that time that the Meccans were anxious to get them within their grip, so that they might wipe them out of existence and thus extirpate Islam. The weakness of the Muslims became all the more apparent when the Meccans actually saw them, for they saw them smaller than their actual number, and both these impressions helped to encourage either party to come to grips with the opposing party, with the result that the \"thing decreed\" was miraculously brought about.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 46,
        "v_": 45,
        "topics": [
            {
                "id": 2239,
                "topic": "Allah: remembrance of",
                "verses": "13:29, 2:153, 2:204, 3:192, 4:104, 7:206, 10:13, 24:38, 26:228, 29:46, 33:42, 39:10, 43:37, 57:17, 62:10-11, 63:10, 73:9"
            },
            {
                "id": 15502,
                "topic": "Remember: Allah",
                "verses": "2:153, 2:199, 2:201, 2:204, 2:232, 2:240, 3:42, 3:192, 4:104, 5:8, 5:12, 5:21, 7:70, 7:75, 7:206, 13:29, 18:25, 20:15, 20:43, 24:38, 26:228, 29:46, 33:22, 33:36, 33:42, 35:4, 39:24, 43:14, 57:17, 62:11, 63:10, 73:9, 76:26, 87:16"
            },
            {
                "id": 17325,
                "topic": "Success: <i>Falah</i>, believers, obedient, shall achieve",
                "verses": "3:201, 2:6, 2:190, 3:105, 3:131, 5:36, 5:91, 5:101, 7:9, 7:70, 7:158, 9:88, 20:65, 22:78, 23:2, 23:103, 24:32, 24:52, 28:68, 30:39, 31:6, 59:10, 62:11, 64:17, 87:15, 91:10"
            },
            {
                "id": 18336,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا لَقِیۡتُمۡ فِئَۃً فَاثۡبُتُوۡا وَ اذۡکُرُوا اللّٰہَ کَثِیۡرًا لَّعَلَّکُمۡ  تُفۡلِحُوۡنَ ﴿ۚ۴۶﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! جب بھی کسی دستہ سے تمہاری مڈھ بھیڑ ہو تو ثابت قدم رہو اور کثرت سے اللہ کو یاد کرو تاکہ تم کامیاب ہو جاؤ۔",
        "v5": {
            "text": "[a]O ye who believe! when you encounter an army, remain firm, and [b]remember Allah much that you may prosper.[1134]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:16; 47:5."
                },
                {
                    "ref": "b",
                    "note": "33:42; 62:11."
                },
                {
                    "ref": "1134",
                    "note": "<p><strong>Commentary:</strong></p><p>Muslims are here told that they should not think that war with disbelievers had ended with the Battle of Badr. The enemy was to return to the attack repeatedly and with larger and still larger forces. So Muslims are exhorted to remain firm and not to waver before the repeated onslaughts of the enemy.</p><p>The words, <i>remember</i> <i>Allah much</i>, imply that as the enemy will call his allies to his aid, so the Faithful, too, should call God to their help by constantly praying to Him.</p><p>The secret of success is stated here to lie in two things: (1) that Muslims should never feel secure from the attacks of the enemy and should always be prepared for them, and (2) that they should be always invoking God’s help.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 47,
        "v_": 46,
        "topics": [
            {
                "id": 2103,
                "topic": "Allah: obey and His Messenger",
                "verses": "4:60, 3:33, 3:133, 4:14, 4:81, 5:93, 8:2, 8:21, 24:53, 24:55, 33:72, 47:34, 48:18, 58:14"
            },
            {
                "id": 6641,
                "topic": "Dispute",
                "verses": "8:7, 2:85, 2:140, 3:21, 3:62, 3:66, 3:153, 4:66, 4:106, 7:72, 11:33, 13:14, 16:5, 18:22, 22:4, 22:9, 22:20, 22:68, 31:21, 40:5-6, 40:36, 40:48, 40:70, 42:17, 42:19, 42:36, 49:11, 53:13"
            },
            {
                "id": 11946,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:66-67, 10:90, 10:110, 11:12, 11:116, 12:91, 13:25, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:55, 28:81, 29:60, 32:25, 33:36, 34:20, 37:103, 38:45, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            },
            {
                "id": 13213,
                "topic": "Obey: Allah, Messenger",
                "verses": "24:48-55, 3:21, 3:33, 3:51, 3:133, 4:14, 4:60, 4:65, 4:70, 4:81, 5:93, 8:2, 8:21, 24:57, 26:108-109, 26:127, 26:145, 26:164, 26:180, 33:34, 33:36-37, 33:72, 43:64, 47:34, 48:18, 58:14, 64:13, 64:17"
            },
            {
                "id": 13698,
                "topic": "Patience: <i>sabr</i>: Allah’s help for",
                "verses": "2:154, 2:156, 2:250, 3:147, 8:67"
            },
            {
                "id": 13705,
                "topic": "Patience: <i>sabr</i>: enjoined",
                "verses": "2:46, 2:154, 3:201, 7:88, 7:129, 12:19, 18:29, 31:18, 42:44"
            },
            {
                "id": 18336,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "وَ اَطِیۡعُوا اللّٰہَ  وَ رَسُوۡلَہٗ  وَ لَا  تَنَازَعُوۡا فَتَفۡشَلُوۡا  وَ تَذۡہَبَ رِیۡحُکُمۡ وَ اصۡبِرُوۡا ؕ اِنَّ  اللّٰہَ  مَعَ  الصّٰبِرِیۡنَ ﴿ۚ۴۷﴾ ",
        "ur": "اور اللہ کی اطاعت کرو اور اس کے رسول کی اور آپس میں مت جھگڑو ورنہ تم بزدل بن جاؤگے اور تمہارا رعب جاتا رہے گا۔ اور صبر سے کام لو یقیناً اللہ صبر کرنے والوں کے ساتھ ہوتا ہے۔",
        "v5": {
            "text": "And [c]obey Allah and His Messenger and dispute not with one another, lest you falter and your power depart <i>from you</i>. And be steadfast; surely, Allah is with those who are steadfast.[1135]",
            "notes": [
                {
                    "ref": "c",
                    "note": "3:33; 4:60; 8:21; 24:55."
                },
                {
                    "ref": "1135",
                    "note": "<p><strong>Important Words:</strong></p><p>ریح (power) is derived from راح i.e. it (a day) was violently windy; or it was or became cool and pleasant by means of the wind. راح الشجر means, the tree felt the wind. راح also means, he was or became brisk, lively, active or quick (as though he felt the wind and was refreshed by it). ریح means wind, i.e. the air that is between heaven and earth; the breath of the air, or, in like manner, of anything (said to be so called because it generally brings rest or ease); puff or gust of wind; also predominance or prevalence; power or force; aid against an enemy; victory or conquest; a turn of good fortune. One would say ذھبت ریحھم i.e. their turn of good fortune had departed تذھب ریحکم means, your predominance and power would depart (Lane).</p><p><strong>Commentary:</strong></p><p>The verse mentions three ways by following which Muslims could remain firm and become successful. Firstly, they are bidden to obey the commandments of God and His Messenger. Secondly, they are enjoined not to dispute with one another, but to remain united. Thirdly, they are commanded to remain patient and steadfast.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 48,
        "v_": 47,
        "topics": [
            {
                "id": 1449,
                "topic": "Allah: encompasses the disbelievers",
                "verses": "2:20, 85:20-21"
            },
            {
                "id": 18518,
                "topic": "Way of: <i>Sabil</i>: hindering from the Allah",
                "verses": "8:37, 3:100, 4:161, 4:168, 7:46, 7:87, 9:34, 11:20, 14:4, 16:89, 16:95, 22:26, 47:2, 47:33, 47:35, 58:17"
            }
        ],
        "ar": "وَ لَا تَکُوۡنُوۡا کَالَّذِیۡنَ خَرَجُوۡا مِنۡ دِیَارِہِمۡ بَطَرًا وَّ رِئَآءَ النَّاسِ وَ یَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ ؕ وَ اللّٰہُ بِمَا یَعۡمَلُوۡنَ  مُحِیۡطٌ ﴿۴۸﴾ ",
        "ur": "اور ان لوگوں کی طرح نہ ہونا جو اپنے گھروں سے اِتراتے ہوئے اور لوگوں کو دکھانے کی خاطر نکلے اور وہ اللہ کی راہ سے روک رہے تھے اور اللہ اسے گھیرے میں لئے ہوئے تھا جو وہ کرتے تھے۔",
        "v5": {
            "text": "And be not like those who came forth from their homes boastfully, and to be seen of men, and who turn <i>men</i> away from the path of Allah, and Allah encompasses all that they do.[1136]",
            "notes": [
                {
                    "ref": "1136",
                    "note": "<p><strong>Important Words:</strong></p><p>بطرا (boastfully). بطر الرجل means, the man exulted or exulted excessively; or he behaved insolently and ungratefully; or he behaved with pride and boastfulness; or he became stupefied and confounded with his wealth (and power), bearing it in an evil manner and turning it to a wrong purpose; or he regarded a thing with hatred and dislike, without its deserving to be so regarded; or he walked with a proud and conceited gait (Lane).</p><p><strong>Commentary:</strong></p><p>Boastfulness and the desire to be seen of and praised by others have always been a source of weakness in man, and the verse condemns them in the strongest terms. Again, in the field of religion, true service lies in opposing the enemy not only with fervour and zeal but with a view to helping and advancing the cause of truth. Those who are truly brave do nothing from motives of selfishness or self-display; their only motive is to seek the pleasure of God. The verse gives a description of the Meccan army under Abu Jahl which came forth from Mecca in proud exultation, and the Muslims are warned against following their example.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 49,
        "v_": 48,
        "topics": [
            {
                "id": 395,
                "topic": "Actions: <i>A‘mal</i>: appear beautiful",
                "verses": "27:5, 6:44, 16:64, 27:25, 29:39, 35:9, 40:38, 47:15"
            },
            {
                "id": 3890,
                "topic": "Badr: Battle of",
                "verses": "3:124, 3:14, 3:141, 3:166, 8:13, 8:16, 8:18, 8:42-45, 25:27, 54:46, 54:51"
            },
            {
                "id": 7430,
                "topic": "Fear: of Allah, <i>Khashi‘ah</i>",
                "verses": "2:151, 5:4, 5:29, 5:45, 7:57, 9:13, 9:18, 9:109, 12:110, 13:22, 14:15, 16:52, 17:58, 20:4, 21:50, 23:3, 23:58, 23:61, 24:53, 33:38, 33:40, 35:19, 35:29-30, 36:12, 39:11, 39:21, 39:24, 49:2, 50:34, 55:47, 59:17, 67:13, 79:27, 79:41, 79:46, 80:10, 87:11, 98:9"
            },
            {
                "id": 11156,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 16227,
                "topic": "Satan: leads astray, tempts",
                "verses": "2:269, 2:170, 4:119-121, 5:92, 6:44, 14:23, 15:40, 16:64, 17:65, 17:78, 19:84, 20:121, 25:30, 27:25, 29:39, 31:22, 58:20"
            }
        ],
        "ar": "وَ اِذۡ زَیَّنَ لَہُمُ الشَّیۡطٰنُ اَعۡمَالَہُمۡ  وَ قَالَ لَا غَالِبَ لَکُمُ  الۡیَوۡمَ مِنَ النَّاسِ  وَ اِنِّیۡ جَارٌ لَّکُمۡ ۚ فَلَمَّا تَرَآءَتِ الۡفِئَتٰنِ نَکَصَ عَلٰی عَقِبَیۡہِ وَ قَالَ اِنِّیۡ بَرِیۡٓءٌ مِّنۡکُمۡ  اِنِّیۡۤ  اَرٰی مَا لَا تَرَوۡنَ  اِنِّیۡۤ  اَخَافُ اللّٰہَ ؕ وَ اللّٰہُ شَدِیۡدُ الۡعِقَابِ ﴿٪۴۹﴾ ",
        "ur": "اور (یاد کرو) جب (ایک) شیطان (صفت انسان) نے ان کے اعمال انہیں خوبصورت کر کے دکھائے اور کہا کہ آج کے دن لوگوں میں سے تم پر کوئی غالب نہیں آئے گا اور یقیناً میں تمہیں پناہ دینے والا ہوں۔ پھر جب دونوں فریق آمنے سامنے ہوئے تو وہ اپنی ایڑیوں کے بل پھر گیا اور اس نے کہا یقیناً میں تم سے بری الذمہ ہوں۔ میں ضرور وہ کچھ دیکھ رہا ہوں جو تم نہیں دیکھ رہے۔ میں اللہ سے ڈرتا ہوں اور اللہ سزا دینے میں بہت سخت ہے۔",
        "v5": {
            "text": "And when [a]Satan made their deeds seem fair to them and said, [b]‘None among men shall prevail against you this day, and I am your protector.’ But when the two armies came in sight of each other, he turned on his heels, and said, ‘Surely, I have nothing to do with you; surely, I see what you see not. Surely, I fear Allah; and Allah is severe in punishing.’[1137]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:44; 16:64; 27:25; 29:49."
                },
                {
                    "ref": "b",
                    "note": "14:23; 59:17."
                },
                {
                    "ref": "1137",
                    "note": "<p><strong>Important Words:</strong></p><p>جار (protector) is derived from جار which means, he declined or deviated. جاورہ means, he became his neighbour, or he lived in his neighbourhood. جاورہ also means, he bound himself to him by a covenant to protect him. جار means, a neighbour; a person whom one protects; one who seeks protection; also a protector (Lane).</p><p>نکص (he turned). نکص عن الامر means, he receded or retired or drew back from the thing or the affair; or he recoiled or shrank from it in fear. نکص علی عقبیه means, he turned back from a thing to which he had applied himself (Lane).</p><p><strong>Commentary:</strong></p><p>For the meaning of the word \"Satan\", see 2:15. The word here means, one who misleads or gives evil advice. The person referred to in the verse is reported to be Suraqah bin Malik bin Ju‘sham who incited the Meccans against the Muslims but who afterwards embraced Islam.</p><p>The Meccan army was still at Mecca when some of the Quraishite leaders gave expression to the fear that Banu Bakr, a branch of Banu Kananah, who were hostile to the Quraish, might surprise Mecca during their absence or attack the Meccan army from the rear. Their fears were allayed by Suraqah, a chief of Banu Kananah, who assured them that his tribesmen would do them no harm (Jarir, x. 13).</p><p>The words, I see what you see not, signify that when Suraqah saw the grim determination of the Muslims, fear took hold of him; for on seeing them he was convinced that the Muslims would win or die. This was exactly what ‘Utbah and ‘Umair also saw and felt when they told the Meccans that the Muslims looked like so many \"seekers of death\" (Tabari). Suraqah uttered the words, I fear Allah, not because he really feared God at that time but because he wished to find an excuse to flee from the battlefield.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 50,
        "v_": 49,
        "topics": [
            {
                "id": 6588,
                "topic": "Disease",
                "verses": "2:11, 2:220, 4:4, 5:53, 9:125, 10:58, 20:98, 22:54, 24:51, 33:13, 33:33, 33:61, 38:42-43, 47:21, 47:30, 74:32"
            },
            {
                "id": 8454,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: diseased",
                "verses": "53:12, 2:11, 5:53, 9:125, 22:54, 24:51, 33:13, 33:33, 33:61, 47:21, 47:30, 74:32"
            },
            {
                "id": 17550,
                "topic": "Tawakkul ‘Alallah: trust in Allah",
                "verses": "3:123, 3:160-161, 4:82, 4:133, 4:172, 5:12, 5:24, 7:90, 8:3, 8:62, 9:51, 9:129, 10:72, 10:85-86, 11:57, 11:89, 11:124, 12:68, 13:31, 14:12-13, 16:43, 16:100, 25:59, 26:218, 27:80, 29:60, 33:4, 33:49, 39:39, 42:11, 58:11, 60:5, 64:14, 65:4, 67:30"
            }
        ],
        "ar": "اِذۡ یَقُوۡلُ الۡمُنٰفِقُوۡنَ وَ الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ غَرَّہٰۤؤُ لَآءِ دِیۡنُہُمۡ ؕ وَ مَنۡ یَّتَوَکَّلۡ عَلَی اللّٰہِ فَاِنَّ اللّٰہَ عَزِیۡزٌ حَکِیۡمٌ ﴿۵۰﴾ ",
        "ur": "(یاد کرو) جب منافقین اور وہ لوگ جن کے دلوں میں مرض ہے کہنے لگے کہ ان لوگوں کو ان کے دین نے دھوکہ میں ڈال رکھا ہے حالانکہ جو بھی اللہ پرتوکل کرتا ہے تو اللہ یقیناً کامل غلبہ والا (اور) بہت حکمت والا ہے۔",
        "v5": {
            "text": "[a]When the hypocrites and those in whose hearts is a disease said, ‘Their religion has deluded these <i>men</i>.’ And [b]whoso puts his trust in Allah, then surely Allah is Mighty, Wise.[1138]",
            "notes": [
                {
                    "ref": "a",
                    "note": "33:13."
                },
                {
                    "ref": "b",
                    "note": "9:51; 12:68; 14:12; 33:4; 65:4."
                },
                {
                    "ref": "1138",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, <i>the hypocrites and those in whose hearts is a disease</i>, here refer to those men in the Meccan army who had embraced Islam in Mecca, but who, being weak, remained with disbelievers out of fear, and had now come forth with the Meccan army in order to fight the Muslims. There were four or five such men who, when they saw the small band of Muslims arrayed in battle-order against a well-equipped army of Meccan warriors, thought it foolhardy on the part of the former to take their stand against the overwhelming odds and made the remark mentioned in the verse. To this remark, the verse gives the reply that the small band of Muslims faced the heavy odds not because their religion had deluded them but because they had put their trust in God Who was both Mighty and Wise and Who had promised to help them. The last words of the verse are thus also intended to reprimand the weak-hearted Muslims of Mecca and to remind them that their hypocritical policy resulted from the fact that they had no trust in the power and might of God.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 51,
        "v_": 50,
        "topics": [
            {
                "id": 2638,
                "topic": "Angels: <i>Mala’ikah</i>: take away the souls of men, <i>Tawaffa</i>",
                "verses": "22:6, 4:98, 5:118, 16:29, 16:33, 32:12, 6:61-62, 7:38, 10:47, 10:105, 12:102, 13:41, 16:71, 39:43, 40:68, 40:78, 47:28"
            },
            {
                "id": 6188,
                "topic": "Dead, Death: <i>Maut</i>: <i>Tawaffa</i>, caused,",
                "verses": "22:6, 2:235, 2:241, 3:56, 3:194, 4:16, 4:98, 5:118, 32:12, 6:61, 6:62, 7:38, 7:127, 10:47, 10:105, 12:102, 13:41, 16:29, 16:33, 16:71, 39:43, 40:68, 40:78, 47:28"
            },
            {
                "id": 7317,
                "topic": "Faces: <i>Wujuh</i>",
                "verses": "67:28, 2:145, 2:178, 4:44, 5:7, 7:30, 18:30, 47:28, 48:30"
            },
            {
                "id": 8669,
                "topic": "Hell: <i>Jahannam</i>: conditions in",
                "verses": "19:69, 17:98, 3:107, 3:182, 6:71, 10:28, 11:107, 14:17, 14:51, 15:45, 16:30, 18:30, 18:101, 19:72, 21:40, 21:101, 22:20-23, 23:105, 25:35, 26:92, 27:91, 32:21, 37:63, 38:58, 39:61, 39:72-73, 40:72-73, 44:44-47, 44:49, 47:16, 54:49, 55:45, 56:43-45, 56:53-55, 56:94, 67:8, 67:28, 69:33, 69:37, 76:5, 78:25-26, 88:6-8, 102:7"
            }
        ],
        "ar": "وَ لَوۡ تَرٰۤی اِذۡ یَتَوَفَّی الَّذِیۡنَ کَفَرُوا ۙ الۡمَلٰٓئِکَۃُ یَضۡرِبُوۡنَ  وُجُوۡہَہُمۡ وَ اَدۡبَارَہُمۡ ۚ وَ ذُوۡقُوۡا  عَذَابَ الۡحَرِیۡقِ ﴿۵۱﴾ ",
        "ur": "اور اگر تو دیکھ سکے (تو یہ دیکھے گا) کہ جب فرشتے ان لوگوں کو جنہوں نے کفر کیا وفات دیتے ہیں تو وہ ان کے چہروں اور ان کی پیٹھوں کو چوٹیں لگاتے ہیں اور (یہ کہتے ہیں کہ) سخت جلن کا عذاب چکھو۔",
        "v5": {
            "text": "And if thou couldst see, [c]when the angels take away the souls of those who disbelieve, smiting their faces and their backs and <i>saying</i>:[d]‘Taste ye the punishment of burning![1139]",
            "notes": [
                {
                    "ref": "c",
                    "note": "47:28."
                },
                {
                    "ref": "d",
                    "note": "3:182; 22:10."
                },
                {
                    "ref": "1139",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse signifies that angels will smite the <i>faces</i> and the <i>backs</i> of disbelievers as a fitting punishment for their evil actions. The punishment corresponded with the actions of disbelievers, because the latter used to confront the believers and meet them <i>face to face</i> when fighting them. Again, they used to turn their backs disdainfully when truth was preached to them. So both faces and backs would receive punishment.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 52,
        "v_": 51,
        "topics": [
            {
                "id": 1822,
                "topic": "Allah: is not unjust to His servants",
                "verses": "3:183, 17:72, 22:11, 24:51, 26:210, 41:47, 50:30"
            }
        ],
        "ar": "ذٰلِکَ بِمَا قَدَّمَتۡ اَیۡدِیۡکُمۡ وَ اَنَّ اللّٰہَ لَیۡسَ  بِظَلَّامٍ   لِّلۡعَبِیۡدِ ﴿ۙ۵۲﴾ ",
        "ur": "یہ اُس کی وجہ سے ہے جو تمہارے (اپنے ہی) ہاتھوں نے آگے بھیجا جبکہ اللہ ہرگز ایسا نہیں کہ اپنے بندوں پر ادنیٰ سا بھی ظلم کرنے والا ہو۔",
        "v5": {
            "text": "‘That is because of that which your hands have sent on before <i>yourselves</i>, and <i>know</i> that [a]Allah is not at all unjust to <i>His</i> servants.’[1140]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:183; 22:11; 41:47."
                },
                {
                    "ref": "1140",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse further explains and provides a reason for the idea expressed in the preceding verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 53,
        "v_": 52,
        "topics": [
            {
                "id": 2204,
                "topic": "Allah: punishes wrong-doers, disbelievers",
                "verses": "2:16, 3:57, 4:174, 9:26, 9:74, 9:79, 11:9, 18:88, 21:42, 35:27, 46:27, 48:7, 48:17, 68:45, 69:26-33, 79:26, 88:25, 89:7-14"
            },
            {
                "id": 3475,
                "topic": "Attributes of Allah: Al-Qawiyy (The Powerful)",
                "verses": "33:26, 22:41, 22:75, 40:23, 42:20, 51:59, 57:26, 58:22"
            },
            {
                "id": 3834,
                "topic": "Attributes of Allah: Shadidul-‘Iqab (Severe in Punishment)",
                "verses": "40:4, 2:197"
            },
            {
                "id": 16883,
                "topic": "Sin: <i>Dhanb</i>: punishment of",
                "verses": "10:28, 2:82, 3:12, 5:19, 5:50, 6:7, 6:161, 7:101, 8:55, 28:79, 28:85, 40:41, 45:34, 91:15"
            }
        ],
        "ar": "کَدَاۡبِ اٰلِ فِرۡعَوۡنَ ۙ وَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ  کَفَرُوۡا بِاٰیٰتِ اللّٰہِ  فَاَخَذَہُمُ اللّٰہُ  بِذُنُوۡبِہِمۡ ؕ اِنَّ اللّٰہَ  قَوِیٌّ شَدِیۡدُ الۡعِقَابِ ﴿۵۳﴾ ",
        "ur": "فرعون کی قوم اور ان لوگوں کے اسلوب کی طرح جو اُن سے پہلے تھے (تمہارا بھی اسلوب ہے)۔ انہوں نے اللہ کی آیات کا انکار کیا تھا۔ پس اللہ نے ان کو ان کے گناہوں کے سبب سے پکڑ لیا۔ یقیناً اللہ بہت طاقت ور (اور) سزا دینے میں بہت سخت ہے۔",
        "v5": {
            "text": "[b]<i>Their case</i> <i>is</i> like the case of the people of Pharaoh and those before them: they disbelieved in the Signs of Allah; so Allah punished them for their sins. Surely, Allah is Powerful <i>and</i> severe in punishing.[1141]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:12; 8:55."
                },
                {
                    "ref": "1141",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse signifies that Allah has dealt with the opponents of Islam just as He dealt with the people of Pharaoh. The reference is to the Battle of Badr, where God destroyed Abu Jahl and his host as He destroyed Pharaoh and his people in the sea. The verse thus points to the similarity between the Holy Prophet and Moses (see Deut. 18:18).</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 54,
        "v_": 53,
        "topics": [
            {
                "id": 1437,
                "topic": "Allah: does not withdraw favours unless...",
                "verses": "2:212, 13:12, 14:29"
            },
            {
                "id": 12918,
                "topic": "Ni‘mat: favours",
                "verses": "1:7, 2:41, 2:48, 2:123, 2:151, 2:212, 2:232, 3:104, 3:172, 3:175, 4:70, 5:4, 5:7-8, 5:12, 5:21, 5:111, 12:7, 14:7, 14:29, 14:35, 16:19, 16:54, 16:72-73, 16:84, 16:122, 19:59, 26:23, 27:20, 28:18, 31:32, 33:10, 35:4, 37:58, 39:9, 39:50, 46:16, 48:3, 49:9, 52:30, 54:36, 68:3, 68:50, 93:12"
            }
        ],
        "ar": "ذٰلِکَ بِاَنَّ  اللّٰہَ  لَمۡ یَکُ مُغَیِّرًا  نِّعۡمَۃً اَنۡعَمَہَا عَلٰی قَوۡمٍ حَتّٰی یُغَیِّرُوۡا مَا بِاَنۡفُسِہِمۡ ۙ وَ اَنَّ  اللّٰہَ  سَمِیۡعٌ  عَلِیۡمٌ ﴿ۙ۵۴﴾ ",
        "ur": "یہ اس لئے کہ اللہ کبھی وہ نعمت تبدیل نہیں کرتا جو اس نے کسی قوم کو عطا کی ہو یہاں تک کہ وہ خود اپنی حالت کو تبدیل کر دیں۔ اور (یاد رکھو) کہ یقیناً اللہ بہت سننے والا (اور) دائمی علم رکھنے والا ہے۔",
        "v5": {
            "text": "This is because [c]Allah would never change a favour that He has conferred upon a people until they change their own condition, and <i>know</i> that Allah is All-Hearing, All-Knowing.[1142]",
            "notes": [
                {
                    "ref": "c",
                    "note": "13:12."
                },
                {
                    "ref": "1142",
                    "note": "<p><strong>Commentary:</strong></p><p>The word ذالك (this) refers to the punishment spoken of in the previous verse. The disbelievers rejected the Signs of Allah, so Allah destroyed them for their rebellion and sins. God sent His punishment on the people because they had brought about a change in their hearts. The verse states a general law of God which is to the effect that God never deprives a people of a favour which He had conferred upon them until there is first a change in their own hearts for the worse. For instance, if God grants a people dominion and power, He does not take it away from them until they lose their virtues and become wicked. The verse should also prove an eye-opener for present-day Muslims from whom God has definitely withdrawn His favour.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 55,
        "v_": 54,
        "topics": [
            {
                "id": 3845,
                "topic": "Ayah: verses",
                "verses": "2:42, 3:114, 8:3, 13:2, 16:102, 19:59, 22:17, 39:72"
            },
            {
                "id": 6817,
                "topic": "Drown: <i>Gharq</i>: Pharaoh",
                "verses": "2:51, 7:137, 10:91, 17:104, 26:67, 29:41, 43:56, 44:25"
            },
            {
                "id": 13891,
                "topic": "Pharaoh: <i>Fir‘aun</i>: drowning of",
                "verses": "2:51, 10:91, 17:104, 20:79, 26:67, 28:41, 43:56, 44:25, 51:41"
            },
            {
                "id": 13907,
                "topic": "Pharaoh: <i>Fir‘aun</i>: punishment of",
                "verses": "11:99-100, 3:12, 7:131, 10:91, 28:42-43, 40:47, 44:30, 54:42-43, 73:17, 79:25-26"
            },
            {
                "id": 16884,
                "topic": "Sin: <i>Dhanb</i>: punishment of",
                "verses": "10:28, 2:82, 3:12, 5:19, 5:50, 6:7, 6:161, 7:101, 8:53, 28:79, 28:85, 40:41, 45:34, 91:15"
            },
            {
                "id": 18875,
                "topic": "Wrongdoers: <i>Zalim</i>",
                "verses": "4:76, 3:95, 3:129, 5:46, 6:34, 9:23, 11:103, 14:14, 14:43, 18:36, 21:12, 22:46, 22:49, 25:28, 26:11, 29:15, 29:50, 35:33, 37:114"
            }
        ],
        "ar": "کَدَاۡبِ اٰلِ فِرۡعَوۡنَ ۙ وَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ کَذَّبُوۡا بِاٰیٰتِ رَبِّہِمۡ فَاَہۡلَکۡنٰہُمۡ بِذُنُوۡبِہِمۡ وَ اَغۡرَقۡنَاۤ  اٰلَ فِرۡعَوۡنَ ۚ وَ کُلٌّ  کَانُوۡا ظٰلِمِیۡنَ ﴿۵۵﴾ ",
        "ur": "فرعون کی قوم اور ان لوگوں کے اسلوب کی طرح جو ان سے پہلے تھے (تمہارا بھی اسلوب ہے)۔ انہوں نے اپنے ربّ کی آیات کو جھٹلا دیا تو ہم نے انہیں ان کے گناہوں کے سبب سے ہلاک کر دیا اور فرعون کی قوم کو ہم نے غرق کر دیا اور وہ سب کے سب ظالم لوگ تھے۔",
        "v5": {
            "text": "[a]<i>Their case is</i> like the case of the people of Pharaoh and those before them; they rejected the Signs of their Lord, so We destroyed them for their sins. And We drowned the people of Pharaoh, for they were all wrongdoers.[1143]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:12; 8:53."
                },
                {
                    "ref": "1143",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse repeats the subject matter of 8:53 above, with the change that here (1) the words اخذھم اللّه (Allah punished them, lit. Allah seized them) have been changed to اھلکناھم (We destroyed them); and (2) the words, <i>We drowned the people of Pharaoh</i>, etc. have been added. This is to point to the severity of the punishment and the total destruction of the disbelievers.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 56,
        "v_": 55,
        "topics": [
            {
                "id": 1720,
                "topic": "Allah: has made them apes, swine, beasts",
                "verses": "2:66, 5:61, 7:167, 8:23, 98:7"
            },
            {
                "id": 4235,
                "topic": "Belief: <i>Iman</i>: those who have no",
                "verses": "2:7-8, 2:14, 4:39, 4:138, 4:151-152, 6:151, 6:159, 7:28, 7:102, 10:91-93, 10:97-98, 10:102, 13:2, 36:8, 40:60, 40:86, 41:45"
            },
            {
                "id": 5546,
                "topic": "Dabbatul-Ard: creatures, beasts",
                "verses": "27:83, 2:165, 6:39, 8:23, 11:7, 11:57, 16:50, 16:62, 22:19, 31:11, 34:15, 35:29, 35:46, 42:30, 45:5, 81:6"
            },
            {
                "id": 6416,
                "topic": "Disbelief: <i>Kufr</i>: Disbeliever, <i>Kuffar</i>",
                "verses": "2:7-21, 2:35, 3:5, 3:98, 4:151-152, 5:18, 5:37, 5:38, 5:45, 5:73, 7:38, 7:51, 9:37, 12:88, 14:3-4, 16:108, 19:72, 38:74-75, 39:33, 39:60, 40:5, 45:12, 47:35, 85:11, 85:20-21, 98:7, 109:2-7"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            }
        ],
        "ar": "اِنَّ شَرَّ الدَّوَآبِّ عِنۡدَ اللّٰہِ الَّذِیۡنَ کَفَرُوۡا  فَہُمۡ  لَا  یُؤۡمِنُوۡنَ ﴿ۖۚ۵۶﴾ ",
        "ur": "یقیناً اللہ کے نزدیک بدترین جاندار وہ ہیں جنہوں نے کفر کیا اور وہ کسی صورت ایمان نہیں لاتے۔",
        "v5": {
            "text": "Surely, [b]the worst of beasts in the sight of Allah are those who are ungrateful. So they will not believe,[1144]",
            "notes": [
                {
                    "ref": "b",
                    "note": "8:23; 98:7."
                },
                {
                    "ref": "1144",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse explains 6:39, which says that the animals that move on the earth and the birds that fly in the air are better than the disbelievers; for, whereas animals and birds do not understand, because they lack the power of understanding, the disbelievers possess the power to understand and yet they fail to do so. See also 8:23.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 57,
        "v_": 56,
        "topics": [
            {
                "id": 1017,
                "topic": "Agreements: <i>‘Ahd</i>",
                "verses": "16:92-3, 2:28, 2:41, 2:178, 3:77-78, 5:2, 6:153, 9:4, 9:111, 13:21, 16:96, 17:35, 23:9, 48:11, 70:33"
            },
            {
                "id": 5358,
                "topic": "Covenant: <i>Mithaq, ‘Ahd</i>: with believers",
                "verses": "3:188, 48:11, 2:177, 2:238, 2:257, 5:2, 5:8, 4:22, 8:73, 9:8, 9:12-13, 9:75, 9:111, 17:35, 23:9, 70:33"
            },
            {
                "id": 7507,
                "topic": "Fear: cast into disbelievers",
                "verses": "8:13, 2:20, 2:67, 2:207, 3:176, 8:27, 33:20, 34:52, 42:23, 106:5"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            }
        ],
        "ar": "اَلَّذِیۡنَ عٰہَدۡتَّ مِنۡہُمۡ ثُمَّ یَنۡقُضُوۡنَ عَہۡدَہُمۡ  فِیۡ  کُلِّ  مَرَّۃٍ   وَّ ہُمۡ لَا یَتَّقُوۡنَ ﴿۵۷﴾ ",
        "ur": "(یعنی) وہ لوگ جن سے تو نے معاہدہ کیا پھر وہ ہر بار اپنا عہد توڑ دیتے ہیں اور وہ ڈرتے نہیں۔",
        "v5": {
            "text": "Those with whom thou didst make a covenant; then [c]they break their covenant every time, and they do not fear <i>God</i>.[1144A]",
            "notes": [
                {
                    "ref": "c",
                    "note": "2:28."
                },
                {
                    "ref": "1144A",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse qualifies and explains the one that precedes it.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 58,
        "v_": 57,
        "topics": [
            {
                "id": 5358,
                "topic": "Covenant: <i>Mithaq, ‘Ahd</i>: with believers",
                "verses": "3:188, 48:11, 2:177, 2:238, 2:257, 5:2, 5:8, 4:22, 8:73, 9:8, 9:12-13, 9:75, 9:111, 17:35, 23:9, 70:33"
            },
            {
                "id": 12793,
                "topic": "Muslims: repugnance to war",
                "verses": "3:111, 2:217-218"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            },
            {
                "id": 18369,
                "topic": "War: <i>Qital</i>: Muslim warriors",
                "verses": "100:2-6, 3:144, 4:72, 8:16-17, 8:61, 8:66, 9:52, 48:17-18, 61:5"
            },
            {
                "id": 18387,
                "topic": "War: <i>Qital</i>: repugnance for",
                "verses": "2:217, 4:78, 5:34, 47:23"
            }
        ],
        "ar": "فَاِمَّا تَثۡقَفَنَّہُمۡ فِی الۡحَرۡبِ فَشَرِّدۡ بِہِمۡ مَّنۡ  خَلۡفَہُمۡ  لَعَلَّہُمۡ  یَذَّکَّرُوۡنَ ﴿۵۸﴾ ",
        "ur": "پس اگر تُو اُن سے لڑائی میں متصادم ہو تو اُن (کے حشر) سے اُن کے پچھلوں کو بھی تتربتر کردے تاکہ شاید وہ نصیحت پکڑیں۔\r\n",
        "v5": {
            "text": "So, if thou catchest them in war, then by <i>routing</i> them strike fear in those that are behind them, that they may be admonished.[1145]",
            "notes": [
                {
                    "ref": "1145",
                    "note": "<p><strong>Important Words:</strong></p><p>شرد (strike fear) is derived from شرد (<i>sharada</i>) which means, he (a horse, etc.) took fright and fled or ran away at random; or simply he fled or ran away. شردہ or شرد به (<i>sharrada</i>) means, he made him take fright and flee or run away at random; or he drove him away. تشرید also signifies the act of dispersing or scattering. شردبه also means, he rendered him notorious by exposing his vices or faults. شرد به من خلفھم means, disperse or scatter by them or through them those who are or who shall come after them; or terrify by or through them those who are, or who shall come after them; or make them notorious to those who are, or who shall come, after them (Taj).</p><p><strong>Commentary:</strong></p><p>The Quran uses the word تثقفنھم (for which see 2:192) meaning <i>thou catchest them</i> with a view to pointing to the fact that when a disbeliever meets a believer on a field of battle, the former is, as it were, in the very grip of the latter. Thus when believers have to fight, they are expected to fight like valiant men and the enemy who opposes them should be considered as having come within their grasp and should not be able to escape from their hands. The expression تشرید (striking fear) has also been used to point to the same truth. A believer is always slow to take up arms; but when he does so, he fights so valiantly that he not only takes the enemy in his iron grip but deals such blows to him as may strike terror in the hearts of those that are behind the enemy, as well as those that may come after him. A feebly-pursued and lingering war is never a good policy. If there is to be a war, it should be swift and exemplary. This is why the verse enjoins that, when forced to fight, Muslims should fight the enemy so valiantly that not only those who are actually engaged in fighting should be routed, but even their supporters who are behind them, should be struck with terror. In fact, Islam not only requires its followers to excel others in things moral and spiritual, but also expects them to surpass others even in the physical sphere. They have to set the highest example in all matters. If they must fight, they should excel others in fighting as well.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 59,
        "v_": 58,
        "topics": [
            {
                "id": 1026,
                "topic": "Agreements: <i>‘Ahd</i>: may be repudiated",
                "verses": null
            },
            {
                "id": 1407,
                "topic": "Allah: loves not",
                "verses": "31:19, 2:191, 2:206, 2:277, 3:33, 4:37, 4:108, 4:149, 5:65, 7:32, 16:24, 22:39, 28:77-78, 42:41"
            },
            {
                "id": 4386,
                "topic": "Betray",
                "verses": "8:28, 2:188, 4:108, 5:14, 8:72, 12:53, 22:39, 40:20"
            },
            {
                "id": 5358,
                "topic": "Covenant: <i>Mithaq, ‘Ahd</i>: with believers",
                "verses": "3:188, 48:11, 2:177, 2:238, 2:257, 5:2, 5:8, 4:22, 8:73, 9:8, 9:12-13, 9:75, 9:111, 17:35, 23:9, 70:33"
            },
            {
                "id": 6521,
                "topic": "Dishonesty: <i>Khiyanah</i>",
                "verses": "8:28, 3:162, 4:106, 4:108, 12:53, 22:39, 40:20, 66:11"
            },
            {
                "id": 12793,
                "topic": "Muslims: repugnance to war",
                "verses": "3:111, 2:217-218"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            },
            {
                "id": 18337,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "وَ  اِمَّا  تَخَافَنَّ مِنۡ قَوۡمٍ خِیَانَۃً  فَانۡۢبِذۡ اِلَیۡہِمۡ عَلٰی سَوَآءٍ ؕ اِنَّ اللّٰہَ  لَا یُحِبُّ الۡخَآئِنِیۡنَ ﴿٪۵۹﴾ ",
        "ur": "اور اگر کسی قوم سے تُو خیانت کا خوف کرے تو اُن سے ویسا ہی کر جیسا اُنہوں نے کیا ہو۔ اللہ خیانت کرنے والوں کو ہرگز پسند نہیں کرتا۔",
        "v5": {
            "text": "And if thou fearest treachery from a people, throw back to them <i>their covenant</i> with equity. Surely, [a]Allah loves not the treacherous.[1146]",
            "notes": [
                {
                    "ref": "a",
                    "note": "4:108."
                },
                {
                    "ref": "1146",
                    "note": "<p><strong>Commentary:</strong></p><p>If a people with whom Muslims have entered into a covenant begin to commit acts of hostility towards them and it is feared that they are going to play false, then it should be openly and plainly declared to them that the covenant between them and the Muslims had come to an end. Then if, after such a declaration, they should fight the Muslims, the latter should also fight them. Thus Muslims are not allowed to make a surprise attack on any people without due notice. The Holy Prophet is reported to have said لا تفرط ولا تفجأ i.e. \"Do not exceed the bounds in fighting, nor make a surprise attack on the enemy.\" Even in war, Islam enjoins strict justice and mercy.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 60,
        "v_": 59,
        "topics": [
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            }
        ],
        "ar": "وَ لَا یَحۡسَبَنَّ الَّذِیۡنَ کَفَرُوۡا سَبَقُوۡا ؕ اِنَّہُمۡ  لَا  یُعۡجِزُوۡنَ ﴿۶۰﴾",
        "ur": "اور وہ لوگ جنہوں نے کفر کیا ہرگز یہ وہم نہ کریں کہ وہ سبقت لے گئے ہیں۔ وہ ہرگز عاجز نہیں کر سکیں گے۔",
        "v5": {
            "text": "And [b]let not those who disbelieve think that they have outstripped <i>Us</i>. Surely, they cannot frustrate <i>God’s purpose</i>.[1147]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:179."
                },
                {
                    "ref": "1147",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse contains the great prophecy that the enemies of Islam who had waged war against the Muslims would never prevail. Such a prophecy could not be made by a human being in the circumstances in which it was made; for it is an established historical fact that at the time when this prophecy was made the Muslims were extremely weak both in number and equipment and no mortal could predict that such a weak and ill-equipped community could vanquish their numerous and powerful enemies. Only God, Who is Almighty and Omniscient, could predict victory for the Muslims in such circumstances; and the promised victory did actually come to pass.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 61,
        "v_": 60,
        "topics": [
            {
                "id": 2374,
                "topic": "Allah: spend in the way of",
                "verses": "2:268, 2:4, 2:196, 2:216, 2:220, 2:246, 2:255, 2:263, 2:265, 2:273, 2:275, 3:93, 8:4, 9:20, 9:34, 9:41, 9:99, 9:111, 13:23, 14:32, 16:76, 22:36, 24:38-39, 28:55, 32:17, 35:30, 42:39, 47:39, 57:8, 57:11, 61:12, 63:11, 64:17-18, 65:8, 73:21"
            },
            {
                "id": 7151,
                "topic": "Enmity: <i>‘Adawah</i>: of unbelievers",
                "verses": "2:98-99, 3:29, 3:119-121, 4:102, 7:130, 9:12-14, 41:20, 41:29, 60:2, 60:8, 63:5"
            },
            {
                "id": 14428,
                "topic": "Prophecies in the Holy Qur’an: about: Islam",
                "verses": "30:3-5, 2:116, 9:33, 12:103, 16:78, 17:2, 19:41, 22:24, 22:27, 32:6, 33:23, 35:12, 38:2, 41:54, 43:90, 48:29-30, 53:2, 56:4, 58:22, 60:8, 61:10, 70:37-38, 79:2-6, 81:19, 81:24-25, 82:2, 83:30-35, 89:23, 90:2-3, 91:2-5, 93:2-3, 94:6-7, 99:2-7, 100:10-12"
            },
            {
                "id": 17069,
                "topic": "Spending: <i>Nafaqah</i>: by believers",
                "verses": "2:255, 2:4, 2:178, 2:196, 2:262, 2:263, 2:268, 2:274, 3:18, 3:93, 9:60, 9:104, 14:32, 47:39, 57:8, 57:11, 63:11, 64:17, 70:25, 73:21"
            },
            {
                "id": 17089,
                "topic": "Spending: <i>Nafaqah</i>: rewards of",
                "verses": "2:246, 2:262-263, 2:273, 2:275, 5:13, 9:121, 57:8, 57:12, 57:19, 64:18"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            },
            {
                "id": 18338,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            },
            {
                "id": 18370,
                "topic": "War: <i>Qital</i>: Muslim warriors",
                "verses": "100:2-6, 3:144, 4:72, 8:16-17, 8:58, 8:66, 9:52, 48:17-18, 61:5"
            }
        ],
        "ar": "وَ اَعِدُّوۡا لَہُمۡ مَّا اسۡتَطَعۡتُمۡ مِّنۡ قُوَّۃٍ وَّ مِنۡ رِّبَاطِ الۡخَیۡلِ تُرۡہِبُوۡنَ بِہٖ عَدُوَّ اللّٰہِ وَ عَدُوَّکُمۡ  وَ اٰخَرِیۡنَ مِنۡ دُوۡنِہِمۡ ۚ لَا تَعۡلَمُوۡنَہُمۡ ۚ اَللّٰہُ یَعۡلَمُہُمۡ ؕ وَ مَا تُنۡفِقُوۡا مِنۡ شَیۡءٍ  فِیۡ  سَبِیۡلِ  اللّٰہِ  یُوَفَّ اِلَیۡکُمۡ  وَ  اَنۡتُمۡ  لَا  تُظۡلَمُوۡنَ ﴿۶۱﴾ ",
        "ur": "اور جہاں تک تمہیں توفیق ہو اُن کے لئے تیاری رکھو، کچھ قوّت جمع کرکے اور کچھ سرحدوں پر گھوڑے باندھ کر۔ اس سے تم اللہ کے دشمن اور اپنے دشمن اور ان کے علاوہ دوسرں کو بھی مرعوب کرو گے۔ تم انہیں نہیں جانتے اللہ انہیں جانتا ہے۔ اور جو کچھ بھی تم اللہ کی راہ میں خرچ کروگے تمہیں بھرپور طور پر واپس کیا جائے گا اور تمہاری حق تلفی نہیں کی جائے گی۔ ",
        "v5": {
            "text": "And [a]make ready for them whatever you can of force and of mounted pickets at the frontier, whereby you may frighten the enemy of Allah and your enemy and others besides them whom you know not, <i>but</i> Allah knows them. And [b]whatever you spend in the way of Allah, it shall be repaid to you in full and you shall not be wronged.[1148]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:201."
                },
                {
                    "ref": "b",
                    "note": "2:273; 9:121; 64:18; 65:8."
                },
                {
                    "ref": "1148",
                    "note": "<p><strong>Important Words:</strong></p><p>رباط الخیل (mounted pickets at the frontier). For رباط see 3:201. خیل is derived from خال i.e. he thought or fancied. اختال means, he was proud and haughty. خیل means, horses collectively, so called because of the pride and conceit in their gait; also horsemen (Lane).</p><p><strong>Commentary:</strong></p><p>This verse teaches Muslims that efficient preparation is the best means of preventing war. It teaches them that they should not only keep a sufficient fighting force in the country but also an adequate number of troops on the frontier so that the enemy might refrain from attack, thus enabling the Faithful to live in peace. The verse also points to the necessity of spending freely in war.</p><p>It is worthy of note that the verse does not simply say \"your enemy\" but<i> the enemy of Allah and your enemy</i>, thus hinting that disbelievers had become hostile to Muslims for the sole reason that the latter had accepted Islam, the religion of God. These words throw interesting light on the causes of early Islamic wars.</p><p>The verse further informs Muslims that the pagan Arabs were not the only enemies of Islam. There were other nations also which would attack Muslims in the future, as the Arabs had already done. So Muslims were told to keep their frontiers strong and well-protected and to spend freely in the cause of Allah. This prophecy referred to the Greeks and the Persians with whom Muslims came in contact soon after the death of the Holy Prophet.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 62,
        "v_": 61,
        "topics": [
            {
                "id": 7151,
                "topic": "Enmity: <i>‘Adawah</i>: of unbelievers",
                "verses": "2:98-99, 3:29, 3:119-121, 4:102, 7:130, 9:12-14, 41:20, 41:29, 60:2, 60:8, 63:5"
            },
            {
                "id": 13754,
                "topic": "Peace",
                "verses": "47:36, 49:10"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            },
            {
                "id": 17551,
                "topic": "Tawakkul ‘Alallah: trust in Allah",
                "verses": "3:123, 3:160-161, 4:82, 4:133, 4:172, 5:12, 5:24, 7:90, 8:3, 8:50, 9:51, 9:129, 10:72, 10:85-86, 11:57, 11:89, 11:124, 12:68, 13:31, 14:12-13, 16:43, 16:100, 25:59, 26:218, 27:80, 29:60, 33:4, 33:49, 39:39, 42:11, 58:11, 60:5, 64:14, 65:4, 67:30"
            },
            {
                "id": 18338,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "وَ اِنۡ جَنَحُوۡا لِلسَّلۡمِ فَاجۡنَحۡ لَہَا وَ تَوَکَّلۡ عَلَی اللّٰہِ ؕ اِنَّہٗ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۶۲﴾ ",
        "ur": "اور اگر وہ صلح کے لئے جُھک جائیں تو تُو بھی اُس کے لئے جُھک جا اور اللہ پر توکل کر۔ یقیناً وہی بہت سننے والا (اور) دائمی علم رکھنے والا ہے۔",
        "v5": {
            "text": "And if they incline towards peace, incline thou also towards it, and put thy trust in Allah. Surely, it is He Who is All-Hearing, All-Knowing.[1149]",
            "notes": [
                {
                    "ref": "1149",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse, besides embodying an important principle about the formation of peace-treaties, throws interesting light on the character of the wars undertaken by Islam. Muslims did not resort to war to force men to embrace Islam, but simply to maintain peace. Hence, if any people after making war against Muslims sued for peace, the latter were enjoined to desist from war and make peace with them, in spite of their being disbelievers. Even the consideration that the enemy might be suing for peace simply to deceive the Muslims and to gain time was not to deter them from making peace. This shows that what the Muslims desired was nothing but peace, and they were bidden to welcome it at all hazards. See also the verse that follows.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 63,
        "v_": 62,
        "topics": [
            {
                "id": 6221,
                "topic": "Deceive: <i>Gharrah, Khada‘ah</i>",
                "verses": "2:10, 3:25, 3:197, 4:143, 6:113, 6:131, 31:34, 40:5, 45:36, 57:15, 82:7"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            }
        ],
        "ar": "وَ اِنۡ یُّرِیۡدُوۡۤا اَنۡ یَّخۡدَعُوۡکَ فَاِنَّ حَسۡبَکَ اللّٰہُ ؕ ہُوَ  الَّذِیۡۤ   اَیَّدَکَ  بِنَصۡرِہٖ وَ بِالۡمُؤۡمِنِیۡنَ ﴿ۙ۶۳﴾ ",
        "ur": "اور اگر وہ ارادہ کریں کہ تجھے دھوکہ دیں تو یقیناً اللہ تجھے کافی ہے۔ وہی ہے جس نے اپنی نصرت کے ذریعہ اور مومنوں کے ذریعہ تیری مددکی۔",
        "v5": {
            "text": "And if they intend to deceive thee, then surely [a]Allah is sufficient for thee. He it is Who has strengthened thee with His help and with the believers;[1150]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:65."
                },
                {
                    "ref": "1150",
                    "note": "<p><strong>Commentary:</strong></p><p>An offer of peace by the enemy must be accepted, even if there is the risk of his playing false. See note on the preceding verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 64,
        "v_": 63,
        "topics": [
            {
                "id": 824,
                "topic": "Affection",
                "verses": "48:30, 3:104, 5:55, 59:10-11"
            },
            {
                "id": 8478,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: love in their",
                "verses": "53:12, 3:104, 9:60"
            },
            {
                "id": 17222,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 9:1-16, 22:40-42"
            }
        ],
        "ar": "وَ اَلَّفَ بَیۡنَ قُلُوۡبِہِمۡ ؕ لَوۡ اَنۡفَقۡتَ مَا فِی الۡاَرۡضِ جَمِیۡعًا مَّاۤ  اَلَّفۡتَ بَیۡنَ قُلُوۡبِہِمۡ وَ لٰکِنَّ اللّٰہَ  اَلَّفَ بَیۡنَہُمۡ ؕ اِنَّہٗ  عَزِیۡزٌ  حَکِیۡمٌ ﴿۶۴﴾",
        "ur": "اور اس نے ان کے دلوں کو آپس میں باندھ دیا۔ اگر تُو وہ سب کچھ خرچ کر دیتا جو زمین میں ہے تب بھی تُو ان کے دلوں کو آپس میں باندھ نہیں سکتا تھا۔ لیکن یہ اللہ ہی ہے جس نے ان (کے دلوں) کو باہم باندھا۔ وہ یقیناً کامل غلبہ والا (اور) حکمت والا ہے۔",
        "v5": {
            "text": "And [b]He has put affection between their hearts. If thou hadst expended all that is in the earth, thou couldst not have put affection between their hearts, but Allah has put affection between them. Surely, He is Mighty, Wise.[1151]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:104."
                },
                {
                    "ref": "1151",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse is intended to meet any possible demur on the part of believers in the matter of accepting a peace offer made by the enemy. It is no favour of the believers upon God or His Messenger, if they have helped the Prophet; on the other hand, it is God’s favour upon them that He has put affection \"between their hearts,\" for, before their acceptance of Islam they too were enemies of one another.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 65,
        "v_": 64,
        "topics": [],
        "ar": "یٰۤاَیُّہَا النَّبِیُّ حَسۡبُکَ اللّٰہُ وَ مَنِ اتَّبَعَکَ  مِنَ  الۡمُؤۡمِنِیۡنَ ﴿٪۶۵﴾ ",
        "ur": "اے نبی! تجھے اللہ کافی ہے اور اُن کو بھی جو مومنوں میں سے تیری پیروی کریں۔",
        "v5": {
            "text": "O Prophet, [c]Allah is sufficient for thee and for those who follow thee of the believers.[1152]",
            "notes": [
                {
                    "ref": "c",
                    "note": "8:63."
                },
                {
                    "ref": "1152",
                    "note": "<p><strong>Commentary:</strong></p><p>The words من اتبعك (those who follow thee) are grammatically in apposition to the pronoun (thee) in حسبك (sufficient for thee). It is thus wrong to translate the verse as \"Allah is sufficient for thee and so are those who follow thee.\" The sufficing of God relates both to the Prophet and his followers.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 66,
        "v_": 65,
        "topics": [
            {
                "id": 4282,
                "topic": "Believers: <i>Mu’min</i>: can overcome disbelievers",
                "verses": null
            },
            {
                "id": 11947,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:47, 10:90, 10:110, 11:12, 11:116, 12:91, 13:25, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:55, 28:81, 29:60, 32:25, 33:36, 34:20, 37:103, 38:45, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            },
            {
                "id": 18354,
                "topic": "War: <i>Qital</i>: enjoined for Allah",
                "verses": "2:245, 2:247, 4:61, 4:75-77, 9:36, 9:38, 9:111, 9:123, 73:21"
            },
            {
                "id": 18371,
                "topic": "War: <i>Qital</i>: Muslim warriors",
                "verses": "100:2-6, 3:144, 4:72, 8:16-17, 8:58, 8:61, 9:52, 48:17-18, 61:5"
            }
        ],
        "ar": "یٰۤاَیُّہَا النَّبِیُّ حَرِّضِ الۡمُؤۡمِنِیۡنَ عَلَی الۡقِتَالِ ؕ اِنۡ یَّکُنۡ مِّنۡکُمۡ عِشۡرُوۡنَ صٰبِرُوۡنَ یَغۡلِبُوۡا مِائَتَیۡنِ ۚ وَ اِنۡ  یَّکُنۡ مِّنۡکُمۡ  مِّائَۃٌ  یَّغۡلِبُوۡۤا اَلۡفًا مِّنَ الَّذِیۡنَ  کَفَرُوۡا بِاَنَّہُمۡ قَوۡمٌ لَّا یَفۡقَہُوۡنَ ﴿۶۶﴾ ",
        "ur": "اے نبی! مومنوں کو قتال کی ترغیب دے۔ اگر تم میں سے بیس صبر کرنے والے ہوں تو وہ دو سو پر غالب آ جائیں گے۔ اور اگر تم میں سے ایک سو (صبر کرنے والے) ہوں تو وہ کفر کرنے والوں کے ایک ہزار پر غالب آ جائیں گے کیونکہ وہ ایسے لوگ ہیں جو کچھ سمجھتے نہیں۔",
        "v5": {
            "text": "O Prophet, [a]urge the believers to fight. If there be of you twenty who are steadfast, they shall overcome two hundred; and if there be a hundred of you, they shall overcome a thousand of those who disbelieve, because they are a people who do not understand.[1153]",
            "notes": [
                {
                    "ref": "a",
                    "note": "4:85."
                },
                {
                    "ref": "1153",
                    "note": "<p><strong>Commentary:</strong></p><p>As disbelievers were not going to desist from fighting, as they were invited to do (8:23 &amp; 8:39 above), but were determined to carry on war of aggression against Islam, therefore the Holy Prophet has been asked in this verse to urge Muslims also to fight in self-defence.</p><p>The verse promises victory to Muslims over an enemy ten times their number <i>because they are a people who do not understand</i>. Fighters should understand the purpose of their fighting. They should look upon the war, they are engaged in, as their own. They should know the advantage which will accrue to their community if they win, and they should also know the losses which they will have to suffer if they are defeated. Mere hirelings, or men, who are blindly led to war by their leaders but who do not understand its object and feel no personal interest in it, cannot win. The forces that fought against Islam were mostly composed of men, who took part in the war merely because they were called upon to do so by their mischievous leaders-the wicked and avowed enemies of Islam. They felt no personal interest in the war against the new religion.</p><p>Religiously speaking also, they were a people who did not \"understand\", whereas Muslims did understand what faith meant. They were moved by love for their God, their Prophet and their religion. Disbelievers, on the other hand, were not as devoted to their idols as the Faithful were to their God in Whom they had a living faith.</p><p>The verse gives the number twenty as the minimum number for Muslims to win sure victory over their enemy because that was the least number that made a regular fighting party. If the number of men was less than twenty, it was not to be regarded as a fighting force and the laws relating to war did not apply to them.</p><p>Thus, a party of twenty persons, the minimum comprising a fighting unit, was bound to fight if they met an enemy as many as ten times their strength, and they were forbidden to flee. The question of retiring before the enemy is not to be decided by the men but by their officers, who may act as they may think best in the interest of war. See also 8:16.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 67,
        "v_": 66,
        "topics": [
            {
                "id": 11947,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:47, 10:90, 10:110, 11:12, 11:116, 12:91, 13:25, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:55, 28:81, 29:60, 32:25, 33:36, 34:20, 37:103, 38:45, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            },
            {
                "id": 13699,
                "topic": "Patience: <i>sabr</i>: Allah’s help for",
                "verses": "2:154, 2:156, 2:250, 3:147, 8:47"
            },
            {
                "id": 13845,
                "topic": "Permission: Leave, <i>Idhn</i>: of Allah",
                "verses": "64:12, 2:98, 2:103, 2:214, 2:222, 2:250, 2:252, 2:256, 3:50, 3:146, 3:153, 3:167, 4:65, 5:17, 5:111, 7:59, 10:4, 10:101, 11:106, 13:39, 14:2, 14:12, 14:24, 14:26, 22:66, 33:47, 34:13, 35:33, 42:52, 58:11, 59:6, 97:5"
            },
            {
                "id": 18105,
                "topic": "Uhud: Battle of",
                "verses": "33:22, 3:122-130, 3:142, 3:153-156, 3:160, 3:167-175, 22:67, 59:3, 71:29"
            }
        ],
        "ar": "اَلۡـٰٔنَ خَفَّفَ اللّٰہُ عَنۡکُمۡ وَ عَلِمَ اَنَّ فِیۡکُمۡ ضَعۡفًا ؕ فَاِنۡ یَّکُنۡ مِّنۡکُمۡ مِّائَۃٌ صَابِرَۃٌ  یَّغۡلِبُوۡا مِائَتَیۡنِ ۚ وَ اِنۡ یَّکُنۡ مِّنۡکُمۡ اَلۡفٌ یَّغۡلِبُوۡۤا اَلۡفَیۡنِ بِاِذۡنِ اللّٰہِ ؕ وَ اللّٰہُ  مَعَ  الصّٰبِرِیۡنَ ﴿۶۷﴾ ",
        "ur": "سرِدست اللہ نے تم سے بوجھ ہلکا کر دیا ہے کیونکہ وہ جانتا ہے کہ تم میں ابھی کمزوری ہے۔ پس اگر تم میں سے ایک سو صبر کرنے والے ہوں تو وہ دو سو پر غالب آجائیں گے اور اگر تم میں سے ایک ہزار (صبر کرنے والے) ہوں تو وہ اللہ کے حکم سے دو ہزار پر غالب آجائیں گے اور اللہ صبر کرنے والوں کے ساتھ ہوتا ہے۔",
        "v5": {
            "text": "For the present Allah has lightened your burden, for He knows that there is weakness in you. So, if there be a hundred of you who are steadfast, they shall overcome two hundred; and if there be a thousand of you, they shall overcome two thousand by the command of Allah. And Allah is with those who are steadfast.[1154]",
            "notes": [
                {
                    "ref": "1154",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse does not abrogate the previous verse, but only temporarily relieves Muslims in view of the then existing condition of their faith. Their faith, though sincere and true, was \"weak\" as compared with its future condition when it was to grow stronger by their witnessing more and more heavenly signs and by their becoming more and more organized.</p><p>The words, <i>For the present Allah has lightened your burden</i>, show that the previous verse contains not a prophecy, but a commandment. It does not announce by way of prophecy that Muslims will prevail over an enemy ten times their number; it simply gives the injunction that if twenty believers have to face 200 disbelievers, they must fight them, and that if they turn their backs, they will be sinners. In the present verse, however, in view of the then weak condition of Muslims, the limit of disparity has been reduced to twice the number of the believers.</p><p>History tells us that in later times, Muslims had sometimes to fight an enemy even more than ten times their number and still they were victorious. Thus, at the Battle of Yarmuk the Muslim army numbered 30,000, according to the lowest calculation, while the enemy numbered at least 600,000 (the highest figures being respectively 60,000 and 1,000,000) and the battle ended in a decisive victory for the Muslims.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 68,
        "v_": 67,
        "topics": [
            {
                "id": 898,
                "topic": "Afterlife: <i>Akhirah</i>: comparison of present life with",
                "verses": "3:15, 3:186, 4:78, 6:33, 7:170, 9:38, 10:71, 12:58, 12:110, 13:27, 14:4, 16:31, 16:42, 16:108, 16:118, 17:22, 28:61, 29:65, 40:40, 47:37, 57:21, 75:21-22"
            },
            {
                "id": 4921,
                "topic": "Captives: <i>Asir</i>",
                "verses": "2:86, 2:178, 4:25, 5:90, 8:71, 9:60, 33:27, 47:5, 58:4, 76:9, 90:14"
            },
            {
                "id": 12415,
                "topic": "Muhammad<sup>(sa)</sup>: Divine solicitude for",
                "verses": "9:43, 33:38, 66:2, 80:2-12"
            },
            {
                "id": 14247,
                "topic": "Prisoners of War: taking of",
                "verses": "47:5"
            },
            {
                "id": 16929,
                "topic": "Slavery: condemnation of",
                "verses": "4:4"
            },
            {
                "id": 18339,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            },
            {
                "id": 18379,
                "topic": "War: <i>Qital</i>: prisoners of",
                "verses": "8:71-72, 2:86, 4:4, 4:25, 9:6, 60:12, 76:9"
            }
        ],
        "ar": "مَا  کَانَ  لِنَبِیٍّ  اَنۡ  یَّکُوۡنَ  لَہٗۤ  اَسۡرٰی حَتّٰی یُثۡخِنَ فِی الۡاَرۡضِ ؕ تُرِیۡدُوۡنَ عَرَضَ الدُّنۡیَا ٭ۖ وَ اللّٰہُ  یُرِیۡدُ  الۡاٰخِرَۃَ ؕ وَ اللّٰہُ  عَزِیۡزٌ  حَکِیۡمٌ ﴿۶۸﴾ ",
        "ur": "کسی نبی کے لئے جائز نہیں کہ زمین میں خونریز جنگ کئے بغیر قیدی بنائے۔ تم دنیا کی متاع چاہتے ہو جبکہ اللہ آخرت پسند کرتا ہے اور اللہ کامل غلبہ والا (اور) بہت حکمت والا ہے۔",
        "v5": {
            "text": "[a]It does not behove a Prophet that he should have captives until he engages in regular fighting in the land. [b]You desire the goods of the world, while Allah desires <i>for you</i> the Hereafter. And Allah is Mighty, Wise.[1155]",
            "notes": [
                {
                    "ref": "a",
                    "note": "47:5."
                },
                {
                    "ref": "b",
                    "note": "4:95."
                },
                {
                    "ref": "1155",
                    "note": "<p><strong>Important Words:</strong></p><p>اسری (captives) is the plural of اسیر (a captive) which is derived from اسر. They say اسره i.e. he bound or tied him, or he made him a captive or took him a prisoner. اسیر means, one shackled or imprisoned; a captive (Lane).</p><p>یثخن (he engages in a regular fighting) is derived from ثخن (<i>thakhuna</i>) or ثخن (<i>thakhana</i>) which means, it was thick or coarse or hard. اثخنه means, he rendered it thick; or he rendered him heavy or languid or enervated; or he overcame him and inflicted many wounds on him. اثخن فی العدو means, he made a great slaughter or a great wounding among the enemy. اثخن فی الارض means, he made much slaughter in the earth or the land; or he fought vehemently in the earth (Lane). The expression حتی یثخن فی الارض would thus mean, till he (the Prophet) has had a regular fighting in the land, inflicting wounds on the enemy.</p><p><strong>Commentary:</strong></p><p>It was a practice among pre-Islamic Arabs (and it is regrettable that the practice still continues in some parts of the world) to take men captives even if there was no war and no fighting, and then to make them slaves. The verse abolishes this evil custom and lays down in clear words that it is only in war and after regular fighting that enemy combatants can be taken prisoner and that it is not lawful to take any person captive when there is no war and there has been no fighting.</p><p>The verse has been very wrongly interpreted. It is said that when the Muslims took some men of the Meccan army captives at Badr, the Holy Prophet took counsel with his Companions as to what should be done with them. ‘Umar suggested that they should be put to death, while Abu Bakr proposed that they should be released after accepting ransom from them. The Holy </p><p>Prophet accepted the suggestion of Abu Bakr and the prisoners were released for ransom. But it is alleged that by revealing this verse, God expressed His disapproval of the Holy Prophet’s action, declaring that the captives ought to have been put to death and no ransom should have been taken for them. This interpretation, however, is obviously wrong; firstly, because God had so far sent down no commandment forbidding the release of prisoners for ransom, and, therefore, He could not reprove the Holy Prophet for accepting ransom; secondly, because the Holy Prophet had already accepted ransom for two persons taken captive at Nakhlah prior to the Battle of Badr, and God had not disapproved of this action of his; thirdly, because only two verses later God permits Muslims to<i> eat of that which you have won in war as lawful and good</i> (8:70). It is simply inconceivable that God should have reproved the Holy Prophet for having accepted ransom and then at the same time declared the money so taken to be lawful and good. This interpretation is, therefore, obviously wrong and the verse is only intended to lay down a general rule that captives should not be taken until there has been regular fighting and the enemy has been overpowered by the infliction of wounds.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 69,
        "v_": 68,
        "topics": [
            {
                "id": 4635,
                "topic": "Book: <i>Kitab</i>: repository of Divine laws and decrees",
                "verses": "57:23, 2:136, 4:25, 8:76, 9:36, 13:39, 15:5, 17:59, 30:57, 33:7, 35:12"
            },
            {
                "id": 4921,
                "topic": "Captives: <i>Asir</i>",
                "verses": "2:86, 2:178, 4:25, 5:90, 8:71, 9:60, 33:27, 47:5, 58:4, 76:9, 90:14"
            },
            {
                "id": 6236,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4, 97:2-5"
            },
            {
                "id": 14247,
                "topic": "Prisoners of War: taking of",
                "verses": "47:5"
            },
            {
                "id": 18339,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "لَوۡ لَا کِتٰبٌ مِّنَ اللّٰہِ سَبَقَ لَمَسَّکُمۡ فِیۡمَاۤ  اَخَذۡتُمۡ  عَذَابٌ  عَظِیۡمٌ ﴿۶۹﴾ ",
        "ur": "اگر اللہ کی طرف سے (تم سے مغفرت کے سلوک کی) پہلے سے تقدیر نہ لکھی ہوتی تو ضرور تمہیں اس کی پاداش میں جو تم نے حاصل کیا بہت بڑا عذاب پہنچتا۔",
        "v5": {
            "text": "Had there not been a decree from Allah which had gone before, great distress would have surely overtaken you in connection with that which you took.[1156]",
            "notes": [
                {
                    "ref": "1156",
                    "note": "<p><strong>Commentary:</strong></p><p>In the previous verse it was said that Muslims should not be hasty in taking captives from among the enemy. The verse under comment hints that kindness should be shown to prisoners and that they should be treated with mercy. The verse says that it is only through the assistance of God, which He had ordained for Muslims, that they have gained an easy victory and obtained much booty, and that if it had not been for the help which God had promised them beforehand, they would not have obtained the booty without being severely handled by the enemy and suffering great loss at his hands. The words, <i>a decree from Allah which had gone before</i>, obviously refer to the Word of God which had already conveyed the promise of help to the Holy Prophet (see 8:6 above). The words \"great distress\" thus signify distress caused by the enemy and not affliction from God. The verse purports to say that when by the help of God the Muslims have gained so easy a victory, they should feel grateful for it and should show kindness to the prisoners who have fallen into their hands.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 70,
        "v_": 69,
        "topics": [
            {
                "id": 3157,
                "topic": "Attributes of Allah: Al-Ghafur (Most Forgiving)",
                "verses": "22:61, 2:174, 2:183, 2:193, 2:200, 2:219, 2:226, 2:227, 2:236, 4:24, 4:44, 4:97, 4:100-101, 5:99, 9:5, 16:111, 17:26, 17:45, 18:59, 25:7, 25:71, 33:6, 33:25, 33:51, 33:74, 34:16, 35:35, 35:42, 41:33, 42:6, 42:24, 48:15, 58:3, 60:8, 60:13, 64:15, 85:15"
            },
            {
                "id": 10403,
                "topic": "Lawful: <i>Halal</i>",
                "verses": "2:169, 2:174, 2:188, 2:276, 4:24-25, 5:2, 5:5-6, 5:88, 5:89, 5:97, 6:119-120, 10:60, 16:115, 16:117, 66:2"
            },
            {
                "id": 17507,
                "topic": "Taqwa: fear of God",
                "verses": "2:3, 2:190, 2:197-198, 2:204, 2:213, 2:224, 2:232, 2:234, 2:238, 2:279, 2:283-284, 3:16, 3:51, 3:77, 3:103, 3:131, 3:201, 4:2, 4:10, 4:132, 5:3, 5:5, 5:8-9, 5:12, 5:36, 5:58, 5:89, 5:94, 5:97, 5:113, 6:70, 6:73, 7:27, 7:36, 7:66, 8:2, 9:7, 9:108, 9:109, 11:79, 15:70, 20:133, 22:2, 22:33, 22:38, 26:109, 26:133, 26:185, 33:56, 33:71, 43:64, 47:18, 48:27, 49:4, 49:11, 49:13, 57:29, 58:10, 59:8, 59:19, 60:12, 65:2, 65:11, 74:57, 78:32, 96:13"
            },
            {
                "id": 17604,
                "topic": "Tayyib: good things, <i>Tayyibat</i>",
                "verses": "5:101, 2:58, 2:173, 2:268, 4:3, 4:44, 4:161, 5:5-6, 5:88, 7:33, 7:158, 7:161, 8:27, 10:94, 16:73, 17:71, 20:82, 22:25, 24:27, 35:11, 45:17, 46:21"
            },
            {
                "id": 18339,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            },
            {
                "id": 18392,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "59:7-11, 8:2, 8:42, 33:51"
            }
        ],
        "ar": "فَکُلُوۡا مِمَّا غَنِمۡتُمۡ حَلٰلًا طَیِّبًا ۫ۖ وَّ اتَّقُوا  اللّٰہَ ؕ اِنَّ  اللّٰہَ  غَفُوۡرٌ  رَّحِیۡمٌ ﴿٪۷۰﴾ ",
        "ur": "پس جو مالِ غنیمت تم حاصل کرو اس میں سے حلال اور پاکیزہ کھاؤ اور اللہ کا تقویٰ اختیار کرو۔ یقیناً اللہ بہت بخشنے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "So [a]eat, of that which you have won in war, as lawful and good, and fear Allah. Surely, Allah is Most Forgiving, Merciful.[1157]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:42."
                },
                {
                    "ref": "1157",
                    "note": "<p><strong>Commentary:</strong></p><p>The conjunction \"so\", placed in the beginning of the verse, indicates that the commandment, that follows it, is connected with, and is the result of, what has been said in the previous verses. As the booty taken was obtained after regular fighting and the victory came as a result of God’s help, so the booty taken in the battle and the ransom-money realized from the enemy-prisoners are both \"lawful and good\". God has been here spoken of as \"Forgiving\" because He covered up the weaknesses of Muslims and made them appear strong in the sight of the enemy; and He has been spoken of as \"Merciful\" because He granted Muslims a decisive victory against overwhelming odds.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 71,
        "v_": 70,
        "topics": [
            {
                "id": 4926,
                "topic": "Captives: <i>Asir</i>",
                "verses": "8:68-69, 2:86, 2:178, 4:25, 5:90, 9:60, 33:27, 47:5, 58:4, 76:9, 90:14"
            },
            {
                "id": 18339,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            },
            {
                "id": 18375,
                "topic": "War: <i>Qital</i>: prisoners of",
                "verses": "2:86, 4:4, 4:25, 8:68, 9:6, 60:12, 76:9"
            }
        ],
        "ar": "یٰۤاَیُّہَا النَّبِیُّ  قُلۡ  لِّمَنۡ فِیۡۤ  اَیۡدِیۡکُمۡ  مِّنَ الۡاَسۡرٰۤی ۙ اِنۡ یَّعۡلَمِ اللّٰہُ فِیۡ  قُلُوۡبِکُمۡ خَیۡرًا یُّؤۡتِکُمۡ  خَیۡرًا  مِّمَّاۤ  اُخِذَ مِنۡکُمۡ وَ  یَغۡفِرۡ لَکُمۡ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۷۱﴾",
        "ur": "اے نبی! تمہارے ہاتھوں میں جو قیدی ہیں ان سے کہہ دے کہ اگر اللہ نے تمہارے دلوں میں کوئی بھلائی دیکھی تو تمہیں اس سے بہت بہتر دے گا جو تم سے لے لیا گیا ہے اور تمہیں بخش دے گا اور اللہ بہت بخشنے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "O Prophet, say to the captives who are in your hands, ‘If Allah knows any good in your hearts, He will give you better than that which has been taken from you, and will forgive you. And Allah is Most Forgiving, Merciful.’[1158]",
            "notes": [
                {
                    "ref": "1158",
                    "note": "<p><strong>Commentary:</strong></p><p>The words of this verse, addressed to the Meccan prisoners in the hands of the Muslims, are meant by way of consolation. If they have been made to pay ransom for their release, they should not grieve, for if God sees some good in their hearts, He will not only forgive them their past errors but will also amply repay them for their financial loss. One of the prisoners taken at Badr was ‘Abbas, an uncle of the Holy Prophet. Some Muslims recommended him to the Holy Prophet for a free release in consideration of his near relationship to the Prophet and of his being a believer at heart, but the Holy Prophet refused to make any exception in his favour and declared that like other prisoners, he too should pay ransom for his release. When, however, he subsequently embraced Islam openly and came over to the Holy Prophet, he requested, on the basis of the verse under comment, that as God had promised to give the prisoners more than was taken from them as ransom, the promise may be fulfilled in his case, and the Holy Prophet granted his request (Jarir, x. 31).</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 72,
        "v_": 71,
        "topics": [
            {
                "id": 4387,
                "topic": "Betray",
                "verses": "8:28, 2:188, 4:108, 5:14, 8:59, 12:53, 22:39, 40:20"
            },
            {
                "id": 18339,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36, 59:6"
            },
            {
                "id": 18375,
                "topic": "War: <i>Qital</i>: prisoners of",
                "verses": "2:86, 4:4, 4:25, 8:68, 9:6, 60:12, 76:9"
            }
        ],
        "ar": "وَ اِنۡ یُّرِیۡدُوۡا خِیَانَتَکَ فَقَدۡ خَانُوا اللّٰہَ مِنۡ قَبۡلُ فَاَمۡکَنَ مِنۡہُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ  حَکِیۡمٌ ﴿۷۲﴾ ",
        "ur": "اور اگر وہ تجھ سے خیانت کا ارادہ کریں تو وہ پہلے اللہ سے بھی خیانت کرچکے ہیں پس اس نے ان کو بے بس کر دیا اور اللہ دائمی علم رکھنے والا (اور) بہت حکمت والا ہے۔",
        "v5": {
            "text": "And if they intend to deal treacherously with thee, they have already dealt treacherously with Allah before, but He gave <i>thee</i> power over them. And Allah is All-Knowing, Wise.[1159]",
            "notes": [
                {
                    "ref": "1159",
                    "note": "<p><strong>Commentary:</strong></p><p>The treacherous dealing mentioned here is that disbelievers should do evil in return for the kindness shown to them. As was the custom in Arabia, pre-Islamic Arabs used to slay their powerful enemies, whenever they fell into their hands. The verse, therefore, signifies that if the enemies of Islam proved treacherous, God would give Muslims power over them again; so it is not necessary for Muslims to put their prisoners to death as pre-Islamic Arabs used to do.</p><p>God knew that the time was soon coming when the disbelievers would embrace Islam, hence the injunction to spare their lives and to treat them with kindness, for was not God \"All-Knowing, Wise\"?</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 73,
        "v_": 72,
        "topics": [
            {
                "id": 5359,
                "topic": "Covenant: <i>Mithaq, ‘Ahd</i>: with believers",
                "verses": "3:188, 48:11, 2:177, 2:238, 2:257, 5:2, 5:8, 4:22, 8:57-59, 9:8, 9:12-13, 9:75, 9:111, 17:35, 23:9, 70:33"
            },
            {
                "id": 6842,
                "topic": "Duty: of believers",
                "verses": "31:15-16, 6:70"
            },
            {
                "id": 7015,
                "topic": "Earth: <i>Al-Ard</i>: create not mischief on",
                "verses": "2:252, 2:12, 2:28, 2:61, 2:206, 5:65, 7:57, 16:46, 17:5, 18:95, 29:37, 38:29"
            },
            {
                "id": 7115,
                "topic": "Emigration: <i>Hijrah</i>: of believers",
                "verses": "4:98-101, 2:219, 3:196, 4:90, 9:20, 16:111, 22:59"
            },
            {
                "id": 7839,
                "topic": "Friends: <i>Auliya’</i>",
                "verses": "43:68, 4:77, 5:82, 7:4, 7:28, 9:71, 14:32, 18:103, 46:33, 62:7"
            },
            {
                "id": 9265,
                "topic": "Immigrants",
                "verses": "2:219, 8:75, 9:20"
            },
            {
                "id": 9929,
                "topic": "Jihad: is for Allah",
                "verses": "29:70, 2:219, 2:252, 3:143, 4:96, 5:36, 5:55, 8:75, 9:16, 9:19-20, 9:24, 9:41, 9:44, 9:73, 9:81, 9:86, 9:88, 16:111, 22:79, 29:7, 49:16, 60:2, 61:12"
            },
            {
                "id": 11419,
                "topic": "Migration: <i>Hijrah</i>: for Allah",
                "verses": "2:219, 3:196, 4:90, 4:101"
            },
            {
                "id": 12787,
                "topic": "Muslims: qualities of",
                "verses": "3:111, 4:60, 5:3, 5:101, 8:75, 9:124"
            },
            {
                "id": 17215,
                "topic": "State: state relations",
                "verses": "2:248, 16:93, 3:29, 5:3, 16:95, 60:9-10"
            },
            {
                "id": 17851,
                "topic": "Treaties",
                "verses": "9:4, 2:74, 3:29, 4:92, 9:2, 9:7, 9:12-13, 16:92-93, 16:95, 33:16, 33:27, 48:2"
            }
        ],
        "ar": "اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ ہَاجَرُوۡا وَ جٰہَدُوۡا بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ فِیۡ سَبِیۡلِ اللّٰہِ وَ الَّذِیۡنَ اٰوَوۡا وَّ نَصَرُوۡۤا اُولٰٓئِکَ بَعۡضُہُمۡ اَوۡلِیَآءُ بَعۡضٍ ؕ وَ الَّذِیۡنَ اٰمَنُوۡا وَ لَمۡ یُہَاجِرُوۡا مَا لَکُمۡ مِّنۡ وَّلَایَتِہِمۡ مِّنۡ شَیۡءٍ حَتّٰی یُہَاجِرُوۡا ۚ وَ اِنِ اسۡتَنۡصَرُوۡکُمۡ فِی الدِّیۡنِ فَعَلَیۡکُمُ النَّصۡرُ  اِلَّا عَلٰی قَوۡمٍۭ بَیۡنَکُمۡ وَ بَیۡنَہُمۡ مِّیۡثَاقٌ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ  بَصِیۡرٌ ﴿۷۳﴾",
        "ur": "یقیناً وہ لوگ جو ایمان لائے اور انہوں نے ہجرت کی اور اپنے اموال اور جانوں کے ساتھ اللہ کی راہ میں جہاد کیا اور وہ لوگ جنہوں نے (مہاجرین کو) پناہ دی اور (ان کی) مدد کی، یہی لوگ ہیں جن میں سے بعض بعض کے دوست ہیں۔ اور وہ لوگ جو ایمان لائے مگر انہوں نے ہجرت نہ کی تمہارے لئے اُن سے دوستی کا کچھ جواز نہیں یہاں تک کہ وہ ہجرت کر جائیں۔ ہاں اگر وہ دین کے معاملہ میں تم سے مدد چاہیں تو مدد کرنا تم پر فرض ہے سوائے اس کے کہ کسی ایسی قوم کے خلاف (مدد کاسوال) ہو جس کے اور تمہارے درمیان معاہدہ ہو چکا ہو۔ اور اللہ جو کچھ تم کرتے ہو اس پر گہری نظر رکھنے والا ہے۔",
        "v5": {
            "text": "Surely, [a]those who have believed and fled from their homes and striven with their property and their persons for the cause of Allah, and those who have given <i>them</i> shelter and help—these are friends one of another. But as for those who have believed but have not left their homes, you are not at all responsible for their protection until they leave their homes. But if they seek your help in <i>the</i> <i>matter of</i> religion, then it is your duty to help them, except against a people between whom and yourselves there is a treaty. And Allah sees what you do.[1160]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:219; 9:20; 61:12."
                },
                {
                    "ref": "1160",
                    "note": "<p><strong>Important Words:</strong></p><p>آووا (gave shelter) is derived from اوی. They say اوی الیه i.e. he betook himself to it; or he repaired to it for lodging, covert or refuge; or simply he betook himself to it or repaired to it; or he returned to it. اواه means, he gave or afforded him lodging, covert, refuge or asylum; or he sheltered, protected or harboured him. اوی له means, he felt compassion or pity for him. آواه means, he gave or afforded him lodging, covert, refuge or asylum; or he sheltered or harboured him (Lane).</p><p><strong>Commentary:</strong></p><p>The verse enunciates a great principle which should govern the social relations of Muslims. It lays down that those Muslims who live in the same country and under the same administrations, whether as immigrants or as original citizens, are bound to help one another in the hour of need. If one of them is wronged, the others must come to his help. But as regards those Muslims who have not migrated to a Muslim country and prefer to live apart, they have no claim on the assistance of these Muslims in worldly matters. But if they seek their help in the matter of religion, e.g. when they are persecuted for the sake of their religion, then they must be helped. If, however, they are living under a non-Muslim government, with whom Muslims have entered into a treaty of peace, then no help should be rendered them even in matters of religion; and in this case, the only way open to them is to migrate from the non-Muslim country. The reader should note what high regard for compacts and treaties the Quran inculcates in its followers. It is to warn Muslims against a violation of compacts that the verse fittingly ends with the words, <i>And Allah sees what you do</i>.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 74,
        "v_": 73,
        "topics": [
            {
                "id": 1424,
                "topic": "Allah: does not love mischief-mongers",
                "verses": "28:78, 2:12-13, 2:28, 2:61, 2:252, 5:33-34, 5:65, 7:57, 7:75, 7:87, 7:104, 7:143, 10:82, 11:86, 13:26, 17:5, 18:95, 26:153, 26:184, 28:5, 28:84, 38:29, 89:13"
            },
            {
                "id": 6549,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:20, 8:26, 8:40, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 13:26, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:5, 28:78, 28:84, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 7839,
                "topic": "Friends: <i>Auliya’</i>",
                "verses": "43:68, 4:77, 5:82, 7:4, 7:28, 9:71, 14:32, 18:103, 46:33, 62:7"
            },
            {
                "id": 11478,
                "topic": "Mischief: of disbelievers",
                "verses": "2:74, 3:64, 8:20, 10:41, 27:49, 33:61, 44:16, 59:16"
            },
            {
                "id": 17893,
                "topic": "Trial: Fitnah",
                "verses": "7:156, 2:103, 5:72, 8:29, 9:49, 10:86, 17:61, 21:36, 21:112, 22:12, 22:54, 24:64, 25:21, 29:11, 37:64, 39:50, 54:28, 60:6, 64:16, 74:32"
            }
        ],
        "ar": "وَ الَّذِیۡنَ  کَفَرُوۡا  بَعۡضُہُمۡ  اَوۡلِیَآءُ  بَعۡضٍ ؕ اِلَّا تَفۡعَلُوۡہُ  تَکُنۡ فِتۡنَۃٌ  فِی الۡاَرۡضِ وَ فَسَادٌ    کَبِیۡرٌ ﴿ؕ۷۴﴾",
        "ur": "اور وہ لوگ جو کافر ہوئے ان میں سے  بعض بعض کے دوست ہیں۔ اگر تم اس پر عمل نہ کرو (جس کی تمہیں تعلیم دی گئی) تو زمین میں فتنہ اور بڑا فساد برپا ہوگا۔",
        "v5": {
            "text": "And those who disbelieve—they are friends one of another. If you do it not, there will be mischief in the land and great disorder.[1161]",
            "notes": [
                {
                    "ref": "1161",
                    "note": "<p><strong>Commentary:</strong></p><p>The pronoun \"it\" in تفعلوه (if you do it not) refers to what has been said in the previous verse, i.e. helping oppressed Muslims as well as fulfilling compacts with non-Muslims. The verse purports to say that if this teaching is not observed by Muslims, the result will be oppression and disturbance in the earth.</p>"
                }
            ]
        }
    },
    {
        "ch": 8,
        "v": 75,
        "v_": 74,
        "topics": [
            {
                "id": 2729,
                "topic": "Ansar: helpers",
                "verses": "59:10, 2:271, 3:53, 3:193, 9:100, 9:117, 61:15, 71:26"
            },
            {
                "id": 8952,
                "topic": "Honour: of believers",
                "verses": "49:14, 4:32, 4:140, 4:176, 8:5, 10:3, 19:86, 22:51, 30:16, 57:19, 70:35-36, 89:16, 89:18"
            },
            {
                "id": 9267,
                "topic": "Immigrants",
                "verses": "8:73, 2:219, 9:20"
            },
            {
                "id": 9930,
                "topic": "Jihad: is for Allah",
                "verses": "29:70, 2:219, 2:252, 3:143, 4:96, 5:36, 5:55, 8:73, 9:16, 9:19-20, 9:24, 9:41, 9:44, 9:73, 9:81, 9:86, 9:88, 16:111, 22:79, 29:7, 49:16, 60:2, 61:12"
            },
            {
                "id": 12788,
                "topic": "Muslims: qualities of",
                "verses": "3:111, 4:60, 5:3, 5:101, 8:73, 9:124"
            },
            {
                "id": 12795,
                "topic": "Muslims: strive in Allah’s cause",
                "verses": "3:111, 2:245-246, 9:88"
            },
            {
                "id": 14659,
                "topic": "Provisions: Allah provides",
                "verses": "20:132, 5:115, 2:58, 2:173, 2:213, 3:38, 5:89, 7:161, 11:7, 16:72, 16:115, 20:82, 20:132, 22:51, 22:59, 23:73, 24:39, 29:61, 34:5, 51:23, 51:59, 62:12"
            },
            {
                "id": 14684,
                "topic": "Provisions: worldly",
                "verses": "20:132, 2:241, 2:237, 3:15, 5:97, 8:5, 10:60, 10:99, 11:4, 11:7, 11:89, 12:60, 12:66, 14:31, 16:72, 16:76, 17:19, 20:132-133, 22:51, 22:59, 24:27, 28:58, 33:32, 33:50, 34:5, 34:16, 40:40, 42:37, 43:30, 43:36, 45:6, 50:12, 67:16, 67:22, 79:34"
            }
        ],
        "ar": "وَ الَّذِیۡنَ اٰمَنُوۡا وَ ہَاجَرُوۡا وَ جٰہَدُوۡا فِیۡ سَبِیۡلِ اللّٰہِ وَ الَّذِیۡنَ اٰوَوۡا وَّ نَصَرُوۡۤا اُولٰٓئِکَ ہُمُ الۡمُؤۡمِنُوۡنَ حَقًّا ؕ لَہُمۡ مَّغۡفِرَۃٌ   وَّ رِزۡقٌ  کَرِیۡمٌ ﴿۷۵﴾ ",
        "ur": "اور وہ لوگ جو ایمان لائے اور انہوں نے ہجرت کی اور اللہ کی راہ میں جہاد کیا اور وہ لوگ جنہوں نے پناہ دی اور مدد کی یہی لوگ سچے مومن ہیں۔ ان کے لئے مغفرت ہے اور عزت والا رزق۔",
        "v5": {
            "text": "And [a]those who have believed and left their homes and striven for the cause of Allah, and those who have given <i>them</i> shelter and help— these indeed are true believers. For them is forgiveness and an honourable provision.[1162]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:219; 9:20; 61:12."
                },
                {
                    "ref": "1162",
                    "note": "<p><strong>Commentary:</strong></p><p>Two classes of believers have been commended here: firstly, those who, being persecuted, flee from a country where they are not free to follow their faith; secondly, those who give shelter to and help the immigrants. The Muslims of the former class are called <i>Muhajirin </i>(Refugees), while those of the second class are known as <i>Ansar</i> (Helpers). Both these classes have been called true believers, for both are active believers and make sacrifices for the cause of religion; and the verse promises them forgiveness and honourable provision. This also shows that those, who do not migrate from their homes where they do not enjoy religious freedom, and set worldly good above religion, do not have an \"honourable provision,\" i.e. their worldly gains are not honourable in the sight of God. Similarly, the verse hints that those who help and give shelter to the immigrants will, in spite of freely spending on their needy brethren, find their possessions ever increasing, and God will continue to grant them honourable provision.</p>"
                }
            ]
        }
    }
]
