[
    {
        "ch": 38,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[3372]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See1:1."
                },
                {
                    "ref": "3372",
                    "note": "<p><strong>Commentary:</strong></p><p>See. 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 69,
                "topic": "Abbreviations: <i>Sad</i>",
                "verses": null
            },
            {
                "id": 6358,
                "topic": "Dhikr: Qur’an as, reminder",
                "verses": "3:59, 6:91, 11:121, 15:7, 15:10, 16:45, 20:100, 21:25, 21:51, 29:52, 36:70, 37:4, 38:9, 38:50, 38:88, 41:42, 43:45, 54:26, 65:11, 68:52-53, 74:32, 77:6, 81:28"
            },
            {
                "id": 13133,
                "topic": "Oaths: <i>yamin</i>: of Allah",
                "verses": "4:66, 15:73, 15:93, 16:57, 16:64, 36:3, 37:2-4, 43:2-3, 44:2-3, 50:2, 51:2-8, 51:24, 52:2-7, 53:2, 56:76, 68:2, 69:39, 69:40, 70:41, 74:33, 74:35, 75:2-3, 77:2-6, 79:2-6, 81:16-19, 84:17-19, 85:2-4, 86:2, 86:12-13, 89:2-5, 90:2, 90:4, 91:2-8, 92:2-4, 93:2-3, 95:2-4, 100:2, 103:2-3"
            },
            {
                "id": 14439,
                "topic": "Prophecies in the Holy Qur’an: about: Islam",
                "verses": "30:3-5, 2:116, 8:61, 9:33, 12:103, 16:78, 17:2, 19:41, 22:24, 22:27, 32:6, 33:23, 35:12, 41:54, 43:90, 48:29-30, 53:2, 56:4, 58:22, 60:8, 61:10, 70:37-38, 79:2-6, 81:19, 81:24-25, 82:2, 83:30-35, 89:23, 90:2-3, 91:2-5, 93:2-3, 94:6-7, 99:2-7, 100:10-12"
            },
            {
                "id": 15034,
                "topic": "Qur’an: eminence of",
                "verses": null
            },
            {
                "id": 15054,
                "topic": "Qur’an: excellence, perfection of, <i>Ummul-Kitab</i>",
                "verses": "2:24, 2:3, 5:4, 6:156, 8:32, 10:38-40, 11:2, 11:14-15, 13:32, 14:25-26, 15:2, 17:89, 18:110, 21:11, 21:25, 25:2, 27:2, 29:52, 38:30, 39:24, 43:5, 52:34-35, 59:22, 73:6"
            },
            {
                "id": 15211,
                "topic": "Qur’an: truth, wisdom &amp; balance in",
                "verses": "10:2, 3:4, 3:61, 3:109, 4:106, 4:167, 4:171, 5:49, 6:92-93, 6:115, 13:2, 17:82, 17:106, 18:110, 21:11, 23:63, 25:2, 25:34, 31:3-4, 36:3, 42:18"
            }
        ],
        "ar": "صٓ  وَ  الۡقُرۡاٰنِ  ذِی  الذِّکۡرِ ؕ﴿۲﴾ ",
        "ur": "صَادِقُ القَولِ: قول کا سچا۔ قَسم ہے ذکر والے قرآن کی!",
        "v5": {
            "text": "Sad. [b]By the Quran, full of exhortation, <i>it is Our revealed word.</i>[3373]",
            "notes": [
                {
                    "ref": "b",
                    "note": "43:45."
                },
                {
                    "ref": "3373",
                    "note": "<p><strong>Commentary:</strong></p><p>The letter ص may signify \"the Truthful God\" or \"I am Allah, the Truthful\" or \"God has spoken the truth\" (صدق الله). For an explanation of abbreviated letters see 2:2 &amp; 19:2.</p><p>ذی الذکر means full of admonition and exhortation or possessing eminence and honour; or acting upon its teaching the believers will achieve honour, good name and eminence.</p><p>The whole verse may mean that the Truthful God swears by the Quran that the followers of the Holy Prophet, by acting upon the teaching of the Quran and making it a rule of their lives, will achieve eminence and will come to occupy a most honoured place in the comity of nations. The verse thus constitutes a great prophecy about the glorious future of Islam.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 11583,
                "topic": "Moral Traits: arrogance, conceit",
                "verses": "41:51, 2:35, 2:88, 4:174, 7:14, 7:37, 7:41, 7:49, 7:56, 7:76-77, 7:89, 7:134, 7:147, 10:76, 14:22, 16:24, 16:30, 17:38, 23:47, 25:22, 28:40, 28:84, 29:40, 31:19-20, 34:32-34, 38:75-76, 39:60, 40:36, 40:48-49, 40:57, 41:16, 41:39, 44:50, 45:32, 46:11, 46:21, 57:24, 71:8, 74:24"
            },
            {
                "id": 16180,
                "topic": "Satan: arrogance of",
                "verses": "17:62-66, 7:13"
            }
        ],
        "ar": "بَلِ  الَّذِیۡنَ   کَفَرُوۡا فِیۡ عِزَّۃٍ   وَّ  شِقَاقٍ ﴿۳﴾  ",
        "ur": "حقیقت یہ ہے کہ وہ لوگ جنہوں نے کفر کیا (جھوٹی) عزت اور مخالفت میں (مبتلا) ہیں۔",
        "v5": {
            "text": "But those who disbelieve are <i>steeped</i> in <i>false</i> pride and enmity.[3374]",
            "notes": [
                {
                    "ref": "3374",
                    "note": "<p><strong>Commentary:</strong></p><p>The root-cause of all sin and disbelief is false pride, conceit and arrogance. The first recorded sin was committed by Satan who refused to submit to Adam on the basis of his farcical superiority to him (Adam). </p><p>انا خیر منه i.e. \"I am better than he\" (17:13) has always been the boast of disbelievers which has prevented them from accepting the truth in the time of every Prophet. They cannot persuade themselves to give their allegiance to one who, they say, is quite like themselves; even inferior to them in some respects.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 4817,
                "topic": "Calamities: <i>‘Adhab</i>: law of God about",
                "verses": "23:77-78, 6:132, 7:95, 11:118, 16:46-47, 17:16, 20:135, 26:209, 28:60, 67:17-20"
            },
            {
                "id": 7214,
                "topic": "Escape: from Allah’s punishment",
                "verses": "10:51, 10:18, 10:54, 14:22, 15:6, 17:52, 18:54, 29:5, 34:52, 39:52, 41:49, 50:37, 72:13"
            }
        ],
        "ar": "کَمۡ  اَہۡلَکۡنَا مِنۡ قَبۡلِہِمۡ مِّنۡ قَرۡنٍ فَنَادَوۡا  وَّ  لَاتَ حِیۡنَ مَنَاصٍ ﴿۴﴾ ",
        "ur": "ان سے پہلے کتنی ہی قومیں ہم نے ہلاک کردیں۔ پس انہوں نے (مدد کے لئے) پکارا جب کہ نجات کی کوئی راہ باقی نہ تھی۔",
        "v5": {
            "text": "[c]How many a generation have We destroyed before them! They cried out <i>for help</i>, but it was no longer the time for escape.[3375]",
            "notes": [
                {
                    "ref": "c",
                    "note": "6:7; 19:75; 36:32; 50:37."
                },
                {
                    "ref": "3375",
                    "note": "<p><strong>Important Words:</strong></p><p>لات (it was no longer). لاته عن کذا means, he withheld him or restrained him and turned him from such a course. لات شیئا means, he concealed a thing that he knew, and told or narrated something different from it. لاته حقه means, he diminished unto him his due or right. According to some scholars لات is originally لیس, its س being changed into ت and ی into الف; others are of the opinion that it is made up of two words, the fem. ت is added to the negative لا to make the word feminine or to render the negation more intensive. According to a third school, it is an independent word, neither originally لیس nor لا. The fourth school, however, thinks that it is a word and also a part of a word, namely the negative لا, and ت prefixed to حین.It is generally accompanied with حین or some word synonymous with it and is used as لات الحین حین مناص i.e. the time was not the time of refuge. The expression لات حین مناص may have the following different meanings:</p><p>1. There was no place of flight existing for them.</p><p>2. The time is, and was, not a time of flight.</p><p>3. The time of fleeing or petitioning or being aided will not be available to them.</p><p>لات was also one of three great idols of the Meccans, the other two being عزی and مناة (Lane, Aqrab &amp; Zamakhshari).</p><p>مناص (time for escape) is derived from ناص. They say ناص عن قرینه i.e. he fled from, kept away from or left, his associate. ناص فلانا means, he missed such a one and went ahead of him. They say مالک من مناص i.e. there is no time or place of refuge for thee (Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse means to say that disbelievers have rejected the message of truth with contempt and disdain, and consider it below their dignity to listen to the Holy Prophet, but when Divine punishment overtook them, they will cry for help but will find no refuge or asylum.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 10444,
                "topic": "Liar",
                "verses": "3:62, 6:29, 9:43, 9:107, 11:28, 11:94, 12:27, 12:75, 16:87, 16:106, 23:91, 24:8-9, 24:14, 26:224, 27:28, 28:39, 29:4, 29:13, 37:153, 39:4, 40:25, 40:29, 40:38, 54:26-27"
            },
            {
                "id": 10712,
                "topic": "Magicians",
                "verses": "7:110, 2:103, 5:111, 6:8, 7:108, 7:113-123, 10:3, 10:77-78, 10:82, 20:64, 20:67-71, 27:14, 28:37, 34:44, 37:16, 40:25, 43:31, 43:50, 46:8, 51:40, 51:53, 61:7, 74:25"
            },
            {
                "id": 11318,
                "topic": "Messengers: <i>Rusul</i>: are mocked, opposed, called liars, madmen, sorcerers",
                "verses": "51:53-54, 2:88, 3:185, 6:11, 7:93, 7:110, 14:14, 15:7, 15:12, 15:81, 18:107, 20:64, 25:38, 26:28, 26:35, 26:124, 26:142, 26:154, 26:161, 26:177, 26:186, 34:9, 37:37, 40:25, 41:15, 43:48, 43:50, 44:15, 51:40, 54:10, 68:52"
            },
            {
                "id": 12376,
                "topic": "Muhammad<sup>(sa)</sup>: a warner",
                "verses": "35:24-25, 7:189, 10:3, 11:13, 18:5, 25:2, 32:4, 33:46, 34:29, 34:47, 36:7, 38:71, 46:10, 48:9"
            }
        ],
        "ar": "وَ عَجِبُوۡۤا اَنۡ جَآءَہُمۡ مُّنۡذِرٌ مِّنۡہُمۡ ۫ وَ قَالَ  الۡکٰفِرُوۡنَ ہٰذَا سٰحِرٌ کَذَّابٌ ۖ﴿ۚ۵﴾ ",
        "ur": "اور انہوں نے تعجب کیا کہ ان کے پاس انہی میں سے کوئی ڈرانے والا آیا۔ اور کافروں نے کہا یہ سخت جھوٹا جادوگر ہے۔ ",
        "v5": {
            "text": "[a]And they wonder that a Warner has come to them from among themselves; and the disbelievers say, ‘This is a magician, a great liar.[3376]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:64."
                },
                {
                    "ref": "3376",
                    "note": "<p><strong>Commentary:</strong></p><p>The greatest obstacle in the way of disbelievers to accept the truth has always been that they would not pledge their allegiance to a man who is just one of them.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 6,
        "v_": 5,
        "topics": [],
        "ar": "اَجَعَلَ  الۡاٰلِہَۃَ  اِلٰـہًا وَّاحِدًا ۚۖ اِنَّ ہٰذَا  لَشَیۡءٌ  عُجَابٌ ﴿۶﴾ ",
        "ur": "کیا اس نے بہت سے معبودوں کو ایک ہی معبود بنا لیا ہے۔ یقیناً یہ (بات) تو سخت عجیب و غریب ہے۔ ",
        "v5": {
            "text": "Has he made <i>all</i> the gods into one God? This is indeed a strange thing.’",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 7,
        "v_": 6,
        "topics": [],
        "ar": "وَ انۡطَلَقَ الۡمَلَاُ مِنۡہُمۡ  اَنِ امۡشُوۡا وَ اصۡبِرُوۡا عَلٰۤی  اٰلِہَتِکُمۡ ۚۖ اِنَّ ہٰذَا لَشَیۡءٌ  یُّرَادُ ۖ﴿ۚ۷﴾ ",
        "ur": "اور ان میں سے بڑے لوگ (یہ کہتے ہوئے) چلے گئے کہ جاؤ اور اپنے ہی معبودوں پر صبر کرو۔ یقیناً یہ ایک ایسی بات ہے جس کا (کسی خاص مقصد سے) ارادہ کیا گیا ہے۔ ",
        "v5": {
            "text": "And the leaders among them went about <i>saying</i>, ‘Go and [a]stick to your gods. This is a thing designed.[3377]",
            "notes": [
                {
                    "ref": "a",
                    "note": "71:24."
                },
                {
                    "ref": "3377",
                    "note": "<p><strong>Commentary:</strong></p><p>As disbelievers believed that there were many gods, and the Holy Prophet proclaimed the Unity of God, they would say that somehow he had rolled all the gods into one.</p><p>The words \"This is a thing designed\" put in the mouths of the leaders of disbelief signify that according to them the Holy Prophet had his own ulterior motives to serve in preaching the message of the Unity of God. Or the words may mean that when invited by the Holy Prophet to give up idolatry, the leaders of the Quraish said to one another that they should stick to their own gods and that was a most desirable thing for them to do.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 8,
        "v_": 7,
        "topics": [],
        "ar": "مَا سَمِعۡنَا بِہٰذَا فِی الۡمِلَّۃِ  الۡاٰخِرَۃِ ۚۖ اِنۡ ہٰذَاۤ   اِلَّا  اخۡتِلَاقٌ ۖ﴿ۚ۸﴾ ",
        "ur": "ہم نے تو ایسی بات کسی آنے والی ملّت (کے بارہ) میں بھی نہیں سنی۔ یہ من گھڑت بات کے سوا کچھ نہیں۔",
        "v5": {
            "text": "[b]‘We have not heard of <i>anything like</i> this in the latest religion. This is nothing but a fabrication.[3378]",
            "notes": [
                {
                    "ref": "b",
                    "note": "23:25."
                },
                {
                    "ref": "3378",
                    "note": "<p><strong>Important Words:</strong></p><p>اختلاق (fabrication) is derived from خلق which among other things means, he forged or fabricated a story or a lie, etc. (Lane). See also 3:50 &amp; 26:138.</p><p><strong>Commentary:</strong></p><p>The words \"the latest religion\" may refer to Christianity or the idolatrous Faith of the pagans of Mecca, or they may refer to all religions preceding Islam, because in no religion before Islam had belief in the Unity of God remained pure and unadulterated.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 6371,
                "topic": "Dhikr: Qur’an as, reminder",
                "verses": "38:2, 3:59, 6:91, 11:121, 15:7, 15:10, 16:45, 20:100, 21:25, 21:51, 29:52, 36:70, 37:4, 38:50, 38:88, 41:42, 43:45, 54:26, 65:11, 68:52-53, 74:32, 77:6, 81:28"
            },
            {
                "id": 6730,
                "topic": "Doubt: <i>Raib</i>: about Allah, Qur’an",
                "verses": "2:3, 2:24, 2:148, 3:8, 3:61, 6:115, 10:38, 10:95, 10:115, 14:11, 24:51, 32:3, 49:16"
            },
            {
                "id": 12584,
                "topic": "Muhammad<sup>(sa)</sup>: objections against",
                "verses": "21:4, 6:9, 6:38, 7:185, 7:204-205, 10:50, 11:13, 16:104, 16:114, 17:91-94, 21:6, 25:5-10, 25:33, 26:225-228, 34:47, 35:26, 36:70, 42:25, 48:3, 52:30, 52:34-35, 53:3, 53:20-24, 53:63, 68:3-7, 69:42-48, 81:23"
            }
        ],
        "ar": "ءَ اُنۡزِلَ عَلَیۡہِ الذِّکۡرُ مِنۡۢ بَیۡنِنَا ؕ بَلۡ ہُمۡ فِیۡ شَکٍّ مِّنۡ ذِکۡرِیۡ ۚ بَلۡ  لَّمَّا یَذُوۡقُوۡا عَذَابِ ؕ﴿۹﴾ ",
        "ur": "کیا ہم میں سے اِسی پر ذکر اُتارا گیا ہے؟ حقیقت یہ ہے کہ وہ میرے ذکر کے بارہ میں ہی شک میں مبتلا ہیں (اور) حقیقت یہ ہے کہ ابھی انہوں نے میرا عذاب نہیں چکھا۔ ",
        "v5": {
            "text": "[c]‘Has the exhortation been sent down to him <i>in preference to all</i> of us?’ Nay, they are in doubt concerning My exhortation. Nay, but they have not yet tasted My punishment.[3379]",
            "notes": [
                {
                    "ref": "c",
                    "note": "54:26."
                },
                {
                    "ref": "3379",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse refers to a great obstacle which stands in the way of disbelievers to accept the truth. They simply cannot, they say, persuade themselves to follow the lead of a man just like themselves—rather inferior to them in certain respects. The same subject has been referred to in 43:32 where the Meccan infidels are described as refusing to accept the Message of the Quran on the pretext, \"why has not this Quran been sent to some great man of the two towns.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 3077,
                "topic": "Attributes of Allah: Al-‘Aziz (The Mighty)",
                "verses": "4:57, 2:130, 2:210, 2:221, 2:229, 3:7, 3:19, 4:159, 4:166, 9:40, 9:71, 14:2, 16:61, 22:41, 22:75, 26:192, 27:10, 27:79, 33:26, 34:7, 35:29, 38:67, 40:3, 45:3, 46:3, 48:8, 48:20, 59:2, 59:24, 61:2, 62:2, 64:19"
            },
            {
                "id": 3631,
                "topic": "Attributes of Allah: Al-Wahhab (The Bestower)",
                "verses": "3:9, 38:36"
            },
            {
                "id": 12584,
                "topic": "Muhammad<sup>(sa)</sup>: objections against",
                "verses": "21:4, 6:9, 6:38, 7:185, 7:204-205, 10:50, 11:13, 16:104, 16:114, 17:91-94, 21:6, 25:5-10, 25:33, 26:225-228, 34:47, 35:26, 36:70, 42:25, 48:3, 52:30, 52:34-35, 53:3, 53:20-24, 53:63, 68:3-7, 69:42-48, 81:23"
            },
            {
                "id": 17844,
                "topic": "Treasure",
                "verses": "3:50, 1:1, 2:24, 3:76, 4:21, 6:51, 11:13, 11:32, 12:56, 15:22, 17:101, 18:83, 25:9, 26:59, 28:77, 52:38, 63:8"
            }
        ],
        "ar": "اَمۡ عِنۡدَہُمۡ  خَزَآئِنُ رَحۡمَۃِ  رَبِّکَ الۡعَزِیۡزِ  الۡوَہَّابِ  ۚ﴿۱۰﴾",
        "ur": "کیا ان کے پاس تیرے کامل غلبہ والے (اور) بہت عطا کرنے والے ربّ کی رحمت کے خزانے ہیں؟",
        "v5": {
            "text": "[a]Do they possess the treasures of the mercy of thy Lord, the Mighty, the Great Bestower?[3380]",
            "notes": [
                {
                    "ref": "a",
                    "note": "17:101; 52:38."
                },
                {
                    "ref": "3380",
                    "note": "<p><strong>Commentary:</strong></p><p>In reply to the refusal of disbelievers to accept the Holy Prophet on the plea that he was a mere mortal like them and nothing more, the verse reproachfully asks them: Since when have they arrogated to themselves the possession of the treasures of Divine mercy? It is God’s own special prerogative to select, in His infallible wisdom, whom He deems fit to be the bearer of His Message and the conveyer of His will to His creatures.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 11,
        "v_": 10,
        "topics": [],
        "ar": "اَمۡ  لَہُمۡ  مُّلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ مَا بَیۡنَہُمَا ۟ فَلۡیَرۡتَقُوۡا فِی الۡاَسۡبَابِ ﴿۱۱﴾ ",
        "ur": "یا کیا انہیں آسمانوں اور زمین کی اور جو اُن دونوں کے درمیان ہے بادشاہی نصیب ہے؟ پس وہ سب تدبیریں کر گزریں۔ ",
        "v5": {
            "text": "Or is the kingdom of the heavens and the earth and all that is between them theirs? So let them ascend with the means <i>at their disposal</i>.[3381]",
            "notes": [
                {
                    "ref": "3381",
                    "note": "<p><strong>Commentary:</strong></p><p>The present verse continues the argument embodied in the preceding verse and purports to say that disbelievers pose as if the kingdom of the heavens and the earth belongs to them. Then let them gather, it says, all their means and resources against the Holy Prophet and multiply them as much as they can and use them against him. They will find to their mortification that they cannot arrest or impede the progress of the new Message.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 14384,
                "topic": "Prophecies in the Holy Qur’an: about: battles",
                "verses": "30:5, 8:43, 48:22, 52:7, 54:46-49, 79:7-8"
            },
            {
                "id": 14406,
                "topic": "Prophecies in the Holy Qur’an: about: the Holy Prophet<sup>(sa)</sup>",
                "verses": "28:86, 2:41-42, 2:90, 5:48, 10:72, 17:2, 17:61, 17:81, 46:11-13, 47:14, 54:7-9, 81:24, 89:2-3, 90:5, 92:2-3, 94:5"
            },
            {
                "id": 17879,
                "topic": "Trench: battle of",
                "verses": "33:10-26"
            }
        ],
        "ar": "جُنۡدٌ مَّا ہُنَالِکَ مَہۡزُوۡمٌ مِّنَ الۡاَحۡزَابِ ﴿۱۲﴾",
        "ur": "(یہ بھی) اَحزاب میں سے ایک لشکر (ہے) جو وہاں شکست دیا جانے والا ہے۔ ",
        "v5": {
            "text": "[b]<i>They are</i> a host from among the confederates <i>which will be</i> routed here.[3382]",
            "notes": [
                {
                    "ref": "b",
                    "note": "54:46."
                },
                {
                    "ref": "3382",
                    "note": "<p><strong>Important Words:</strong></p><p>مھزوم (routed) is derived from ھزم. They say ھزم العدو i.e. he broke and defeated the enemy. ھزم البشر means, he dug the well. ھزم فلاناً means, he killed him. جند مھزوم means, a defeated and broken army (Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse at once contains a prophecy and a challenge. The challenge is to the forces of evil to muster all their resources and form themselves into a strong confederacy to stop the onward march of Islam. And the prophecy is to the effect that the combined forces of disbelief shall be put to an ignominious rout if they dared oppose Islam. This mighty prophecy was literally fulfilled in the Battle of the Ditch.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 556,
                "topic": "‘Ad: people of: accused Prophets of falsehood",
                "verses": "22:43"
            },
            {
                "id": 583,
                "topic": "‘Ad: people of: rejected Messengers",
                "verses": "7:71, 11:54, 11:60, 14:10, 26:124, 41:15, 46:22-23, 50:14-15"
            },
            {
                "id": 10649,
                "topic": "Lot: <i>Lut(as)</i>: evil people of",
                "verses": "27:55-56, 7:81-82, 26:161, 26:166-167, 27:57, 29:29-30, 54:34"
            },
            {
                "id": 13076,
                "topic": "Noah: <i>Nuh(as)</i>: mocked by people",
                "verses": "23:25-27, 7:65, 10:74, 22:43, 25:38, 26:106, 26:118, 40:6, 50:13, 54:10, 71:22"
            }
        ],
        "ar": "کَذَّبَتۡ قَبۡلَہُمۡ قَوۡمُ نُوۡحٍ وَّ عَادٌ وَّ فِرۡعَوۡنُ  ذُو الۡاَوۡتَادِ ﴿ۙ۱۳﴾ ",
        "ur": "اِن سے پہلے (بھی) نوح کی قوم نے اور عاد نے اور میخوں والے فرعون نے جھٹلا دیا تھا۔ ",
        "v5": {
            "text": "[a]Before them <i>too</i> the people of Noah, and <i>the tribe of</i> ‘Ad and Pharaoh, the lord of stakes, rejected <i>the Messengers</i> as liars;[3383]",
            "notes": [
                {
                    "ref": "a",
                    "note": "9:70; 40:32; 50:13."
                },
                {
                    "ref": "3383",
                    "note": "<p><strong>Important Words:</strong></p><p>اوتاد (stakes) is the plural of وتد. They say وتد الوتد i.e. he made the peg firm or he drove it into the hole. اوتاد means, tent-pegs, poles, wooden nails; stakes etc. اوتاد الارض signifies, the mountains; اوتاد البلاد means, the chief men of the towns and اوتاد الفم means, the teeth (Aqrab). ذو الاوتاد thus signifies, lord of large armies or stakes or of firmly established dominions.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 13798,
                "topic": "People of the Wood: <i>Ashabul-Aikah</i>",
                "verses": "15:79, 26:177, 50:15"
            }
        ],
        "ar": "وَ ثَمُوۡدُ وَ قَوۡمُ لُوۡطٍ وَّ اَصۡحٰبُ  لۡـَٔیۡکَۃِ ؕ اُولٰٓئِکَ  الۡاَحۡزَابُ ﴿۱۴﴾ ",
        "ur": "اور ثمود نے بھی اور لوط کی قوم نے بھی اور گھنے درختوں والوں نے بھی۔ یہی ہیں وہ اَحزاب (جن کا ذکر گزرا ہے)۔",
        "v5": {
            "text": "And <i>the tribe of</i> Thamud, and the people of Lot, and [b]the Dwellers of the Wood—these were the confederates <i>that rejected the Messengers</i>.[3384]",
            "notes": [
                {
                    "ref": "b",
                    "note": "15:79; 26:177; 50:15."
                },
                {
                    "ref": "3384",
                    "note": "<p><strong>Commentary:</strong></p><p>According to the Quran, اصحاب الایکة (Dwellers of the Wood) and اصحاب مدین (People of Median) are names of the same people, or rather, of two sections of the same people, who had adopted two different kinds of trade, one living on commerce and the other keeping herds of camels and sheep and selling milk, wood, etc. Thus, اصحاب الایکة is a section of the tribe of the Prophet Shu‘aib (26:177, 178), who has also been mentioned as having been sent to the People of Median (7:86, 11:85 &amp; 29:37).</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 4796,
                "topic": "Calamities: <i>‘Adhab</i>: due rejection of signs",
                "verses": "23:77-78, 3:113, 34:46"
            }
        ],
        "ar": "اِنۡ کُلٌّ   اِلَّا کَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ ﴿٪۱۵﴾ ",
        "ur": "(ان میں سے) ہر ایک نے رسولوں کو جھٹلایا پس (ان پر) میری سزا واجب ہوگئی۔ ",
        "v5": {
            "text": "Not one<i> of them</i> but treated <i>their</i> Messengers as liars, [c]so My punishment rightly overtook <i>them</i>.[3385]",
            "notes": [
                {
                    "ref": "c",
                    "note": "15:80; 26:190; 50:15."
                },
                {
                    "ref": "3385",
                    "note": "<p><strong>Commentary:</strong></p><p>The Meccan disbelievers are here warned that people wealthier and much stronger than they had lived before them. They rejected and opposed their Prophets with the result that they were destroyed. If they (the Meccans) opposed the Holy Prophet they also will meet a similar fate.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 4796,
                "topic": "Calamities: <i>‘Adhab</i>: due rejection of signs",
                "verses": "23:77-78, 3:113, 34:46"
            }
        ],
        "ar": "وَ مَا یَنۡظُرُ ہٰۤؤُلَآءِ  اِلَّا صَیۡحَۃً  وَّاحِدَۃً مَّا لَہَا مِنۡ  فَوَاقٍ ﴿۱۶﴾ ",
        "ur": "اور یہ لوگ کسی چیز کا انتظار نہیں کر رہے مگر ایک ہی ہولناک آواز کا جس میں کوئی تعطل نہیں ہوگا۔ ",
        "v5": {
            "text": "And these only wait for [d]a single blast, and there shall be no delaying it.[3386]",
            "notes": [
                {
                    "ref": "d",
                    "note": "36:50."
                },
                {
                    "ref": "3386",
                    "note": "<p><strong>Important Words:</strong></p><p>فواق (delaying) is derived from فاق. They say فاقت الناقة i.e. the she-camel had in her udder the milk that had collected between two milkings. فواق means, the time between two milkings; the time between two suckings; the returning of the milk into the udder of the she-camel after the milking; the time between the opening of one’s hand and the grasping with it the udder of the she-camel; or when the milker grasps the udder and then lets it go in milking. They say ما أقام عندہ الافواقاً i.e. he did not stay with him but as long as between two milkings of a she-camel i.e. for a very short time (Lane).</p><p><strong>Commentary:</strong></p><p>The verse means to say that the whole attitude of disbelievers shows that they will not accept the truth till Divine punishment overtakes them, but when it comes, it would be swift and sudden and they would be granted no respite or delay.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 5803,
                "topic": "Day of Reckoning: <i>Yaumul-Hisab</i>",
                "verses": "14:42, 38:27, 38:54, 39:25, 39:60, 40:28, 46:21, 58:19, 78:4, 80:37, 83:6, 111:4"
            }
        ],
        "ar": "وَ قَالُوۡا رَبَّنَا عَجِّلۡ  لَّنَا قِطَّنَا قَبۡلَ یَوۡمِ  الۡحِسَابِ ﴿۱۷﴾ ",
        "ur": "اور انہوں نے کہا اے ہمارے رب! ہمیں ہمارا حصہ جلدتَر یوم حساب سے پہلے ہی دے دے۔",
        "v5": {
            "text": "They say, ‘Our Lord, [a]hasten to us our portion <i>of the punishment</i> before the Day of Reckoning.’[3387]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:201; 17:19."
                },
                {
                    "ref": "3387",
                    "note": "<p><strong>Important Words:</strong></p><p>قطنا (our portion) is derived from قط (<i>qatta</i>). They say قطه i.e. he cut it. قط القلم means, he nibbed the reed for writing. قطmeans, a slice cut off, a portion, share or lot, an hour or a portion of the night. مضی قط من اللیل means, a portion of the night passed (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse means to say that when disbelievers are warned that if they do not accept the Holy Prophet they will be punished, they turn the warning into an occasion for mocking the Prophet, and jeeringly say, \"We demand to have the punishment here and now, and want no more respite.\" The use of the words \"Day of Reckoning\" implies that disbelievers will get the punishment when the reckoning of their evil deeds will have been made and they are shown to have fully deserved it.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 18,
        "v_": 17,
        "topics": [
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 13718,
                "topic": "Patience: <i>sabr</i>: Holy Prophet<sup>(sa)</sup> and",
                "verses": "16:127-128, 10:110, 11:50, 11:116, 18:68-69, 18:73, 20:131, 30:61, 40:56, 40:78, 46:36, 50:40, 52:49, 68:49, 70:6, 73:11, 74:8, 76:25"
            },
            {
                "id": 16547,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:82, 37:161, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 66:11, 89:30"
            }
        ],
        "ar": "اِصۡبِرۡ عَلٰی مَا یَقُوۡلُوۡنَ وَ اذۡکُرۡ عَبۡدَنَا دَاوٗدَ   ذَا  الۡاَیۡدِ ۚ اِنَّہٗۤ   اَوَّابٌ ﴿۱۸﴾ ",
        "ur": "صبر کر اُس پر جو وہ کہتے ہیں اور ہمارے بندے داؤد کو یاد کر جو بڑی دسترس والا تھا۔ یقیناً وہ عاجزی سے بار بار جھکنے والا تھا۔",
        "v5": {
            "text": "Bear patiently what they say, and remember Our servant David, the <i>man</i> of might; surely he was always turning <i>to God</i>.[3388]",
            "notes": [
                {
                    "ref": "3388",
                    "note": "<p><strong>Commentary:</strong></p><p>In this and the following several verses the Holy Prophet has been enjoined to bear patiently the jeers and sneers of disbelievers, like Prophets David, Solomon and Job who too had to face mockery and opposition from their enemies. These three Prophets possessed great power, influence and wealth and that is why perhaps they have always been mentioned together in the Quran.</p><p>See also 4:164, 6:85 &amp; 21:80-84.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 19,
        "v_": 18,
        "topics": [
            {
                "id": 720,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:14, 13:16, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 22:78, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 37:167, 39:10, 39:76, 41:38-39, 48:10, 50:40-41, 55:7, 59:25, 61:2, 62:2, 64:2, 87:2, 96:20, 110:4"
            },
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 12181,
                "topic": "Mountains: <i>Jibal</i>: chieftains, tribes",
                "verses": "13:32, 18:48, 19:91, 20:106, 21:80, 27:89, 34:11, 52:11, 77:11, 78:21, 81:4"
            }
        ],
        "ar": "اِنَّا سَخَّرۡنَا الۡجِبَالَ مَعَہٗ یُسَبِّحۡنَ بِالۡعَشِیِّ  وَ  الۡاِشۡرَاقِ ﴿ۙ۱۹﴾ ",
        "ur": "یقیناً ہم نے اس کے ساتھ پہاڑوں کو مسخر کر دیا، وہ ڈھلتی ہوئی شام اور پھوٹتی ہوئی صبح کے وقت تسبیح کرتے تھے۔",
        "v5": {
            "text": "[a]We subjected to him the mountains—they celebrated God’s praises with him at nightfall and sunrise.[3389]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:80; 34:11."
                },
                {
                    "ref": "3389",
                    "note": "<p><strong>Commentary:</strong></p><p>For a detailed explanation of this and the next verse see 21:80 &amp; 34:11.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 4471,
                "topic": "Birds: asked to sing praises of Allah",
                "verses": "21:80, 34:11"
            },
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            }
        ],
        "ar": "وَ الطَّیۡرَ  مَحۡشُوۡرَۃً ؕ کُلٌّ   لَّہٗۤ   اَوَّابٌ ﴿۲۰﴾ ",
        "ur": "اوراکٹھے کئے ہوئے پرندوں کو بھی (اس کے لئے مسخر کردیا تھا)۔ سب اس (یعنی ربّ) کے حضور جھکنے والے تھے۔",
        "v5": {
            "text": "And <i>We subjected to him</i> the birds gathered together; all turned to him.[3390]",
            "notes": [
                {
                    "ref": "3390",
                    "note": "<p><strong>Commentary:</strong></p><p>While the reference in the word الجبال (the mountains) in the preceding verse is to the mountain tribes, in طیر (birds) it may be to those tribes who hated to be held in subjection by David and were impatient to get their liberty. The sense of impatience seems to be implied in the root word طار (it flew). See also 21:80 &amp; 34:11, 12.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 7390,
                "topic": "Fasl: Decision",
                "verses": "42:22, 86:14"
            },
            {
                "id": 8906,
                "topic": "Hikmah: wisdom",
                "verses": "2:130, 2:252, 2:270, 3:49, 3:59, 3:80, 3:82, 3:165, 4:55, 4:114, 5:111, 6:74, 10:2, 14:20, 16:126, 17:40, 19:13, 21:75, 21:80, 26:84, 28:15, 31:3, 31:13, 33:35, 36:3, 40:68, 43:5, 43:64, 44:5, 54:6, 62:3, 71:14"
            },
            {
                "id": 18686,
                "topic": "Wisdom",
                "verses": "2:130, 2:152, 2:252, 2:270, 3:49, 3:82, 3:165, 5:111, 6:74, 10:2, 16:126, 19:13, 21:75, 21:80, 26:84, 31:13, 33:35, 36:3, 43:5, 43:64"
            }
        ],
        "ar": "وَ شَدَدۡنَا مُلۡکَہٗ  وَ اٰتَیۡنٰہُ  الۡحِکۡمَۃَ وَ فَصۡلَ  الۡخِطَابِ ﴿۲۱﴾ ",
        "ur": "اور اس کی سلطنت کو ہم نے مضبوط کر دیا اور اسے حکمت اورفیصلہ کن کلام بخشے۔",
        "v5": {
            "text": "And We strengthened his kingdom, [b]and gave him wisdom and decisive judgement,[3391]",
            "notes": [
                {
                    "ref": "b",
                    "note": "2:252."
                },
                {
                    "ref": "3391",
                    "note": "<p><strong>Important Words:</strong></p><p>فصل الخطاب (decisive judgement) is infinitive noun from فصل (<i>fasala</i>) which means, he separated or divided a thing or distinguished it, he made it clear or he explained it, he separated it. فصل الحکم means, he decided the judgement. فصل الخطاب means, distinct or plain speech such as decides or distinguishes between what is true and what is false, or that which the person to whom it is addressed clearly understands; or judicial sentence. یوم الفصل means, the Day of Judgement or Decision (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The expression ذا الاید meaning, possessor of dignity and power, the verse shows that David was one of the greatest and most powerful Prophet-Kings of the House of Israel and was a very wise judge. In his reign Israelite glory had reached its high watermark. But in the time of his son, Solomon, though the Israelites tried to maintain their grandeur and the integrity and stability of their dominions, seeds of disruption and disintegration had been sown and signs of decadence had begun to appear. See also 34:11, 12.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 22,
        "v_": 21,
        "topics": [
            {
                "id": 5735,
                "topic": "David: <i>Dawud(as)</i>: attempted murder of",
                "verses": null
            },
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            }
        ],
        "ar": "وَ ہَلۡ  اَتٰٮکَ نَبَؤُا الۡخَصۡمِ ۘ اِذۡ  تَسَوَّرُوا  الۡمِحۡرَابَ ﴿ۙ۲۲﴾ ",
        "ur": "اور کیا تیرے پاس جھگڑنے والوں کی خبر پہنچی ہے جب انہوں نے محل کی فصیل کو پھلانگا؟",
        "v5": {
            "text": "And has the story of the disputants reached thee when they climbed over the wall of <i>his</i> chamber?[3392]",
            "notes": [
                {
                    "ref": "3392",
                    "note": "<p><strong>Important Words:</strong></p><p>تسوروا (they climbed over) is derived from سار. They say سار او تسور الحائط i.e. he scaled or climbed over the wall. سار الیه means, he leaped against and attacked him. سور المدینة (<i>sawwara</i>) means, he built a wall round the town (Aqrab &amp; Lane).</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 5735,
                "topic": "David: <i>Dawud(as)</i>: attempted murder of",
                "verses": null
            },
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 8364,
                "topic": "Hakam: their own laws as",
                "verses": "5:44-46, 5:48-50, 10:48"
            },
            {
                "id": 10023,
                "topic": "Justice: <i>‘Adl</i>, Equity",
                "verses": "4:59, 4:136, 5:43, 5:96, 6:71, 6:83, 7:160, 38:27"
            },
            {
                "id": 11489,
                "topic": "Mischief: of Jews",
                "verses": "2:103, 2:252, 7:143, 17:5, 17:9"
            },
            {
                "id": 11805,
                "topic": "Moral Traits: justice",
                "verses": "16:91, 2:49, 2:283, 3:19, 3:109, 4:4, 4:31, 4:59, 4:106, 4:136, 5:9, 5:43, 5:50, 6:83, 6:116, 6:152-153, 7:30, 7:160, 7:182, 15:9, 16:77, 25:5, 28:29, 38:27, 39:70, 39:76, 40:18, 40:32, 40:79, 49:10, 55:9-10, 57:26, 72:14"
            },
            {
                "id": 17209,
                "topic": "State: must ensure justice",
                "verses": "2:248, 16:91, 4:59, 4:106, 4:136, 5:9, 5:34, 20:119-120, 38:27, 42:16"
            }
        ],
        "ar": "اِذۡ  دَخَلُوۡا عَلٰی دَاوٗدَ  فَفَزِعَ مِنۡہُمۡ  قَالُوۡا لَا تَخَفۡ ۚ خَصۡمٰنِ بَغٰی بَعۡضُنَا عَلٰی بَعۡضٍ فَاحۡکُمۡ  بَیۡنَنَا بِالۡحَقِّ  وَ لَا تُشۡطِطۡ وَ اہۡدِنَاۤ  اِلٰی سَوَآءِ  الصِّرَاطِ ﴿۲۳﴾ ",
        "ur": "جب وہ دا ؤد کے سامنے آئے تو وہ ان کی وجہ سے سخت گھبرایا۔ انہوں نے کہا کوئی خوف نہ کر۔ (ہم) دو جھگڑنے والے (ہیں) ہم میں سے ایک دوسرے پر زیادتی کر رہا ہے۔ پس ہمارے درمیان حق کے ساتھ فیصلہ کر اور کوئی زیادتی نہ کر اور ہمیں سیدھے رستے کی طرف ہدایت دے۔",
        "v5": {
            "text": "When they entered in upon David, and he was afraid of them. They said, “Fear not. <i>We are</i> two disputants; one of us has transgressed against the other; so judge between us with justice, and deviate not from the right course and guide us to the right way.[3393]",
            "notes": [
                {
                    "ref": "3393",
                    "note": "<p><strong>Commentary:</strong></p><p>It appears from history that though Israelite power was at its height in the reigns of David and Solomon, mischief-mongers tried to stir up discord and disaffection; and false charges were constantly raked up and spread against them and some evil-minded persons even sought to kill David. It is to one such attempt at David’s life that reference has been made in the verse under comment. Two of his enemies scaled the wall of his private chamber with the intention of taking him unawares and killing him, but finding him on his guard and realizing that their plan had miscarried they tried to put him at ease and pretended as if they were merely two litigants who had come to seek his decision in a dispute. David, however, rightly understood their evil intention, and so naturally he was afraid of them.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 24,
        "v_": 23,
        "topics": [
            {
                "id": 5735,
                "topic": "David: <i>Dawud(as)</i>: attempted murder of",
                "verses": null
            },
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 8364,
                "topic": "Hakam: their own laws as",
                "verses": "5:44-46, 5:48-50, 10:48"
            }
        ],
        "ar": "اِنَّ  ہٰذَاۤ  اَخِیۡ ۟ لَہٗ  تِسۡعٌ وَّ تِسۡعُوۡنَ نَعۡجَۃً  وَّ لِیَ نَعۡجَۃٌ  وَّاحِدَۃٌ ۟ فَقَالَ اَکۡفِلۡنِیۡہَا وَ عَزَّنِیۡ  فِی الۡخِطَابِ ﴿۲۴﴾ ",
        "ur": "یقیناً یہ میرا بھائی ہے۔ اس کی ننانوے دُنبیاں ہیں اور میری صرف ایک دُنبی ہے۔ پھر بھی یہ کہتا ہے کہ اسے بھی میری ملکیت میں شامل کر دے اور بحث میں مجھ پر غالب آ جاتا ہے۔ ",
        "v5": {
            "text": "This is my brother; he has ninety-nine ewes, and I have <i>only</i> one ewe. Yet he says, ‘Give it to me,’ and has been overbearing to me in his address.”[3394]",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 25,
        "v_": 24,
        "topics": [
            {
                "id": 5248,
                "topic": "Conjecture: <i>Zann</i>: thinking, doubt",
                "verses": "4:158, 7:172, 11:28, 12:43, 17:102-103, 26:187, 28:39, 28:40, 33:11, 40:38, 41:23, 41:24, 48:13, 59:3, 72:6, 72:8, 84:15"
            },
            {
                "id": 5735,
                "topic": "David: <i>Dawud(as)</i>: attempted murder of",
                "verses": null
            },
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 8364,
                "topic": "Hakam: their own laws as",
                "verses": "5:44-46, 5:48-50, 10:48"
            },
            {
                "id": 14633,
                "topic": "Prostration: <i>Sajdah</i>",
                "verses": "13:16, 3:114, 4:103, 7:207, 9:112, 16:50-51, 17:110, 19:59, 22:19, 22:78, 25:61, 27:26-27, 32:16, 41:39, 48:30, 53:63, 55:7, 76:27, 84:22, 96:20"
            }
        ],
        "ar": "قَالَ لَقَدۡ ظَلَمَکَ بِسُؤَالِ نَعۡجَتِکَ  اِلٰی نِعَاجِہٖ ؕ وَ اِنَّ کَثِیۡرًا مِّنَ الۡخُلَطَآءِ لَیَبۡغِیۡ  بَعۡضُہُمۡ عَلٰی بَعۡضٍ  اِلَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَ قَلِیۡلٌ مَّا ہُمۡ ؕ وَ ظَنَّ دَاوٗدُ  اَنَّمَا فَتَنّٰہُ  فَاسۡتَغۡفَرَ رَبَّہٗ  وَ خَرَّ   رَاکِعًا وَّ  اَنَابَ ﴿ٛ۲۵﴾ ",
        "ur": "اس نے کہا اس نے تیری ایک دنبی اپنی دنبیوں میں شامل کرنے کا سوال کر کے یقیناً تجھ پر ظلم کیا ہے۔ اور یقیناً بہت سے شریک ہیں کہ ان میں سے بعض، بعض دوسروں پر ظلم کرتے ہیں سوائے ان لوگوں کے جو ایمان لائے اور اعمال صالحہ بجا لائے اور بہت تھوڑے ہیں ایسے لوگ۔ اور دا ؤد نے سمجھ لیا کہ ہم نے اس کی آزمائش کی تھی۔ پس اس نے اپنے ربّ سے بخشش مانگی اور وہ عجز کرتے ہوئے گِر پڑا اور توبہ کی۔",
        "v5": {
            "text": "<i>David</i> said, ‘Surely, he has wronged thee in demanding thy ewe <i>to add</i> to his own ewes. And certainly many partners transgress against one another, except those who believe <i>in God</i> and do good works; and these are but few.’ And David perceived that We had tried him; so he asked forgiveness of his Lord, and fell down bowing in worship and turned <i>to Him</i>.[3395]",
            "notes": [
                {
                    "ref": "3395",
                    "note": "<p><strong>Commentary:</strong></p><p>David was not taken in by the mask of ordinary litigants that the two intruders had put on; he saw through the game. Though he did not lose his presence of mind and gave his decision like a sane and sedate judge, yet he realized that his control over his people had weakened and that, despite the precautions he had taken, he was not quite safe from the schemes and plots of his enemies. He felt that the incident was a reminder from God. So he adopted the only course which the righteous and the God-fearing adopt in such circumstances. He prayed to God and sought Divine protection against the schemes and conspiracies of his enemies. The insinuation behind the tale of the litigants was that David was a tyrant who was extending his domination over small and weak neighbouring tribes.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 26,
        "v_": 25,
        "topics": [
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 8364,
                "topic": "Hakam: their own laws as",
                "verses": "5:44-46, 5:48-50, 10:48"
            }
        ],
        "ar": "فَغَفَرۡنَا لَہٗ  ذٰلِکَ ؕ وَ  اِنَّ  لَہٗ عِنۡدَنَا لَزُلۡفٰی وَ حُسۡنَ مَاٰبٍ ﴿۲۶﴾ ",
        "ur": "پس ہم نے اس کو یہ (قصور) بخش دیا۔ اور یقیناً اُسے ہمارے ہاں ایک قربت اور اچھا مقام حاصل تھا۔",
        "v5": {
            "text": "So We forgave him that; and indeed, he had a position of nearness with Us and an excellent retreat.[3396]",
            "notes": [
                {
                    "ref": "3396",
                    "note": "<p><strong>Important Words:</strong></p><p>غفرنا (We forgave him). غفر الشیء means, he concealed or hid the thing. غفر الله له: God forgave him his sins. غفر الامر means, he set right the affair (Lane &amp; Aqrab). See also 2:59, 200, 286 &amp; 14:42.</p><p><strong>Commentary:</strong></p><p>The expression غفرنا له may mean, \"We gave him Our protection\" or \"We set his affairs right.\" The words, \"he had a position of nearness with Us and an excellent retreat,\" show that David did not suffer from any moral defect and spiritual weakness; rather they most effectively negate and demolish the wicked charge of David having committed adultery as imputed to him by the Bible (2 Samuel, 11:4, 5).</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 27,
        "v_": 26,
        "topics": [
            {
                "id": 5634,
                "topic": "Dallin: astray",
                "verses": "1:7, 2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:28, 13:34, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:5, 22:10, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:33, 37:72, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            },
            {
                "id": 5743,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:31"
            },
            {
                "id": 5805,
                "topic": "Day of Reckoning: <i>Yaumul-Hisab</i>",
                "verses": "38:17, 14:42, 38:54, 39:25, 39:60, 40:28, 46:21, 58:19, 78:4, 80:37, 83:6, 111:4"
            },
            {
                "id": 6320,
                "topic": "Desire: (evil, low), <i>Hawa</i>",
                "verses": "28:51, 4:136, 7:177, 18:29, 20:17, 25:44, 45:24, 53:3, 53:5, 79:41, 79:42"
            },
            {
                "id": 8364,
                "topic": "Hakam: their own laws as",
                "verses": "5:44-46, 5:48-50, 10:48"
            },
            {
                "id": 10024,
                "topic": "Justice: <i>‘Adl</i>, Equity",
                "verses": "4:59, 4:136, 5:43, 5:96, 6:71, 6:83, 7:160, 38:23"
            },
            {
                "id": 10915,
                "topic": "Man: vicegerent on earth",
                "verses": "2:31, 6:166, 17:71"
            },
            {
                "id": 11806,
                "topic": "Moral Traits: justice",
                "verses": "16:91, 2:49, 2:283, 3:19, 3:109, 4:4, 4:31, 4:59, 4:106, 4:136, 5:9, 5:43, 5:50, 6:83, 6:116, 6:152-153, 7:30, 7:160, 7:182, 15:9, 16:77, 25:5, 28:29, 38:23, 39:70, 39:76, 40:18, 40:32, 40:79, 49:10, 55:9-10, 57:26, 72:14"
            },
            {
                "id": 17210,
                "topic": "State: must ensure justice",
                "verses": "2:248, 16:91, 4:59, 4:106, 4:136, 5:9, 5:34, 20:119-120, 38:23, 42:16"
            },
            {
                "id": 18532,
                "topic": "Way of: <i>Sabil</i>: leading astray from",
                "verses": "6:118, 22:10, 33:68"
            }
        ],
        "ar": "یٰدَاوٗدُ  اِنَّا جَعَلۡنٰکَ خَلِیۡفَۃً فِی الۡاَرۡضِ فَاحۡکُمۡ بَیۡنَ النَّاسِ بِالۡحَقِّ وَ لَا تَتَّبِعِ الۡہَوٰی فَیُضِلَّکَ عَنۡ سَبِیۡلِ اللّٰہِ ؕ اِنَّ الَّذِیۡنَ یَضِلُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ  لَہُمۡ عَذَابٌ شَدِیۡدٌۢ بِمَا نَسُوۡا یَوۡمَ الۡحِسَابِ  ﴿٪۲۷﴾",
        "ur": "اے دا ؤد! یقیناً ہم نے تجھے زمین میں خلیفہ بنایا ہے۔ پس لوگوں کے درمیان حق کے ساتھ فیصلہ کر اور میلانِ طبع کی پیروی نہ کر ورنہ وہ (میلان) تجھے اللہ کے رستے سے گمراہ کر دے گا۔ یقیناً وہ لوگ جو اللہ کے رستے سے گمراہ ہو جاتے ہیں ان کے لئے سخت عذاب (مقدر) ہے بوجہ اس کے کہ وہ حساب کا دن بھول گئے تھے۔ ",
        "v5": {
            "text": "<i>Then we said to him,</i> ‘O David, We have made thee a vicegerent in the earth; so judge between men with justice, and follow not vain desire, lest it should lead thee astray from the way of Allah.’ Surely, those who go astray from the way of Allah will have a severe punishment, because they forgot the Day of Reckoning.[3397]",
            "notes": [
                {
                    "ref": "3397",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse further comforts David and assures him that God will protect him against the machinations and plots of his enemies. He had not made him His vicegerent in the earth that he should come to grief at the hands of his mischievous opponents.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 28,
        "v_": 27,
        "topics": [
            {
                "id": 1326,
                "topic": "Allah: created Heavens and earth",
                "verses": "41:10-13, 2:165, 3:191, 6:2, 7:55, 10:4, 10:7, 11:8, 14:33, 25:3, 25:60, 29:62, 30:23, 31:11, 32:5, 35:4, 39:63, 40:63, 43:10, 44:39, 46:4, 50:7-8, 50:39, 57:5, 65:13, 67:4, 71:16-18"
            },
            {
                "id": 5231,
                "topic": "Conjecture: <i>Zann</i>",
                "verses": "4:158, 2:79, 3:8, 6:117, 6:149, 10:37, 10:61, 10:67, 34:54, 43:21, 45:25, 45:33, 48:7, 48:13, 49:13, 53:24, 53:29"
            },
            {
                "id": 6496,
                "topic": "Disbelief: <i>Kufr</i>: punishment of a",
                "verses": "2:7-21, 2:25, 2:40, 2:91, 2:105, 2:127, 2:176, 3:11, 3:23, 3:57, 3:92, 3:132, 3:142, 4:19, 4:38, 4:57, 4:141, 4:152, 4:162, 5:11, 5:87, 6:31, 6:111, 7:51, 8:15, 8:37, 9:26, 9:49, 9:68, 13:36, 14:3, 16:28, 17:9, 18:103, 18:107, 21:40, 22:20, 22:73, 29:55, 33:65-66, 34:34, 35:37, 36:64-65, 39:33, 39:72, 41:51, 48:14, 67:7, 70:2-3, 76:5, 98:7"
            },
            {
                "id": 6975,
                "topic": "Earth: <i>Al-Ard</i>: creation of the",
                "verses": "67:16, 3:191, 6:74, 7:55, 10:4, 11:8, 14:20, 14:33, 20:5, 21:31, 22:19, 25:60, 29:45, 29:62, 30:23, 32:5, 35:2, 36:82, 39:6, 40:58, 41:10-12, 62:2, 64:4, 65:13, 79:31-34, 84:4"
            },
            {
                "id": 7339,
                "topic": "Falsehood: <i>Batil</i>",
                "verses": "17:82, 2:43, 2:189, 3:72, 3:192, 4:30, 5:43, 8:9, 10:83, 13:18, 21:19, 34:49-50"
            },
            {
                "id": 18143,
                "topic": "Universe: created with purpose",
                "verses": "15:86, 3:191-192, 16:4, 21:17, 44:39-40, 46:4"
            },
            {
                "id": 18812,
                "topic": "Woe: <i>Wail</i>",
                "verses": "2:80, 5:32, 11:73, 14:3, 18:50, 19:38, 20:62, 21:19, 21:47, 25:29, 28:81, 36:53, 39:23, 41:7-8, 43:66, 45:8, 46:18, 47:21, 51:61, 52:12, 68:32, 75:35-36, 77:16, 77:20, 77:25, 77:29, 77:35, 77:38, 77:41, 77:46, 77:48, 77:50, 80:18, 83:2-3, 83:11-12, 104:2, 107:5-6"
            }
        ],
        "ar": "وَ مَا خَلَقۡنَا السَّمَآءَ  وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَا بَاطِلًا ؕ ذٰلِکَ ظَنُّ الَّذِیۡنَ کَفَرُوۡا ۚ فَوَیۡلٌ  لِّلَّذِیۡنَ کَفَرُوۡا مِنَ النَّارِ ﴿ؕ۲۸﴾ ",
        "ur": "اور ہم نے آسمان اور زمین کو اور جو اُن کے درمیان ہے بے مقصد پیدا نہیں کیا۔ یہ ان لوگوں کا محض گمان ہے جنہوں نے انکار کیا۔ پس آگ (کے عذاب) کی ہلاکت ہو ان پر جنہوں نے کفر کیا۔",
        "v5": {
            "text": "[a]And We have not created the heaven and the earth and all that is between them in vain. That is the view of those who disbelieve. [b]Woe, then, to the disbelievers because <i>of the punishment</i> of the Fire.[3398]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:17; 44:39."
                },
                {
                    "ref": "b",
                    "note": "14:3; 19:38; 51:61."
                },
                {
                    "ref": "3398",
                    "note": "<p><strong>Commentary:</strong></p><p>With this verse the <i>Surah</i> reverts to its original theme dealt with in the opening verses. It purports to say that the heavens and the earth and all that is between them have not been created in vain. They serve a mighty purpose and point to the existence of an Infallible mind, an Almighty Being Who has created them. Divine Prophets come into the world to call men to their Creator and when they come, those to whom they address their Message become divided into two groups—believers and disbelievers.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 29,
        "v_": 28,
        "topics": [
            {
                "id": 419,
                "topic": "Actions: <i>A‘mal</i>: each responsible for his own",
                "verses": "45:16, 2:140, 2:282, 3:26, 4:85, 6:165, 10:42, 17:16, 28:56, 32:19, 35:19, 39:8, 39:71, 42:16, 45:22, 53:39, 68:36, 109:7"
            },
            {
                "id": 1434,
                "topic": "Allah: does not love mischief-mongers",
                "verses": "28:78, 2:12-13, 2:28, 2:61, 2:252, 5:33-34, 5:65, 7:57, 7:75, 7:87, 7:104, 7:143, 8:74, 10:82, 11:86, 13:26, 17:5, 18:95, 26:153, 26:184, 28:5, 28:84, 89:13"
            },
            {
                "id": 7020,
                "topic": "Earth: <i>Al-Ard</i>: create not mischief on",
                "verses": "2:252, 2:12, 2:28, 2:61, 2:206, 5:65, 7:57, 8:73, 16:46, 17:5, 18:95, 29:37"
            }
        ],
        "ar": "اَمۡ نَجۡعَلُ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ کَالۡمُفۡسِدِیۡنَ فِی الۡاَرۡضِ ۫ اَمۡ  نَجۡعَلُ  الۡمُتَّقِیۡنَ  کَالۡفُجَّارِ ﴿۲۹﴾ ",
        "ur": "کیا ہم ان لوگوں کو جو ایمان لائے اور نیک اعمال بجا لائے ویسا ہی قرار دے دیں گے جیسے زمین میں فساد کرنے والوں کو یا کیا ہم تقویٰ اختیار کرنے والوں کو بدکرداروں جیسا سمجھ لیں گے ؟",
        "v5": {
            "text": "[c]Shall We treat those who believe and do good works like those who act corruptly in the earth? Shall We treat the righteous like the wicked?[3399]",
            "notes": [
                {
                    "ref": "c",
                    "note": "68:36."
                },
                {
                    "ref": "3399",
                    "note": "<p><strong>Commentary:</strong></p><p>It is to the two parties of believers and disbelievers implied in the preceding verse that the present verse refers and then proceeds to say that there lies a world of difference between them.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 30,
        "v_": 29,
        "topics": [
            {
                "id": 4048,
                "topic": "Barakah: <i>blessings</i>: Allah sent down",
                "verses": "6:156, 6:93, 7:97, 21:51, 33:44, 44:4, 50:10"
            },
            {
                "id": 15055,
                "topic": "Qur’an: excellence, perfection of, <i>Ummul-Kitab</i>",
                "verses": "2:24, 2:3, 5:4, 6:156, 8:32, 10:38-40, 11:2, 11:14-15, 13:32, 14:25-26, 15:2, 17:89, 18:110, 21:11, 21:25, 25:2, 27:2, 29:52, 38:2, 39:24, 43:5, 52:34-35, 59:22, 73:6"
            },
            {
                "id": 15229,
                "topic": "Qur’an: universality of",
                "verses": "25:2, 2:22, 26:193, 34:29, 81:28"
            },
            {
                "id": 15397,
                "topic": "Reflect: ponder, <i>Tafakkur</i>",
                "verses": "30:9, 2:220, 2:267, 4:83, 6:51, 7:177, 10:25, 13:4, 16:12, 16:45, 16:70, 27:63, 28:44, 30:22, 32:5, 34:47, 39:43, 40:59, 45:14, 47:25, 51:50, 56:63, 59:22"
            }
        ],
        "ar": "کِتٰبٌ  اَنۡزَلۡنٰہُ  اِلَیۡکَ مُبٰرَکٌ  لِّیَدَّبَّرُوۡۤا اٰیٰتِہٖ وَ  لِیَتَذَکَّرَ  اُولُوا الۡاَلۡبَابِ ﴿۳۰﴾ ",
        "ur": "عظیم کتاب جسے ہم نے تیری طرف نازل کیا، برکت دی گئی ہے تاکہ یہ (لوگ) اس کی آیات پر تدبر کریں اور تاکہ عقل والے نصیحت پکڑیں۔ ",
        "v5": {
            "text": "[a]<i>This is</i> a Book which We have revealed to thee, full of excellences, that they may reflect over its verses, and that those <i>gifted</i> with understanding may take heed.[3400]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:93; 21:51."
                },
                {
                    "ref": "3400",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that this Book—the Quran—which contains the basic and universal principles of all religions and their permanent and imperishable teachings and contains much more that is indispensable for the growing needs and requirements of man, has been revealed to the Holy Prophet by God.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 31,
        "v_": 30,
        "topics": [
            {
                "id": 5744,
                "topic": "David: <i>Dawud(as)</i>: favours of God on",
                "verses": "2:252, 4:164, 6:85, 17:56, 21:79-81, 27:16-17, 34:11-12, 38:18-27"
            },
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "وَ وَہَبۡنَا لِدَاوٗدَ  سُلَیۡمٰنَ ؕ نِعۡمَ  الۡعَبۡدُ ؕ اِنَّہٗۤ  اَوَّابٌ ﴿ؕ۳۱﴾ ",
        "ur": "اور ہم نے دا ؤد کو سلیمان عطا کیا۔ کیا ہی اچھا بندہ تھا۔ یقیناً وہ بار بار عاجزی سے جھکنے والا تھا۔ ",
        "v5": {
            "text": "[b]And We bestowed on David, Solomon who was an excellent servant. He was always turning <i>to Us</i>.[3401]",
            "notes": [
                {
                    "ref": "b",
                    "note": "27:17."
                },
                {
                    "ref": "3401",
                    "note": "<p><strong>Commentary:</strong></p><p>After briefly reverting to the primary theme with which this <i>Surah</i> had opened, the present verse gives another example of a Divine Prophet—Solomon, upon whom God had bestowed great material wealth, power and honour, but who also suffered at the hands of his evil-minded enemies. Reversion to the primary theme is meant to tell the Holy Prophet that he too, like the great Prophets, David and Solomon, will have to go through great trials and tribulations in the way of God.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 32,
        "v_": 31,
        "topics": [
            {
                "id": 8986,
                "topic": "Horses: <i>Khail</i>",
                "verses": "16:9, 3:15, 3:201, 4:72, 9:41, 17:65, 27:18, 59:7, 100:2"
            },
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "اِذۡ عُرِضَ عَلَیۡہِ بِالۡعَشِیِّ الصّٰفِنٰتُ الۡجِیَادُ ﴿ۙ۳۲﴾ ",
        "ur": "جب شام کے وقت اس کے سامنے تیزرَو گھوڑے لائے گئے۔",
        "v5": {
            "text": "When there were brought before him at eventide steeds of noblest breed and swift of foot,[3402]",
            "notes": [
                {
                    "ref": "3402",
                    "note": "<p><strong>Important Words:</strong></p><p>صافنات (steeds) is the plural of صافنة which is fem. of صافن which is active participle from صفن. They say صفن الفرس i.e. the horse stood on three legs, the hoof of the fourth slightly touching the ground. صافن means, a horse standing upon three legs and the extremity of the hoof of the fourth leg. Standing in this posture is considered to be the peculiarity of Arabian breed which are regarded as the best bred horses. The word صافن would therefore mean, horses of the noblest breed (Lane &amp; Aqrab).</p><p>جیاد (swift-footed horses) is the plural of جواد which is derived from جاد. They say جاد الفرس i.e. the horse became swift-footed. جاد فی عدوہ means, he became swift and excellent. فرس جواد means, a quick-footed horse (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 33,
        "v_": 32,
        "topics": [
            {
                "id": 4096,
                "topic": "Barrier: <i>Barzakh</i>: as veil",
                "verses": "33:54, 17:46, 19:18, 41:6, 42:51, 83:16"
            },
            {
                "id": 4961,
                "topic": "Cavalry",
                "verses": "27:18"
            },
            {
                "id": 8986,
                "topic": "Horses: <i>Khail</i>",
                "verses": "16:9, 3:15, 3:201, 4:72, 9:41, 17:65, 27:18, 59:7, 100:2"
            },
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "فَقَالَ  اِنِّیۡۤ  اَحۡبَبۡتُ حُبَّ الۡخَیۡرِ عَنۡ ذِکۡرِ  رَبِّیۡ ۚ حَتّٰی تَوَارَتۡ بِالۡحِجَابِ ﴿ٝ۳۳﴾ ",
        "ur": "تو اس نے کہا یقیناً میں مال کی محبت اپنے ربّ کی یاد کی وجہ سے کرتا ہوں۔ یہاں تک کہ وہ اوٹ میں چلے گئے۔ ",
        "v5": {
            "text": "He said, ‘I love the love of horses because they remind <i>me</i> of my Lord.’ <i>So great was his love of them that</i> when they were hidden behind the veil, <i>he said</i>,[3403]",
            "notes": [
                {
                    "ref": "3403",
                    "note": "<p><strong>Important Words:</strong></p><p>عن (because) is a preposition and as such it has several meanings:</p><p>1. It denotes transition as in the saying سافرت عن البلد i.e. I journeyed from the town.</p><p>2. It denotes compensation as in the verse لاتجزی نفس عن نفس شیئاً i.e. no soul shall serve as a substitute for another soul (2:49).</p><p>3. It denotes superiority i.e. being synonymous with علی as in the verse فانـما یبخل عن نفسه i.e. And whoso is niggardly, is niggardly only against his own soul or is niggardly only to himself (47:39).</p><p>4. It denotes a cause as in the verse under comment and also in the verse وما نـحن بتارکی آلـھتنا عن قولك i.e. we are not going to forsake our gods because of thy saying (11:54).</p><p>5. It is synonymous with بعد (after) as in the verse لترکبن طبقا عن طبق, meaning حالة بعد حالة i.e. you will surely pass on from one stage to another (84:20).</p><p>6. It is also synonymous with من (from) as in the verse الذی یقبل التوبة عن عبادہ i.e. He it is Who accepts repentance from His servants (42:26).</p><p>7. It has the same sense as ب (by or with) as in the verse وما ینطق عن الـھوی i.e. nor does he speak with the desire of self-gratification (53:4).</p><p>8. It denotes the using of a thing as an aid or instrument as in the saying: رمیت عن القوس i.e. I shot with or by means of the bow (Lane).</p><p><strong>Commentary:</strong></p><p>God had bestowed upon Solomon power and wealth. He ruled over a vast kingdom and, therefore, he had to keep a strong army. Naturally, he had a great liking for horses of good breed because cavalry formed a strong wing of his army which was so necessary to guard and protect his God-given and far-flung kingdom—a great stronghold of truth and righteousness. So Solomon’s love for horses was not that of a race-goer or a professional breeder of horses. It only sprang from his love for his Creator as the horses were used for fighting in the cause of God.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 34,
        "v_": 33,
        "topics": [
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "رُدُّوۡہَا عَلَیَّ ؕ فَطَفِقَ مَسۡحًۢا بِالسُّوۡقِ وَ الۡاَعۡنَاقِ ﴿۳۴﴾ ",
        "ur": "(اس نے کہا) انہیں دوبارہ میرے سامنے لاؤ۔ پس وہ (ان کی) پنڈلیوں اور گردنوں پر (پیار سے) ہاتھ پھیرنے لگا۔",
        "v5": {
            "text": "‘Bring them back to me.’ Then he began to stroke <i>their</i> legs and <i>their</i> necks.[3404]",
            "notes": [
                {
                    "ref": "3404",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse shows that Solomon was seeing a horse parade and in order to show his admiration for his horses he stroked their necks and legs.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 35,
        "v_": 34,
        "topics": [
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "وَ لَقَدۡ فَتَنَّا سُلَیۡمٰنَ وَ اَلۡقَیۡنَا عَلٰی کُرۡسِیِّہٖ  جَسَدًا ثُمَّ  اَنَابَ ﴿۳۵﴾ ",
        "ur": "اور یقیناً ہم نے سلیمان کو آزمایا اور ہم نے اس (کی سلطنت) کے تخت پر (عقل وشعور سے عاری) ایک جسد پھینک دیا۔ تب وہ (اللہ ہی کی طرف) جُھکا۔",
        "v5": {
            "text": "And We did try Solomon and We placed on his throne a <i>mere</i> body. Then he turned <i>to God, seeking His mercy</i>.[3405]",
            "notes": [
                {
                    "ref": "3405",
                    "note": "<p><strong>Commentary:</strong></p><p>While here the words are \"a mere body,\" in 34:15 the expression used is \"a worm of the earth.\" The reference in both the places may either be to Solomon’s son and heir, Rehoboam, a worthless fellow, in whose reign Solomon’s kingdom fell victim to disintegration and disruption, or to Jeroboam who raised the standard of revolt against the House of David and succeeded in winning the allegiance of ten tribes of Israel. Jeroboam was an idol worshipper and under his lead the Israelites relapsed into image-worship (1 Kings 12:28).</p><p>The words \"he turned to God\" seem to imply that Solomon had realized that after his death his kingdom would not maintain its integrity under his incompetent and inefficient successor. So he turned to God and prayed to Him. The prayer is given in the next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 36,
        "v_": 35,
        "topics": [
            {
                "id": 3632,
                "topic": "Attributes of Allah: Al-Wahhab (The Bestower)",
                "verses": "3:9, 38:10"
            },
            {
                "id": 7757,
                "topic": "Forgiveness: <i>‘Afw</i>: Adam, Prophets, seek",
                "verses": "19:48, 7:24, 7:152, 7:156, 9:114, 14:42, 26:87, 28:17, 60:5-6, 71:29"
            },
            {
                "id": 14128,
                "topic": "Prayers of the Holy Qur’an: for forgiveness",
                "verses": "3:17, 2:286-287, 3:148, 3:194-195, 7:24, 7:150, 7:152, 7:156-157, 11:48, 12:102, 18:11, 21:88, 23:95, 23:110, 23:119, 25:66-67, 28:17, 35:38, 40:8, 59:11, 66:9, 71:27-29"
            },
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "قَالَ رَبِّ اغۡفِرۡ لِیۡ وَ ہَبۡ لِیۡ مُلۡکًا لَّا یَنۡۢبَغِیۡ لِاَحَدٍ مِّنۡۢ بَعۡدِیۡ ۚ اِنَّکَ اَنۡتَ الۡوَہَّابُ  ﴿۳۶﴾",
        "ur": "(اور) کہا اے میرے ربّ! مجھے بخش دے اور مجھے ایک ایسی سلطنت عطا کر کہ میرے بعد اُس پر اور کوئی نہ جچے۔ یقیناً تُو ہی بے انتہا عطا کرنے والا ہے۔",
        "v5": {
            "text": "He said, ‘O my Lord, grant me forgiveness and bestow on me a kingdom that will not suit anyone after me; surely Thou art the Great Bestower.’[3406]",
            "notes": [
                {
                    "ref": "3406",
                    "note": "<p><strong>Commentary:</strong></p><p>As it appears from the preceding verse Solomon had foreseen that his temporal kingdom would become disrupted after his death, through the imbecility of his foolish and worthless son, so he prayed that the spiritual kingdom which God had bestowed upon his House might continue among them. If the words \"a kingdom that will not suit anyone after me\" are taken in their literal sense, then Solomon’s prayer would be understood to have been accepted in the sense that after his death no king possessing the power and prestige that he possessed ever appeared among the Israelites.</p><p>The words لا ینبغی لاحد من بعدی may also signify a kingdom which pertains to the individual and is not heritable.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 37,
        "v_": 36,
        "topics": [
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            },
            {
                "id": 18631,
                "topic": "Wind: as a blessing and a sign",
                "verses": "27:64, 2:165, 7:58, 15:23, 24:44, 25:49, 30:47, 30:49, 35:10, 42:34, 45:6"
            },
            {
                "id": 18637,
                "topic": "Wind: as a force of nature",
                "verses": "33:10, 21:82, 34:13"
            },
            {
                "id": 18659,
                "topic": "Wind: types of",
                "verses": "67:18, 14:19, 15:23, 17:70, 41:17, 46:25, 54:20, 69:7"
            }
        ],
        "ar": "فَسَخَّرۡنَا لَہُ  الرِّیۡحَ تَجۡرِیۡ بِاَمۡرِہٖ رُخَآءً  حَیۡثُ  اَصَابَ  ﴿ۙ۳۷﴾",
        "ur": "پس ہم نے اس کے لئے ہوا کو بھی مسخر کر دیا جو اس کے حکم پر نرم رفتاری سے، جدھر وہ (لے) جانا چاہتا تھا، چلتی تھی۔",
        "v5": {
            "text": "So [a]We subjected to him the wind, blowing gently by his command whithersoever he desired to go.[3407]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:82; 27:18; 34:13."
                },
                {
                    "ref": "3407",
                    "note": "<p><strong>Important Words:</strong></p><p>رخاء (blowing gently) is derived from رخا which means, it was or became soft, flabby or brittle. رخاالعیش means, the life became affluent and pleasant, the life became easy or plentiful. رخاء means, a soft or gentle wind or a soft or gentle and quick wind or gentle wind that does not move anything (Lane &amp; Aqrab).</p><p>الریح means, (1) wind, (2) a good and pure thing, (3) mercy, (4) aid against an enemy, (5) victory or conquest, (6) predominance and power, (7) a turn of good fortune, etc. (Lane &amp; Aqrab). See also 34:13.</p><p><strong>Commentary:</strong></p><p>According to the different meanings of the word ریح given above, the expression, سخرنا له الریح would mean:</p><p>1. God granted to Solomon good and pure things of the world;</p><p>2. He aided Solomon against his enemies;</p><p>3. He was merciful to Solomon;</p><p>4. Solomon made great conquests and won victories over his enemies;</p><p>5. Solomon possessed great power, prestige and predominance.</p><p>6. The words also signify that Solomon possessed a large and powerful navy (1 Kings 9:26-28). See also 34:13.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 38,
        "v_": 37,
        "topics": [
            {
                "id": 16221,
                "topic": "Satan: leaders, giants",
                "verses": "2:15, 21:83"
            },
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "وَ الشَّیٰطِیۡنَ کُلَّ  بَنَّآءٍ   وَّ غَوَّاصٍ ﴿ۙ۳۸﴾ ",
        "ur": "اور شیاطین کو بھی (یعنی) ہر فنِ تعمیر کے ماہر اور غوطہ خور کو۔ ",
        "v5": {
            "text": "[b]And the giants, all <i>sorts of</i> builders and divers.[3408]",
            "notes": [
                {
                    "ref": "b",
                    "note": "21:83; 34:13-14."
                },
                {
                    "ref": "3408",
                    "note": "<p><strong>Important Words:</strong></p><p>غواص (divers) is derived from غاص. They say غاص فی الماء i.e. he dived in or descended beneath or entered into the water to fetch out what was in it. غائص or غواص, the latter having an intensive signification or implying the habit of so doing, means, one who dives in or descends beneath or enters into water, particularly one who dives in the sea for pearls and fetches them out (Lane).</p><p><strong>Commentary:</strong></p><p>See next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 39,
        "v_": 38,
        "topics": [
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "وَّ اٰخَرِیۡنَ مُقَرَّنِیۡنَ فِی الۡاَصۡفَادِ ﴿۳۹﴾ ",
        "ur": "اور (بعض) دوسروں کو بھی جنہیں زنجیروں میں جکڑا گیا تھا۔ ",
        "v5": {
            "text": "[c]And others bound in fetters.[3409]",
            "notes": [
                {
                    "ref": "c",
                    "note": "14:50."
                },
                {
                    "ref": "3409",
                    "note": "<p><strong>Commentary:</strong></p><p>Solomon as stated in 21:83 and 34:13, 14, had subdued and subjected to his rule savage and rebellious mountain tribes. He had forced them into his service and had compelled them to work for him. الشیاطین (giants) of the preceding verse and الـجن (Jinn) of 34:13 are the same people, and the work on which they were employed by Solomon was also of the same nature. In the Bible we have:</p><p>\"Now Solomon purposed to build a house for the name of the Lord and a house for his kingdom. And Solomon told three-score and ten thousand men to bear burdens, and four-score thousand men that were hewers in the mountains, and three thousand and six hundred to oversee them\" (2 Chronicles 2:1-2).</p><p>See also 21:83.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 40,
        "v_": 39,
        "topics": [
            {
                "id": 15357,
                "topic": "Reckoning: <i>Hisab</i>: bestows without",
                "verses": "39:11, 2:213, 3:28, 3:38, 24:39, 40:41"
            },
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "ہٰذَا عَطَآؤُنَا فَامۡنُنۡ اَوۡ اَمۡسِکۡ بِغَیۡرِ حِسَابٍ ﴿۴۰﴾ ",
        "ur": "یہ ہماری بے حساب عطا ہے پس احسان کا سلوک کر یا روکے رکھ۔ ",
        "v5": {
            "text": "‘This is Our gift—so give freely or withhold—without reckoning.’",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 41,
        "v_": 40,
        "topics": [
            {
                "id": 16964,
                "topic": "Solomon: <i>Sulaiman(as)</i>: story of",
                "verses": "27:16-45, 2:103, 4:164, 6:85, 27:77, 34:13-15"
            }
        ],
        "ar": "وَ اِنَّ لَہٗ عِنۡدَنَا لَزُلۡفٰی وَ حُسۡنَ مَاٰبٍ ﴿٪۴۱﴾ ",
        "ur": "اور یقیناً اسے ہمارے ہاں ایک قربت اور اچھا مقام حاصل تھا۔",
        "v5": {
            "text": "And certainly he had a position of nearness with Us and an excellent retreat.",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 42,
        "v_": 41,
        "topics": [
            {
                "id": 853,
                "topic": "Affliction: <i>Bala’</i>",
                "verses": "2:156-158, 2:50, 2:125, 2:178, 2:215, 2:250, 3:143, 3:155, 4:63, 6:18, 7:142, 7:164, 7:169, 8:26, 16:28, 16:54-55, 17:57, 17:74, 21:84, 21:88, 22:36, 23:31, 28:48, 29:11, 30:34, 30:37, 39:9, 41:51, 47:32, 64:12, 68:7"
            },
            {
                "id": 3862,
                "topic": "Ayyub<sup>(as)</sup>: Job",
                "verses": "6:85, 4:164, 21:84-85"
            },
            {
                "id": 6597,
                "topic": "Disease",
                "verses": "2:11, 2:220, 4:4, 5:53, 8:50, 9:125, 10:58, 20:98, 22:54, 24:51, 33:13, 33:33, 33:61, 47:21, 47:30, 74:32"
            },
            {
                "id": 7110,
                "topic": "Emigration: <i>Hijrah</i>: of Adam, Job",
                "verses": "20:124, 2:37, 7:25"
            },
            {
                "id": 7428,
                "topic": "Fatigue",
                "verses": "15:49, 9:120, 18:63"
            },
            {
                "id": 11437,
                "topic": "Migration: <i>Hijrah</i>: of Prophets<sup>(as)</sup>",
                "verses": "7:25, 2:37, 19:49, 20:124, 21:72"
            },
            {
                "id": 11473,
                "topic": "Mischief",
                "verses": "10:82, 10:92, 11:79, 12:30, 12:74, 28:5, 28:78, 113:5"
            },
            {
                "id": 11496,
                "topic": "Misfortune",
                "verses": "2:157, 3:166, 4:73, 5:53, 7:151, 9:50, 42:31"
            },
            {
                "id": 14143,
                "topic": "Prayers of the Holy Qur’an: for deliverance",
                "verses": "2:287, 3:192, 4:76, 10:86-87, 21:84, 21:88-89, 23:98-9, 25:66-67, 26:170, 28:22, 40:8-10, 59:11, 66:12"
            },
            {
                "id": 16283,
                "topic": "Satan: and Prophets<sup>(as)</sup>",
                "verses": "22:53-54, 6:113, 53:21"
            },
            {
                "id": 16912,
                "topic": "Skin",
                "verses": "4:57, 16:81, 20:98, 22:21, 39:24, 41:21-23, 70:17"
            }
        ],
        "ar": "وَ اذۡکُرۡ عَبۡدَنَاۤ  اَیُّوۡبَ ۘ اِذۡ  نَادٰی رَبَّہٗۤ اَنِّیۡ مَسَّنِیَ الشَّیۡطٰنُ بِنُصۡبٍ وَّ عَذَابٍ ﴿ؕ۴۲﴾ ",
        "ur": "اور ہمارے بندے ایوب کو بھی یاد کر جب اس نے اپنے ربّ کو پکارا کہ یقیناً مجھے شیطان نے بہت دکھ اور عذاب دیا ہے۔ ",
        "v5": {
            "text": "And remember Our servant Job, [a]when he cried unto his Lord, <i>saying</i>, ‘Satan has afflicted me with toil and torment.’[3410]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:84."
                },
                {
                    "ref": "3410",
                    "note": "<p><strong>Important Words:</strong></p><p>نصب (toil) is derived from نصب (<i>nasaba</i>). They say نصبه المرض i.e. the disease pained him or tired him. نصب (<i>nasiba</i>) means, he was tired and fatigued. نصب فی الامر means, he exerted himself and laboured regarding the affair. نصب (<i>nusbun</i>) means, fatigue, toil, weariness, affliction, difficulty, distress, trouble, disease, misfortune, etc. (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>In the present and the next three verses the language used is as fittingly metaphorical as that used in the preceding several verses. It seems that the Prophet Job lived in a country of which the ruler was, as the word الشیطان (the leader of mischief) shows, a cruel and tyrannical idol-worshipper, who opposed the monotheistic teaching of Job and severely persecuted him. Job had to leave his native land and take refuge in another country and as a result of this migration he was separated from his family and followers.</p><p>If the word الشیطان as some authorities hold, should signify شیطان الفلاة (satan of the desert) i.e. thirst, the verse would mean that Job in his long and tiresome journey had suffered from thirst and fatigue. According to some other authorities the reference in the word \"Satan has afflicted me with toil and torment\" is to a skin disease from which Prophet Job is said to have temporarily suffered and which left him very much exhausted.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 43,
        "v_": 42,
        "topics": [
            {
                "id": 3862,
                "topic": "Ayyub<sup>(as)</sup>: Job",
                "verses": "6:85, 4:164, 21:84-85"
            },
            {
                "id": 6597,
                "topic": "Disease",
                "verses": "2:11, 2:220, 4:4, 5:53, 8:50, 9:125, 10:58, 20:98, 22:54, 24:51, 33:13, 33:33, 33:61, 47:21, 47:30, 74:32"
            },
            {
                "id": 6788,
                "topic": "Drinks",
                "verses": "2:61, 2:188, 2:250, 2:260, 6:71, 7:32, 9:19, 10:5, 12:42, 14:17, 15:23, 16:11, 16:67-68, 18:30, 19:27, 23:34, 25:50, 26:80, 35:13, 38:52, 47:16, 52:20, 56:55-56, 56:69, 69:25, 72:17, 76:6, 76:18, 76:22, 77:28, 77:44, 78:25, 83:26, 88:6"
            },
            {
                "id": 16912,
                "topic": "Skin",
                "verses": "4:57, 16:81, 20:98, 22:21, 39:24, 41:21-23, 70:17"
            }
        ],
        "ar": "اُرۡکُضۡ بِرِجۡلِکَ ۚ ہٰذَا مُغۡتَسَلٌۢ  بَارِدٌ وَّ  شَرَابٌ ﴿۴۳﴾ ",
        "ur": "(ہم نے اسے کہا) اپنی سواری کو ایڑ لگا۔ یہ (قریب ہی) نہانے کے لئے ٹھنڈا پانی ہے اور پینے کے لئے بھی۔ ",
        "v5": {
            "text": "<i>And We said to him</i>, ‘Strike <i>and urge thy riding beast</i> with thy foot. Yonder is cool water to wash with and a drink.’[3411]",
            "notes": [
                {
                    "ref": "3411",
                    "note": "<p><strong>Important Words:</strong></p><p>ارکض برجلك (strike with thy foot). رکض الرجل means, the man struck the ground with his foot. رکض الفرس برجله means, he urged the horse or spurred the horse with his feet. ارکض برجلك therefore would mean, strike thou, or tread the ground with thy feet, or as given in the text, \"strike and urge the riding beast with thy foot\" (Lane &amp;Aqrab). See also 21:13.</p><p><strong>Commentary:</strong></p><p>In view of the three explanations of the words, \"Satan has afflicted me with toil and torment\" in the preceding verse, the reference in the present verse, may be to the Divine injunction in pursuance of which Job had to leave the country of the cruel polytheistic king and to resume his journey on his riding beast and to strike and urge it on in order to reach a place of safety soon. And as in his long and tiresome journey he greatly suffered from thirst and fatigue, he was comforted with the information that there lay ahead of him a fountain of sweet, cool water where he could slake his thirst and wash himself. Or the meaning may be that having been left alone at a place where there was no water, he was told by God to urge on his riding beast as there lay ahead a fountain of cool, sweet water where he could take rest, satisfy his thirst and take a bath. Or, the verse may signify that as Job suffered from a skin disease, he was directed by God to take bath in a particular fountain whose water contained such minerals as would cure his skin disease.</p><p>It seems that the country through which Job had to travel abounded in springs and fountains.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 44,
        "v_": 43,
        "topics": [
            {
                "id": 3862,
                "topic": "Ayyub<sup>(as)</sup>: Job",
                "verses": "6:85, 4:164, 21:84-85"
            },
            {
                "id": 7381,
                "topic": "Family",
                "verses": "11:46-47, 2:41, 2:197, 2:249, 3:34, 3:36, 7:84, 11:41, 11:82, 12:7, 12:89, 15:66, 20:30, 21:77, 21:85, 26:170-171, 27:50, 28:9, 28:30, 29:33, 37:77, 49:14, 84:10"
            },
            {
                "id": 16912,
                "topic": "Skin",
                "verses": "4:57, 16:81, 20:98, 22:21, 39:24, 41:21-23, 70:17"
            }
        ],
        "ar": "وَ وَہَبۡنَا  لَہٗۤ  اَہۡلَہٗ  وَ مِثۡلَہُمۡ مَّعَہُمۡ رَحۡمَۃً  مِّنَّا وَ ذِکۡرٰی  لِاُولِی الۡاَلۡبَابِ ﴿۴۴﴾ ",
        "ur": "اور پھر ہم نے اسے اس کے اہلِ خانہ اور ان کے علاوہ ان جیسے اور بھی عطا کر دیئے اپنی رحمت کے طور پر اور اہلِ عقل کے لئے ایک سبق آموز ذکر کے طور پر۔",
        "v5": {
            "text": "[a]And We bestowed on him, his family and as many more with them, <i>by way of</i> mercy from Us, and as a reminder for men of understanding.[3412]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:85."
                },
                {
                    "ref": "3412",
                    "note": "<p><strong>Commentary:</strong></p><p>When, in obedience to Divine command, Job continued his journey, he not only found cool and refreshing water with which he washed himself and assuaged his thirst, he found also his family and the people from whom he had become separated.</p><p>It is also possible that on account of some skin disease from which he suffered, Job’s people might have left him.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 45,
        "v_": 44,
        "topics": [
            {
                "id": 3862,
                "topic": "Ayyub<sup>(as)</sup>: Job",
                "verses": "6:85, 4:164, 21:84-85"
            },
            {
                "id": 11967,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:47, 8:66-67, 10:90, 10:110, 11:12, 11:116, 12:91, 13:25, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:55, 28:81, 29:60, 32:25, 33:36, 34:20, 37:103, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            }
        ],
        "ar": "وَ خُذۡ بِیَدِکَ ضِغۡثًا  فَاضۡرِبۡ بِّہٖ وَ لَا تَحۡنَثۡ ؕ اِنَّا وَجَدۡنٰہُ صَابِرًا ؕ نِعۡمَ الۡعَبۡدُ ؕ اِنَّہٗۤ  اَوَّابٌ ﴿۴۵﴾ ",
        "ur": "اور خشک اور تر شاخوں کاگچھا اپنے ہاتھ میں لے اور اسی سے ضرب لگا اور (اپنی) قسم کو جھوٹا نہ کر۔ یقیناً ہم نے اسے بہت صبر کرنے والا پایا۔ کیا ہی اچھا بندہ تھا۔ یقیناً وہ بار بار عاجزی سے جھکنے والا تھا۔",
        "v5": {
            "text": "And <i>We said to him</i>, ‘Take in thy hand a handful of dry twigs and strike therewith, and break not thy oath.’ Indeed, We found him steadfast. An excellent servant was he. Surely, he was always turning <i>to God.</i>[3413]",
            "notes": [
                {
                    "ref": "3413",
                    "note": "<p><strong>Important Words:</strong></p><p>ضغثاً (a handful of dry twigs) is derived from ضغث (<i>daghatha</i>). They say ضغث الشیء i.e. he collected together the thing. ضغث الحدیث means, he related the tradition in a confused manner; ضغث also means, he uttered a cry. ضغث (<i>dighthun</i>) means, a handful of fresh or dry twigs; whatever is collected together and grasped with the hand; a bundle of rushes; what is confused and without truth or reality (Lane &amp; Aqrab).</p><p>لاتـحنث (break not thy oath) is derived from حنث which means, he said what was not true; he committed a sin or crime; he inclined towards what was false. حنث فی یمینه means, he broke or retracted his oath. حنث means, a sin or crime. بلغ الحنث means, he attained to the age when he was punishable for sin or disobedience (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>While in v. 43 Job was enjoined to urge his riding beast with his foot, in the present verse he is told to strike the beast with a bundle of twigs to make it run fast that he may be out of danger and reach a place of safety soon.</p><p>The words لاتـحنث mean, do not incline to falsehood, i.e. make no compromise with idol worship or polytheistic beliefs and remain steadfast in your belief in the Unity of God.</p><p>The expression لاتـحنث meaning, break not thy oath, the verse may also signify that as Job had become separated from his people, due to negligence on their part, he had vowed that he would punish the guilty for their negligence after he joined them. When, however, he was united with them he was told by God (as the verse shows) not to be severe on them in the hour of joy and thanks-giving and to fulfil his oath in a way which should cause least distress to them.</p><p>The implied reference in this and the preceding three verses seems to be to the separation of the Holy Prophet from his kith and kin by his migration to Medina, where after a few years not only were his own people united with him but he found many other most sincere and devoted followers—the Ansar. When even-tually he triumphed over his own people, he forgave them with a large-heartedness and magnanimity which has remained unequalled in the whole history of the world. This was all in harmony with the Divine plan that his resemblance with Job might be established.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 46,
        "v_": 45,
        "topics": [
            {
                "id": 224,
                "topic": "Abraham: <i>Ibrahim(as)</i>: an elect and a man of power and vision",
                "verses": null
            },
            {
                "id": 288,
                "topic": "Abraham: <i>Ibrahim(as)</i>: guided by and chosen of Allah",
                "verses": "2:131, 2:125, 16:122, 21:52, 21:74, 29:28"
            },
            {
                "id": 325,
                "topic": "Abraham: <i>Ibrahim(as)</i>: Prophethood among descendants of",
                "verses": "21:74, 29:28, 37:114, 57:27"
            },
            {
                "id": 9429,
                "topic": "Isaac: <i>Ishaq(as)</i>",
                "verses": "19:50-51, 2:134, 2:137, 4:164, 6:85, 11:72, 14:40, 15:54, 21:73-74, 29:28, 37:113-114, 51:29"
            },
            {
                "id": 9648,
                "topic": "Jacob: <i>Ya‘qub(as)</i>: Prophet",
                "verses": "2:137, 2:133, 2:134, 2:141, 4:164, 12:7, 19:50-51, 21:73-74"
            },
            {
                "id": 16548,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:82, 37:161, 38:18, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 66:11, 89:30"
            },
            {
                "id": 18303,
                "topic": "Vision: of Holy Prophet<sup>(sa)</sup>",
                "verses": "50:23, 48:28, 8:44, 17:2, 17:61, 48:2, 48:28, 53:14, 54:2"
            }
        ],
        "ar": "وَ اذۡکُرۡ عِبٰدَنَاۤ  اِبۡرٰہِیۡمَ وَ اِسۡحٰقَ وَ یَعۡقُوۡبَ اُولِی الۡاَیۡدِیۡ  وَ  الۡاَبۡصَارِ ﴿۴۶﴾ ",
        "ur": "اور یاد کر ہمارے بندوں ابراہیم اور اسحاق اور یعقوب کو جو بہت دسترس والے اور صاحب بصیرت تھے۔ ",
        "v5": {
            "text": "And remember Our servants Abraham, and Isaac, and Jacob, <i>men</i> of position and vision.[3414]",
            "notes": [
                {
                    "ref": "3414",
                    "note": "<p><strong>Important Words:</strong></p><p>ایدی (hands) is the plural of ید which means, benefit, bounty, favour; (2) power, influence; (3) assistance, help, protection, (4) troops, host, army; (5) possessions, wealth; (6) promise and (7) submission (Lane &amp; Aqrab). See also 5:65 &amp; 9:29.</p><p>ابصار (vision) is the plural of بصر which means, the eye, the sense of sight; knowledge; understanding; vision (Lane &amp; Aqrab). See also 2:8; 6:104.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 47,
        "v_": 46,
        "topics": [
            {
                "id": 288,
                "topic": "Abraham: <i>Ibrahim(as)</i>: guided by and chosen of Allah",
                "verses": "2:131, 2:125, 16:122, 21:52, 21:74, 29:28"
            },
            {
                "id": 325,
                "topic": "Abraham: <i>Ibrahim(as)</i>: Prophethood among descendants of",
                "verses": "21:74, 29:28, 37:114, 57:27"
            },
            {
                "id": 1283,
                "topic": "Allah: chooses His Messengers",
                "verses": "2:131, 2:106, 3:34, 3:75, 7:145, 12:7, 19:52, 19:59, 20:14, 20:123, 22:76, 27:60, 42:14, 68:51, 72:28"
            },
            {
                "id": 5689,
                "topic": "Darul-Akhirah: abode of Hereafter",
                "verses": "2:95, 6:33, 7:170, 12:110, 16:31, 28:78, 28:84, 29:65, 33:30"
            }
        ],
        "ar": "اِنَّاۤ  اَخۡلَصۡنٰہُمۡ بِخَالِصَۃٍ  ذِکۡرَی الدَّارِ ﴿ۚ۴۷﴾ ",
        "ur": "یقیناً ہم نے انہیں خالصۃً آخرت کے گھر کے ذکر کی وجہ سے چن لیا۔",
        "v5": {
            "text": "We chose them for a special <i>purpose</i>—reminding <i>people</i> of the abode <i>of the Hereafter</i>.",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 48,
        "v_": 47,
        "topics": [
            {
                "id": 288,
                "topic": "Abraham: <i>Ibrahim(as)</i>: guided by and chosen of Allah",
                "verses": "2:131, 2:125, 16:122, 21:52, 21:74, 29:28"
            },
            {
                "id": 325,
                "topic": "Abraham: <i>Ibrahim(as)</i>: Prophethood among descendants of",
                "verses": "21:74, 29:28, 37:114, 57:27"
            }
        ],
        "ar": "وَ اِنَّہُمۡ عِنۡدَنَا لَمِنَ الۡمُصۡطَفَیۡنَ الۡاَخۡیَارِ ﴿ؕ۴۸﴾ ",
        "ur": "اور یقیناً وہ ہمارے نزدیک ضرور چُنیدہ (اور) بہت خوبیوں والے لوگوں میں سے تھے۔",
        "v5": {
            "text": "And truly, they are in Our sight among the elect <i>and</i> the best.",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 49,
        "v_": 48,
        "topics": [
            {
                "id": 2549,
                "topic": "Al-Yasa‘: Elisha",
                "verses": "6:87"
            },
            {
                "id": 6384,
                "topic": "Dhul-Kifl",
                "verses": "21:86, 2:260"
            },
            {
                "id": 7099,
                "topic": "Elijah: <i>Ilyas(as)</i>",
                "verses": "37:124-133, 6:86"
            },
            {
                "id": 7100,
                "topic": "Elisha: <i>Alyasa‘<sup>(as)</sup></i>",
                "verses": "6:87"
            },
            {
                "id": 9443,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:101-108, 37:114"
            }
        ],
        "ar": "وَ اذۡکُرۡ  اِسۡمٰعِیۡلَ وَ الۡیَسَعَ وَ ذَاالۡکِفۡلِ ؕ وَ کُلٌّ  مِّنَ  الۡاَخۡیَارِ ﴿ؕ۴۹﴾ ",
        "ur": "اور اسماعیل کو بھی یاد کر اور اَلیَسَع کو اور ذُوالکفل کو اور وہ سب بہترین لوگوں میں سے تھے۔ ",
        "v5": {
            "text": "[a]And remember Ishmael and Elisha and Dhul-Kifl; they were all of the best.[3415]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:87; 21:86-87."
                },
                {
                    "ref": "3415",
                    "note": "<p><strong>Commentary:</strong></p><p>الیسع (Elisha) was the disciple and successor of Elijah. He lived from 928 B.C. to 838 B.C. See also 6:87.</p><p>ذوالکفل (Dhul-Kifl). The Prophet known by this name appears to be the Prophet Ezekiel who is called Dhul-Kifl by the Arabs. For a detailed note on Ezekiel, see 21:86.</p><p>اسماعیل (Ishmael), Prophet Abraham’s son from Hagar. He was the elder brother of Prophet Isaac and a progenitor of the Holy Prophet of Islam. See also 2:126.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 50,
        "v_": 49,
        "topics": [
            {
                "id": 6372,
                "topic": "Dhikr: Qur’an as, reminder",
                "verses": "38:2, 3:59, 6:91, 11:121, 15:7, 15:10, 16:45, 20:100, 21:25, 21:51, 29:52, 36:70, 37:4, 38:9, 38:88, 41:42, 43:45, 54:26, 65:11, 68:52-53, 74:32, 77:6, 81:28"
            },
            {
                "id": 6384,
                "topic": "Dhul-Kifl",
                "verses": "21:86, 2:260"
            },
            {
                "id": 6708,
                "topic": "Door: <i>Bab</i>",
                "verses": "78:20, 2:190, 7:41, 7:162, 12:24, 12:26, 13:24-25, 15:44-45, 16:30, 23:78, 39:72-73, 40:77, 43:35, 54:12, 57:14"
            },
            {
                "id": 13445,
                "topic": "Paradise: <i>Jannah</i>: believers who do good works will enter",
                "verses": "2:26, 2:83, 3:199, 4:58, 4:123, 4:125, 7:43, 10:10, 11:24, 14:24, 15:46, 16:31-32, 18:108, 19:61, 19:64, 20:76-77, 22:15, 22:24, 22:57, 25:16, 29:59, 30:16, 31:9, 32:20, 40:41, 42:23, 44:52-53, 47:13, 51:16, 54:55, 64:10, 65:12, 68:35, 85:12, 89:29-31, 98:8-9"
            },
            {
                "id": 13498,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13563,
                "topic": "Paradise: <i>Jannah</i>: <i>Jannate ‘Adn</i>",
                "verses": "9:72, 13:24, 16:32, 18:32, 19:62, 20:77, 35:34, 40:9, 61:13, 98:9"
            },
            {
                "id": 15861,
                "topic": "Righteous: <i>Salihin</i>: rewarded",
                "verses": "13:36, 3:126, 3:134-135, 3:173, 3:180, 7:157, 7:170-171, 7:197, 9:4, 9:123, 11:116, 15:46, 16:32, 19:86, 22:24, 25:16, 25:71, 26:91, 29:8, 29:10, 29:28, 29:59, 30:16, 30:45-46, 34:5, 35:8, 39:62, 39:74-75, 41:9, 41:19, 43:36, 44:52-57, 45:20, 45:31, 47:3, 47:16, 47:18, 47:37, 49:4, 50:32, 51:16, 52:18, 54:55, 64:10, 65:12, 68:51, 77:42, 78:32-37, 83:23, 98:8"
            }
        ],
        "ar": "ہٰذَا  ذِکۡرٌ ؕ وَ  اِنَّ  لِلۡمُتَّقِیۡنَ لَحُسۡنَ مَاٰبٍ ﴿ۙ۵۰﴾ ",
        "ur": "یہ ایک عظیم ذکر ہے اور یقیناً متقیوں کے لئے بہت اچھا ٹھکانا ہوگا۔ ",
        "v5": {
            "text": "This is a reminder. And the righteous will surely have excellent retreat—",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 51,
        "v_": 50,
        "topics": [
            {
                "id": 6708,
                "topic": "Door: <i>Bab</i>",
                "verses": "78:20, 2:190, 7:41, 7:162, 12:24, 12:26, 13:24-25, 15:44-45, 16:30, 23:78, 39:72-73, 40:77, 43:35, 54:12, 57:14"
            },
            {
                "id": 13445,
                "topic": "Paradise: <i>Jannah</i>: believers who do good works will enter",
                "verses": "2:26, 2:83, 3:199, 4:58, 4:123, 4:125, 7:43, 10:10, 11:24, 14:24, 15:46, 16:31-32, 18:108, 19:61, 19:64, 20:76-77, 22:15, 22:24, 22:57, 25:16, 29:59, 30:16, 31:9, 32:20, 40:41, 42:23, 44:52-53, 47:13, 51:16, 54:55, 64:10, 65:12, 68:35, 85:12, 89:29-31, 98:8-9"
            },
            {
                "id": 13498,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13563,
                "topic": "Paradise: <i>Jannah</i>: <i>Jannate ‘Adn</i>",
                "verses": "9:72, 13:24, 16:32, 18:32, 19:62, 20:77, 35:34, 40:9, 61:13, 98:9"
            }
        ],
        "ar": "جَنّٰتِ عَدۡنٍ مُّفَتَّحَۃً  لَّہُمُ  الۡاَبۡوَابُ ﴿ۚ۵۱﴾ ",
        "ur": "یعنی ہمیشہ کے باغات ہونگے۔ اُن کی خاطر دروازے اچھی طرح کھلے رکھے جائیں گے۔",
        "v5": {
            "text": "Gardens of Eternity, with <i>their</i> gates thrown open to them,",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 52,
        "v_": 51,
        "topics": [
            {
                "id": 6789,
                "topic": "Drinks",
                "verses": "2:61, 2:188, 2:250, 2:260, 6:71, 7:32, 9:19, 10:5, 12:42, 14:17, 15:23, 16:11, 16:67-68, 18:30, 19:27, 23:34, 25:50, 26:80, 35:13, 38:43, 47:16, 52:20, 56:55-56, 56:69, 69:25, 72:17, 76:6, 76:18, 76:22, 77:28, 77:44, 78:25, 83:26, 88:6"
            },
            {
                "id": 13498,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            }
        ],
        "ar": "مُتَّکِـِٕیۡنَ  فِیۡہَا یَدۡعُوۡنَ فِیۡہَا بِفَاکِہَۃٍ  کَثِیۡرَۃٍ   وَّ  شَرَابٍ ﴿۵۲﴾ ",
        "ur": "اُن میں وہ تکیوں پر ٹیک لگائے ہوئے ہوں گے (اور) وہاں بکثرت طرح طرح کے میوے اور مشروب طلب کر رہے ہوں گے۔",
        "v5": {
            "text": "[a]Reclining therein <i>on cushions;</i> they will therein call <i>at pleasure</i> for plenteous fruit and drink.",
            "notes": [
                {
                    "ref": "a",
                    "note": "18:32; 36:57; 83:24."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 53,
        "v_": 52,
        "topics": [
            {
                "id": 6747,
                "topic": "Downcast",
                "verses": "88:3"
            },
            {
                "id": 13462,
                "topic": "Paradise: <i>Jannah</i>: chaste companions in",
                "verses": "2:26, 3:16, 36:57, 37:49-50, 44:55, 52:21, 52:25, 55:57, 55:59, 55:71, 55:73, 55:75, 56:18, 56:23-24, 56:35-38, 76:20, 78:34"
            },
            {
                "id": 13498,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            }
        ],
        "ar": "وَ عِنۡدَہُمۡ  قٰصِرٰتُ الطَّرۡفِ  اَتۡرَابٌ ﴿۵۳﴾ ",
        "ur": "اور ان کے پاس (حیادار) نظریں جھکائے رکھنے والی ہمجولیاں ہوں گی۔",
        "v5": {
            "text": "And with them will be [b]<i>chaste women</i>, restraining their looks, companions of equal age.[3416]",
            "notes": [
                {
                    "ref": "b",
                    "note": "55:57."
                },
                {
                    "ref": "3416",
                    "note": "<p><strong>Important Words:</strong></p><p>اتراب (companions of equal age) is the plural of ترب (<i>tirbun</i>) which means, one born at the same time with another; a contemporary in birth, an equal in age; a match, a peer (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The present and preceding two verses embody a complete picture of the material benefits and blessings which are bestowed upon believers in this very life and thus furnish a proof that they will also have the blessings promised to them in the life to come.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 54,
        "v_": 53,
        "topics": [
            {
                "id": 5806,
                "topic": "Day of Reckoning: <i>Yaumul-Hisab</i>",
                "verses": "38:17, 14:42, 38:27, 39:25, 39:60, 40:28, 46:21, 58:19, 78:4, 80:37, 83:6, 111:4"
            },
            {
                "id": 12890,
                "topic": "Nations",
                "verses": "11:102, 2:245, 2:262, 2:270, 3:27-28, 3:140, 7:35, 10:25, 17:17, 21:97, 21:105, 23:81, 29:21, 29:25, 31:30, 35:10, 36:69, 83:2-6, 90:14-18, 103:2-4, 111:5-6"
            },
            {
                "id": 14311,
                "topic": "Promise: of Allah",
                "verses": "24:56, 2:269, 3:153, 4:96, 5:10, 8:8, 9:72, 9:111, 13:36, 18:49, 19:62, 19:88, 21:102, 21:104-105, 23:36, 25:16-17, 28:62, 30:7, 33:23, 34:31, 39:75, 41:31, 46:17, 47:16, 48:22, 48:30, 50:33, 51:23, 57:11, 85:3"
            }
        ],
        "ar": "ہٰذَا مَا تُوۡعَدُوۡنَ  لِیَوۡمِ الۡحِسَابِ ﴿ؓ۵۴﴾  ",
        "ur": "یہ ہے وہ جس کا حساب کے دن کے لئے تم وعدہ دیئے جاتے ہو۔",
        "v5": {
            "text": "This is what you are promised for the Day of Reckoning.[3417]",
            "notes": [
                {
                    "ref": "3417",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, \"the Day of Reckoning,\" besides referring to the Day of Judgement, here also mean, \"the day of national reckoning\" when a whole people become deserving of reward or Divine punishment according to their deeds and actions. A day of reckoning comes to every individual, community, and nation in this very life.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 55,
        "v_": 54,
        "topics": [
            {
                "id": 14676,
                "topic": "Provisions: spiritual",
                "verses": "20:132, 2:198, 37:42, 51:58, 65:12"
            }
        ],
        "ar": "اِنَّ  ہٰذَا  لَرِزۡقُنَا مَا  لَہٗ  مِنۡ  نَّفَادٍ  ﴿ۚۖ۵۵﴾",
        "ur": "یقیناً یہ ہمارا رزق ہے۔ اُس کا ختم ہوجانا ممکن نہیں۔",
        "v5": {
            "text": "Verily, this is Our provision which will never be exhausted.[3418]",
            "notes": [
                {
                    "ref": "3418",
                    "note": "<p><strong>Important Words:</strong></p><p>نفاد (exhaustion) is derived from نفد which means, it came to an end, it became spent or exhausted. They say, نفد زاد القوم i.e. the provision of the people became exhausted. أنفدت البئر means, the well lost its water. نفاد means, wasting away; getting exhausted; ceasing; destruction (Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 56,
        "v_": 55,
        "topics": [
            {
                "id": 8784,
                "topic": "Hell: <i>Jahannam</i>: for those who disobey Allah, for evil-doers",
                "verses": "19:69, 10:28, 2:82, 2:276, 3:182, 4:11, 4:94, 4:116, 8:38, 11:17, 11:107, 13:26, 14:16-17, 16:30, 17:19, 19:87, 20:75, 21:99, 23:104-105, 27:91, 39:61, 39:73, 40:44, 40:77, 43:75, 50:25-26, 54:48-49, 55:44, 71:26, 72:16, 82:15, 85:11, 92:15-16, 101:9-10, 104:3"
            }
        ],
        "ar": "ہٰذَا ؕ وَ  اِنَّ  لِلطّٰغِیۡنَ  لَشَرَّ  مَاٰبٍ ﴿ۙ۵۶﴾ ",
        "ur": "یہی ہوگا۔ اور یقیناً سرکشوں کے لئے ضرور سب سے بُری لَوٹنے کی جگہ ہے۔",
        "v5": {
            "text": "This is <i>for the believers</i>. [c]But for the rebellious there is an evil place of return—",
            "notes": [
                {
                    "ref": "c",
                    "note": "78:22-23."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 57,
        "v_": 56,
        "topics": [
            {
                "id": 5393,
                "topic": "Cradle: <i>Mahd</i>, bed, resting place",
                "verses": "3:47, 2:207, 5:111, 7:42, 13:19, 19:30, 20:54, 43:11, 78:7"
            },
            {
                "id": 8784,
                "topic": "Hell: <i>Jahannam</i>: for those who disobey Allah, for evil-doers",
                "verses": "19:69, 10:28, 2:82, 2:276, 3:182, 4:11, 4:94, 4:116, 8:38, 11:17, 11:107, 13:26, 14:16-17, 16:30, 17:19, 19:87, 20:75, 21:99, 23:104-105, 27:91, 39:61, 39:73, 40:44, 40:77, 43:75, 50:25-26, 54:48-49, 55:44, 71:26, 72:16, 82:15, 85:11, 92:15-16, 101:9-10, 104:3"
            }
        ],
        "ar": "جَہَنَّمَ ۚ یَصۡلَوۡنَہَا ۚ فَبِئۡسَ الۡمِہَادُ ﴿۵۷﴾ ",
        "ur": "جہنّم۔ وہ اس میں داخل ہوں گے۔ پس کیا ہی بُرا بچھونا ہے۔",
        "v5": {
            "text": "Hell, wherein they will burn. What an evil resting-place!",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 58,
        "v_": 57,
        "topics": [
            {
                "id": 7944,
                "topic": "Ghassaq: stinking",
                "verses": "78:26"
            },
            {
                "id": 8688,
                "topic": "Hell: <i>Jahannam</i>: conditions in",
                "verses": "19:69, 17:98, 3:107, 3:182, 6:71, 8:51, 10:28, 11:107, 14:17, 14:51, 15:45, 16:30, 18:30, 18:101, 19:72, 21:40, 21:101, 22:20-23, 23:105, 25:35, 26:92, 27:91, 32:21, 37:63, 39:61, 39:72-73, 40:72-73, 44:44-47, 44:49, 47:16, 54:49, 55:45, 56:43-45, 56:53-55, 56:94, 67:8, 67:28, 69:33, 69:37, 76:5, 78:25-26, 88:6-8, 102:7"
            },
            {
                "id": 18446,
                "topic": "Water: <i>Ma’</i>: as punishment",
                "verses": "6:71, 7:51, 10:5, 14:17, 22:20, 37:68, 40:73, 44:47, 44:49, 47:16, 56:43, 56:55, 56:94, 78:26"
            },
            {
                "id": 18483,
                "topic": "Water: <i>Ma’</i>: sent from heaven",
                "verses": "16:11-12, 2:23, 2:165, 6:100, 7:58, 8:12, 10:25, 13:18, 14:33, 15:23, 16:66, 18:46, 22:6, 22:64, 23:19, 27:61, 30:25, 32:28, 35:28, 37:68, 39:22, 41:40, 43:12, 50:10, 55:45, 78:15, 88:6"
            }
        ],
        "ar": "ہٰذَا ۙ فَلۡیَذُوۡقُوۡہُ حَمِیۡمٌ  وَّ غَسَّاقٌ ﴿ۙ۵۸﴾ ",
        "ur": "یہ ضرور ہوگا۔ پس وہ اسے چکھیں (یعنی) کھولتا ہوا اور یخ بستہ پانی۔ ",
        "v5": {
            "text": "This is <i>what they will have</i>. So let them taste it—[a]a boiling fluid, and an intensely cold and stinking drink.[3419]",
            "notes": [
                {
                    "ref": "a",
                    "note": "78:26."
                },
                {
                    "ref": "3419",
                    "note": "<p><strong>Important Words:</strong></p><p>غساق (intensely cold and stinking drink) is derived from غسق. They say غسق اللیل i.e. the night became intensely dark. غسقت عیناہ (means, his eyes shed tears. غساق means, the ichor or watery matter and thick purulent matter that will flow and drip from the skins of the inmates of Hell, or the washings of them or their tears; intensely cold; cold and stinking (Lane). See also 17:79.</p><p><strong>Commentary:</strong></p><p>The inmates of Hell will be made to drink intensely hot or intensely cold water. As they did not make proper use of their God-given faculties and went to extremes in using them and did not follow the golden mean, so they will be made to drink extremely hot or extremely cold water.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 59,
        "v_": 58,
        "topics": [],
        "ar": "وَّ اٰخَرُ  مِنۡ شَکۡلِہٖۤ  اَزۡوَاجٌ ﴿ؕ۵۹﴾ ",
        "ur": "اور دوسری بھی اُس سے ملتی جلتی چیزیں ہوں گی۔",
        "v5": {
            "text": "And <i>various kinds of</i> other <i>torments</i> of a similar nature.[3419A]",
            "notes": [
                {
                    "ref": "3419A",
                    "note": "<p><strong>Commentary:</strong></p><p>Besides the meaning given in the text, the verse may also mean, \"And like them there will be other groups with similar records.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 60,
        "v_": 59,
        "topics": [
            {
                "id": 8722,
                "topic": "Hell: <i>Jahannam</i>: for disbelievers, hypocrites, idolaters",
                "verses": "19:69, 29:55, 2:25, 2:40, 2:127, 2:258, 3:11, 3:13, 3:132, 4:141, 4:146, 5:73, 8:37, 19:87, 25:12, 41:20, 44:48, 67:7, 78:22, 79:37, 83:16-18, 88:5, 89:24, 98:7"
            }
        ],
        "ar": "ہٰذَا فَوۡجٌ مُّقۡتَحِمٌ  مَّعَکُمۡ ۚ لَا مَرۡحَبًۢا بِہِمۡ ؕ اِنَّہُمۡ صَالُوا النَّارِ ﴿۶۰﴾ ",
        "ur": "یہ وہ لشکر ہے جو تمہارے ساتھ (اس میں) داخل ہونے والا ہے۔ ان کے لئے کوئی مرحبا نہیں۔ یقیناً وہ آگ میں داخل ہونے والے ہیں۔ ",
        "v5": {
            "text": "‘This is a host <i>of yours</i> [b]rushing headlong with you, <i>O leaders of mischief</i>.’ No welcome for them. They must burn in the Fire.[3420]",
            "notes": [
                {
                    "ref": "3420",
                    "note": "<p><strong>Important Words:</strong></p><p>مقتحم (rushing headlong) is derived from قحم. They say قحم فی الامر i.e. he entered into the affair without consideration. اقتحم الامر means, he threw himself into the affair with vehemence and difficulty.</p><p><strong>Commentary:</strong></p><p>When leaders of disbelief will go to Hell, they will be told that a host of their followers will also enter into fire along with them. As the latter rushed to follow their leaders blindly and unthinkingly rejecting truth, so they will enter Hell rushing headlong.</p><p>The words لامرحباً بھم (no welcome for them) may be taken as having been spoken by the angels in charge of Hell or by the leaders of disbelief who would already be in Hell.</p>"
                },
                {
                    "ref": "b",
                    "note": "18:54; 21:40; 52:14."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 61,
        "v_": 60,
        "topics": [
            {
                "id": 10845,
                "topic": "Man: nature of, <i>Fitrah</i>",
                "verses": "30:31, 4:29, 10:13, 11:10-11, 14:35, 16:5, 17:12, 17:68-70, 17:101, 18:55, 21:38, 22:6, 22:67, 23:78-79, 25:51, 30:37, 31:7-8, 31:22, 33:73, 34:32, 36:78-79, 39:50, 40:11, 41:50-52, 42:49, 43:16, 57:9, 70:20-22, 75:21, 80:18, 89:16-21, 90:5, 91:8-9, 95:5, 96:7-8, 100:7, 100:9, 103:3-4"
            }
        ],
        "ar": "قَالُوۡا بَلۡ  اَنۡتُمۡ ۟ لَا مَرۡحَبًۢا بِکُمۡ ؕ اَنۡتُمۡ  قَدَّمۡتُمُوۡہُ   لَنَا ۚ فَبِئۡسَ الۡقَرَارُ ﴿۶۱﴾ ",
        "ur": "وہ (لعنت ڈالنے والے گروہ سے) کہیں گے بلکہ تم ہی (ملعون) ہو، تمہارے لئے کوئی مرحبا نہیں، تم ہی ہو جنہوں نے ہمارے لئے یہ کچھ آگے بھیجا ہے۔ پس کیا ہی بُری قرار کی جگہ ہے۔ ",
        "v5": {
            "text": "They will say, ‘Nay, it is you. No welcome for you <i>in truth</i>. It is you who prepared this for us. What an evil resting-place it is!’[3421]",
            "notes": [
                {
                    "ref": "3421",
                    "note": "<p><strong>Commentary:</strong></p><p>The words of this verse seem to have been spoken against the leaders of disbelief by their blind followers. Both the leaders and the led will curse one another. It is human nature that when man is confronted with the evil consequences of his deeds, he tries to shift the blame to others. This is exactly what the guilty people generally do when they find themselves face to face with the dreadful results of their wicked deeds.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 62,
        "v_": 61,
        "topics": [],
        "ar": "قَالُوۡا رَبَّنَا مَنۡ قَدَّمَ لَنَا ہٰذَا فَزِدۡہُ عَذَابًا ضِعۡفًا فِی النَّارِ ﴿۶۲﴾ ",
        "ur": "وہ کہیں گے اے ہمارے ربّ! جس نے ہمارے لئے یہ آگے بھیجا اسے آگ میں دُہرا عذاب دے۔ ",
        "v5": {
            "text": "They will <i>also</i> say, ‘Our Lord, whosoever prepared this for us—so [a]add to him a double punishment in the Fire.’[3422]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:39."
                },
                {
                    "ref": "3422",
                    "note": "<p><strong>Commentary:</strong></p><p>The followers of the leaders of disbelief will invoke the curse of God upon the heads of their erstwhile leaders.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 63,
        "v_": 62,
        "topics": [
            {
                "id": 18611,
                "topic": "Wicked: <i>Fujjar</i>, <i>Fasiq</i>, <i>Ashrar</i>, <i>Mufsid</i>, <i>Khabith</i>",
                "verses": "83:8, 6:124, 19:29, 21:75, 21:78, 29:31, 43:55, 92:16"
            }
        ],
        "ar": "وَ قَالُوۡا مَا لَنَا لَا نَرٰی رِجَالًا کُنَّا نَعُدُّہُمۡ مِّنَ الۡاَشۡرَارِ ﴿ؕ۶۳﴾ ",
        "ur": "اور وہ کہیں گے ہمیں کیا ہوا ہے کہ ہم ان لوگوں کو نہیں دیکھ رہے جنہیں ہم شریروں میں شما ر کیا کرتے تھے۔",
        "v5": {
            "text": "And they will say, ‘What has happened to us that we see not the men whom we used to reckon among the wicked?[3423]",
            "notes": [
                {
                    "ref": "3423",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference in the word \"the men\" is to the believers.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 64,
        "v_": 63,
        "topics": [],
        "ar": "اَتَّخَذۡنٰہُمۡ سِخۡرِیًّا  اَمۡ  زَاغَتۡ عَنۡہُمُ الۡاَبۡصَارُ ﴿۶۴﴾ ",
        "ur": "کیا ہم نے انہیں حقیر سمجھ رکھا تھا یا اُن (کی پہچان) سے ہماری نظریں چُوک گئیں؟ ",
        "v5": {
            "text": "Is it because we <i>unjustly</i> took them for a laughing stock or have the eyes missed them?’[3424]",
            "notes": [
                {
                    "ref": "3424",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that the inmates of Hell will say to one another, \"What is the matter with us that we do not see here those men whom we looked down upon as of no consequence and whom we mocked and ridiculed in the earthly life. Did they not deserve our ridicule and were really good and godly men or are they in Hell but we do not see them?\"</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 65,
        "v_": 64,
        "topics": [],
        "ar": "اِنَّ  ذٰلِکَ  لَحَقٌّ  تَخَاصُمُ   اَہۡلِ النَّارِ ﴿٪۶۵﴾ ",
        "ur": "یقیناً یہ آ گ والوں کا باہمی جھگڑنا حق ہے۔",
        "v5": {
            "text": "Surely, this is a fact—[a]the disputing together of the people of the Fire.",
            "notes": [
                {
                    "ref": "a",
                    "note": "34:32; 40:48."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 66,
        "v_": 65,
        "topics": [
            {
                "id": 3468,
                "topic": "Attributes of Allah: Al-Qahhar (Most Supreme)",
                "verses": "12:40, 6:19, 13:17, 14:49, 39:5, 40:17"
            },
            {
                "id": 3642,
                "topic": "Attributes of Allah: Al-Wahid (The One)",
                "verses": "13:17, 2:134, 2:164, 5:74, 9:31, 16:23, 18:111, 22:35, 37:5, 39:5, 112:2"
            }
        ],
        "ar": "قُلۡ  اِنَّمَاۤ  اَنَا مُنۡذِرٌ ٭ۖ وَّ مَا مِنۡ  اِلٰہٍ   اِلَّا اللّٰہُ  الۡوَاحِدُ  الۡقَہَّارُ ﴿ۚ۶۶﴾ ",
        "ur": "تو کہہ دے میں تو محض ایک ڈرانے والا ہوں اور کوئی معبود نہیں مگر اللہ جو واحد (اور) صاحبِ جبروت ہے۔",
        "v5": {
            "text": "Say, ‘I am only a Warner; and there is no God but Allah, the One, the Most Supreme.[3425]",
            "notes": [
                {
                    "ref": "3425",
                    "note": "<p><strong>Commentary:</strong></p><p>After having briefly referred to some of the Prophets who had to suffer great hardships at the hands of their enemies and who endured those hardships with great patience and fortitude and also after having dealt with the subject that opposition to God’s Messengers never goes unpunished and their acceptance unrewarded, the <i>Surah</i> towards its close reverts (as is the invariable rule in the Quran) to the main subject with which it had opened, namely, the subject of Divine Unity. The Holy Prophet is enjoined to tell disbelievers that from the accounts of the life of Divine Messengers, mentioned in the preceding verses, they must have realized that God is One and that He is the Almighty and the Most Supreme and that it is to preach and establish His Unity in the world that the Holy Prophet has been sent.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 67,
        "v_": 66,
        "topics": [
            {
                "id": 3078,
                "topic": "Attributes of Allah: Al-‘Aziz (The Mighty)",
                "verses": "4:57, 2:130, 2:210, 2:221, 2:229, 3:7, 3:19, 4:159, 4:166, 9:40, 9:71, 14:2, 16:61, 22:41, 22:75, 26:192, 27:10, 27:79, 33:26, 34:7, 35:29, 38:10, 40:3, 45:3, 46:3, 48:8, 48:20, 59:2, 59:24, 61:2, 62:2, 64:19"
            },
            {
                "id": 3138,
                "topic": "Attributes of Allah: Al-Ghaffar (Great Forgiver)",
                "verses": "20:83, 39:6, 40:43, 71:11"
            },
            {
                "id": 3814,
                "topic": "Attributes of Allah: Rabbus-Samawate wal-Ard (Lord of Heavens &amp; earth)",
                "verses": "19:66, 13:17, 17:103, 18:15, 21:57, 26:25, 37:6, 43:83, 44:8, 45:37, 51:24, 78:38"
            }
        ],
        "ar": "رَبُّ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ مَا بَیۡنَہُمَا الۡعَزِیۡزُ  الۡغَفَّارُ ﴿۶۷﴾ ",
        "ur": " آسمانوں اور زمین کا ربّ اور اُس کا جو اِن دونوں کے درمیان ہے۔ کامل غلبہ والا (اور) بہت بخشنے والا ہے۔",
        "v5": {
            "text": "The Lord of the heavens and the earth, and all that is between the two, the Mighty, the Great Forgiver.’",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 68,
        "v_": 67,
        "topics": [],
        "ar": "قُلۡ ہُوَ  نَبَؤٌا عَظِیۡمٌ ﴿ۙ۶۸﴾ ",
        "ur": "تو کہہ دے یہ ایک بہت بڑی خبر ہے۔",
        "v5": {
            "text": "Say, ‘It is a big news,[3426]",
            "notes": [
                {
                    "ref": "3426",
                    "note": "<p><strong>Important Words:</strong></p><p>نبأ (big news) is infinitive noun from نبأ (<i>naba’a</i>). أنبأہ إیاہ means, he informed him or it. نبأ means, a piece of information; an announcement; or an announcement of great importance from which results great knowledge; message; news; or news which fills the heart of a person with fear (Aqrab &amp; Lane). See also 6:6.</p><p><strong>Commentary:</strong></p><p>\"The big news\" may refer to the great event of the revelation of the Quran and the advent of the Holy Prophet.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 69,
        "v_": 68,
        "topics": [],
        "ar": "اَنۡتُمۡ عَنۡہُ  مُعۡرِضُوۡنَ ﴿۶۹﴾ ",
        "ur": "تم اس سے اِعراض کررہے ہو۔",
        "v5": {
            "text": "‘From which you are turning away.",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 70,
        "v_": 69,
        "topics": [
            {
                "id": 2591,
                "topic": "Angels: <i>Mala’ikah</i>: exalted assembly",
                "verses": null
            },
            {
                "id": 6212,
                "topic": "Debate",
                "verses": "37:2-5, 2:112, 3:62, 10:51, 16:126, 22:68, 25:53, 29:47, 103:4"
            },
            {
                "id": 9372,
                "topic": "Intention: <i>Niyyah, Ikhlas</i>",
                "verses": "39:15, 2:140, 2:197, 2:226, 2:287, 4:13, 7:30, 10:23, 29:66, 31:33, 39:3, 39:12, 40:15, 40:66, 98:6"
            },
            {
                "id": 10250,
                "topic": "Knowledge: <i>‘Ilm</i>: and Holy Prophet<sup>(sa)</sup>",
                "verses": "7:158, 3:62, 29:49, 53:15, 67:27"
            }
        ],
        "ar": "مَا کَانَ لِیَ مِنۡ عِلۡمٍۭ  بِالۡمَلَاِ الۡاَعۡلٰۤی  اِذۡ یَخۡتَصِمُوۡنَ ﴿۷۰﴾ ",
        "ur": "مجھے ملاءاعلیٰ کا کوئی علم نہیں تھا جب وہ بحث کر رہے تھے۔",
        "v5": {
            "text": "I had no knowledge of the exalted Assembly when they discussed <i>the matter</i> among themselves,[3427]",
            "notes": [
                {
                    "ref": "3427",
                    "note": "<p><strong>Commentary:</strong></p><p>It appears from 2:30 and from the Hadith that when God decrees to raise a Prophet in the world, He discloses His intention to those angels who are nearest to Him. They discuss this affair of the highest import among themselves. These angels are referred to as \"the exalted assembly\" in the verse under comment. The Holy Prophet is represented as saying that he had no knowledge of what was being discussed and debated in heavens about his being entrusted with a great divine mission.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 71,
        "v_": 70,
        "topics": [
            {
                "id": 12377,
                "topic": "Muhammad<sup>(sa)</sup>: a warner",
                "verses": "35:24-25, 7:189, 10:3, 11:13, 18:5, 25:2, 32:4, 33:46, 34:29, 34:47, 36:7, 38:5, 46:10, 48:9"
            },
            {
                "id": 12655,
                "topic": "Muhammad<sup>(sa)</sup>: revelations",
                "verses": "53:3-13, 2:100, 3:45, 4:164, 5:68, 6:20, 10:3, 11:13, 12:4, 13:31, 14:5, 16:124, 17:40, 18:28, 21:109, 29:46, 34:51, 35:32, 42:4"
            },
            {
                "id": 15684,
                "topic": "Revelation: to Holy Prophet<sup>(sa)</sup>",
                "verses": "3:45, 6:20, 6:51, 7:204, 10:3, 11:13, 12:4, 13:31, 16:124, 18:28, 20:115, 21:46, 29:46, 33:3, 34:51, 35:32, 39:66, 41:7, 42:4, 42:53, 43:44, 46:10, 53:5, 72:2"
            },
            {
                "id": 18434,
                "topic": "Warner: <i>Nadhir</i>",
                "verses": "35:24-25, 2:120, 2:214, 4:166, 5:20, 7:185, 7:189, 11:3, 11:13, 11:26, 15:90, 17:106, 22:50, 25:2, 25:8, 25:52, 25:57, 26:115-116, 27:93, 28:47, 29:51, 32:4, 33:46, 34:29, 34:35, 34:47, 35:38, 35:43, 41:5, 46:10, 48:9, 51:51, 53:57, 67:9-10, 67:27, 71:3"
            }
        ],
        "ar": "اِنۡ یُّوۡحٰۤی اِلَیَّ  اِلَّاۤ  اَنَّمَاۤ  اَنَا نَذِیۡرٌ  مُّبِیۡنٌ ﴿۷۱﴾ ",
        "ur": "مجھے تو محض یہ وحی کی جاتی ہے کہ میں ایک کھلا کھلا ڈرانے والا ہوں۔",
        "v5": {
            "text": "But this that it has been revealed to me, that I am a plain Warner.’",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 72,
        "v_": 71,
        "topics": [
            {
                "id": 622,
                "topic": "Adam: <i>Adam(as)</i>: creation of",
                "verses": "3:60, 7:13, 15:29, 17:62"
            },
            {
                "id": 1359,
                "topic": "Allah: created you",
                "verses": "30:41, 2:22, 2:30, 4:2, 6:103, 7:190, 13:17, 15:29, 15:86, 16:73, 20:56, 21:17, 21:34, 23:13-15, 23:18, 24:46, 27:65, 30:21-22, 35:4, 36:37, 39:7, 41:10, 43:13, 46:4, 50:17, 53:46, 55:4, 55:15-16, 59:25, 67:3, 71:15, 87:3, 92:4, 96:3"
            },
            {
                "id": 4160,
                "topic": "Bashr: mortal: created from clay",
                "verses": "25:55, 30:21, 3:60, 15:29, 15:34, 18:38, 22:6, 35:12, 40:68"
            },
            {
                "id": 5117,
                "topic": "Clay: Tin, <i>Sijjil</i>",
                "verses": "23:13, 3:50, 5:111, 6:3, 7:13, 11:83, 15:75, 17:62, 28:39, 32:8, 37:12, 38:77, 51:34, 105:5"
            },
            {
                "id": 5402,
                "topic": "Creation: <i>Khalq</i>: from clay",
                "verses": "23:13, 6:3, 17:62, 32:8, 37:12"
            },
            {
                "id": 10786,
                "topic": "Man: creation of",
                "verses": "23:13-15, 3:7, 3:60, 4:2, 6:3, 7:12-13, 15:27, 15:29-30, 15:34, 16:5, 18:38, 22:6, 25:55, 30:21, 32:8-10, 35:12, 36:78, 37:12, 39:7, 40:68, 49:14, 53:47, 55:15, 71:15, 71:18, 75:38-40, 76:3, 77:21-24, 86:7, 87:3, 95:5-6, 96:3"
            }
        ],
        "ar": "اِذۡ قَالَ رَبُّکَ لِلۡمَلٰٓئِکَۃِ  اِنِّیۡ خَالِقٌۢ  بَشَرًا مِّنۡ طِیۡنٍ ﴿۷۲﴾ ",
        "ur": "جب تیرے ربّ نے فرشتوں سے کہا یقیناً میں مٹی سے بشر پیدا کرنے والا ہوں۔",
        "v5": {
            "text": "[a]<i>Remember</i> when thy Lord said to the angels, ‘I am about to create man from clay;[3428]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:35; 7:12-13; 15:29-33; 17:62; 18:51."
                },
                {
                    "ref": "3428",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse refers to God’s intention which He disclosed to \"the exalted Assembly\" of the select angels and which the angels had been discussing, as mentioned in verse 70 above. Verses 72-86, however, may apply equally to every Prophet, but they have particular application to the Holy Prophet Muhammad. This and the next verse purport to say that when a Prophet is raised in the world, angels are commanded to help him in the furtherance of his cause and to render null and void all the schemes and machinations of his enemies. See also 15:29-45.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 73,
        "v_": 72,
        "topics": [
            {
                "id": 610,
                "topic": "Adam: <i>Adam(as)</i>: angels submit to",
                "verses": "2:35, 7:12, 15:30, 17:62, 18:51, 20:117"
            },
            {
                "id": 2629,
                "topic": "Angels: <i>Mala’ikah</i>: Recording, Guardian",
                "verses": "2:35, 7:12, 17:62, 18:51, 20:117"
            },
            {
                "id": 10881,
                "topic": "Man: perfection in",
                "verses": "55:4, 15:30, 32:10, 95:5"
            },
            {
                "id": 17020,
                "topic": "Soul: <i>Ruh</i>, spirit: Allah breaths",
                "verses": "4:172, 66:13, 4:172, 15:30, 21:92, 32:10"
            }
        ],
        "ar": "فَاِذَا سَوَّیۡتُہٗ وَ نَفَخۡتُ فِیۡہِ مِنۡ رُّوۡحِیۡ فَقَعُوۡا  لَہٗ   سٰجِدِیۡنَ ﴿۷۳﴾   ",
        "ur": "پس جب میں اسے ٹھیک ٹھاک کر لوں اور اس میں اپنی روح میں سے کچھ پھونک دوں تو اس کے سامنے سجدہ کرتے ہوئے گِر پڑو۔",
        "v5": {
            "text": "[b]And so when I have fashioned him <i>in perfection</i>, and have breathed into him of My Spirit, fall ye down in submission to him.’[3429]",
            "notes": [
                {
                    "ref": "b",
                    "note": "15:30; 32:10."
                },
                {
                    "ref": "3429",
                    "note": "<p><strong>Commentary:</strong></p><p>This and the next verse mean to say that when a Messenger is entrusted with his great mission, and Divine revelation descends on him, angels begin to help him in his great mission. Or they may mean that men of angelic nature accept his lead and help to spread his Message.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 74,
        "v_": 73,
        "topics": [
            {
                "id": 610,
                "topic": "Adam: <i>Adam(as)</i>: angels submit to",
                "verses": "2:35, 7:12, 15:30, 17:62, 18:51, 20:117"
            },
            {
                "id": 632,
                "topic": "Adam: <i>Adam(as)</i>: <i>Iblis</i> refused to submit to",
                "verses": "7:12, 2:35, 15:31-32, 17:62, 18:51, 20:117"
            },
            {
                "id": 2588,
                "topic": "Angels: <i>Mala’ikah</i>: duties of",
                "verses": "16:3, 6:112, 13:12, 15:9, 35:2, 39:76, 42:6"
            },
            {
                "id": 2629,
                "topic": "Angels: <i>Mala’ikah</i>: Recording, Guardian",
                "verses": "2:35, 7:12, 17:62, 18:51, 20:117"
            },
            {
                "id": 6422,
                "topic": "Disbelief: <i>Kufr</i>: Disbeliever, <i>Kuffar</i>",
                "verses": "2:7-21, 2:35, 3:5, 3:98, 4:151-152, 5:18, 5:37, 5:38, 5:45, 5:73, 7:38, 7:51, 8:56, 9:37, 12:88, 14:3-4, 16:108, 19:72, 39:33, 39:60, 40:5, 45:12, 47:35, 85:11, 85:20-21, 98:7, 109:2-7"
            }
        ],
        "ar": "فَسَجَدَ الۡمَلٰٓئِکَۃُ  کُلُّہُمۡ  اَجۡمَعُوۡنَ ﴿ۙ۷۴﴾ ",
        "ur": "اس پر سب کے سب فرشتوں نے سجدہ کیا۔",
        "v5": {
            "text": "So the angels submitted, all of them together.",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 75,
        "v_": 74,
        "topics": [
            {
                "id": 632,
                "topic": "Adam: <i>Adam(as)</i>: <i>Iblis</i> refused to submit to",
                "verses": "7:12, 2:35, 15:31-32, 17:62, 18:51, 20:117"
            },
            {
                "id": 6422,
                "topic": "Disbelief: <i>Kufr</i>: Disbeliever, <i>Kuffar</i>",
                "verses": "2:7-21, 2:35, 3:5, 3:98, 4:151-152, 5:18, 5:37, 5:38, 5:45, 5:73, 7:38, 7:51, 8:56, 9:37, 12:88, 14:3-4, 16:108, 19:72, 39:33, 39:60, 40:5, 45:12, 47:35, 85:11, 85:20-21, 98:7, 109:2-7"
            },
            {
                "id": 9124,
                "topic": "Iblis: Devil: refused to submit",
                "verses": "7:12, 2:35, 15:32, 15:34, 17:62, 18:51, 20:117"
            },
            {
                "id": 11584,
                "topic": "Moral Traits: arrogance, conceit",
                "verses": "41:51, 2:35, 2:88, 4:174, 7:14, 7:37, 7:41, 7:49, 7:56, 7:76-77, 7:89, 7:134, 7:147, 10:76, 14:22, 16:24, 16:30, 17:38, 23:47, 25:22, 28:40, 28:84, 29:40, 31:19-20, 34:32-34, 38:3, 39:60, 40:36, 40:48-49, 40:57, 41:16, 41:39, 44:50, 45:32, 46:11, 46:21, 57:24, 71:8, 74:24"
            }
        ],
        "ar": "اِلَّاۤ  اِبۡلِیۡسَ ؕ اِسۡتَکۡبَرَ وَ کَانَ مِنَ الۡکٰفِرِیۡنَ ﴿۷۵﴾ ",
        "ur": "مگر ابلیس نے نہیں۔ اس نے استکبار کیا اور وہ تھا ہی کافروں میں سے۔ ",
        "v5": {
            "text": "But Iblis <i>did not</i>. He behaved proudly, and was of those who disbelieved.[3430]",
            "notes": [
                {
                    "ref": "3430",
                    "note": "<p><strong>Commentary:</strong></p><p>Whereas men of angelic nature give their allegiance and support to the Prophet of the day, those of satanic nature oppose and fight him. For the meaning of the word إبلیس see 2:35.</p><p>The words \"what I had created with my two hands\" seem to signify that God had endowed Adam with perfect faculties for spiritual as well as material progress.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 76,
        "v_": 75,
        "topics": [
            {
                "id": 623,
                "topic": "Adam: <i>Adam(as)</i>: created to manifest Allah’s attributes",
                "verses": null
            },
            {
                "id": 9124,
                "topic": "Iblis: Devil: refused to submit",
                "verses": "7:12, 2:35, 15:32, 15:34, 17:62, 18:51, 20:117"
            },
            {
                "id": 11584,
                "topic": "Moral Traits: arrogance, conceit",
                "verses": "41:51, 2:35, 2:88, 4:174, 7:14, 7:37, 7:41, 7:49, 7:56, 7:76-77, 7:89, 7:134, 7:147, 10:76, 14:22, 16:24, 16:30, 17:38, 23:47, 25:22, 28:40, 28:84, 29:40, 31:19-20, 34:32-34, 38:3, 39:60, 40:36, 40:48-49, 40:57, 41:16, 41:39, 44:50, 45:32, 46:11, 46:21, 57:24, 71:8, 74:24"
            }
        ],
        "ar": "قَالَ یٰۤاِبۡلِیۡسُ مَا مَنَعَکَ اَنۡ تَسۡجُدَ لِمَا خَلَقۡتُ بِیَدَیَّ ؕ اَسۡتَکۡبَرۡتَ اَمۡ کُنۡتَ مِنَ  الۡعَالِیۡنَ ﴿۷۶﴾ ",
        "ur": "اس نے کہا اے ابلیس! تجھے کس چیز نے اُسے سجدہ کرنے سے منع کیا جسے میں نے اپنی (قدرت کے) دونوں ہاتھوں سے تخلیق کیا تھا؟ کیا تو نے تکبر سے کام لیا ہے یا تو بہت اونچے لوگوں میں سے ہے؟",
        "v5": {
            "text": "[a]<i>God</i> said, ‘O Iblis, what hindered thee from submitting to what I had created with My two hands? Is it that thou art <i>too</i> proud or art thou <i>really</i> of the exalted ones?’",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:13; 15:33."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 77,
        "v_": 76,
        "topics": [
            {
                "id": 5118,
                "topic": "Clay: Tin, <i>Sijjil</i>",
                "verses": "23:13, 3:50, 5:111, 6:3, 7:13, 11:83, 15:75, 17:62, 28:39, 32:8, 37:12, 38:72, 51:34, 105:5"
            },
            {
                "id": 7568,
                "topic": "Fire: <i>An-Nar</i>: <i>Jinn</i> made of",
                "verses": "7:13, 15:28, 55:16"
            },
            {
                "id": 9116,
                "topic": "Iblis: Devil: of fiery nature",
                "verses": "55:16, 7:13, 15:28"
            }
        ],
        "ar": "قَالَ  اَنَا خَیۡرٌ  مِّنۡہُ ؕ خَلَقۡتَنِیۡ  مِنۡ نَّارٍ وَّ  خَلَقۡتَہٗ  مِنۡ  طِیۡنٍ ﴿۷۷﴾ ",
        "ur": "اس نے کہا میں اس سے بہتر ہوں۔ تُو نے مجھے آگ سے پیدا کیا اور اسے مٹی سے پیدا کیا۔ ",
        "v5": {
            "text": "He said, ‘I am better than he. [b]Thou hast created me of fire and him hast Thou created of clay.’[3431]",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:13; 15:28; 55:16."
                },
                {
                    "ref": "3431",
                    "note": "<p><strong>Commentary:</strong></p><p>The opponents of a Prophet always regard themselves as superior to him in power, position and prestige. It hurts their sense of pride to give their allegiance to a man whom they consider to be like them or even inferior to them. The main obstacle in the way of their accepting the truth is their false sense of pride and superiority. See also 7:13 and 15:34.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 78,
        "v_": 77,
        "topics": [
            {
                "id": 9107,
                "topic": "Iblis: Devil: banished, rejected",
                "verses": "7:14, 7:19, 15:35, 17:64"
            },
            {
                "id": 16184,
                "topic": "Satan: curse of Allah on",
                "verses": "4:119, 15:18, 15:36, 81:26"
            },
            {
                "id": 16279,
                "topic": "Satan: the rejected, abased",
                "verses": "3:37, 7:14"
            }
        ],
        "ar": "قَالَ فَاخۡرُجۡ  مِنۡہَا فَاِنَّکَ  رَجِیۡمٌ ﴿ۚۖ۷۸﴾ ",
        "ur": "اس نے کہا پس یہاں سے نکل جا۔ تُو یقیناً دھتکارا ہوا ہے۔ ",
        "v5": {
            "text": "[c]<i>God</i> said, ‘Then get out hence, for, surely thou art rejected.[3432]",
            "notes": [
                {
                    "ref": "c",
                    "note": "7:14; 15:35."
                },
                {
                    "ref": "3432",
                    "note": "<p><strong>Commentary:</strong></p><p>The pronoun ھا in the expression منھا (from hence) does not refer to post-mortal Heaven because Heaven is a place where Satan could not possibly enter and from which no one who has once entered is turned out (15:49). In fact the pronoun refers to that state of apparent bliss which men enjoy before the advent of a Prophet, and which is represented in the Quran as جنة (garden).</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 79,
        "v_": 78,
        "topics": [
            {
                "id": 5488,
                "topic": "Curse: <i>La‘nah</i>: on <i>Iblis</i>",
                "verses": "15:36"
            },
            {
                "id": 16184,
                "topic": "Satan: curse of Allah on",
                "verses": "4:119, 15:18, 15:36, 81:26"
            },
            {
                "id": 18939,
                "topic": "Yaumud-Din: Day of Judgment",
                "verses": "1:4, 7:188, 15:36, 26:83, 33:64, 37:21, 51:13, 56:57, 70:27, 74:47, 78:2-3, 79:43, 82:16, 82:18-19, 83:12"
            }
        ],
        "ar": "وَّ اِنَّ عَلَیۡکَ لَعۡنَتِیۡۤ  اِلٰی یَوۡمِ الدِّیۡنِ ﴿۷۹﴾ ",
        "ur": "اور یقیناً تجھ پر میری لعنت پڑے گی جزا سزا کے دن تک۔ ",
        "v5": {
            "text": "[d]And surely on thee shall rest My curse till the Day of Judgement.’",
            "notes": [
                {
                    "ref": "d",
                    "note": "15:36."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 80,
        "v_": 79,
        "topics": [
            {
                "id": 5843,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>",
                "verses": "37:21, 1:4, 2:9, 2:49, 2:86, 2:114, 2:127, 3:78, 3:115, 4:40, 4:142, 5:70, 6:13, 9:18, 11:27, 14:32, 14:43, 15:36, 23:102, 24:3, 24:38, 25:27, 26:83, 26:88, 29:37, 30:57, 33:22, 43:66, 44:17, 50:45, 51:13, 60:4, 70:9, 74:9-10, 75:2-3, 82:17-18, 83:11-12, 86:10"
            },
            {
                "id": 14206,
                "topic": "Prayers of the Holy Qur’an: of <i>Iblis</i>",
                "verses": "15:37"
            },
            {
                "id": 15581,
                "topic": "Respite: to Satan",
                "verses": "7:15-16, 15:37, 17:63"
            }
        ],
        "ar": "قَالَ رَبِّ فَاَنۡظِرۡنِیۡۤ  اِلٰی یَوۡمِ یُبۡعَثُوۡنَ ﴿۸۰﴾ ",
        "ur": "اس نے کہا اے میرے ربّ! اس صورت میں مجھے اس دن تک مہلت دے دے جس دن (لوگ) مبعوث کئے جائیں گے۔ ",
        "v5": {
            "text": "He said, [a]‘My Lord, then grant me respite till the day when they shall be raised.’[3433]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:15; 15:37; 17:63."
                },
                {
                    "ref": "3433",
                    "note": "<p><strong>Commentary:</strong></p><p>The clause, <i>the day when they shall be raised</i>, signifies the time of the spiritual rebirth of man, when having attained to the stage of النفس المطمئنة (the soul at peace) he becomes quite immune to spiritual fall. It does not signify the Day of Resurrection after death, because there is no possibility of man being seduced by Satan after his death. See also 15:37.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 81,
        "v_": 80,
        "topics": [
            {
                "id": 15581,
                "topic": "Respite: to Satan",
                "verses": "7:15-16, 15:37, 17:63"
            }
        ],
        "ar": "قَالَ  فَاِنَّکَ مِنَ الۡمُنۡظَرِیۡنَ ﴿ۙ۸۱﴾ ",
        "ur": "اس نے کہا پس یقیناً تُو مہلت دیئے جانے والوں میں سے ہے۔ ",
        "v5": {
            "text": "<i>God</i> said, [b]‘Certainly thou art of the respited ones,",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:16; 15:38; 17:64."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 82,
        "v_": 81,
        "topics": [
            {
                "id": 5767,
                "topic": "Day of Appointed Time: <i>Yaumul-Waqt</i>",
                "verses": "15:39, 56:51"
            }
        ],
        "ar": "اِلٰی یَوۡمِ الۡوَقۡتِ الۡمَعۡلُوۡمِ ﴿۸۲﴾ ",
        "ur": "ایک معلوم وقت کے دن تک۔",
        "v5": {
            "text": "[c]Till the day of the appointed time.’[3434]",
            "notes": [
                {
                    "ref": "c",
                    "note": "15:39."
                },
                {
                    "ref": "3434",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, <i>till the day of the appointed time</i>, may mean, till the day when truth finally triumphs over falsehood and the votaries of falsehood are completely crushed. See also 15:39.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 83,
        "v_": 82,
        "topics": [
            {
                "id": 13188,
                "topic": "Oaths: <i>yamin</i>: of Satan",
                "verses": "7:22"
            }
        ],
        "ar": "قَالَ فَبِعِزَّتِکَ لَاُغۡوِیَنَّہُمۡ اَجۡمَعِیۡنَ ﴿ۙ۸۳﴾ ",
        "ur": "اس نے کہا تو پھر تیری عزت کی قسم! میں ضرور ان سب کو گمراہ کروں گا۔ ",
        "v5": {
            "text": "He said, ‘So by Thy might, [d]I will surely lead them all astray.",
            "notes": [
                {
                    "ref": "d",
                    "note": "7:17-18; 15:40."
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 84,
        "v_": 83,
        "topics": [],
        "ar": "اِلَّا عِبَادَکَ مِنۡہُمُ  الۡمُخۡلَصِیۡنَ ﴿۸۴﴾ ",
        "ur": "سوائے اُن میں سے تیرے اُن بندوں کے جو (تیرے) چنیدہ ہوں گے۔",
        "v5": {
            "text": "[e]Except Thy chosen servants from among them.’[3435]",
            "notes": [
                {
                    "ref": "e",
                    "note": "15:41; 17:66."
                },
                {
                    "ref": "3435",
                    "note": "<p><strong>Commentary:</strong></p><p>The words \"chosen servants\" apply particularly to the Prophets who are completely immune to the temptations and seductions of Satan. They can commit no sin and, therefore, are completely free from spiritual fall. See also 15:41.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 85,
        "v_": 84,
        "topics": [],
        "ar": "قَالَ  فَالۡحَقُّ ۫ وَ الۡحَقَّ  اَقُوۡلُ ﴿ۚ۸۵﴾ ",
        "ur": "اس نے کہا پس حق تو یہ ہے اور میں لازماً حق ہی کہتا ہوں۔ ",
        "v5": {
            "text": "<i>God</i> said, ‘Then the truth is, and the truth I speak,",
            "notes": null
        }
    },
    {
        "ch": 38,
        "v": 86,
        "v_": 85,
        "topics": [
            {
                "id": 8746,
                "topic": "Hell: <i>Jahannam</i>: for Satan",
                "verses": "19:69, 4:120-122, 7:19, 17:64, 19:69, 26:92-96, 36:64"
            },
            {
                "id": 9984,
                "topic": "Jinn: punished like men",
                "verses": "11:120, 32:14, 11:120, 15:43-44"
            },
            {
                "id": 16191,
                "topic": "Satan: destined to hell",
                "verses": "19:69, 15:44, 67:6"
            }
        ],
        "ar": "لَاَمۡلَـَٔنَّ جَہَنَّمَ مِنۡکَ وَ مِمَّنۡ تَبِعَکَ مِنۡہُمۡ  اَجۡمَعِیۡنَ  ﴿۸۶﴾ ",
        "ur": "میں جہنّم کو ضرور بھردوں گا تجھ سے اور اُن سب سے جو ان میں سے تیری پیروی کریں گے۔ ",
        "v5": {
            "text": "[f]<i>That</i> I will certainly fill Hell with thee and with those who follow thee, all together.’[3436]",
            "notes": [
                {
                    "ref": "f",
                    "note": "11:120; 15:44; 32:14."
                },
                {
                    "ref": "3436",
                    "note": "<p><strong>Commentary:</strong></p><p>The dialogue between God and Satan, as mentioned in the above verses, does not refer to any talk that actually took place but represents, in metaphorical language, the state of things as they exist at the time when a Prophet is raised. The \"man\" referred to in verse 72 above stands for the Prophet of the time, particularly, the Holy Prophet; and <i>Iblis</i> represents those wicked and evil-minded persons who oppose him and seek to impede and retard the progress of his mission.</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 87,
        "v_": 86,
        "topics": [
            {
                "id": 9815,
                "topic": "Jaza’: recompense: with Allah",
                "verses": "10:73, 11:30, 11:52, 12:5, 26:110, 26:128, 26:146, 26:165, 26:181, 34:48, 36:22, 42:24, 42:41, 76:10"
            }
        ],
        "ar": "قُلۡ مَاۤ  اَسۡـَٔلُکُمۡ عَلَیۡہِ مِنۡ  اَجۡرٍ وَّ مَاۤ  اَنَا مِنَ الۡمُتَکَلِّفِیۡنَ ﴿۸۷﴾ ",
        "ur": "تو کہہ دے کہ میں تم سے اس (بات) پر کوئی اجر نہیں مانگتا اور نہ ہی میں تکلف کرنے والوں میں سے ہوں۔ ",
        "v5": {
            "text": "Say, [a]‘I ask not of you any reward for it, nor am I of those who are given to affectation.[3437]",
            "notes": [
                {
                    "ref": "a",
                    "note": "25:58; 42:24."
                },
                {
                    "ref": "3437",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse makes it clear that بشر (man) referred to in v. 72 above is the Holy Prophet, since in the present verse he is represented as saying that he seeks no recompense or reward for preaching the message of truth and for calling men to God. Exactly the same expression has been mentioned as having been used by the Holy Prophet about himself at several places in the Quran (25:58; 34:48; etc.).</p>"
                }
            ]
        }
    },
    {
        "ch": 38,
        "v": 88,
        "v_": 87,
        "topics": [
            {
                "id": 6373,
                "topic": "Dhikr: Qur’an as, reminder",
                "verses": "38:2, 3:59, 6:91, 11:121, 15:7, 15:10, 16:45, 20:100, 21:25, 21:51, 29:52, 36:70, 37:4, 38:9, 38:50, 41:42, 43:45, 54:26, 65:11, 68:52-53, 74:32, 77:6, 81:28"
            }
        ],
        "ar": "اِنۡ  ہُوَ   اِلَّا  ذِکۡرٌ   لِّلۡعٰلَمِیۡنَ ﴿۸۸﴾ ",
        "ur": "یہ تو تمام جہانوں کے لئے ایک عظیم نصیحت کے سوا کچھ نہیں۔",
        "v5": {
            "text": "[b]It is nothing but a Reminder for <i>all</i> peoples.",
            "notes": [
                {
                    "ref": "b",
                    "note": "12:105; 81:28."
                }
            ]
        }
    }
]
