[
    {
        "ch": 22,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[2436]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                },
                {
                    "ref": "2436",
                    "note": "<p><strong>Commentary:</strong></p><p>See 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 1892,
                "topic": "Allah: knowledge of the hour, <i>Sa‘ah</i>",
                "verses": "7:188, 6:32, 6:41, 7:188, 12:108, 25:12, 31:35, 33:64, 41:48, 42:19, 43:62, 43:67, 43:86, 45:33, 53:58, 54:47, 67:27, 79:43"
            },
            {
                "id": 7052,
                "topic": "Earthquake: <i>Rajfah, Zalzalah</i>",
                "verses": "11:68, 7:79, 7:92, 7:156, 15:84, 26:159, 79:7, 99:2-3"
            },
            {
                "id": 8999,
                "topic": "Hour: <i>Sa‘ah</i>",
                "verses": "25:12, 6:32, 6:41, 7:188, 12:108, 15:86, 16:78, 18:22, 20:16, 21:50, 22:8, 22:56, 30:13, 30:56, 31:35, 33:64, 34:4, 40:60, 41:48, 41:51, 42:18-19, 43:62, 43:67, 43:86, 45:28, 45:33, 47:19, 54:2, 54:47, 79:43, 79:44"
            },
            {
                "id": 14424,
                "topic": "Prophecies in the Holy Qur’an: about: the Hour",
                "verses": "54:2"
            },
            {
                "id": 14499,
                "topic": "Prophecies in the Holy Qur’an: about: wars, earthquakes",
                "verses": "18:48, 55:32, 69:2-4, 101:2-10, 111:2"
            },
            {
                "id": 17514,
                "topic": "Taqwa: fear of God",
                "verses": "2:3, 2:190, 2:197-198, 2:204, 2:213, 2:224, 2:232, 2:234, 2:238, 2:279, 2:283-284, 3:16, 3:51, 3:77, 3:103, 3:131, 3:201, 4:2, 4:10, 4:132, 5:3, 5:5, 5:8-9, 5:12, 5:36, 5:58, 5:89, 5:94, 5:97, 5:113, 6:70, 6:73, 7:27, 7:36, 7:66, 8:2, 8:70, 9:7, 9:108, 9:109, 11:79, 15:70, 20:133, 22:33, 22:38, 26:109, 26:133, 26:185, 33:56, 33:71, 43:64, 47:18, 48:27, 49:4, 49:11, 49:13, 57:29, 58:10, 59:8, 59:19, 60:12, 65:2, 65:11, 74:57, 78:32, 96:13"
            }
        ],
        "ar": "یٰۤاَیُّہَا النَّاسُ اتَّقُوۡا رَبَّکُمۡ ۚ اِنَّ  زَلۡزَلَۃَ  السَّاعَۃِ  شَیۡءٌ  عَظِیۡمٌ ﴿۲﴾ ",
        "ur": "اے لوگو! اپنے ربّ کا تقویٰ اختیار کرو۔ یقیناً ساعت کا زلزلہ ایک بہت بڑی چیز ہوگی۔",
        "v5": {
            "text": "O people, fear your Lord; verily the earthquake of the Hour is a tremendous thing—[2437]",
            "notes": [
                {
                    "ref": "2437",
                    "note": "<p><strong>Important Words:</strong></p><p>زلزلة (earthquake) is derived from زلزل. They say زلزل اللّٰه الارض i.e. God shook the earth. زلزله means, he frightened him. زلزل الابل means, he drove the camels harshly. زلزلة means, a shaking of the earth; an earthquake; a calamity; a terrible visitation; زلازل (plural) i.e. calamities, miseries, trials, afflictions (Aqrab). The word also means: a war or the effects of war. The last two World Wars were called زلزلة (an earthquake) because they shook the foundation of human society and brought about new political and social changes and also a revolutionary change in the beliefs, ideas and ideals of men. The word has been used in the Quran in the sense of a calamity (2:215) and also in the sense of war or the effects of war (33:11, 12).</p><p>الساعة (Hour) is derived from ساع. They say ساع الشیء i.e. the thing was lost, it degraded. ساعت الابل means, the camels went away grazing without a driver. ساعة means, an hour; a part of time; a while or a little while; a space; a period; an indefinite time; a watch. الساعة means, the present time; now; just now; this moment. It also means, difficulty, distress or affliction; distance; remoteness. الساعة (Hour) or القیامة is used in three senses: (a) death of a great and famous person. It is called القیامة الصغری or الساعةالصغری i.e. the small resurrection; (b) a national calamity or the doom that overtakes a whole people on account of their evil deeds. It is called الساعة الوسطی i.e. the Middle Hour; (c) the Day of Judgement. It is called القیامة الکبری or الساعة الکبری i.e. the Great Hour (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The word الساعة has been used in the Quran in the last two senses mentioned under \"Important Words\" above. The context shows that in the verse under comment it has been used in the second sense, i.e. in the sense of a national calamity that shakes the very foundation of a people. It may have particular reference to the impending doom of the Arabs when Mecca, the citadel of their political power, would fall and their political power and whole social system would break and crumble or it may refer to a terrible calamity that would overtake mankind in the form of a global war and would bring calamitous changes in its wake. The present verse read along with 2:213 lends further support to the inference that the words الساعة (the Hour) or یوم القیامة (the Day of Judgement) used in the Quran generally signify a great national calamity that overtakes a people.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 1892,
                "topic": "Allah: knowledge of the hour, <i>Sa‘ah</i>",
                "verses": "7:188, 6:32, 6:41, 7:188, 12:108, 25:12, 31:35, 33:64, 41:48, 42:19, 43:62, 43:67, 43:86, 45:33, 53:58, 54:47, 67:27, 79:43"
            },
            {
                "id": 14424,
                "topic": "Prophecies in the Holy Qur’an: about: the Hour",
                "verses": "54:2"
            },
            {
                "id": 14499,
                "topic": "Prophecies in the Holy Qur’an: about: wars, earthquakes",
                "verses": "18:48, 55:32, 69:2-4, 101:2-10, 111:2"
            }
        ],
        "ar": "یَوۡمَ تَرَوۡنَہَا تَذۡہَلُ کُلُّ مُرۡضِعَۃٍ عَمَّاۤ اَرۡضَعَتۡ وَ تَضَعُ کُلُّ ذَاتِ حَمۡلٍ حَمۡلَہَا وَ تَرَی النَّاسَ سُکٰرٰی وَ مَا ہُمۡ  بِسُکٰرٰی وَ لٰکِنَّ عَذَابَ اللّٰہِ شَدِیۡدٌ ﴿۳﴾",
        "ur": "جس دن تم اُسے دیکھو گے، ہر دودھ پلانے والی اسے بھول جائے گی جسے وہ دودھ پلاتی تھی اور ہر حاملہ اپنا حمل گرا دے گی اور تُو لوگوں کو مدہوش دیکھے گا حالانکہ وہ مدہوش نہیں ہوں گے لیکن اللہ کا عذاب بہت سخت ہوگا۔",
        "v5": {
            "text": "The day when you see it, every woman giving suck shall forget her suckling and every pregnant woman shall cast her burden; and thou shalt see men as drunken while they will not be drunken, but severe will indeed be the punishment of Allah.[2438]",
            "notes": [
                {
                    "ref": "2438",
                    "note": "<p><strong>Important Words:</strong></p><p>تذھل (forget) is derived from ذھل. They say ذھل عنه i.e. he forgot it or neglected it; he was or became unmindful of it; he neglected it intentionally or in consequence of his being diverted by something. ذھول is the neglecting of a thing, dismissing it from the mind; or the quitting of a thing with confusion or perplexity or alienation of mind such as arises from fear etc. or being diverted from one’s constant companion so as to forget him (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse has used three metaphors or similes to express the extreme severity of \"the earthquake of the Hour,\" referred to in the preceding verse. Nothing is dearer to a mother than the babe to which she gives suck and there could be no terror more dreadful in its effects than the one that makes a woman cast down her burden and which drives men to frenzy and yet, the verse says, the suddenness and severity of the terror inspired by the dreadful event would be such that mothers would abandon the babes at their breasts and pregnant women would cast down their burdens and people would go mad with fright and like a drunken man would lose all control over their actions. The wording of the verse incidentally implies that the \"Hour\" referred to in the preceding verse is not the final Day of Judgement but, as stated in the preceding verse, is the destruction of the political power of Meccans in the form of the Fall of Mecca and other calamities that would overtake them, and the victory of Islam.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 6646,
                "topic": "Dispute",
                "verses": "8:7, 2:85, 2:140, 3:21, 3:62, 3:66, 3:153, 4:66, 4:106, 7:72, 8:47, 11:33, 13:14, 16:5, 18:22, 22:9, 22:20, 22:68, 31:21, 40:5-6, 40:36, 40:48, 40:70, 42:17, 42:19, 42:36, 49:11, 53:13"
            },
            {
                "id": 10238,
                "topic": "Knowledge: <i>‘Ilm</i>: and disbelievers",
                "verses": "6:149, 2:119, 3:62, 4:158, 5:105, 6:101, 6:120, 6:141, 9:6, 10:40, 16:28, 17:37, 22:9, 22:72, 27:67, 30:8, 30:59-60, 40:84, 46:5, 47:17"
            },
            {
                "id": 10258,
                "topic": "Knowledge: <i>‘Ilm</i>: and ignorant",
                "verses": "16:120, 6:109, 6:141, 6:145, 16:26, 22:9, 30:30, 31:7, 39:10, 102:6"
            },
            {
                "id": 16216,
                "topic": "Satan: evil, rebellious",
                "verses": "37:8, 4:61, 4:77, 4:118, 19:45, 24:22, 26:222-223"
            }
        ],
        "ar": "وَ مِنَ النَّاسِ مَنۡ یُّجَادِلُ فِی اللّٰہِ  بِغَیۡرِ عِلۡمٍ  وَّ  یَتَّبِعُ  کُلَّ  شَیۡطٰنٍ  مَّرِیۡدٍ ۙ﴿۴﴾ ",
        "ur": "اور لوگوں میں سے ایسا بھی ہے جو بغیر کسی علم کے اللہ کے بارہ میں جھگڑا کرتا ہے اور ہر سرکش شیطان کی پیروی کرتا ہے۔",
        "v5": {
            "text": "[a]And among men there are some who dispute concerning Allah without knowledge, and follow every rebellious satan,[2439]",
            "notes": [
                {
                    "ref": "a",
                    "note": "13:14; 22:9; 31:21; 40:70."
                },
                {
                    "ref": "2439",
                    "note": "<p><strong>Important Words:</strong></p><p>مرید (rebellious) is derived from مرد (<i>marada</i>) which means, he exalted himself; he was insolent and audacious in pride and in acts of disobedience; he was excessively proud or disobedient or rebellious; he was refractory; he outstripped others in pride or disobedience. مرد (<i>marida</i>), means it (the tree) became denuded of its leaves. شجر أمرد means, a tree devoid of leaves, المارد or المرید means, one who is destitute of good (Lane &amp; Aqrab). See also 9:101.</p><p><strong>Commentary:</strong></p><p>The verse shows that true knowledge is a great divine boon and all misguidance is the result of the lack of it. At another place (35:29) the Quran states that the realization of the Diving Being is vouchsafed only to those who are possessed of true knowledge. The present verse is of general application and applies to no particular person. The words فی الله (concerning Allah) mean, concerning the person, power and attribute of God.</p><p>It may be noted here that شیطان (Satan) or ابلیس (<i>Iblis</i>) is the being who has been created by God to incite men to do evil deeds as angels have been created to exhort them to do good deeds and thus he is the exact opposite of the angels, and the object of his creation is to try and test the mettle of men. He has his representatives in every time and age. It is this inciter to evil deeds and his representatives who have been mentioned in the Quran in connection with Adam’s story. This inciter to evil deeds will live as long as the world lasts but his representatives in the form of wicked men die and others take their place.</p><p>It may also be mentioned here that Satan will not be punished for inciting men to evil deeds as angels will not be rewarded for exhorting them to do good deeds. Punishment is awarded for deeds which are against the laws of nature or of the Shari‘ah but to incite men to bad deeds is ingrained in the very nature of Satan and is a part of his being. So the question of punishment in regard to him does not arise. It is true that according to the Quran, Satan will go to Hell just as the angels will go to Heaven but the fire of Hell will cause him no pain or suffering just as the rewards of heaven will give no joy or happiness to the angels. Having been created of fire (7:13) Satan is immune from the effects of burning. He is no doubt hated and condemned and denounced because he represents evil and sin but he deserves and will receive no punishment for what is a part of his nature and what he has been created to do. His representatives from among men, however, will certainly be punished for their wicked deeds. See also 2:35, 37.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 5612,
                "topic": "Dallin: astray",
                "verses": "1:7, 2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:28, 13:34, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:10, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:33, 37:72, 38:27, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            },
            {
                "id": 6258,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4, 97:2-5"
            },
            {
                "id": 8847,
                "topic": "Hell: <i>Jahannam</i>: <i>Sa‘ir</i>",
                "verses": "19:69, 4:11, 4:56, 17:98, 25:12, 31:22, 33:65, 34:13, 42:8, 48:14, 67:6, 76:5, 84:13"
            }
        ],
        "ar": "کُتِبَ عَلَیۡہِ  اَنَّہٗ  مَنۡ تَوَلَّاہُ  فَاَنَّہٗ یُضِلُّہٗ وَ یَہۡدِیۡہِ  اِلٰی عَذَابِ السَّعِیۡرِ ﴿۵﴾ ",
        "ur": "اُس پر یہ بات مقدر کر دی گئی ہے کہ جو اس سے دوستی کرے گا تو وہ یقیناً اُسے بھی گمراہ کر دے گا اور اسے بھڑکتی آگ کے عذاب کی طرف لے جائے گا۔",
        "v5": {
            "text": "Concerning whom it is decreed that [a]whosoever makes friends with him, him he will lead astray and will guide him to the punishment of the Fire.[2440]",
            "notes": [
                {
                    "ref": "a",
                    "note": "4:39,120."
                },
                {
                    "ref": "2440",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse makes it clear that only those are led astray by Satan who first make friends with him and follow him. At another place the Quran says that Satan has no power over the true servants of God. It is only those who accept his evil suggestions and follow him that fall victim to him (16:100-101; 17:66).</p><p>The expression یھدیه (guides him) contains a beautiful irony. i.e. Satan 'guides' disbelievers to the fire of Hell as if the fire of Hell is a thing to which they would like to be guided. It is of interest to note that whereas for the righteous it is said that \"are on guidance\" or, in other words, they are mounted on guidance, for the wicked it is said that they are led or driven to Hell.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 867,
                "topic": "Afterlife: <i>Akhirah</i>: arguments for",
                "verses": "29:65, 2:29, 15:86, 17:50-53, 19:67-68, 23:116, 30:9, 79:28"
            },
            {
                "id": 1131,
                "topic": "Ajal: <i>Musamma</i>, fixed",
                "verses": "2:232, 11:105, 3:146, 6:3, 6:129, 7:35, 10:50, 11:4, 13:3, 13:39, 14:11, 15:6, 16:62, 17:100, 20:130, 22:34, 29:54, 30:9, 31:30, 35:14, 35:46, 39:43, 40:68, 42:15, 46:4"
            },
            {
                "id": 2403,
                "topic": "Allah: takes away the souls of men",
                "verses": null
            },
            {
                "id": 2630,
                "topic": "Angels: <i>Mala’ikah</i>: take away the souls of men, <i>Tawaffa</i>",
                "verses": "4:98, 5:118, 16:29, 16:33, 32:12, 6:61-62, 7:38, 8:51, 10:47, 10:105, 12:102, 13:41, 16:71, 39:43, 40:68, 40:78, 47:28"
            },
            {
                "id": 4090,
                "topic": "Barren: earth",
                "verses": "42:51, 41:40, 2:265"
            },
            {
                "id": 4158,
                "topic": "Bashr: mortal: created from clay",
                "verses": "25:55, 30:21, 3:60, 15:29, 15:34, 18:38, 35:12, 38:72, 40:68"
            },
            {
                "id": 4174,
                "topic": "Beauty: in physical world, <i>Bahjah</i>, <i>Zinah</i>,",
                "verses": "16:9, 7:32-33, 10:89, 11:16, 16:7, 18:8, 18:29, 18:47, 20:88, 27:61, 28:80, 33:29, 37:7, 41:26, 49:8, 50:7-8, 57:21"
            },
            {
                "id": 4444,
                "topic": "Biology: creation of life, birth: creation",
                "verses": "30:55, 4:2, 18:38, 20:56, 23:13-15, 36:78, 40:68, 55:15"
            },
            {
                "id": 4512,
                "topic": "Blood: man born out of congealed",
                "verses": "96:3, 23:15, 40:68, 75:39"
            },
            {
                "id": 5128,
                "topic": "Clot",
                "verses": "23:15, 39:7, 40:68, 75:39, 96:3"
            },
            {
                "id": 5405,
                "topic": "Creation: <i>Khalq</i>: from dust",
                "verses": "3:60, 18:38, 30:21, 35:12, 40:68"
            },
            {
                "id": 6175,
                "topic": "Dead, Death: <i>Maut</i>: <i>Tawaffa</i>, caused,",
                "verses": "2:235, 2:241, 3:56, 3:194, 4:16, 4:98, 5:118, 32:12, 6:61, 6:62, 7:38, 7:127, 8:51, 10:47, 10:105, 12:102, 13:41, 16:29, 16:33, 16:71, 39:43, 40:68, 40:78, 47:28"
            },
            {
                "id": 6732,
                "topic": "Doubt: <i>Raib</i>: about resurrection",
                "verses": "3:10, 3:26, 4:88, 6:3, 6:13, 18:22, 27:67, 34:22, 40:60, 41:55, 45:27"
            },
            {
                "id": 6896,
                "topic": "Earth: <i>Al-Ard</i>: Allah bestows life to dead",
                "verses": "2:165, 16:66, 29:64, 30:20, 30:25, 30:51, 35:10, 36:34, 39:22, 41:40, 45:6, 46:34, 57:18"
            },
            {
                "id": 7286,
                "topic": "Evolution",
                "verses": "1:2, 23:13-15, 32:8-10, 56:61-62, 71:15, 71:18, 95:2-6"
            },
            {
                "id": 7676,
                "topic": "Flesh: <i>Lahm</i>: creation of",
                "verses": "23:15, 39:7"
            },
            {
                "id": 10779,
                "topic": "Man: creation of",
                "verses": "23:13-15, 3:7, 3:60, 4:2, 6:3, 7:12-13, 15:27, 15:29-30, 15:34, 16:5, 18:38, 25:55, 30:21, 32:8-10, 35:12, 36:78, 37:12, 38:72, 39:7, 40:68, 49:14, 53:47, 55:15, 71:15, 71:18, 75:38-40, 76:3, 77:21-24, 86:7, 87:3, 95:5-6, 96:3"
            },
            {
                "id": 10835,
                "topic": "Man: nature of, <i>Fitrah</i>",
                "verses": "30:31, 4:29, 10:13, 11:10-11, 14:35, 16:5, 17:12, 17:68-70, 17:101, 18:55, 21:38, 22:67, 23:78-79, 25:51, 30:37, 31:7-8, 31:22, 33:73, 34:32, 36:78-79, 38:61, 39:50, 40:11, 41:50-52, 42:49, 43:16, 57:9, 70:20-22, 75:21, 80:18, 89:16-21, 90:5, 91:8-9, 95:5, 96:7-8, 100:7, 100:9, 103:3-4"
            },
            {
                "id": 15630,
                "topic": "Resurrection: spiritual",
                "verses": "6:37, 2:57, 2:74, 2:261, 5:111, 7:15, 7:58, 8:25, 30:51, 41:40, 56:2-7, 69:14-17, 75:41"
            },
            {
                "id": 16312,
                "topic": "Science: embryology",
                "verses": "6:96, 13:4, 23:14-15, 32:9-10, 35:12, 36:37, 39:7, 40:68, 53:46-47, 65:5, 71:15, 75:38-40, 76:3, 77:21-22, 82:7-9, 86:7-8, 96:2-3"
            },
            {
                "id": 17105,
                "topic": "Sperm",
                "verses": "18:38, 19:23, 23:14-15, 35:12, 39:7, 40:68, 53:47, 56:59, 75:38, 76:3, 77:21-24, 80:20, 86:7-8"
            },
            {
                "id": 18279,
                "topic": "Vegetation",
                "verses": "6:100, 7:59, 18:46, 20:54, 57:21, 78:16"
            },
            {
                "id": 18475,
                "topic": "Water: <i>Ma’</i>: sent from heaven",
                "verses": "16:11-12, 2:23, 2:165, 6:100, 7:58, 8:12, 10:25, 13:18, 14:33, 15:23, 16:66, 18:46, 22:64, 23:19, 27:61, 30:25, 32:28, 35:28, 37:68, 38:58, 39:22, 41:40, 43:12, 50:10, 55:45, 78:15, 88:6"
            }
        ],
        "ar": "یٰۤاَیُّہَا النَّاسُ  اِنۡ  کُنۡتُمۡ فِیۡ رَیۡبٍ مِّنَ الۡبَعۡثِ فَاِنَّا خَلَقۡنٰکُمۡ مِّنۡ تُرَابٍ ثُمَّ مِنۡ نُّطۡفَۃٍ  ثُمَّ مِنۡ عَلَقَۃٍ  ثُمَّ مِنۡ مُّضۡغَۃٍ مُّخَلَّقَۃٍ  وَّ غَیۡرِ مُخَلَّقَۃٍ  لِّنُبَیِّنَ لَکُمۡ ؕ وَ نُقِرُّ  فِی الۡاَرۡحَامِ مَا نَشَآءُ  اِلٰۤی اَجَلٍ مُّسَمًّی ثُمَّ نُخۡرِجُکُمۡ طِفۡلًا ثُمَّ  لِتَبۡلُغُوۡۤا  اَشُدَّکُمۡ ۚ وَ مِنۡکُمۡ  مَّنۡ یُّتَوَفّٰی وَ مِنۡکُمۡ مَّنۡ یُّرَدُّ  اِلٰۤی  اَرۡذَلِ الۡعُمُرِ لِکَیۡلَا یَعۡلَمَ مِنۡۢ بَعۡدِ عِلۡمٍ شَیۡئًا ؕ وَ تَرَی الۡاَرۡضَ ہَامِدَۃً  فَاِذَاۤ  اَنۡزَلۡنَا عَلَیۡہَا الۡمَآءَ   اہۡتَزَّتۡ وَ  رَبَتۡ وَ  اَنۡۢبَتَتۡ مِنۡ  کُلِّ  زَوۡجٍۭ  بَہِیۡجٍ ﴿۶﴾",
        "ur": "اے لوگو! اگر تم جی اُٹھنے کے بارہ میں شک میں مبتلا ہو تو یقیناً ہم نے تمہیں مٹی سے پیدا کیا تھا پھر نطفہ سے پھر لوتھڑے سے پھر گوشت کے ٹکڑے سے جسے خاص تخلیقی عمل یا عام تخلیقی عمل سے بنایا گیا تا کہ ہم تم پر (تخلیق کے راز) کھول دیں۔ اور ہم جو چاہیں رِحموں کے اندر ایک مقررہ مدت تک ٹھہراتے ہیں پھر ہم تمہیں ایک بچے کے طور پر نکالتے ہیں تا کہ پھر تم اپنی بلوغت کی عمر کو پہنچو۔ اور تم ہی میں سے وہ ہے جس کو وفات دے دی جاتی ہے اور تم ہی میں سے وہ بھی ہے جو ہوش وحواس کھو دینے کی عمر تک پہنچایا جاتا ہے تاکہ علم حاصل کرنے کے بعد کلیۃً علم سے عاری ہوجائے۔ اور تُو زمین کو بے آب وگیاہ پاتا ہے پھر جب ہم اس پر پانی برساتے ہیں تو وہ (نمو کے لحاظ سے) متحرک ہو جاتی ہے اور پھولنے لگتی ہے اور ہر قسم کے ہرے بھرے پُر رونق جوڑے اگاتی ہے۔",
        "v5": {
            "text": "O people, if you are in doubt concerning the Resurrection, <i>then consider that</i> We have indeed created you from dust, then from a sperm drop, then from clotted blood, then from a lump of flesh, <i>partly</i> formed and <i>partly</i> unformed, in order that We may make <i>Our power</i> manifest to you. [a]And We cause what We will to remain in the wombs for an appointed term; then We bring you forth as babes; then <i>We rear you</i> that you may attain to your <i>age of</i> full strength. And there are some of you who are caused to die <i>prematurely</i>, [b]and there are others among you who are driven to the worst part of life <i>with the result</i> that they know nothing after<i> having had</i> knowledge. And thou seest the earth lifeless, [c]but when We send down water thereon, it stirs and swells, and grows every kind of beauteous vegetation.[2441]",
            "notes": [
                {
                    "ref": "a",
                    "note": "13:9; 35:12; 41:48."
                },
                {
                    "ref": "b",
                    "note": "16:71; 36:69."
                },
                {
                    "ref": "c",
                    "note": "16:66; 27:61; 30:49-51; 35:28; 45:6."
                },
                {
                    "ref": "2441",
                    "note": "<p><strong>Important Words:</strong></p><p>تراب (dust) is derived from ترب which means, it became dusted or dusty; he had dust in his hand; he clove to dust or earth; he clove to the dust or earth by means of poverty. تراب means, dust, earth (Lane).</p><p>علقة (clotted blood) is derived from علق which has several meanings. علق به means, it stuck fast, clung or adhered to it; it was or became suspended by it; it concerned him or it. علقت المرأة means, the woman became pregnant. علق means, blood or intensely red blood or thick or clotted blood because of its clinging together. علقة signifies a portion of clotted blood or the seminal fluid when it becomes thick clotted blood after which it passes to another stage termed مضغة (Lane).</p><p>مضغة (lump of flesh) is derived from مضغ. They say مضغ الطعام i.e. he chewed the food. مضغة means, a piece or bit of flesh or a morsel of flesh; a foetus when it has become like a lump or flesh (Lane &amp; Aqrab).</p><p>مخلقة (formed) is derived form خلق for which see 3:50. مضغة مخلقة signifies a foetus when it has become like a lump of flesh perfect or complete in make or of which the make has become apparent (Lane).</p><p>ھامدة (lifeless) is active participle in the feminine gender from ھمد which means, he or it died or perished. ھمدت الریح means, the wind became still. ھمدت الارض means, the land became lifeless, without herbage and without rain (Lane &amp; Aqrab).</p><p>اھتزت (stirs) is derived from ھز. They say ھزہ i.e. he shook it. اھتز النبات means, the plant or herbage became tall. اھتزت الارضmeans, the land produced herbage or became in motion and produced plants or herbage (Lane &amp; Aqrab). When Sa‘d, a very prominent companion of the Holy Prophet died, he is reported to have exclaimed, اھتز عرش الرحمان لموت سعد بن معاذ i.e. the Throne of the Gracious God shook on account of the death of Sa‘d bin Ma‘adh.</p><p>ربت (swells) is fromربا meaning, it increased or augmented; it became high. ربت الارض means, the earth became large and swelled (Lane). See also 2:266 &amp; 3:131.</p><p>بھیج (beauteous) is derived from بھج (<i>bahuja</i>) i.e. he or it was or became beauteous or beautiful or goodly or beautiful and bright or splendid; or from بھج (<i>bahija</i>) which means, he was or became joyful, glad or happy. بھج به means, he rejoiced in it or at it. Or it may also be said to have been derived from بھج (<i>bahaja</i>). They say بھجه (<i>bahaja</i>) i.e. it made him joyful, glad or happy. بھیج means, beauteous or beautiful and bright or splendid, having a joyful, glad or happy appearance. بھجة means, beauty or goodliness of a thing or its beauty and brightness or splendour; joyfulness, gladness or happiness of appearance (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse proceeds to give arguments to show that life after death or the resurrection is an established fact. Man’s own creation and physical development is the first argument given in this verse to prove this theme. This creation is a process of evolution, a gradual unfolding, a development from one stage to another, from lifeless matter to a seed, then to a fertilized ovum, then to a foetus and then it culminates in the birth of a perfectly formed human being. But this process of evolution and growth does not stop with man’s birth. It continues. A child grows into a full grown man and then he passes on to old age and then to death which is the flight of the human soul from its physical habitat. This wonderful physical growth of man from a lifeless piece of matter to a fully developed human being constitutes an irrefutable proof that the Creator of man and the Author of all these stages of development possesses the power to give him a new life after he is dead.</p><p>The inference seems to be that just as the creation and development of man is a process of evolution and gradual growth, in the same way the progress of Islam will also be gradual and in stages.</p><p>After this argument in favour of life after death, another argument given in this verse is taken from nature. The verse says that the earth becomes barren, bleak or dead on account of a long period of drought. There is not a blade of grass to be seen on it. Then God sends down rain. The bleak and barren earth begins to vibrate with new life. This phenomenon also leads to the same conclusion that God Who has the power to make the dead and barren earth vibrate with new life has the power to bring man to life after his death. It also leads to the implied inference that by the advent of Islam, a spiritually dead Arabia will bloom and blossom into new life. See also 23:13-15.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 3210,
                "topic": "Attributes of Allah: Al-Haqq (The truth, True Lord)",
                "verses": "22:63, 6:63, 10:33, 20:115, 23:117, 24:26, 31:31"
            },
            {
                "id": 3452,
                "topic": "Attributes of Allah: Al-Qadir (All-Powerful)",
                "verses": "35:45, 2:149, 2:285, 4:150, 5:41, 16:71, 25:55, 30:55, 57:3, 64:2"
            },
            {
                "id": 6158,
                "topic": "Dead, Death: <i>Maut</i>: God restores to life",
                "verses": "2:260-261, 2:57, 2:74, 2:244, 6:37, 8:25, 8:43, 22:67, 26:82, 30:20, 30:25, 30:51, 36:13, 36:34, 40:12, 41:40, 42:10, 43:12, 46:34, 50:12, 75:41"
            },
            {
                "id": 6732,
                "topic": "Doubt: <i>Raib</i>: about resurrection",
                "verses": "3:10, 3:26, 4:88, 6:3, 6:13, 18:22, 27:67, 34:22, 40:60, 41:55, 45:27"
            },
            {
                "id": 14884,
                "topic": "Qadir: powerful: Allah has the power to do all",
                "verses": "46:34, 2:107, 2:285, 3:27, 3:30, 3:166, 3:190, 4:134, 6:18, 6:38, 6:66, 16:71, 17:100, 22:40, 23:19, 23:96, 25:55, 30:55, 33:28, 36:82, 42:30, 42:51, 60:8, 65:13, 66:9, 70:41, 75:5, 75:41, 86:9"
            },
            {
                "id": 17981,
                "topic": "Truth: <i>Haqq</i>: is with Allah",
                "verses": "58:22, 6:74, 6:58, 10:31, 10:33, 10:36, 13:15, 18:45, 20:115, 23:117, 24:26, 25:27, 31:31, 33:5, 39:70, 39:76, 40:21, 42:25"
            }
        ],
        "ar": "ذٰلِکَ بِاَنَّ اللّٰہَ ہُوَ الۡحَقُّ وَ اَنَّہٗ یُحۡیِ الۡمَوۡتٰی  وَ  اَنَّہٗ  عَلٰی کُلِّ  شَیۡءٍ  قَدِیۡرٌ ۙ﴿۷﴾ ",
        "ur": "یہ اس لئے ہے کہ یقیناً اللہ ہی حق ہے اور وہی ہے جو مُردوں کو زندہ کرتا ہے اور وہ یقیناً ہر چیز پر جسے وہ چاہے دائمی قدرت رکھتا ہے۔",
        "v5": {
            "text": "That is because Allah is the Truth, and that [a]it is He Who brings the dead to life, and that He has power over all things;[2442]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:74; 30:51; 35:10; 41:40; 42:10; 57:18."
                },
                {
                    "ref": "2442",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that the inescapable inference from the preceding verse is (1) that God is الحق i.e. His existence is an established fact and He is the Creator Who creates according to the requirements of wisdom and justice; (2) that He infuses new life into a spiritually dead people and (3) that He has the power to do all things which are in accordance with His design and device and which fulfil His purpose.</p><p>The word الموتی (the dead) here specially signifies those who are spiritually dead. The physically dead are mentioned in the next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 2223,
                "topic": "Allah: raises all from graves",
                "verses": null
            },
            {
                "id": 3104,
                "topic": "Attributes of Allah: Al-Ba‘ith (The Resurrector)",
                "verses": "2:57, 2:260, 5:13, 6:37, 17:6"
            },
            {
                "id": 5942,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: is sure to come",
                "verses": "37:21, 6:13, 6:32, 12:108, 15:86, 18:22, 20:16, 22:56, 34:4, 40:60, 42:8, 43:67, 45:33, 47:19, 51:7, 56:3"
            },
            {
                "id": 9000,
                "topic": "Hour: <i>Sa‘ah</i>",
                "verses": "25:12, 6:32, 6:41, 7:188, 12:108, 15:86, 16:78, 18:22, 20:16, 21:50, 22:2, 22:56, 30:13, 30:56, 31:35, 33:64, 34:4, 40:60, 41:48, 41:51, 42:18-19, 43:62, 43:67, 43:86, 45:28, 45:33, 47:19, 54:2, 54:47, 79:43, 79:44"
            },
            {
                "id": 10867,
                "topic": "Man: not immortal",
                "verses": "21:35-36, 2:29, 3:186, 20:56, 23:101, 29:58, 36:69, 36:79, 37:59-60, 40:12, 50:19-20, 55:27-28, 58:7, 71:19"
            },
            {
                "id": 14793,
                "topic": "Qabr: grave",
                "verses": "35:23, 9:84, 60:14, 80:22, 82:5-6, 100:10, 102:2-3"
            },
            {
                "id": 15594,
                "topic": "Resurrection: after death",
                "verses": "23:116, 2:48-49, 5:110, 6:37, 17:50-52, 39:68-71, 50:12, 50:21-24, 71:19, 78:39-40"
            },
            {
                "id": 15610,
                "topic": "Resurrection: day of",
                "verses": "4:88, 2:213, 3:186, 11:104, 17:52, 17:98, 19:96, 20:16, 20:101-110, 21:48, 22:10-11, 32:26, 39:48, 40:60, 68:43-44, 70:43-45, 75:2-14, 78:3-4, 78:18-21, 80:34-43, 88:2-17"
            }
        ],
        "ar": "وَّ  اَنَّ السَّاعَۃَ اٰتِیَۃٌ  لَّا رَیۡبَ  فِیۡہَا ۙ وَ اَنَّ اللّٰہَ  یَبۡعَثُ  مَنۡ  فِی  الۡقُبُوۡرِ ﴿۸﴾ ",
        "ur": "اور قیامت ضرور آکر رہے گی۔ اُس میں کوئی شک نہیں۔ اور یقیناً اللہ اُنہیں اٹھائے گا جو قبروں میں پڑے ہوئے ہیں۔",
        "v5": {
            "text": "[a]And because the Hour will <i>certainly</i> come, there is no doubt about it, and because Allah will raise up those who are in the graves.[2443]",
            "notes": [
                {
                    "ref": "a",
                    "note": "15:86; 18:22; 20:16; 40:60; 45:33."
                },
                {
                    "ref": "2443",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse continues the theme of its predecessor and like it constitutes an inevitable conclusion to v. 6 viz. \"that the Hour will certainly come and that Allah will raise up those who are in the graves.\" The expression \"who are in the graves\" may also refer to those who are spiritually dead and are waiting for a Divine Reformer to come and raise them from their graves, i.e. their spiritual death. This expression and the word الموتی (the dead) in the preceding verse may be taken as depicting two aspects of the spiritually dead people.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 6647,
                "topic": "Dispute",
                "verses": "8:7, 2:85, 2:140, 3:21, 3:62, 3:66, 3:153, 4:66, 4:106, 7:72, 8:47, 11:33, 13:14, 16:5, 18:22, 22:4, 22:20, 22:68, 31:21, 40:5-6, 40:36, 40:48, 40:70, 42:17, 42:19, 42:36, 49:11, 53:13"
            },
            {
                "id": 10239,
                "topic": "Knowledge: <i>‘Ilm</i>: and disbelievers",
                "verses": "6:149, 2:119, 3:62, 4:158, 5:105, 6:101, 6:120, 6:141, 9:6, 10:40, 16:28, 17:37, 22:4, 22:72, 27:67, 30:8, 30:59-60, 40:84, 46:5, 47:17"
            },
            {
                "id": 10259,
                "topic": "Knowledge: <i>‘Ilm</i>: and ignorant",
                "verses": "16:120, 6:109, 6:141, 6:145, 16:26, 22:4, 30:30, 31:7, 39:10, 102:6"
            }
        ],
        "ar": "وَ مِنَ النَّاسِ مَنۡ یُّجَادِلُ فِی اللّٰہِ بِغَیۡرِ عِلۡمٍ  وَّ لَا ہُدًی وَّ لَا کِتٰبٍ مُّنِیۡرٍ ۙ﴿۹﴾ ",
        "ur": "اور لوگوں میں سے ایسا بھی ہے جو بغیر علم کے اور بغیر ہدایت کے اور بغیر کسی روشن کتاب کے اللہ کے بارہ میں جھگڑا کرتا ہے۔",
        "v5": {
            "text": "[b]And among men there is he who disputes concerning Allah without knowledge and without guidance and without an enlightening Book.[2444]",
            "notes": [
                {
                    "ref": "b",
                    "note": "22:4."
                },
                {
                    "ref": "2444",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse stresses the importance of true knowledge and reiterates the fact that all deviation from the right path is due to the lack of it. It purports to say that the inference from v. 6 viz. that God <i>is</i> and that He has the power to bring the dead to life, is so patent and manifest that it is only perverse thinking, born of lack of true knowledge that can deny it.</p><p>علم (knowledge) signifies intellectual proof and arguments, ھدی Divine guidance and کتاب منیر signifies scriptural evidence.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 969,
                "topic": "Afterlife: <i>Akhirah</i>: punishment in",
                "verses": "16:28, 2:86-87, 5:34, 13:35, 17:11, 27:6, 33:58, 34:9, 39:27, 41:17, 46:36, 57:21, 68:34, 79:47"
            },
            {
                "id": 5613,
                "topic": "Dallin: astray",
                "verses": "1:7, 2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:28, 13:34, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:5, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:33, 37:72, 38:27, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            },
            {
                "id": 6004,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: punished on the",
                "verses": "37:21, 2:175, 3:78, 3:181, 5:37, 7:168, 11:61, 11:99-100, 15:36, 16:26, 16:28, 17:98, 20:101, 20:125, 25:70, 28:42, 28:62, 29:14, 29:26, 39:16, 39:25, 39:48, 39:61, 41:41, 42:46, 82:16"
            },
            {
                "id": 14745,
                "topic": "Punishment: kinds of",
                "verses": "6:66, 10:14, 24:6, 29:41, 32:22"
            },
            {
                "id": 15611,
                "topic": "Resurrection: day of",
                "verses": "4:88, 2:213, 3:186, 11:104, 17:52, 17:98, 19:96, 20:16, 20:101-110, 21:48, 22:8, 32:26, 39:48, 40:60, 68:43-44, 70:43-45, 75:2-14, 78:3-4, 78:18-21, 80:34-43, 88:2-17"
            },
            {
                "id": 18530,
                "topic": "Way of: <i>Sabil</i>: leading astray from",
                "verses": "6:118, 33:68, 38:27"
            }
        ],
        "ar": "ثَانِیَ عِطۡفِہٖ  لِیُضِلَّ عَنۡ  سَبِیۡلِ اللّٰہِ ؕ لَہٗ فِی الدُّنۡیَا خِزۡیٌ وَّ نُذِیۡقُہٗ یَوۡمَ الۡقِیٰمَۃِ  عَذَابَ  الۡحَرِیۡقِ ﴿۱۰﴾ ",
        "ur": "(تکبر سے) اپنا پہلو موڑتے ہوئے تاکہ اللہ کے رستے سے گمراہ کر دے۔ اس کے لئے دنیا میں ذلت ہوگی اور قیامت کے دن بھی ہم اسے آگ کا عذاب چکھائیں گے۔",
        "v5": {
            "text": "Turning his side <i>disdainfully</i>, that he may lead <i>men</i> astray from the way of Allah. For him is disgrace in this world; and on the Day of Resurrection We shall make him taste the punishment of burning.[2445]",
            "notes": [
                {
                    "ref": "2445",
                    "note": "<p><strong>Important Words:</strong></p><p>ثانی (turning) is derived from ثنی. They say ثناہ i.e. he doubled it or folded it; he bent it; he turned him or turned him away or back. ثناہ من حاجته he turned him or turned him away or back from the object of his want. ثانی عطفه meaning twisting or bending his back and turning his side, is a metaphor for \"behaving proudly.\" See also 11:6 &amp; 15:88.</p><p><strong>Commentary:</strong></p><p>Two kinds of punishment are in store for the deniers of truth, viz. defeat and discomfiture in the present life and disgrace and ignominy in the life to come. The punishment in this life constitutes a proof of punishment in the life to come.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 1824,
                "topic": "Allah: is not unjust to His servants",
                "verses": "3:183, 8:52, 17:72, 24:51, 26:210, 41:47, 50:30"
            },
            {
                "id": 15611,
                "topic": "Resurrection: day of",
                "verses": "4:88, 2:213, 3:186, 11:104, 17:52, 17:98, 19:96, 20:16, 20:101-110, 21:48, 22:8, 32:26, 39:48, 40:60, 68:43-44, 70:43-45, 75:2-14, 78:3-4, 78:18-21, 80:34-43, 88:2-17"
            }
        ],
        "ar": "ذٰلِکَ بِمَا قَدَّمَتۡ یَدٰکَ وَ اَنَّ اللّٰہَ لَیۡسَ بِظَلَّامٍ   لِّلۡعَبِیۡدِ ﴿٪۱۱﴾ ",
        "ur": "یہ اُس کے باعث ہے جو تیرے دونوں ہاتھوں نے آگے بھیجا اور یقیناً اللہ بندوں پر ذرا بھی ظلم کرنے والا نہیں۔",
        "v5": {
            "text": "[a]This is because of what thy hands have sent on before, and Allah is not unjust to <i>His</i> servants.",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:183; 8:52; 41:47."
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 9636,
                "topic": "Itminan: satisfaction",
                "verses": "2:261, 3:127, 4:104, 5:114, 8:11, 10:8, 13:29, 16:107, 16:113, 17:96, 89:28"
            },
            {
                "id": 10627,
                "topic": "Losers: <i>Khasirun</i>",
                "verses": "2:122, 2:28, 2:65, 3:86, 3:150, 4:120, 5:6, 5:22, 5:31, 5:54, 6:32, 6:141, 7:24, 7:91, 7:93, 7:100, 7:150, 7:179, 8:38, 9:69, 10:46, 10:96, 11:23, 11:48, 12:15, 16:110, 18:104, 21:71, 27:6, 29:53, 39:16, 39:64, 39:66, 40:79, 40:86, 41:24, 41:26, 42:46, 45:28, 46:19, 58:20, 63:10"
            },
            {
                "id": 10905,
                "topic": "Man: trial on earth",
                "verses": "2:156-157, 2:103, 3:187, 6:166, 8:29, 10:86, 14:7, 21:36, 21:112, 22:54, 25:29, 39:50, 54:28, 64:16, 94:16"
            },
            {
                "id": 17899,
                "topic": "Trial: Fitnah",
                "verses": "7:156, 2:103, 5:72, 8:29, 8:74, 9:49, 10:86, 17:61, 21:36, 21:112, 22:54, 24:64, 25:21, 29:11, 37:64, 39:50, 54:28, 60:6, 64:16, 74:32"
            }
        ],
        "ar": "وَ مِنَ النَّاسِ مَنۡ یَّعۡبُدُ اللّٰہَ عَلٰی حَرۡفٍ ۚ فَاِنۡ  اَصَابَہٗ  خَیۡرُ ۨ اطۡمَاَنَّ بِہٖ ۚ وَ اِنۡ اَصَابَتۡہُ فِتۡنَۃُ ۣ انۡقَلَبَ عَلٰی وَجۡہِہٖ ۟ۚ  خَسِرَ الدُّنۡیَا وَ الۡاٰخِرَۃَ ؕ ذٰلِکَ  ہُوَ  الۡخُسۡرَانُ  الۡمُبِیۡنُ ﴿۱۲﴾ ",
        "ur": "اور لوگوں میں سے وہ بھی ہے جو اللہ کی محض سرسری عبادت کرتا ہے۔ پس اگر اسے کوئی بھلائی پہنچ جائے تو اس سے مطمئن ہو جاتا ہے اور اگر اسے کوئی ابتلا آئے تو وہ منہ پھیر لیتا ہے۔ وہ دنیا بھی گنوا بیٹھا اور آخرت بھی۔ یہ تو بہت کھلا کھلا نقصان ہے۔",
        "v5": {
            "text": "And among men there is he who serves Allah, <i>standing</i> <i>as it were</i>, on the verge. Then [b]if good befall him, he is content therewith; and if there befall him a trial, he returns to his <i>former</i> way. He loses in this world as well as in the Hereafter. That is a manifest loss.[2446]",
            "notes": [
                {
                    "ref": "b",
                    "note": "33:20; 70:21-22."
                },
                {
                    "ref": "2446",
                    "note": "<p><strong>Important Words:</strong></p><p>حرف (verge) is infinitive noun from حرف (<i>harafa</i>). They say حرف الشیء عن وجھه i.e. he turned the thing from its proper way or manner or altered it therefrom. حرف means, the extremity, verge, border, margin, brink, side or edge of anything, as for instance the side of a river, the edge of a sword or the ridge of a mountain. علی حرف من امرہ means, such a one is in a vacillating condition, looking to the result of an affair, he turns to it if he sees what he likes, and turns away from it if he sees what does not please him. من یعبد اللّٰه علی حرف means, one who serves Allah standing aloof with respect to religion, in a fluctuating state, like the person who is in the outskirts of the army, so that if he is sure of victory and spoil, he stands firm, otherwise he flees away; or the meaning is, he who serves God in doubt or suspense being unsteady like him who is on the ridge of a mountain; or the meaning is, one who serves God in one mode of circumstances i.e. when in ample circumstances and not when in straitened circumstances (Lane).</p><p><strong>Commentary:</strong></p><p>The sense of the expression علی حرف (on the verge) is explained in the very next sentence, viz. if good befall him, he is content therewith; and if there befall him a trial, he returns to his former way. Taking the word حرف in the sense of suspense, the expression would signify that people of weak faith are always in a state of doubt and suspense. If by accepting the message of truth they hope to get some material benefit, they remain and act as believers but if belief is attended with trials and tribulations then they turn back on their heels. Taking this word in the sense of edge or brink, the expression would mean that such people have only a superficial knowledge of religion. They do not enter into its spirit and have no insight into it. Such waverers and doubters are always deprived of the very benefits they hope to get by their insincere faith.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 16617,
                "topic": "Shirk: false gods cannot help, harm you",
                "verses": "5:77, 6:72, 10:107, 13:15, 13:17, 21:67, 25:56, 29:18"
            }
        ],
        "ar": "یَدۡعُوۡا مِنۡ دُوۡنِ اللّٰہِ  مَا لَا  یَضُرُّہٗ  وَ مَا لَا یَنۡفَعُہٗ ؕ ذٰلِکَ ہُوَ الضَّلٰلُ الۡبَعِیۡدُ ﴿ۚ۱۳﴾ ",
        "ur": "وہ اللہ کے سوا اُسے پکارتا ہے جو نہ اسے نقصان پہنچا سکتا ہے اور نہ اُسے فائدہ پہنچا سکتا ہے۔ یہی ہے پرلے درجہ کی گمراہی۔",
        "v5": {
            "text": "[a]He calls beside Allah on that which can neither harm him nor benefit him. That is indeed straying far away.",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:72; 10:107; 21:67; 25:56."
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 9181,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: steeped in error",
                "verses": "9:3-14, 17:23, 10:67, 21:55, 22:31"
            }
        ],
        "ar": "یَدۡعُوۡا لَمَنۡ ضَرُّہٗۤ  اَقۡرَبُ مِنۡ نَّفۡعِہٖ ؕ لَبِئۡسَ  الۡمَوۡلٰی  وَ  لَبِئۡسَ  الۡعَشِیۡرُ ﴿۱۴﴾ ",
        "ur": "وہ اُسے پکارتا ہے جس کا نقصان پہنچانا زیادہ قرینِ قیاس ہے بہ نسبت اس کے نفع پہنچانے کے۔ کیا ہی بُرا سرپرست ہے اور کیا ہی بُرا ساتھی ہے۔",
        "v5": {
            "text": "He calls on him whose harm is nearer than his benefit. Evil indeed is the patron, and evil indeed the associate.[2447]",
            "notes": [
                {
                    "ref": "2447",
                    "note": "<p><strong>Commentary:</strong></p><p>There may seem to be some contradiction between the subject-matter of this and the previous verse. But in reality there is none. The preceding verse only means that false gods are devoid of all power to do any good or ill to anybody, so it is foolish to worship such worthless objects. The present verse, however, means that the moral injury that the worship of false gods does to their votaries is immediate and quite patent inasmuch as the worshippers degrade themselves before lifeless things and thus do a great injury to their dignity and self-respect, but any benefit that they hope to get from it is imaginary and far-fetched. The verse may also signify that the unreal, temporary and insubstantial worldly gain that the idolaters hope to gain by associating themselves with the community of polytheists is nothing compared with the moral and spiritual injury they do to themselves by their worship of the idols.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 484,
                "topic": "Actions: <i>A‘mal</i>: rewarded",
                "verses": "28:85, 3:196, 4:41, 4:58, 4:174, 5:10, 7:9, 7:44, 9:121, 11:16, 11:112, 16:98, 17:10, 18:3, 18:47, 18:108-9, 19:77, 20:76-77, 22:57, 24:39, 29:8, 29:10, 31:9-10, 32:18, 32:20, 33:30, 34:38, 35:8, 35:11, 35:33, 39:36, 41:9, 42:23-24, 42:27, 43:73-74, 45:31, 46:20, 47:13, 47:36, 48:30, 52:18-21, 65:12, 84:26, 85:12, 95:7, 98:8-9, 99:8, 101:7-8"
            },
            {
                "id": 1801,
                "topic": "Allah: if so willed, <i>Lau sha’allah</i>",
                "verses": "10:100, 2:221, 2:254, 4:91, 5:49, 6:36, 6:108, 6:113, 6:138, 6:150, 10:17, 11:119, 12:22, 16:94, 22:19, 25:46, 42:9, 58:22, 76:31, 85:17"
            },
            {
                "id": 13437,
                "topic": "Paradise: <i>Jannah</i>: believers who do good works will enter",
                "verses": "2:26, 2:83, 3:199, 4:58, 4:123, 4:125, 7:43, 10:10, 11:24, 14:24, 15:46, 16:31-32, 18:108, 19:61, 19:64, 20:76-77, 22:24, 22:57, 25:16, 29:59, 30:16, 31:9, 32:20, 38:50-51, 40:41, 42:23, 44:52-53, 47:13, 51:16, 54:55, 64:10, 65:12, 68:35, 85:12, 89:29-31, 98:8-9"
            }
        ],
        "ar": "اِنَّ اللّٰہَ یُدۡخِلُ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ؕ اِنَّ  اللّٰہَ  یَفۡعَلُ  مَا  یُرِیۡدُ ﴿۱۵﴾ ",
        "ur": "یقیناً اللہ اُنہیں جو ایمان لائے اور نیک اعمال بجا لائے ایسی جنتوں میں داخل کرے گا جن کے دامن میں نہریں بہتی ہیں۔ یقیناً اللہ جو چاہتا ہے کرتا ہے۔",
        "v5": {
            "text": "[a]Verily, Allah will cause those who believe and do good deeds to enter Gardens beneath which rivers flow; surely Allah does what He will.[2448]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:278; 4:176; 10:10; 13:30; 14:24."
                },
                {
                    "ref": "2448",
                    "note": "<p><strong>Commentary:</strong></p><p>Whereas the preceding two verses purport to say that idol worshippers get no gain from their evil practices or if at all they happen to derive any benefit from them it is quite insubstantial and transitory, the present verse says that the advantages of true faith and good works are manifold and enduring.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 6439,
                "topic": "Disbelief: <i>Kufr</i>: challenge to",
                "verses": "2:7-21, 2:24, 8:32, 10:39, 11:13-14, 17:89, 52:34-35"
            },
            {
                "id": 9465,
                "topic": "Islam: enemies of",
                "verses": "5:34-35, 2:193, 3:120, 7:183, 59:15, 61:8, 88:3-8, 100:10-12"
            },
            {
                "id": 12294,
                "topic": "Muhammad<sup>(sa)</sup>: and disbelievers",
                "verses": "15:89-98, 2:7, 2:110, 2:119, 2:192, 2:218, 3:33, 3:128, 3:177, 3:197, 4:91, 4:103, 5:42, 5:55, 6:34, 8:31, 9:2, 9:4, 9:32, 9:40, 9:73, 9:123, 10:66, 11:13, 13:28, 15:3, 16:128, 18:7, 20:134, 25:5, 26:4, 27:71, 28:57, 29:51, 35:5, 35:9, 36:77, 41:6, 48:30, 52:34, 66:10, 68:52, 73:11, 93:6, 94:2-4"
            },
            {
                "id": 15953,
                "topic": "Rope: <i>Habl</i>",
                "verses": "3:104, 3:113, 7:41, 50:17, 111:5, 111:6"
            }
        ],
        "ar": "مَنۡ کَانَ یَظُنُّ  اَنۡ لَّنۡ یَّنۡصُرَہُ اللّٰہُ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ  فَلۡیَمۡدُدۡ  بِسَبَبٍ  اِلَی السَّمَآءِ  ثُمَّ لۡیَقۡطَعۡ فَلۡیَنۡظُرۡ ہَلۡ یُذۡہِبَنَّ  کَیۡدُہٗ   مَا  یَغِیۡظُ ﴿۱۶﴾ ",
        "ur": "جو شخص یہ گمان کرنے لگا ہے کہ اللہ اِس (رسول) کی دنیا اور آخرت میں مدد نہیں کرے گا تو چاہئے کہ وہ آسمان کی طرف رستہ بنائے پھر (اس مدد کو) کاٹ دے پھر دیکھ لے کہ کیا اس کی تدبیر وہ بات دور کر سکتی ہے جو (اسے) غصہ دلاتی ہے۔",
        "v5": {
            "text": "Whoso thinks that Allah will not help him (the Prophet) in this world and the Hereafter, let him, <i>if he can</i>, find a way to heaven, and let him cut off <i>the Divine help</i>. Then let him see if his device can remove that which enrages <i>him</i>.[2449]",
            "notes": [
                {
                    "ref": "2449",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse is generally misunderstood and misinterpreted. We have tried to make the meaning clear by supplying the words \"the Prophet\" within brackets and the expressions \"the Divine help\" and \"if he can\" and the pronoun \"him\" in italics. The verse seems to hold out a challenge to disbelievers to do their worst against the Holy Prophet; and then see if they can stop Divine help which he is constantly receiving and will continue to receive from on high. It is decreed in the heavens that Islam will make steady and uninterrupted progress and that no one can alter the Divine decree; and that only death will save disbelievers from the humiliating and painful sight of seeing Islam making rapid progress. If the word سـمـاء be interpreted as \"roof\" or \"ceiling\" the verse would signify, \"if the opponents of the Holy Prophetare enraged at the success of his mission, then let them hang themselves by fixing a rope to the ceiling and cutting it off. But even then Divine assistance will not stop coming.\" This meaning is supported by 3:120 where disbelievers are reproved and reprimanded in the words, \"Die in your rage, surely Allah knows full well what is in your hearts.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 1659,
                "topic": "Allah: guides towards the right path",
                "verses": "16:10, 2:143, 2:214, 2:273, 3:74, 6:40, 6:89, 6:127, 6:154, 7:179, 9:115, 10:26, 10:36, 13:28, 14:5, 16:94, 17:98, 18:18, 24:36, 24:47, 28:57, 29:70, 33:5, 34:7, 35:9, 39:24, 39:38, 42:14, 74:32"
            },
            {
                "id": 3852,
                "topic": "Ayah: verses",
                "verses": "8:55, 2:42, 3:114, 8:3, 13:2, 16:102, 19:59, 39:72"
            },
            {
                "id": 8220,
                "topic": "Guidance: Allah gives",
                "verses": "20:51, 2:121, 2:186, 2:214, 3:74, 3:102, 4:69, 5:17, 6:36, 6:72, 6:89, 6:150, 7:44, 7:179, 10:10, 10:26, 10:36, 13:28, 13:32, 14:5, 14:13, 16:10, 16:94, 16:122, 19:77, 22:38, 24:36, 24:47, 26:63, 26:79, 28:57, 29:70, 31:5-6, 33:5, 35:9, 37:119, 39:19, 39:24, 39:38, 42:14, 47:18, 48:3, 48:21, 49:18, 64:12, 74:32, 76:4, 93:8"
            }
        ],
        "ar": "وَ کَذٰلِکَ  اَنۡزَلۡنٰہُ اٰیٰتٍۭ بَیِّنٰتٍ ۙ وَّ اَنَّ اللّٰہَ  یَہۡدِیۡ  مَنۡ  یُّرِیۡدُ ﴿۱۷﴾ ",
        "ur": "اور اسی طرح ہم نے اسے کھلی کھلی روشن آیات کی صورت میں اتارا ہے۔ اور (حق یہ ہے کہ) اللہ اسے ہدایت دیتا ہے جو (ہدایت) چاہتا ہے۔",
        "v5": {
            "text": "And thus have We sent it (the Quran) down as manifest Signs, and surely Allah guides whom He will.",
            "notes": null
        }
    },
    {
        "ch": 22,
        "v": 18,
        "v_": 17,
        "topics": [
            {
                "id": 3605,
                "topic": "Attributes of Allah: Ash-Shahid (The Witness)",
                "verses": "4:80, 3:99, 4:167, 6:20, 13:44, 29:53, 33:56, 34:48, 41:54, 48:29"
            },
            {
                "id": 5077,
                "topic": "Christians & Christianity",
                "verses": "2:63, 2:112-13, 2:121, 2:136, 2:141, 3:68, 5:15, 5:19, 5:52, 5:70, 5:83, 9:30, 9:32, 18:9-44, 20:106, 61:15"
            },
            {
                "id": 6052,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: render justice on the",
                "verses": "37:21, 17:14-15, 2:114, 3:186, 4:142, 10:94, 16:125, 21:48, 22:70, 32:26, 45:18, 60:4"
            },
            {
                "id": 7199,
                "topic": "Equality of man",
                "verses": "49:14, 2:179, 3:116, 3:196, 4:4, 4:8, 4:13, 4:33, 4:96, 4:125, 10:88, 16:72, 16:98, 24:62, 33:36, 33:38"
            },
            {
                "id": 8340,
                "topic": "Hakam: Allah as",
                "verses": "3:56, 4:142, 6:58, 6:115, 7:88, 7:187, 10:94, 10:110, 11:46, 12:81, 16:125, 21:113, 22:57, 22:70, 24:52, 26:119, 34:27, 39:4, 39:24, 39:47, 40:35, 42:45, 45:18, 45:24, 60:11, 95:9"
            },
            {
                "id": 9549,
                "topic": "Israelites: belief of",
                "verses": "3:94, 5:70, 2:63, 4:161, 5:45, 6:147, 16:119, 62:7"
            },
            {
                "id": 10695,
                "topic": "Magians",
                "verses": "30:31"
            },
            {
                "id": 15447,
                "topic": "Religion: Allah will judge between",
                "verses": null
            },
            {
                "id": 15985,
                "topic": "Sabian: <i>Sabi</i>",
                "verses": "2:63, 5:70, 27:25"
            },
            {
                "id": 16157,
                "topic": "Salvation: of non-Muslims",
                "verses": "2:63, 20:52-53"
            }
        ],
        "ar": "اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ الَّذِیۡنَ ہَادُوۡا وَ الصّٰبِئِیۡنَ وَ النَّصٰرٰی وَ الۡمَجُوۡسَ وَ الَّذِیۡنَ اَشۡرَکُوۡۤا ٭ۖ اِنَّ اللّٰہَ یَفۡصِلُ بَیۡنَہُمۡ  یَوۡمَ الۡقِیٰمَۃِ ؕ اِنَّ اللّٰہَ  عَلٰی  کُلِّ  شَیۡءٍ  شَہِیۡدٌ ﴿۱۸﴾",
        "ur": "یقیناً وہ لوگ جو ایمان لائے اور وہ جو یہودی ہوئے اور صابئین اور نصارٰی اور مجوسی اور وہ لوگ جنہوں نے شرک کیا اللہ ضرور ان کے درمیان قیامت کے دن فیصلہ کرے گا۔ یقیناً اللہ ہر چیز پر گواہ ہے۔",
        "v5": {
            "text": "<i>As to</i> those who believe, and the Jews, and the Sabians, and the Christians, and the Magians and the idolaters, verily, Allah will judge between them on the Day of Resurrection; surely, Allah is Witness over all things.[2450]",
            "notes": [
                {
                    "ref": "2450",
                    "note": "<p><strong>Important Words:</strong></p><p>المجوس (Magians) is derived from مجس (<i>majjasa</i>). They say مجسه i.e. he made him a Magian. The Holy Prophet is reported to have said,</p><p>ما من مولود الا یولد علی الفطرة فأبواہ یھودانه و ینصرانه و یمجسانه</p><p>i.e.\" Every child is born on the true Islamic nature but his parents make him a Jew, Christian or Magian\" (Bukhari, <i>Kitabul-Jana’iz </i>&amp; Muslim). المجوس (Magians) are a people who worship the sun and the fire; sometimes the word مجوسی is used for a magician or a philosopher. It applies particularly to the Zoroastrians whose sacred Book is Zend-Avesta. In later Arabic literature, the word is also used to denote the people of northern Europe (Aqrab &amp; Enc. of Islam).</p><p><strong>Commentary:</strong></p><p>The present verse read in conjunction with 2:63 and 5:70, clears the misunderstanding to which these two verses are mistakenly understood to give rise. These verses do not bear the construction put upon them by some Christian writers, viz. that Christians, Jews and Sabians are equally eligible to salvation along with true believers. The Quran lends support to no such belief. According to it the only religion acceptable to God is Islam (3:20, 86). The present verse lays down only a criterion to test the truth of all these religions and not that it regards all of them as true. The implied criterion is that of all these religions the true one will prevail over others in the \"Hour of Decision.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 19,
        "v_": 18,
        "topics": [
            {
                "id": 1499,
                "topic": "Allah: everything submits to",
                "verses": "13:16, 2:113, 16:50, 55:7"
            },
            {
                "id": 1520,
                "topic": "Allah: existence of",
                "verses": "2:29, 2:165, 2:187, 6:74, 7:173, 10:7, 10:32, 13:3-5, 25:3-4, 27:61-67, 30:21-28, 31:11-12, 45:3-7, 87:2-6"
            },
            {
                "id": 1802,
                "topic": "Allah: if so willed, <i>Lau sha’allah</i>",
                "verses": "10:100, 2:221, 2:254, 4:91, 5:49, 6:36, 6:108, 6:113, 6:138, 6:150, 10:17, 11:119, 12:22, 16:94, 22:15, 25:46, 42:9, 58:22, 76:31, 85:17"
            },
            {
                "id": 5551,
                "topic": "Dabbatul-Ard: creatures, beasts",
                "verses": "27:83, 2:165, 6:39, 8:23, 8:56, 11:7, 11:57, 16:50, 16:62, 31:11, 34:15, 35:29, 35:46, 42:30, 45:5, 81:6"
            },
            {
                "id": 6967,
                "topic": "Earth: <i>Al-Ard</i>: creation of the",
                "verses": "67:16, 3:191, 6:74, 7:55, 10:4, 11:8, 14:20, 14:33, 20:5, 21:31, 25:60, 29:45, 29:62, 30:23, 32:5, 35:2, 36:82, 38:28, 39:6, 40:58, 41:10-12, 62:2, 64:4, 65:13, 79:31-34, 84:4"
            },
            {
                "id": 8969,
                "topic": "Honour: of man",
                "verses": "17:71, 43:71, 44:50"
            },
            {
                "id": 9186,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: punishment for",
                "verses": "9:3-14, 2:166-168, 3:152, 19:46, 22:32, 22:73, 71:24-26"
            },
            {
                "id": 10939,
                "topic": "Mankind: Allah and",
                "verses": "49:14, 1:4, 2:22, 10:93, 12:39, 13:7, 13:32, 14:53, 17:71, 27:74, 30:31, 35:3, 40:58, 40:62, 45:27, 57:26, 114:2-4"
            },
            {
                "id": 11539,
                "topic": "Moon",
                "verses": "2:190, 6:78, 6:97, 7:55, 7:131, 10:6, 12:5, 13:3, 14:34, 16:13, 21:34, 25:62, 29:62, 31:30, 35:14, 36:40-41, 39:6, 41:38, 55:6, 71:17, 84:19, 91:3"
            },
            {
                "id": 12190,
                "topic": "Mountains: <i>Jibal</i>: created for man",
                "verses": "16:16, 13:4, 15:20, 21:32, 24:44, 27:62, 31:11, 35:28, 41:11, 50:8, 77:28, 78:8, 79:33, 88:20"
            },
            {
                "id": 12855,
                "topic": "Najm: <i>Kaukab</i>, star",
                "verses": "53:2-3, 6:77, 6:98, 7:55, 12:5, 16:13, 16:17, 24:36, 37:7, 41:13, 56:76, 67:6, 77:9, 81:3, 82:3, 86:2-4"
            },
            {
                "id": 14628,
                "topic": "Prostration: <i>Sajdah</i>",
                "verses": "13:16, 3:114, 4:103, 7:207, 9:112, 16:50-51, 17:110, 19:59, 22:78, 25:61, 27:26-27, 32:16, 38:25, 41:39, 48:30, 53:63, 55:7, 76:27, 84:22, 96:20"
            },
            {
                "id": 16586,
                "topic": "Shari‘ah",
                "verses": "5:102, 4:29, 10:14, 12:2"
            },
            {
                "id": 17368,
                "topic": "Sun: and Moon",
                "verses": "25:62, 2:190, 6:97, 7:55, 10:6, 13:3, 14:34, 16:13, 21:34, 25:46-47, 31:30, 35:14, 36:39-41, 39:6, 41:38, 55:6, 71:17, 75:8-10, 78:14, 84:17-19, 91:2-3"
            }
        ],
        "ar": "اَلَمۡ تَرَ اَنَّ اللّٰہَ یَسۡجُدُ لَہٗ  مَنۡ فِی السَّمٰوٰتِ وَ مَنۡ فِی الۡاَرۡضِ وَ الشَّمۡسُ وَ الۡقَمَرُ وَ النُّجُوۡمُ وَ الۡجِبَالُ وَ الشَّجَرُ وَ الدَّوَآبُّ وَ کَثِیۡرٌ  مِّنَ  النَّاسِ ؕ وَ کَثِیۡرٌ حَقَّ عَلَیۡہِ الۡعَذَابُ ؕ وَ مَنۡ  یُّہِنِ اللّٰہُ  فَمَا لَہٗ  مِنۡ مُّکۡرِمٍ ؕ اِنَّ اللّٰہَ  یَفۡعَلُ مَا  یَشَآءُ ﴿ؕٛ۱۹﴾",
        "ur": "کیا تُو نے نہیں دیکھا کہ اللہ ہی ہے کہ اسے سجدہ کرتا ہے جو آسمانوں میں ہے اور جو زمین میں ہے اور شمس وقمر بھی اور نجوم بھی اور پہاڑ اور درخت بھی اور چلنے پھرنے والے تمام جاندار اور بکثرت انسان بھی۔ جبکہ بہت سے ایسے ہیں جن پر اس کا عذاب لازم ہو چکا ہے۔ اور جسے اللہ رسوا کر دے تو اس کو عزت دینے والا کوئی نہیں۔ یقیناً اللہ جو چاہتا ہے کرتا ہے۔",
        "v5": {
            "text": "Hast thou not seen that [a]to Allah submits whosoever is in the heavens and whosoever is in the earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and the beasts, and many of mankind? But there are many who become deserving of punishment. And whomsoever Allah disgraces, none can raise him to honour. Verily, Allah does what He pleases.[2451]",
            "notes": [
                {
                    "ref": "a",
                    "note": "13:16; 16:49-50; 55:7."
                },
                {
                    "ref": "2451",
                    "note": "<p><strong>Commentary:</strong></p><p>God has fixed certain laws—natural laws, which all created things, animate or inanimate, have to obey. There is no escape from submission to these laws. There are, however, certain other laws—the laws of the Shari‘ah—which God has made for the guidance of man. These laws man may obey or disobey and defy and thus may suffer the consequences of his defiance.</p><p>The verse further brings home to idolaters the folly and futility of their taking the objects of nature for worship besides Allah. It says that all these things depend upon Him for their very existence. They all submit to the laws He has fixed for them and cannot live independently of God for a moment. It is sheer folly, therefore, to adore and worship things and beings which are themselves subject to God-made laws. The expression یسجد له کثیر من الناس و کثیر حق علیه العذاب besides the meaning given in the text, may also mean that many from among men submit to Allah and many others incur His displeasure and punishment because they do not submit to laws made by Him.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 6489,
                "topic": "Disbelief: <i>Kufr</i>: punishment of a",
                "verses": "2:7-21, 2:25, 2:40, 2:91, 2:105, 2:127, 2:176, 3:11, 3:23, 3:57, 3:92, 3:132, 3:142, 4:19, 4:38, 4:57, 4:141, 4:152, 4:162, 5:11, 5:87, 6:31, 6:111, 7:51, 8:15, 8:37, 9:26, 9:49, 9:68, 13:36, 14:3, 16:28, 17:9, 18:103, 18:107, 21:40, 22:73, 29:55, 33:65-66, 34:34, 35:37, 36:64-65, 38:28, 39:33, 39:72, 41:51, 48:14, 67:7, 70:2-3, 76:5, 98:7"
            },
            {
                "id": 6648,
                "topic": "Dispute",
                "verses": "8:7, 2:85, 2:140, 3:21, 3:62, 3:66, 3:153, 4:66, 4:106, 7:72, 8:47, 11:33, 13:14, 16:5, 18:22, 22:4, 22:9, 22:68, 31:21, 40:5-6, 40:36, 40:48, 40:70, 42:17, 42:19, 42:36, 49:11, 53:13"
            },
            {
                "id": 7607,
                "topic": "Fire: <i>An-Nar</i>: of Hell",
                "verses": "52:14, 2:25, 2:40, 2:81, 2:82, 2:127, 2:168, 2:175-176, 2:202, 2:218, 2:222, 2:258, 3:11, 3:17, 3:25, 3:103, 3:117, 3:132, 3:152, 3:186, 3:192-193, 4:15, 4:31, 5:30, 7:37, 7:39, 8:15, 9:17, 10:9, 11:17, 13:6, 14:31, 16:63, 18:30, 21:40, 23:105, 24:58, 28:42, 29:26, 66:7, 111:4"
            },
            {
                "id": 8681,
                "topic": "Hell: <i>Jahannam</i>: conditions in",
                "verses": "19:69, 17:98, 3:107, 3:182, 6:71, 8:51, 10:28, 11:107, 14:17, 14:51, 15:45, 16:30, 18:30, 18:101, 19:72, 21:40, 21:101, 23:105, 25:35, 26:92, 27:91, 32:21, 37:63, 38:58, 39:61, 39:72-73, 40:72-73, 44:44-47, 44:49, 47:16, 54:49, 55:45, 56:43-45, 56:53-55, 56:94, 67:8, 67:28, 69:33, 69:37, 76:5, 78:25-26, 88:6-8, 102:7"
            },
            {
                "id": 18451,
                "topic": "Water: <i>Ma’</i>: as punishment",
                "verses": "38:58, 6:71, 7:51, 10:5, 14:17, 37:68, 40:73, 44:47, 44:49, 47:16, 56:43, 56:55, 56:94, 78:26"
            }
        ],
        "ar": "ہٰذٰنِ خَصۡمٰنِ اخۡتَصَمُوۡا فِیۡ رَبِّہِمۡ ۫ فَالَّذِیۡنَ کَفَرُوۡا قُطِّعَتۡ لَہُمۡ ثِیَابٌ مِّنۡ نَّارٍ ؕ یُصَبُّ مِنۡ فَوۡقِ رُءُوۡسِہِمُ الۡحَمِیۡمُ ﴿ۚ۲۰﴾ ",
        "ur": "یہ دو جھگڑالو ہیں جنہوں نے اپنے ربّ کے بارہ میں جھگڑا کیا۔ پس وہ لوگ جنہوں نے انکار کیا ان کے لئے آگ کے کپڑے کاٹے جائیں گے۔ ان کے سروں کے اوپر سے سخت گرم پانی انڈیلا جائے گا۔",
        "v5": {
            "text": "These two are two disputants who dispute concerning their Lord. As for those who disbelieve, garments of fire will be cut out for them; <i>and</i> [a]boiling water will be poured down over their heads,[2452]",
            "notes": [
                {
                    "ref": "2452",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference in the words \"These two\" is to two classes of men—the believers and disbelievers, i.e. those who obey and willingly submit to the laws of nature and those of the Shari‘ah and those who flout, disobey and defy these laws. The verse means to say that the second class of men will suffer the evil consequences of their disobedience and defiance.</p>"
                },
                {
                    "ref": "a",
                    "note": "44:49; 55:45; 56:43-44."
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 8681,
                "topic": "Hell: <i>Jahannam</i>: conditions in",
                "verses": "19:69, 17:98, 3:107, 3:182, 6:71, 8:51, 10:28, 11:107, 14:17, 14:51, 15:45, 16:30, 18:30, 18:101, 19:72, 21:40, 21:101, 23:105, 25:35, 26:92, 27:91, 32:21, 37:63, 38:58, 39:61, 39:72-73, 40:72-73, 44:44-47, 44:49, 47:16, 54:49, 55:45, 56:43-45, 56:53-55, 56:94, 67:8, 67:28, 69:33, 69:37, 76:5, 78:25-26, 88:6-8, 102:7"
            },
            {
                "id": 16911,
                "topic": "Skin",
                "verses": "4:57, 16:81, 20:98, 38:42-44, 39:24, 41:21-23, 70:17"
            }
        ],
        "ar": "یُصۡہَرُ  بِہٖ  مَا فِیۡ  بُطُوۡنِہِمۡ  وَ الۡجُلُوۡدُ ﴿ؕ۲۱﴾ ",
        "ur": "اس سے جو کچھ ان کے پیٹوں میں ہے گلا دیا جائے گا اور ان کی جِلدیں بھی۔",
        "v5": {
            "text": "[a]Whereby that which is in their bellies, and <i>their</i> skins too, will be melted;[2453]",
            "notes": [
                {
                    "ref": "a",
                    "note": "44:46."
                },
                {
                    "ref": "2453",
                    "note": "<p><strong>Important Words:</strong></p><p>یصھر (will be melted) is formed from صھر which means, he melted or liquefied fat or a thing; he or it burned; he thoroughly cooked with fire. صھرته الشمس means, the sun affected him severely by its heat (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse purports to say that the flouters and defiers of Divine Laws will suffer both internal and external punishment, i.e. they will lose their peace of mind and will also suffer corporal punishment. The verse also seems to point, on the one hand, to the extreme severity of the punishment of Hell and on the other to its temporary nature. It purports to say that the fire of Hell will burn and melt whatever there would be in the bellies and skins of disbelievers, i.e. it will melt away the inward and outward dross and impurities of the sins committed by them and thus after cleansing and purifying them of their impurities and dross will make them deserving of salvation.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 22,
        "v_": 21,
        "topics": [
            {
                "id": 8681,
                "topic": "Hell: <i>Jahannam</i>: conditions in",
                "verses": "19:69, 17:98, 3:107, 3:182, 6:71, 8:51, 10:28, 11:107, 14:17, 14:51, 15:45, 16:30, 18:30, 18:101, 19:72, 21:40, 21:101, 23:105, 25:35, 26:92, 27:91, 32:21, 37:63, 38:58, 39:61, 39:72-73, 40:72-73, 44:44-47, 44:49, 47:16, 54:49, 55:45, 56:43-45, 56:53-55, 56:94, 67:8, 67:28, 69:33, 69:37, 76:5, 78:25-26, 88:6-8, 102:7"
            },
            {
                "id": 9412,
                "topic": "Iron: <i>Hadid</i>",
                "verses": "57:26, 17:51, 18:97, 34:11, 40:72, 76:5"
            },
            {
                "id": 11403,
                "topic": "Metals",
                "verses": "55:36, 18:97, 34:11, 34:13, 44:46, 57:26, 70:9"
            }
        ],
        "ar": "وَ لَہُمۡ  مَّقَامِعُ مِنۡ  حَدِیۡدٍ ﴿۲۲﴾ ",
        "ur": "اور ان کے لئے لوہے کے ہتھوڑے ہوں گے۔",
        "v5": {
            "text": "And <i>for their further punishment</i> there will be maces of iron.[2454]",
            "notes": [
                {
                    "ref": "2454",
                    "note": "<p><strong>Important Words:</strong></p><p>مقامع (maces) is the plural of مقمعة which is derived from قمع. They say قمعه i.e. he beat him with a mace or iron rod; he prevented him by force from what he intended; he dominated him and disgraced him; he struck on the upper part of his head. مقمعة means, a mace; an iron rod or club to lead an elephant; a hooked staff (Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 8681,
                "topic": "Hell: <i>Jahannam</i>: conditions in",
                "verses": "19:69, 17:98, 3:107, 3:182, 6:71, 8:51, 10:28, 11:107, 14:17, 14:51, 15:45, 16:30, 18:30, 18:101, 19:72, 21:40, 21:101, 23:105, 25:35, 26:92, 27:91, 32:21, 37:63, 38:58, 39:61, 39:72-73, 40:72-73, 44:44-47, 44:49, 47:16, 54:49, 55:45, 56:43-45, 56:53-55, 56:94, 67:8, 67:28, 69:33, 69:37, 76:5, 78:25-26, 88:6-8, 102:7"
            }
        ],
        "ar": "کُلَّمَاۤ  اَرَادُوۡۤا اَنۡ یَّخۡرُجُوۡا مِنۡہَا مِنۡ غَمٍّ  اُعِیۡدُوۡا فِیۡہَا ٭ وَ ذُوۡقُوۡا عَذَابَ الۡحَرِیۡقِ ﴿٪۲۳﴾ ",
        "ur": "جب کبھی وہ ارادہ کریں گے کہ غم کی شدت کی وجہ سے اس میں سے نکل جائیں وہ اسی میں لوٹا دئیے جائیں گے اور (اُن سے کہا جائے گا کہ) تم آگ کا عذاب چکھو۔",
        "v5": {
            "text": "[b]Whenever they will seek to get out of it from anguish, they will be turned back into it: and <i>it will be said to them</i>, [c]‘Taste ye the punishment of burning!’[2455]",
            "notes": [
                {
                    "ref": "b",
                    "note": "5:38; 32:21."
                },
                {
                    "ref": "c",
                    "note": "8:15; 34:43."
                },
                {
                    "ref": "2455",
                    "note": "<p><strong>Commentary:</strong></p><p>The expression من غم may also mean, on account of غم (anguish), or غم being case in apposition with the pronoun ھا (<i>ha</i>), the expression may mean, whenever they will seek to get out of it, i.e. out of غم (anguish).</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 24,
        "v_": 23,
        "topics": [
            {
                "id": 778,
                "topic": "Adornment: <i>Zinah</i>: of heavens",
                "verses": "7:32-33, 15:17, 37:7, 41:13, 50:7, 67:6"
            },
            {
                "id": 4722,
                "topic": "Bracelets of gold",
                "verses": "35:34, 43:54, 76:22"
            },
            {
                "id": 7937,
                "topic": "Garments",
                "verses": "74:2, 2:188, 7:27-28, 14:51, 16:82, 25:48, 33:60, 35:34, 76:13, 78:11"
            },
            {
                "id": 8003,
                "topic": "Gold: <i>Dhahab</i>",
                "verses": "3:15, 9:34, 18:32, 35:34, 43:72"
            },
            {
                "id": 13438,
                "topic": "Paradise: <i>Jannah</i>: believers who do good works will enter",
                "verses": "2:26, 2:83, 3:199, 4:58, 4:123, 4:125, 7:43, 10:10, 11:24, 14:24, 15:46, 16:31-32, 18:108, 19:61, 19:64, 20:76-77, 22:15, 22:57, 25:16, 29:59, 30:16, 31:9, 32:20, 38:50-51, 40:41, 42:23, 44:52-53, 47:13, 51:16, 54:55, 64:10, 65:12, 68:35, 85:12, 89:29-31, 98:8-9"
            },
            {
                "id": 13488,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 14434,
                "topic": "Prophecies in the Holy Qur’an: about: Islam",
                "verses": "30:3-5, 2:116, 8:61, 9:33, 12:103, 16:78, 17:2, 19:41, 22:27, 32:6, 33:23, 35:12, 38:2, 41:54, 43:90, 48:29-30, 53:2, 56:4, 58:22, 60:8, 61:10, 70:37-38, 79:2-6, 81:19, 81:24-25, 82:2, 83:30-35, 89:23, 90:2-3, 91:2-5, 93:2-3, 94:6-7, 99:2-7, 100:10-12"
            },
            {
                "id": 15849,
                "topic": "Righteous: <i>Salihin</i>: rewarded",
                "verses": "13:36, 3:126, 3:134-135, 3:173, 3:180, 7:157, 7:170-171, 7:197, 9:4, 9:123, 11:116, 15:46, 16:32, 19:86, 25:16, 25:71, 26:91, 29:8, 29:10, 29:28, 29:59, 30:16, 30:45-46, 34:5, 35:8, 38:50, 39:62, 39:74-75, 41:9, 41:19, 43:36, 44:52-57, 45:20, 45:31, 47:3, 47:16, 47:18, 47:37, 49:4, 50:32, 51:16, 52:18, 54:55, 64:10, 65:12, 68:51, 77:42, 78:32-37, 83:23, 98:8"
            },
            {
                "id": 15930,
                "topic": "River: of Paradise",
                "verses": "3:137, 7:44, 9:72, 47:16"
            }
        ],
        "ar": "اِنَّ اللّٰہَ یُدۡخِلُ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ  یُحَلَّوۡنَ فِیۡہَا مِنۡ اَسَاوِرَ مِنۡ ذَہَبٍ وَّ لُؤۡلُؤًا ؕ وَ لِبَاسُہُمۡ  فِیۡہَا حَرِیۡرٌ ﴿۲۴﴾ ",
        "ur": "یقیناً اللہ ان لوگوں کو جو ایمان لائے اور نیک اعمال بجا لائے ایسی جنتوں میں داخل کرے گا جن کے دامن میں نہریں بہتی ہوں گی۔ ان میں انہیں سونے کے کڑے اور موتی پہنائے جائیں گے اور اُن میں اُن کا لباس ریشم ہوگا۔",
        "v5": {
            "text": "But Allah will cause those who believe and do good deeds to enter Gardens beneath which rivers flow. [a]They will be adorned therein with bracelets of gold, and <i>with</i> pearls; and [b]their raiment therein will be of silk.[2456]",
            "notes": [
                {
                    "ref": "a",
                    "note": "18:32; 35:34; 76:22."
                },
                {
                    "ref": "b",
                    "note": "76:13."
                },
                {
                    "ref": "2456",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse refers to the believers, the second of the two classes of men referred to in v. 20 above. The first class of men—the disbelievers, have been referred to in vv. 20-23 above.</p><p>The verse embodies a prophecy which met with remarkable fulfilment. It was made at a time when the very fate of Islam hung in the balance and there was no safety or security for Muslims anywhere. But afterwards in fulfilment of this prophecy they were given most fertile and beautiful countries to rule. They had the choicest of fruits to eat and they lived in gardens beneath which streams flowed. The Holy Prophet is reported to have said, \"The Nile and the Euphrates are two of the streams of Paradise\" (Muslim, ch. <i>Al-Jannah</i>). So it is clear that the Holy Prophet and his Companions knew that they were promised 'gardens' not only in the next life but in this world also and that they also knew that by 'gardens' in this life were meant rich and fertile lands once ruled by the Kings of Persia and the Emperors of the eastern Roman Empire. During the Caliphate of ‘Umar, Muslim armies fought on two fronts, in Mesopotamia and Syria, and when Arab chiefs with their respective claims presented themselves before him and offered their services, he asked them to which of \"the two promised lands,\" Mesopotamia or Syria, they would like to go. This shows that the Companions of the Holy Prophet knew and understood that the 'gardens' promised them in the Quran were the rich provinces of the Persian Empire and of Syria and Egypt. The prophecy was literally fulfilled. When Persia was conquered, bracelets of gold and pearl and silken garments formed part of the booty. These things were distributed among the Muslims and Suraqah, a companion of the Holy Prophet, was made by ‘Umar to wear the bracelets of gold which the kings of Persia used to wear on special State occasions. Thus was fulfilled another prophecy of the Holy Prophet according to which he is reported to have once said to Suraqah, \"How would you feel when you will be made to wear the golden bracelets of Chosroes (Al-Khasa’isul-Kubra, vol. II, p. 113).</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 25,
        "v_": 24,
        "topics": [
            {
                "id": 3280,
                "topic": "Attributes of Allah: Al-Hamid (Praiseworthy)",
                "verses": "22:65, 2:268, 4:132, 11:74, 14:2, 14:9, 31:13, 31:27, 41:43, 42:29, 60:7, 85:9"
            },
            {
                "id": 14763,
                "topic": "Pure",
                "verses": "3:39, 4:44, 4:161, 5:7, 16:98, 37:85, 40:65, 45:17, 61:13, 98:3"
            },
            {
                "id": 17609,
                "topic": "Tayyib: good things, <i>Tayyibat</i>",
                "verses": "5:101, 2:58, 2:173, 2:268, 4:3, 4:44, 4:161, 5:5-6, 5:88, 7:33, 7:158, 7:161, 8:27, 8:70, 10:94, 16:73, 17:71, 20:82, 24:27, 35:11, 45:17, 46:21"
            }
        ],
        "ar": "وَ ہُدُوۡۤا اِلٰی الطَّیِّبِ مِنَ الۡقَوۡلِ ۚۖ وَ ہُدُوۡۤا  اِلَی  صِرَاطِ  الۡحَمِیۡدِ ﴿۲۵﴾ ",
        "ur": "اور پاک قول کی طرف ان کی رہنمائی کی جائے گی اور صاحبِ حمد (اللہ) کی راہ کی طرف ان کی رہنمائی کی جائے گی۔",
        "v5": {
            "text": "And they will be guided to pure speech, and they will be guided to the path of the Praiseworthy <i>God</i>.[2456A]",
            "notes": [
                {
                    "ref": "2456A",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse shows that Paradise will not be a place of inactivity or idleness. On the other hand it will be a place of continuous work. Only the nature of the work will be different and there will be no fear of failure or fall as in this life. The spiritual progress of the righteous will be uniform and uninterrupted.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 26,
        "v_": 25,
        "topics": [
            {
                "id": 8401,
                "topic": "Haram: Sacred",
                "verses": "2:150-151, 2:145, 2:192, 2:195, 2:197, 2:199, 2:218, 5:3, 5:98, 8:35, 9:7, 9:19, 9:28, 9:36-37, 14:38, 17:2, 22:31, 22:33, 22:37, 27:92, 48:26, 48:28"
            },
            {
                "id": 9202,
                "topic": "Ilhad: deviation",
                "verses": "7:181, 16:10, 18:28, 27:61"
            },
            {
                "id": 12145,
                "topic": "Mosque",
                "verses": "2:115, 2:145, 2:151, 2:188, 2:192, 2:218, 5:3, 7:30, 7:32, 8:35, 9:17-19, 9:108, 17:2, 48:26, 48:28, 72:19"
            },
            {
                "id": 18524,
                "topic": "Way of: <i>Sabil</i>: hindering from the Allah",
                "verses": "8:37, 3:100, 4:161, 4:168, 7:46, 7:87, 8:48, 9:34, 11:20, 14:4, 16:89, 16:95, 47:2, 47:33, 47:35, 58:17"
            }
        ],
        "ar": "اِنَّ الَّذِیۡنَ کَفَرُوۡا وَ یَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ وَ الۡمَسۡجِدِ  الۡحَرَامِ  الَّذِیۡ جَعَلۡنٰہُ  لِلنَّاسِ سَوَآءَ ۣ  الۡعَاکِفُ فِیۡہِ وَ الۡبَادِ ؕ وَ مَنۡ یُّرِدۡ  فِیۡہِ  بِاِلۡحَادٍۭ بِظُلۡمٍ  نُّذِقۡہُ  مِنۡ  عَذَابٍ  اَلِیۡمٍ ﴿٪۲۶﴾ ",
        "ur": "یقیناً وہ لوگ جنہوں نے کفر کیا اور وہ اللہ کی راہ سے اور اُس مسجدِ حرام سے روکتے ہیں جسے ہم نے سب انسانوں کے فائدہ کے لئے بنایا ہے اس طرح کہ اس میں (خدا کی خاطر) بیٹھ رہنے والے اور بادیہ نشین (سب) برابر ہیں، اور جو بھی ظلم کی راہ سے اس میں کجی پیدا کرنے کی کوشش کرے گا اسے ہم دردناک عذاب چکھائیں گے۔",
        "v5": {
            "text": "<i>As to</i> those who disbelieve, and hinder <i>men</i> from the way of Allah, and <i>from</i> [a]the Sacred Mosque, which We have appointed equally for all men, be they dwellers therein or visitors from the desert, and whoso seeks wrongfully to deviate therein <i>from the right path</i>—We shall cause him to taste of a grievous punishment.[2457]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:35; 16:89; 43:38; 48:26."
                },
                {
                    "ref": "2457",
                    "note": "<p><strong>Important Words:</strong></p><p>عاکف means, one who dwells in a place or dwells there permanently. Here it means one who dwells in Mecca or dwells in it constantly. See also 2:126 &amp; 21:53.</p><p>الباد (visitor from the desert) is derived from بدا. They say بدا القوم الی البادیة i.e. people went forth to the desert, or they went forth from the region of the towns to the pasturing places in the desert. حضارة which means, life in the towns, is contrary to بداوة which means, life in the desert. باد means, one who dwells in بادیة i.e. desert or tents; not remaining in his place; one who comes from outside the town, i.e. a visitor or an occasional visitor (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>This verse serves as an introduction to the subject of pilgrimage which is the central theme of this <i>Surah</i>. Circumambulation of the Sacred Mosque is the most important of the rituals and ceremonies of Pilgrimage, so a brief reference to the sacredness and importance of the Ka‘bah forms a befitting introduction to the subject of Hajj.</p><p>The reference in words \"those who hinder men from the way of Allah and from the Sacred Mosque\" may also be to a well-known incident connected with the Truce of Hudaibiyyah. In the 7th year of the Hijrah, the Holy Prophet, in fulfilment of a vision, left Medina with 1400 Companions to pay a visit to Mecca and perform <i>‘Umrah</i> or the Lesser Pilgrimage. When he reached a place called Hudaibiyyah, he was prevented by the Meccans from proceeding further. He returned to Medina after having signed a truce known as the Truce of Hudaibiyyah. This Truce, known after the name of the place at which it was signed, led to the conquest of Mecca and eventually of the whole of Arabia.</p><p>The verse also points to the Islamic principle of the equality of status of all men in a place of worship and by implication to the inherent equality of all human beings.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 27,
        "v_": 26,
        "topics": [
            {
                "id": 257,
                "topic": "Abraham: <i>Ibrahim(as)</i>: enjoined to clean and purify the House",
                "verses": "2:126"
            },
            {
                "id": 346,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 29:17-28, 37:84-114, 51:25-35"
            },
            {
                "id": 3942,
                "topic": "Baitul-Haram: <i>Ka‘bah</i>",
                "verses": "17:2, 2:126, 2:128, 2:159, 5:3, 5:98, 8:36, 14:38, 22:30, 28:58, 106:4-5"
            },
            {
                "id": 5084,
                "topic": "Circumambulate",
                "verses": "22:30, 2:126, 2:159"
            },
            {
                "id": 10078,
                "topic": "Ka‘bah: for Allah only",
                "verses": "17:2, 9:3, 8:35-36, 9:18-19, 9:28"
            },
            {
                "id": 10087,
                "topic": "Ka‘bah: rebuilt",
                "verses": "17:2, 2:128, 22:30"
            },
            {
                "id": 11626,
                "topic": "Moral Traits: cleanliness",
                "verses": "2:223, 2:126, 4:44, 5:7, 7:32, 9:103, 9:108, 22:30, 24:22, 33:34, 53:33, 56:80, 74:5-6, 87:15, 91:10-11"
            },
            {
                "id": 14435,
                "topic": "Prophecies in the Holy Qur’an: about: Islam",
                "verses": "30:3-5, 2:116, 8:61, 9:33, 12:103, 16:78, 17:2, 19:41, 22:24, 32:6, 33:23, 35:12, 38:2, 41:54, 43:90, 48:29-30, 53:2, 56:4, 58:22, 60:8, 61:10, 70:37-38, 79:2-6, 81:19, 81:24-25, 82:2, 83:30-35, 89:23, 90:2-3, 91:2-5, 93:2-3, 94:6-7, 99:2-7, 100:10-12"
            },
            {
                "id": 14469,
                "topic": "Prophecies in the Holy Qur’an: about: <i>Ka‘bah</i>",
                "verses": "5:98, 5:96"
            },
            {
                "id": 15320,
                "topic": "Raka‘: Bow down",
                "verses": "2:44, 2:126, 3:44, 5:56, 9:112, 22:78, 48:30, 77:49"
            },
            {
                "id": 16595,
                "topic": "Shirk: associating partners with Allah",
                "verses": "6:15, 10:106, 22:32, 28:88, 30:32"
            }
        ],
        "ar": "وَ اِذۡ بَوَّاۡنَا لِاِبۡرٰہِیۡمَ مَکَانَ الۡبَیۡتِ اَنۡ لَّا تُشۡرِکۡ بِیۡ شَیۡئًا وَّ طَہِّرۡ بَیۡتِیَ لِلطَّآئِفِیۡنَ وَ الۡقَآئِمِیۡنَ وَ الرُّکَّعِ السُّجُوۡدِ ﴿۲۷﴾ ",
        "ur": "اور جب ہم نے ابراہیم کے لئے خانہ کعبہ کی جگہ بنائی (یہ کہتے ہوئے کہ) میرا کسی کو شریک نہ ٹھہرا اور میرے گھر کو طواف کرنے والوں اور قیام کرنے والوں اور رکوع کرنے والوں (اور) سجدہ کرنے والوں کے لئے پاک وصاف رکھ۔",
        "v5": {
            "text": "And <i>remember the time</i> when We assigned to Abraham the site of the House <i>and said</i>, ‘Associate not anything with Me and [a]keep My House clean for those who perform the circuits, and those who stand up and those who bow down <i>and</i> fall prostrate <i>in Prayer</i>;[2458]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:126."
                },
                {
                    "ref": "2458",
                    "note": "<p><strong>Commentary:</strong></p><p>The Ka‘bah is variously mentioned in the Quran as بیتی i.e. My House (2:126 &amp; 22:27), as البیت المحرم i.e. the Sacred House (14:38), as المسجد الحرام i.e. the Sacred Mosque (2:151), as البیت i.e. the House (2:128, 159; 3:98; 8:36; 22:27), as البیت العتیق i.e. the Ancient House (22:30, 34), as البیت المعمور i.e. the Frequented House (52:5) and as اول بیت i.e. the First House (3:97). All these different appellations point to the eminence of the Ka‘bah as being the greatest centre of worship for mankind.</p><p>The words \"We assigned to Abraham the site of the House\" show that the site of the Ka‘bah had existed before Abraham’s time. In fact the Ka‘bah was built by Adam and as it appears from 3:97, it was the first House of worship built in the world. By the time of Abraham it had fallen into ruins and its site having been disclosed to him by revelation he and his son Ishmael, the Holy Prophet’s great progenitor, rebuilt it.</p><p>The words \"keep My House clean\" embodied both a commandment and a prophecy. The commandment was that the Ka‘bah was not to be polluted with idol worship as it had been built for the worship of the One True God and the prophecy lay in the fact that this commandment would be defied and the House of God would become the house of idols but would eventually be completely cleared of them. The prophecy was fulfilled when at the Fall of Mecca the Ka‘bah was cleared by the Holy Prophet of all the abominations and of the 360 idols that were kept in it. Thus the commandment, in a way, embodied a prophecy about the advent of the Holy Prophet; and the rebuilding of the Ka‘bah by Abraham and Ishmael was, in fact, the first step towards the fulfilment of that great prophecy. See also 2:128-130.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 28,
        "v_": 27,
        "topics": [
            {
                "id": 244,
                "topic": "Abraham: <i>Ibrahim(as)</i>: commanded to proclaim Pilgrimage",
                "verses": null
            },
            {
                "id": 346,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 29:17-28, 37:84-114, 51:25-35"
            },
            {
                "id": 4903,
                "topic": "Camel: <i>Ibil</i>: transportation for pilgrimage",
                "verses": "7:41"
            },
            {
                "id": 13932,
                "topic": "Pilgrimage: <i>Hajj</i>: proclamation of",
                "verses": "48:28, 9:3"
            },
            {
                "id": 14469,
                "topic": "Prophecies in the Holy Qur’an: about: <i>Ka‘bah</i>",
                "verses": "5:98, 5:96"
            }
        ],
        "ar": "وَ اَذِّنۡ فِی النَّاسِ بِالۡحَجِّ  یَاۡتُوۡکَ  رِجَالًا وَّ عَلٰی کُلِّ ضَامِرٍ یَّاۡتِیۡنَ مِنۡ کُلِّ فَجٍّ عَمِیۡقٍ ﴿ۙ۲۸﴾ ",
        "ur": "اور لوگوں میں حج کا اعلان کر دے وہ تیرے پاس پاپیادہ آئیں گے اور ہر ایسی سواری پر بھی جو لمبے سفر کی تکان سے دبلی ہو گئی ہو۔ وہ (سواریاں اور چیزیں) ہر گہرے اور دور کے رستے سے آئیں گی۔",
        "v5": {
            "text": "[a]And proclaim unto mankind the Pilgrimage. They will come to thee on foot, and on every lean camel, coming by every distant track,[2458A]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:198; 3:98."
                },
                {
                    "ref": "2458A",
                    "note": "<p><strong>Important Words:</strong></p><p>رجالا (on foot) is the plural of راجل, which means, one who walks on foot, a footman. رجل راجل means, a great walker (Lane). See also 2:240.</p><p>ضامر (lean camel) is active participle from ضمر which means, he or it was or became lean or slender and lean or lean and lank in the belly. ضامر means, lean and lank in the belly; a horse in a state of preparation for racing by its having been fed with food barely sufficient to sustain it after having become fat. خیل ضامرة means, horses in that state, i.e. lean and lank horses (Lane).</p><p>عمیق (distant) is derived from عمق which means, it was or became deep. عمیق when applied to a road means, remote or far-extending or long. بئر عمیقة means, a deep well (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The Pilgrimage as an institution began with Abraham as the words \"and proclaim unto mankind the Pilgrimage\" show. It was not an idolatrous institution incorporated into Islam by the Holy Prophet to conciliate the idol worshipping Arabs as some Christian writers have been led to think. From the time of Abraham, Pilgrimage has continued without a break to this day and will continue till the end of time. The Ka‘bah was once the centre of Pilgrimage for the Arabs alone, but now it is the centre of Pilgrimage for the whole Muslim world and is destined to become the spiritual centre for all mankind. It is when Islam will prevail in the world that the Ka‘bah will become a symbol of the Unity of God and of mankind. The time is not far off when there will be only One God, one Religion, one Prophet and one Book with the Ka‘bah as the one spiritual centre for the whole of mankind. That the Ka‘bah was destined one day to come into the possession of the Holy Prophet who was to set free captives \"not for price nor reward\" and at whose hands it was to become the spiritual centre for the whole of mankind was foretold several hundred years before the advent of the Holy Prophet by the Prophet Isaiah. Isaiah’s prophecy is as follows:</p><p>I have raised him up in righteousness; and I will direct his ways: He shall build my city, and he shall let go my captives, not for price nor reward, saith the Lord of hosts... the labour of Egypt, and merchandise of Ethiopia and of the Sabeans, men of stature, shall come over unto thee, and they shall be thine: They shall come after thee; in chains they shall come over, and they shall fall down unto thee, they shall make supplication unto thee, saying, surely God is in thee; and there is none else, there is no God (Isaiah 45: 13-14).</p><p>The prophecy is too clear to need any explanation. It evidently applies to the Holy Prophet.</p><p>The verse also constitutes a mighty prophecy. The proclamation that Ka‘bah would one day become a great centre to which people from distant lands would come to perform Hajj was made at Mecca at a time when the very fate of Islam was hanging in the balance. Life was not safe for the Holy Prophet and his followers. They were being driven away from their hearths and homes and did not know where to go. It was at that time that it was proclaimed to the world, as if with a beat of drum, that to the Ka‘bah would come people from all parts of the earth. The gathering in Mecca every year of many hundreds of thousands of Muslims from very distant lands bears an irrefutable testimony to the remarkable fulfilment of this prophecy.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 29,
        "v_": 28,
        "topics": [
            {
                "id": 4943,
                "topic": "Cattle: <i>An‘am</i>",
                "verses": "16:67, 20:55, 22:35, 25:50, 35:29"
            },
            {
                "id": 13939,
                "topic": "Pilgrimage: <i>Hajj</i>: rites of",
                "verses": "48:28, 2:159, 2:197-201, 2:204"
            },
            {
                "id": 14025,
                "topic": "Poor",
                "verses": "90:12-17, 2:272, 3:182, 4:7, 4:136, 9:60, 24:33, 28:25, 35:16, 47:39, 69:35, 107:4"
            }
        ],
        "ar": "لِّیَشۡہَدُوۡا مَنَافِعَ  لَہُمۡ  وَ یَذۡکُرُوا  اسۡمَ اللّٰہِ فِیۡۤ  اَیَّامٍ مَّعۡلُوۡمٰتٍ عَلٰی مَا رَزَقَہُمۡ مِّنۡۢ بَہِیۡمَۃِ الۡاَنۡعَامِ ۚ فَکُلُوۡا مِنۡہَا وَ اَطۡعِمُوا  الۡبَآئِسَ الۡفَقِیۡرَ ﴿۫۲۹﴾ ",
        "ur": "تا کہ وہ وہاں پر اپنے فوائد کا مشاہدہ کر سکیں اور چند معروف دنوں میں اللہ کے نام کا ذکر (بلند) کریں اس (احسان) پر کہ اس نے مویشی چوپایوں کے ذریعہ انہیں رزق عطا کیا ہے۔ پس ان میں سے (خود بھی) کھاؤ اور محتاج ناداروں کو بھی کھلاؤ۔",
        "v5": {
            "text": "That [a]they may witness <i>its</i> benefits for them and may mention the name of Allah, [b]during the appointed days, over the quadrupeds of <i>the class </i><i>of</i> cattle that He has provided for them. Then eat ye thereof and feed the distressed, the needy.[2459]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:199; 5:3."
                },
                {
                    "ref": "b",
                    "note": "2:204."
                },
                {
                    "ref": "2459",
                    "note": "<p><strong>Commentary:</strong></p><p>Apart from the spiritual good that the Pilgrimage does to a Muslim, it possesses great social and political significance. It has great potentialities for welding different Muslim countries into one strong international brotherhood of Islam. Muslims from all parts of the world, who meet at Mecca once a year can exchange views on all sorts of matters of international importance, renew old and establish new contacts. They have opportunities to acquaint themselves with the problems that confront their brethren in faith in other countries, to copy one another’s good points and profit by one another’s experience and also to cooperate with one another in many other ways. Mecca being God’s appointed centre of Islam, the Pilgrimage can serve as a sort of a United Nations Organization for the whole Muslim world. All other religions have failed to produce such a forum for the exchange of international ideas and programmes. But it is regretted that Muslims have not yet awakened to the realization of Mecca being an international capital for the whole Muslim world. These are some of the material benefits and advantages to which reference has been made in the words, \"that they may witness its benefits;\" and the words \"and may mention the name of Allah,\" refer to the great spiritual benefits which Muslims can and should derive from the Pilgrimage to Mecca. See also 3:98.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 30,
        "v_": 29,
        "topics": [
            {
                "id": 3932,
                "topic": "Baitul-‘Atiq",
                "verses": "22:34"
            },
            {
                "id": 3943,
                "topic": "Baitul-Haram: <i>Ka‘bah</i>",
                "verses": "17:2, 2:126, 2:128, 2:159, 5:3, 5:98, 8:36, 14:38, 22:27, 28:58, 106:4-5"
            },
            {
                "id": 5081,
                "topic": "Circumambulate",
                "verses": "2:126, 2:159, 22:27"
            },
            {
                "id": 10088,
                "topic": "Ka‘bah: rebuilt",
                "verses": "17:2, 2:128, 22:27"
            },
            {
                "id": 11627,
                "topic": "Moral Traits: cleanliness",
                "verses": "2:223, 2:126, 4:44, 5:7, 7:32, 9:103, 9:108, 22:27, 24:22, 33:34, 53:33, 56:80, 74:5-6, 87:15, 91:10-11"
            },
            {
                "id": 13939,
                "topic": "Pilgrimage: <i>Hajj</i>: rites of",
                "verses": "48:28, 2:159, 2:197-201, 2:204"
            }
        ],
        "ar": "ثُمَّ لۡیَقۡضُوۡا تَفَثَہُمۡ وَ لۡیُوۡفُوۡا نُذُوۡرَہُمۡ وَ لۡیَطَّوَّفُوۡا بِالۡبَیۡتِ الۡعَتِیۡقِ ﴿۳۰﴾ ",
        "ur": "پھر چاہئے کہ وہ اپنی (بدیوں کی) میل کو دور کریں اور اپنی منتوں کو پورا کریں اور اس قدیم گھر کا طواف کریں۔",
        "v5": {
            "text": "Then let them accomplish their needful acts of cleansing, and fulfill their vows, and go around the Ancient House.’[2460]",
            "notes": [
                {
                    "ref": "2460",
                    "note": "<p><strong>Important Words:</strong></p><p>لیقضوا تفثھم (accomplish their needful acts of cleansing). تفث (<i>tafathun</i>) is infinitive noun from (<i>tafatha</i>) which means, he left off shaving his pubes and in consequence became dirty. </p><p>قضی تفثه means, he removed his uncleanliness. The Quranic expression لیقضوا تفثھم means, then let them accomplish their needful acts of shaving and cleansing (Lane &amp; Aqrab).</p><p>العتیق (ancient) is derived from عتق. They say, عتق العبد i.e. the slave became free. عتیق الخمر means, the wine became old and good. عتیق means, free from slavery or emancipated; old; beautiful; excellent (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The words, \"and go round the ancient House,\" refer to the last <i>tawaf</i> or circumambulation round the Ka‘bah.</p><p>The seven circuits round the Ka‘bah correspond to seven prayers of Abraham which he uttered when, with the assistance of his son Ishmael, he was building the Ka‘bah. The prayers are given in 2:129-130 and are as follows:</p><p>1. \"Our Lord make us submissive to Thee;</p><p>2. \"and make of our offspring a people submissive to thee;</p><p>3. \"show us our ways of worship;</p><p>4. \"turn to us with mercy;</p><p>5. \"raise up among them a Messenger from among themselves;</p><p>6. \"who may recite to them thy Signs, may teach them the Book and wisdom;</p><p>In view of the three meanings of the root word عتق, the expression البیت العتیق would mean, free, excellent and a very old House. The epithet 'free' implies a prophecy that no hostile power will ever be able to conquer it. It shall always remain free. The second epithet, i.e. excellent, signifies that the Ka‘bah shall always occupy a position of honour in the world. It has also been described as البیت الحرام (the Sacred House) in the Quran. The fact that the Ka‘bah is a very ancient House of worship in the world finds corroboration in another verse of the Quran (3:97) where it is said that it is the very first House founded for Divine worship. In 14:38 we find that the Ka‘bah was in existence long before Abraham brought his wife Hagar and his son Ishmael to settle in the barren, bleak and arid valley of Mecca. Noah is believed by some to have performed the circuit of the Ka‘bah (Tabari as quoted by Enc. of Islam). Historians of established repute and authority, including even some very hostile critics of Islam, have admitted that the Ka‘bah had been held sacred from time immemorial. Diodorus Siculus writing about the region now known as the Hijaz says that there is in this country a temple greatly revered by all the Arabs \"to which the neighbouring peoples throng from all sides.\" \"These words,\" says Sir William Muir, \"must refer to the Holy House of Mecca for we know of no other which ever commanded the universal homage of Arabia… Tradition represents the Ka‘bah as from time immemorial the scene of pilgrimage from all quarters of Arabia so extensive an homage must have had its beginning in an extremely remote age\" (Muir, p. ciii).</p><p>The fact seems to be that the Ka‘bah was first built by Adam and after that it was washed away by the great Deluge in the time of Noah and was later rebuilt by Abraham. See also 2:128-129.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 31,
        "v_": 30,
        "topics": [
            {
                "id": 213,
                "topic": "Abomination: indecency, wickedness, <i>Khaba’ith</i>, <i>Rijs</i>",
                "verses": "5:91, 2:268, 3:180, 4:3, 5:101, 6:122, 6:146, 6:152, 7:34, 7:81, 7:82, 7:158, 8:38, 9:95, 14:27, 17:33, 21:75, 24:27, 33:34, 74:6"
            },
            {
                "id": 7358,
                "topic": "Falsehood: <i>Batil</i>: <i>Zur</i>",
                "verses": "17:82, 58:3"
            },
            {
                "id": 7670,
                "topic": "Flesh: <i>Lahm</i>: as food",
                "verses": "2:174, 5:4, 6:145-146, 16:6, 16:15, 16:116, 23:22, 36:73, 40:80, 56:22"
            },
            {
                "id": 8402,
                "topic": "Haram: Sacred",
                "verses": "2:150-151, 2:145, 2:192, 2:195, 2:197, 2:199, 2:218, 5:3, 5:98, 8:35, 9:7, 9:19, 9:28, 9:36-37, 14:38, 17:2, 22:26, 22:33, 22:37, 27:92, 48:26, 48:28"
            },
            {
                "id": 9182,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: steeped in error",
                "verses": "9:3-14, 17:23, 10:67, 21:55, 22:14"
            },
            {
                "id": 11643,
                "topic": "Moral Traits: dishonesty",
                "verses": "4:108, 11:85, 83:2-4"
            },
            {
                "id": 11983,
                "topic": "Moral Traits: lying",
                "verses": "6:22, 6:149, 7:153, 10:60-61, 11:51, 12:111, 16:117, 25:73, 39:33, 72:5"
            },
            {
                "id": 12012,
                "topic": "Moral Traits: truthfulness",
                "verses": "25:73, 3:61, 4:136, 5:76, 5:120, 9:119, 10:17, 16:117, 17:82, 19:42, 33:9, 33:25, 33:36, 33:71, 39:4, 39:33, 103:3-4"
            }
        ],
        "ar": "ذٰلِکَ ٭ وَ مَنۡ یُّعَظِّمۡ حُرُمٰتِ اللّٰہِ فَہُوَ خَیۡرٌ لَّہٗ عِنۡدَ رَبِّہٖ ؕ وَ اُحِلَّتۡ لَکُمُ الۡاَنۡعَامُ  اِلَّا مَا یُتۡلٰی عَلَیۡکُمۡ فَاجۡتَنِبُوا الرِّجۡسَ مِنَ الۡاَوۡثَانِ وَ اجۡتَنِبُوۡا  قَوۡلَ  الزُّوۡرِ ﴿ۙ۳۱﴾ ",
        "ur": "یہ (ہم نے حکم دیا)۔ اور جو بھی اُن چیزوں کی تعظیم کرے گا جنہیں اللہ نے حرمت بخشی ہے تو یہ اس کے لئے اس کے ربّ کے نزدیک بہتر ہے۔ اور تمہارے لئے چوپائے حلال کر دئیے گئے سوائے ان کے جن کا ذکر تم سے کیا جاتا ہے۔ پس بتوں کی پلیدی سے احتراز کرو اور جھوٹ کہنے سے بچو۔",
        "v5": {
            "text": "That is <i>God’s commandment</i>. [a]And whoso honours the sacred things of Allah, it will be good for him with his Lord. [b]And <i>the eating of the flesh of all</i> cattle is made lawful to you except that which has <i>already</i> been announced to you <i>in the Quran</i>. Shun, therefore, the abomination of idols, and shun all words of untruth,[2461]",
            "notes": [
                {
                    "ref": "a",
                    "note": "5:3."
                },
                {
                    "ref": "b",
                    "note": "5:2; 6:146."
                },
                {
                    "ref": "2461",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, \"whoso honours the sacred things of Allah, it will be good for him with his Lord,\" signify that a Muslim should not treat lightly or with disrespect such things as God has sanctified or held sacred. The words cover all those things and persons that God has honoured.</p><p>In the last sentence of the verse lying and idol worship have been condemned as equally heinous. Of all abominations, falsehood, perhaps, plays the greatest part in the moral degradation of a man, second only to idol worship.</p><p>The verse also points to the great truth that without fully subscribing to the belief in Divine Unity it is impossible to get rid of mental confusion and bewilderment and to enjoy real peace of mind. An idolater falls an easy victim to unfounded superstitious fears.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 32,
        "v_": 31,
        "topics": [
            {
                "id": 1699,
                "topic": "Allah: has no partners",
                "verses": "6:164, 3:65, 3:152, 4:37, 4:49, 6:15, 6:80, 6:82, 6:101, 7:34, 7:191, 10:19, 12:39, 13:17, 13:34, 13:37, 16:2, 16:4, 17:112, 18:43, 18:111, 23:60, 23:93, 25:3-4, 28:69, 30:41, 39:68, 40:43, 40:85, 59:24"
            },
            {
                "id": 4466,
                "topic": "Birds: as Allah’s signs",
                "verses": "16:80, 6:39, 24:42, 67:20"
            },
            {
                "id": 8382,
                "topic": "Hanif",
                "verses": "4:126, 2:136, 3:68, 3:96, 6:80, 6:162, 10:106, 16:124, 30:31, 98:6"
            },
            {
                "id": 9187,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: punishment for",
                "verses": "9:3-14, 2:166-168, 3:152, 19:46, 22:19, 22:73, 71:24-26"
            },
            {
                "id": 13377,
                "topic": "Parable of: an idol worshipper",
                "verses": null
            },
            {
                "id": 16598,
                "topic": "Shirk: associating partners with Allah",
                "verses": "22:27, 6:15, 10:106, 28:88, 30:32"
            },
            {
                "id": 16641,
                "topic": "Shirk: no forgiveness for",
                "verses": "4:49, 4:117, 5:73-74, 6:89, 9:113, 39:66"
            },
            {
                "id": 18641,
                "topic": "Wind: as a parable",
                "verses": "18:46, 3:118, 14:19"
            },
            {
                "id": 18646,
                "topic": "Wind: as a punishment, <i>‘Asif</i>",
                "verses": "10:23, 14:19, 17:69-70, 18:46, 29:41, 41:17, 54:20, 54:35, 67:18, 69:6-7"
            }
        ],
        "ar": "حُنَفَآءَ لِلّٰہِ غَیۡرَ  مُشۡرِکِیۡنَ بِہٖ ؕ وَ مَنۡ یُّشۡرِکۡ بِاللّٰہِ فَکَاَنَّمَا خَرَّ  مِنَ السَّمَآءِ فَتَخۡطَفُہُ الطَّیۡرُ  اَوۡ تَہۡوِیۡ بِہِ الرِّیۡحُ فِیۡ مَکَانٍ  سَحِیۡقٍ ﴿۳۲﴾ ",
        "ur": "ہمیشہ اللہ کی طرف جھکتے ہوئے اس کا شریک نہ ٹھہراتے ہوئے۔ اور جو بھی اللہ کا شریک ٹھہرائے گا تو گویا وہ آسمان سے گر گیا۔ پس یا تو اسے پرندے اُچک لیں گے یا ہوا اسے کسی دور جگہ جا پھینکے گی۔",
        "v5": {
            "text": "<i>Remaining</i> ever inclined to Allah, not associating anything with Him. And whoso associates anything with Allah, falls, as it were, from a height, and the birds snatch him away, or the wind blows him away to a distant place.[2462]",
            "notes": [
                {
                    "ref": "2462",
                    "note": "<p><strong>Commentary:</strong></p><p>Man is the noblest creation of God. The whole universe—the sun, the moon, the stars, the earth, the oceans, the mountains, etc., have been made to serve him. He can rise morally and spiritually so high as to reflect in his person the Divine attributes. So if man whom God has given the highest place in His whole creation degrades himself so low as to worship lifeless objects, he falls, as it were, from the heights of spiritual eminence to the depths of moral and intellectual degradation. This, in brief, is the purport of this verse.</p><p>A brief note on idolatry is here called for. Broadly speaking idolatry consists in the paying of Divine honours to idols, images or any created object; the ascription of Divine powers to natural agencies and the excessive admiration, veneration or love for any person or thing. Besides this, idolatry has several other subtler forms. Some of these are as follows:</p><p>1. To believe that there are more beings than one who possess equal and similar powers and attributes and who have equal share in the creation and control of the universe with God.</p><p>2. To show allegiance or veneration to beings or objects other than God in the form of acts and movements of the body which are expressive of the highest veneration for those beings or objects and which are prescribed by different religions to be offered only to the Supreme Being and which have been regarded as part of worship, such as prostration, etc.</p><p>3. To rely fully and completely upon material means for the fulfilment of one’s needs to the entire exclusion of trust in God.</p><p>4. To ascribe to human beings attributes which are God’s own exclusive prerogatives, such as His being Eternal and Everlasting and His attribute of creation or quickening the dead.</p><p>5. To think of a person that he has attained to such stage of nearness to God that God is bound to and does accept all his prayers. This amounts to ascribing Divine powers to him.</p><p>6. To entertain feelings of love, veneration for, or fear of, any human being greater or even equal to those which he has for God. All these different forms of idolatry have been expressed by the four words used by the Quran, viz. ند (like or equal); شریک (co-partner or sharer); اله(worthy of worship) and رب (sustainer).</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 33,
        "v_": 32,
        "topics": [
            {
                "id": 8403,
                "topic": "Haram: Sacred",
                "verses": "2:150-151, 2:145, 2:192, 2:195, 2:197, 2:199, 2:218, 5:3, 5:98, 8:35, 9:7, 9:19, 9:28, 9:36-37, 14:38, 17:2, 22:26, 22:31, 22:37, 27:92, 48:26, 48:28"
            },
            {
                "id": 9510,
                "topic": "Islam: teachings of",
                "verses": "2:4-6, 2:113, 2:137, 2:209, 2:286, 3:85, 4:126, 6:121, 6:162-163, 11:2-5, 11:109, 17:79, 22:79, 30:31, 42:14, 72:15"
            },
            {
                "id": 15794,
                "topic": "Righteous: <i>Salihin</i>: description of",
                "verses": "2:178, 2:4-5, 3:115, 3:180, 16:129, 20:83, 39:34, 51:16-19"
            },
            {
                "id": 16677,
                "topic": "Signs: and true believers",
                "verses": "8:3, 19:59, 25:74, 32:16"
            },
            {
                "id": 17515,
                "topic": "Taqwa: fear of God",
                "verses": "2:3, 2:190, 2:197-198, 2:204, 2:213, 2:224, 2:232, 2:234, 2:238, 2:279, 2:283-284, 3:16, 3:51, 3:77, 3:103, 3:131, 3:201, 4:2, 4:10, 4:132, 5:3, 5:5, 5:8-9, 5:12, 5:36, 5:58, 5:89, 5:94, 5:97, 5:113, 6:70, 6:73, 7:27, 7:36, 7:66, 8:2, 8:70, 9:7, 9:108, 9:109, 11:79, 15:70, 20:133, 22:2, 22:38, 26:109, 26:133, 26:185, 33:56, 33:71, 43:64, 47:18, 48:27, 49:4, 49:11, 49:13, 57:29, 58:10, 59:8, 59:19, 60:12, 65:2, 65:11, 74:57, 78:32, 96:13"
            }
        ],
        "ar": "ذٰلِکَ ٭ وَ مَنۡ یُّعَظِّمۡ شَعَآئِرَ  اللّٰہِ فَاِنَّہَا مِنۡ  تَقۡوَی  الۡقُلُوۡبِ  ﴿۳۳﴾",
        "ur": "یہ (اہم بات ہے) اور جو کوئی شعائراللہ کو عظمت دے گا تو یقیناً یہ بات دلوں کے تقویٰ کی علامت ہے۔",
        "v5": {
            "text": "That <i>is so</i>. [a]And whoso honours the sacred Signs of Allah—that indeed <i>proceeds</i> from the righteousness of hearts.[2463]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:159."
                },
                {
                    "ref": "2463",
                    "note": "<p><strong>Commentary:</strong></p><p>For شعائر اللّٰه see 2:159 &amp; 5:3. The verse implies that the object underlying all the commandments and ordinances of Islam is to inculcate righteousness and purity of heart. All Islamic rites and acts of worship are only means that lead to this supreme goal.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 34,
        "v_": 33,
        "topics": [
            {
                "id": 1132,
                "topic": "Ajal: <i>Musamma</i>, fixed",
                "verses": "2:232, 11:105, 3:146, 6:3, 6:129, 7:35, 10:50, 11:4, 13:3, 13:39, 14:11, 15:6, 16:62, 17:100, 20:130, 22:6, 29:54, 30:9, 31:30, 35:14, 35:46, 39:43, 40:68, 42:15, 46:4"
            },
            {
                "id": 2689,
                "topic": "Animals: <i>Dabbah</i>, <i>An‘am</i>: beneficial for man",
                "verses": "23:22, 6:143, 16:6-9, 16:67, 16:70, 16:81, 31:11, 36:73-74, 40:80, 43:13, 55:11"
            },
            {
                "id": 3933,
                "topic": "Baitul-‘Atiq",
                "verses": "22:30"
            }
        ],
        "ar": "لَکُمۡ  فِیۡہَا مَنَافِعُ  اِلٰۤی اَجَلٍ مُّسَمًّی ثُمَّ  مَحِلُّہَاۤ  اِلَی الۡبَیۡتِ  الۡعَتِیۡقِ ﴿٪۳۴﴾ ",
        "ur": "تمہارے لئے ان (قربانی کے مویشیوں) میں ایک مقررہ مدت تک فوائد وابستہ ہیں پھر انہیں قدیم گھر تک پہنچانا ہے۔",
        "v5": {
            "text": "In these (offerings) are benefits for you for an appointed term, then [b]their place of sacrifice is at the Ancient House.[2464]",
            "notes": [
                {
                    "ref": "b",
                    "note": "2:197; 48:26."
                },
                {
                    "ref": "2464",
                    "note": "<p><strong>Commentary:</strong></p><p>The animals that are brought to Mecca for sacrifice may be used for riding, and carrying burdens or their milk may be used before they are sacrificed. They can serve other useful purposes.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 35,
        "v_": 34,
        "topics": [
            {
                "id": 2059,
                "topic": "Allah: no god but He, <i>La ilaha illallah</i>",
                "verses": "40:4, 2:164, 2:256, 3:3, 3:19, 3:63, 3:65, 4:88, 5:74, 6:20, 9:31, 16:3, 16:23, 16:52, 21:26, 23:117, 28:71, 37:5, 40:63"
            },
            {
                "id": 2707,
                "topic": "Animals: <i>Dabbah</i>, <i>An‘am</i>: sacrifice",
                "verses": "5:98, 22:37"
            },
            {
                "id": 3002,
                "topic": "Attributes of Allah: Al-Ahad (The One, Unique)",
                "verses": "112:2, 2:164, 2:256, 4:172, 5:74, 16:23, 37:5, 59:23-24"
            },
            {
                "id": 3640,
                "topic": "Attributes of Allah: Al-Wahid (The One)",
                "verses": "13:17, 2:134, 2:164, 5:74, 9:31, 16:23, 18:111, 37:5, 38:66, 39:5, 112:2"
            },
            {
                "id": 4944,
                "topic": "Cattle: <i>An‘am</i>",
                "verses": "16:67, 20:55, 22:29, 25:50, 35:29"
            },
            {
                "id": 7973,
                "topic": "Glad Tidings: <i>Bushra</i>: to believers, pious, fearful",
                "verses": "2:26, 2:156, 2:224, 9:112, 10:3, 10:65, 10:88, 17:10, 22:38, 33:48, 36:12, 39:18, 41:31, 57:13, 61:14"
            },
            {
                "id": 9358,
                "topic": "Innovation: <i>Bid‘ah</i>",
                "verses": "57:28, 46:10"
            },
            {
                "id": 10919,
                "topic": "Manasik",
                "verses": "2:159, 2:197-201, 2:204"
            },
            {
                "id": 11768,
                "topic": "Moral Traits: humility, humbleness",
                "verses": "49:4, 33:36, 31:20, 31:19, 27:88, 27:38, 23:77, 23:3, 22:55, 21:91, 20:135, 20:112, 17:110, 17:38-39, 17:25, 16:49, 12:33, 11:24, 7:162, 7:95, 7:56, 6:64, 6:44, 6:43, 5:55, 3:18, 2:75, 2:46, 1:5, 25:64, 57:17"
            },
            {
                "id": 15997,
                "topic": "Sacrifice: a universal practice",
                "verses": null
            },
            {
                "id": 17278,
                "topic": "Submit",
                "verses": "2:131-134, 2:137, 3:85, 4:66, 6:15, 6:72, 6:164, 10:91, 16:82, 16:90, 25:61, 27:45, 29:47, 33:36, 39:13, 40:67, 41:34, 68:36, 72:15"
            }
        ],
        "ar": "وَ لِکُلِّ اُمَّۃٍ جَعَلۡنَا مَنۡسَکًا لِّیَذۡکُرُوا اسۡمَ اللّٰہِ عَلٰی مَا رَزَقَہُمۡ مِّنۡۢ بَہِیۡمَۃِ الۡاَنۡعَامِ ؕ فَاِلٰـہُکُمۡ اِلٰہٌ  وَّاحِدٌ فَلَہٗۤ اَسۡلِمُوۡا ؕ وَ  بَشِّرِ  الۡمُخۡبِتِیۡنَ ﴿ۙ۳۵﴾",
        "ur": "اور ہم نے ہر اُمّت کے لئے قربانی کا طریق مقرر کیا ہے تا کہ وہ اللہ کا نام اُس پر پڑھیں جو اس نے انہیں مویشی چوپائے عطا کئے ہیں۔ پس تمہارا معبود ایک ہی معبود ہے۔ پس اس کے لئے فرمانبردار ہو جاؤ۔ اور عاجزی کرنے والوں کو بشارت دے دے۔",
        "v5": {
            "text": "And to every people We appointed rites of Sacrifice, that [c]they might mention the name of Allah over the quadrupeds of <i>the class of</i> cattle that He has provided for them. So [d]your God is One God; therefore submit ye <i>all</i> to Him. And give thou glad tidings to the humble,[2465]",
            "notes": [
                {
                    "ref": "c",
                    "note": "5:5; 6:119."
                },
                {
                    "ref": "d",
                    "note": "5:74; 16:23; 37:5."
                },
                {
                    "ref": "2465",
                    "note": "<p><strong>Important Words:</strong></p><p>منسکا (rites of sacrifice) is derived from نسك . They say نسك الذبیحة i.e. he slaughtered and sacrificed the animal. نسك الرجلmeans, the man led a life devoted to God; he practised virtue and piety. نسك للّٰه means, he sacrificed seeking to win the pleasure of God; he did good deeds willingly and spontaneously in order to win nearness to God. نسك الثوب means, he washed the cloth. منسك means, rites of sacrifice; place where those rites are performed; one’s native place. مناسك الحج means, the religious rites and ceremonies of the Pilgrimage.</p><p>For مخبتین see 11:24.</p><p><strong>Commentary:</strong></p><p>With this verse begins the subject of sacrifice, one of the three main themes with which this <i>Surah</i> deals, the other two being Hajj and jihad.</p><p>The words \"And to every people We appointed rites of Sacrifice,\" show that the commandment relating to Sacrifice is not confined to Islam. Sacrifice is common to all religions because they have proceeded from the same Divine source. It also appears from this verse that it was the sacrifice of animals that was originally enjoined on the followers of all religions and that the cruel practice of offering human beings as sacrifice was a later innovation.</p><p>In view of the different meanings of the root word true sacrifice possesses three essential characteristics:-</p><p>(a) It should be fully voluntary and spontaneous;</p><p>(b) It should be offered with the purest of motives, i.e. only to win the pleasure of God;</p><p>(c) It should not be offered from ulterior motives and material considerations.</p><p>Thus the first commandment relating to sacrifice though apparently very simple is of great inward significance. It is that sacrifice should be offered only for the sake of Allah and that Allah’s name should be invoked while the animal is being slaughtered for food. This not only sanctifies and blesses the food but is also calculated to turn attention to the sublime object underlying the act of slaughtering the animal—to win the pleasure of God and to be prepared to sacrifice the dearest thing in His way and for His sake.</p><p>The words, \"So your God is one God, therefore, submit ye all to Him,\" have twofold significance: (1) The fact that the rite of sacrifice is common to all religions, although they are so widely separated from one another as regards the time and place of their origin, shows that originally they all emanated from the same Supreme Source and that the God of all nations is One God. (2) That the object underlying sacrifice is to realize and proclaim the Oneness of God by sacrificing our ambitions and aspirations, all our ideas and ideals and even life and honour for His sake, and by completely submitting ourselves to His commandments. The concept of sacrifice according to Islam does not consist in appeasing an offended deity or in atoning for one’s sins but in sacrificing one’s all for the sake of God and in the way of God. Those who have full realization of this concept of sacrifice are called (humble) in the language of the Quran.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 36,
        "v_": 35,
        "topics": [
            {
                "id": 847,
                "topic": "Affliction: <i>Bala’</i>",
                "verses": "2:156-158, 2:50, 2:125, 2:178, 2:215, 2:250, 3:143, 3:155, 4:63, 6:18, 7:142, 7:164, 7:169, 8:26, 16:28, 16:54-55, 17:57, 17:74, 21:84, 21:88, 23:31, 28:48, 29:11, 30:34, 30:37, 38:42, 39:9, 41:51, 47:32, 64:12, 68:7"
            },
            {
                "id": 1714,
                "topic": "Allah: hearts tremble when name of mentioned",
                "verses": "8:3, 39:24"
            },
            {
                "id": 2383,
                "topic": "Allah: spend in the way of",
                "verses": "2:268, 2:4, 2:196, 2:216, 2:220, 2:246, 2:255, 2:263, 2:265, 2:273, 2:275, 3:93, 8:4, 8:61, 9:20, 9:34, 9:41, 9:99, 9:111, 13:23, 14:32, 16:76, 24:38-39, 28:55, 32:17, 35:30, 42:39, 47:39, 57:8, 57:11, 61:12, 63:11, 64:17-18, 65:8, 73:21"
            },
            {
                "id": 4333,
                "topic": "Believers: <i>Mu’min</i>: observe prayers",
                "verses": "4:163, 2:4, 2:178, 4:104, 5:56, 8:4, 9:18, 13:23, 14:32, 17:110, 19:59, 22:42, 23:3, 23:10, 24:38, 27:4, 31:5, 32:16, 35:30, 42:39, 70:24, 70:35, 73:21, 98:6"
            },
            {
                "id": 8465,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: fear in their",
                "verses": "53:12, 8:3, 23:61, 33:11, 39:24, 40:19"
            },
            {
                "id": 13735,
                "topic": "Patience: <i>sabr</i>: sign of a <i>Mu’min</i>",
                "verses": "3:18, 2:178, 3:187, 14:6, 16:127, 21:86, 31:32, 33:36, 37:103, 54:28"
            }
        ],
        "ar": "الَّذِیۡنَ اِذَا ذُکِرَ  اللّٰہُ وَجِلَتۡ قُلُوۡبُہُمۡ وَ الصّٰبِرِیۡنَ عَلٰی مَاۤ  اَصَابَہُمۡ وَ الۡمُقِیۡمِی الصَّلٰوۃِ ۙ وَ  مِمَّا  رَزَقۡنٰہُمۡ  یُنۡفِقُوۡنَ ﴿۳۶﴾ ",
        "ur": "ان لوگوں کو کہ جب اللہ کا ذکر بلند کیا جاتا ہے تو ان کے دل مرعوب ہو جاتے ہیں اور جو اس تکلیف پر جو انہیں پہنچی ہو صبر کرنے والے ہیں اور نماز کو قائم کرنے والے ہیں اور جو کچھ ہم نے انہیں عطا کیا ہے اس میں سے خرچ کرتے ہیں۔",
        "v5": {
            "text": "[a]Whose hearts are filled with fear when <i>the name of</i> Allah is mentioned, and who patiently endure whatever befalls them, and who observe Prayer, and spend out of what We have provided for them.[2466]",
            "notes": [
                {
                    "ref": "a",
                    "note": "23:61."
                },
                {
                    "ref": "2466",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse gives the fourfold object of sacrifice or the four characteristics of المخبتین i.e. those who have realized the real significance of sacrifice. (1) Their hearts are filled with fear when Allah is mentioned; (2) they patiently bear all sorts of hardships and privations in the way of God; (3) they purify themselves by saying their prayers regularly and punctually and (4) they serve mankind with all that God has bestowed upon them—with all the means at their disposal.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 37,
        "v_": 36,
        "topics": [
            {
                "id": 2709,
                "topic": "Animals: <i>Dabbah</i>, <i>An‘am</i>: sacrifice",
                "verses": "22:35, 5:98"
            },
            {
                "id": 4188,
                "topic": "Begging",
                "verses": "2:274"
            },
            {
                "id": 4896,
                "topic": "Camel: <i>Ibil</i>: Sacrifice, a Sign of Allah",
                "verses": "7:41"
            },
            {
                "id": 8404,
                "topic": "Haram: Sacred",
                "verses": "2:150-151, 2:145, 2:192, 2:195, 2:197, 2:199, 2:218, 5:3, 5:98, 8:35, 9:7, 9:19, 9:28, 9:36-37, 14:38, 17:2, 22:26, 22:31, 22:33, 27:92, 48:26, 48:28"
            },
            {
                "id": 15998,
                "topic": "Sacrifice: animal",
                "verses": "5:3"
            }
        ],
        "ar": "وَ الۡبُدۡنَ جَعَلۡنٰہَا لَکُمۡ مِّنۡ  شَعَآئِرِ اللّٰہِ لَکُمۡ فِیۡہَا خَیۡرٌ ٭ۖ فَاذۡکُرُوا اسۡمَ اللّٰہِ عَلَیۡہَا صَوَآفَّ ۚ فَاِذَا وَجَبَتۡ جُنُوۡبُہَا فَکُلُوۡا مِنۡہَا وَ اَطۡعِمُوا الۡقَانِعَ وَ الۡمُعۡتَرَّ ؕ کَذٰلِکَ سَخَّرۡنٰہَا لَکُمۡ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۳۷﴾ ",
        "ur": "اور قربانی کے اونٹ جنہیں ہم نے تمہارے لئے شعائراللہ میں شامل کر دیا ہے ان میں تمہارے لئے بھلائی ہے۔ پس ان پر قطار میں کھڑا کرکے اللہ کا نام پڑھو۔ پس جب (ذبح کرنے کے بعد) ان کے پہلو زمین سے لگ جائیں تو ان میں سے کھاؤ اور قناعت کرنے والوں کو بھی کھلاؤ اور سوال کرنے والوں کو بھی۔ اسی طرح ہم نے انہیں تمہاری خدمت پر لگا رکھا ہے تاکہ تم شکر کرو۔",
        "v5": {
            "text": "And among the sacred Signs of Allah We have appointed for you the sacrificial camels. In them there is <i>much</i> good for you. So mention the name of Allah over them as they stand tied up in lines. And when they fall down <i>dead</i> on their sides, eat thereof and feed him who is <i>needy</i> <i>but</i> contented and him who supplicates. Thus have We subjected them to you, that you may be thankful.[2467]",
            "notes": [
                {
                    "ref": "2467",
                    "note": "<p><strong>Important Words:</strong></p><p>البدن (sacrificial camels) is the plural of بدنة which means, a she-camel or a male camel; a cow and a bull (preferably the first and the second) that is slaughtered at Mecca or brought there for sacrifice, so called because of its fatness, بدن (<i>badana</i>) as a verb meaning, he was or became big, bulky, big-bodied or corpulent or fat (Lane &amp; Aqrab).</p><p>صواف (stand tied up in rows) is the plural of صافة which is derived from صوف. They say صوف القوم i.e. the people stood in rows. صواف means, standing in rows (Lane).</p><p>وجبت (they fall down). They say وجب الحائط i.e. the wall fell down. وجب الرجل means, the man fell down and died. وجب الشمس means, the sun set. فاذا وجبت جنوبھا means, when their sides fall upon the ground; when they die and fall down (Lane).</p><p>قانع (contented) is active participle from قنع (<i>qania</i>‘) which means, he was contented with his lot; and also from قنع(<i>qana</i>‘<i>a</i>) which means, he asked, he begged. قنع الجبل means, he ascended the mountain. القانع means, one who is contented with his lot; one who asks or begs; one of a people (Aqrab).</p><p>المعتر (one who supplicates) is derived from عر (‘<i>arra</i>). They say عرہ i.e. he vexed him; he did evil to him; he addressed or applied himself to obtain favour without asking; he came to him and sought his bounty. المعتر means, one who applies oneself to obtain favour without asking; one who comes to another to ask for a favour; a poor man (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse signifies that the slaughtering of camels which are brought to Mecca for sacrifice is but a symbol of man’s readiness to lay down his life for the sake of his Creator and Master just as camels lay down their lives for their own masters. This is the supreme object and purpose of sacrifice, other objects mentioned in the verse being of secondary importance. The pilgrim is reminded of the significance of sacrifice when he slaughters an animal and thus the animal serves as a sign of God.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 38,
        "v_": 37,
        "topics": [
            {
                "id": 4516,
                "topic": "Blood: neither flesh nor reaches Allah",
                "verses": null
            },
            {
                "id": 7680,
                "topic": "Flesh: <i>Lahm</i>: sacrificial",
                "verses": null
            },
            {
                "id": 7974,
                "topic": "Glad Tidings: <i>Bushra</i>: to believers, pious, fearful",
                "verses": "2:26, 2:156, 2:224, 9:112, 10:3, 10:65, 10:88, 17:10, 22:35, 33:48, 36:12, 39:18, 41:31, 57:13, 61:14"
            },
            {
                "id": 8221,
                "topic": "Guidance: Allah gives",
                "verses": "20:51, 2:121, 2:186, 2:214, 3:74, 3:102, 4:69, 5:17, 6:36, 6:72, 6:89, 6:150, 7:44, 7:179, 10:10, 10:26, 10:36, 13:28, 13:32, 14:5, 14:13, 16:10, 16:94, 16:122, 19:77, 22:17, 24:36, 24:47, 26:63, 26:79, 28:57, 29:70, 31:5-6, 33:5, 35:9, 37:119, 39:19, 39:24, 39:38, 42:14, 47:18, 48:3, 48:21, 49:18, 64:12, 74:32, 76:4, 93:8"
            },
            {
                "id": 12714,
                "topic": "Muhsin: who do good: are rewarded",
                "verses": "3:135, 29:70, 2:59, 2:113, 4:126, 5:86, 6:85, 7:57, 7:162, 12:23, 28:15, 31:23, 33:30, 37:106, 37:111, 37:122, 37:132, 39:35, 77:45"
            },
            {
                "id": 15797,
                "topic": "Righteous: <i>Salihin</i>: duty of",
                "verses": "6:70, 58:10"
            },
            {
                "id": 15998,
                "topic": "Sacrifice: animal",
                "verses": "5:3"
            },
            {
                "id": 17516,
                "topic": "Taqwa: fear of God",
                "verses": "2:3, 2:190, 2:197-198, 2:204, 2:213, 2:224, 2:232, 2:234, 2:238, 2:279, 2:283-284, 3:16, 3:51, 3:77, 3:103, 3:131, 3:201, 4:2, 4:10, 4:132, 5:3, 5:5, 5:8-9, 5:12, 5:36, 5:58, 5:89, 5:94, 5:97, 5:113, 6:70, 6:73, 7:27, 7:36, 7:66, 8:2, 8:70, 9:7, 9:108, 9:109, 11:79, 15:70, 20:133, 22:2, 22:33, 26:109, 26:133, 26:185, 33:56, 33:71, 43:64, 47:18, 48:27, 49:4, 49:11, 49:13, 57:29, 58:10, 59:8, 59:19, 60:12, 65:2, 65:11, 74:57, 78:32, 96:13"
            }
        ],
        "ar": "لَنۡ یَّنَالَ اللّٰہَ  لُحُوۡمُہَا وَ لَا دِمَآؤُہَا وَ لٰکِنۡ یَّنَالُہُ التَّقۡوٰی مِنۡکُمۡ ؕ کَذٰلِکَ سَخَّرَہَا لَکُمۡ لِتُکَبِّرُوا اللّٰہَ عَلٰی مَا ہَدٰٮکُمۡ ؕ وَ بَشِّرِ  الۡمُحۡسِنِیۡنَ ﴿۳۸﴾ ",
        "ur": "ہرگز اللہ تک نہ ان کے گوشت پہنچیں گے اور نہ ان کے خون لیکن تمہارا تقویٰ اس تک پہنچے گا۔ اِسی طرح اُس نے تمہارے لئے اُنہیں مسخر کردیا ہے تا کہ تم اللہ کی بڑائی بیان کرو اس بنا پر کہ جو اُس نے تمہیں ہدایت عطا کی۔ اور احسان کرنے والوں کو خوشخبری دےدے۔",
        "v5": {
            "text": "Their flesh reaches not Allah, nor does their blood, but it is your righteousness that reaches Him. Thus has He subjected them to you, that you may glorify Allah for His guiding you. And give glad tidings to those who do good.[2468]",
            "notes": [
                {
                    "ref": "2468",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse throws a flood of light on the essence, inwardness and real object and purpose of sacrifice. It also teaches a supreme lesson, viz. that it is not the outward act of sacrifice which pleases God but the spirit underlying it and the motive behind it. The flesh or blood of the slaughtered animal does not reach God, it is righteousness of the heart which is acceptable to Him. God demands and accepts total sacrifice of all that is near and dear to us—our material possessions, the ideals that are so dear to us, our honour and life itself. In reality, God wants and demands no offering from us in the form of flesh and blood of animals but the offering of our hearts.</p><p>It should not, however, be understood to mean that because it is not the outward act of sacrifice but the motive behind it that really matters, the outward act is of no importance. True, the outward act of sacrifice is the shell and the spirit underlying it is the kernel and essence yet the shell or the body of a thing, like its soul, spirit or kernel, is also of very great importance because no soul could exist without a body and no kernel without a shell.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 39,
        "v_": 38,
        "topics": [
            {
                "id": 1409,
                "topic": "Allah: loves not",
                "verses": "31:19, 2:191, 2:206, 2:277, 3:33, 4:37, 4:108, 4:149, 5:65, 7:32, 8:59, 16:24, 28:77-78, 42:41"
            },
            {
                "id": 4389,
                "topic": "Betray",
                "verses": "8:28, 2:188, 4:108, 5:14, 8:59, 8:72, 12:53, 40:20"
            },
            {
                "id": 5186,
                "topic": "Compulsion in Faith: <i>Ikrah fid-Din</i>",
                "verses": "2:257, 2:191, 2:194, 5:49, 5:93, 6:150, 7:89, 8:40, 9:6, 10:100, 11:119, 13:32, 16:10, 18:21, 18:30, 22:41, 25:58, 26:5, 50:46, 76:4, 90:11, 95:6, 109:7"
            },
            {
                "id": 5268,
                "topic": "Conscience",
                "verses": "8:40, 2:194, 3:21, 7:52, 7:89, 14:25, 18:30, 22:41, 22:72, 27:63, 47:5, 50:38, 67:11, 69:40, 75:3"
            },
            {
                "id": 6523,
                "topic": "Dishonesty: <i>Khiyanah</i>",
                "verses": "8:28, 3:162, 4:106, 4:108, 8:59, 12:53, 40:20, 66:11"
            },
            {
                "id": 9946,
                "topic": "Jihad: permission for",
                "verses": null
            },
            {
                "id": 11891,
                "topic": "Moral Traits: perfidy",
                "verses": "4:108, 4:106, 9:8, 9:80, 31:33, 33:27, 48:59"
            },
            {
                "id": 12741,
                "topic": "Murder",
                "verses": "17:34, 2:155, 2:179, 3:158, 3:170, 3:196, 4:30, 4:75, 4:93-94, 5:31, 5:33-34, 6:152, 9:111, 17:32, 22:59, 25:69, 47:5-7, 60:13"
            },
            {
                "id": 18328,
                "topic": "War: <i>Qital</i>: Allah’s support",
                "verses": "4:85, 2:252, 3:14, 9:14, 9:29"
            }
        ],
        "ar": "اِنَّ اللّٰہَ یُدٰفِعُ عَنِ الَّذِیۡنَ اٰمَنُوۡا ؕ اِنَّ اللّٰہَ لَا یُحِبُّ کُلَّ  خَوَّانٍ  کَفُوۡرٍ ﴿٪۳۹﴾ ",
        "ur": "یقیناً اللہ اُن کی جو ایمان لائے مدافعت کرتا ہے۔ یقیناً اللہ کسی خیانت کرنے والے ناشکرے کو پسند نہیں کرتا۔",
        "v5": {
            "text": "Surely, Allah defends those who believe. Surely, Allah loves not anyone who is perfidious <i>or</i> ungrateful.[2469]",
            "notes": [
                {
                    "ref": "2469",
                    "note": "<p><strong>Commentary:</strong></p><p>With this verse is introduced the subject of jihad. The theme of sacrifice has formed a befitting prelude to this all-important subject. Having explained the importance and significance of sacrifice, the Quran proceeds to tell Muslims that the time has arrived that they should be prepared to undergo all manner of sacrifice in the defence of their faith which the enemy is out to destroy. Before the permission to fight in self-defence was given to Muslims, they were apprised of the importance of sacrifice. The words, \"Surely, Allah defends those who believe,\" throw a flood of light on the Islamic conception of jihad. Jihad, as these words show, is fighting in defence of truth. But whereas Islam allows no aggressive war, it regards the waging of it in self-defence as an act of the highest virtue. Because much misconception prevails regarding the Islamic teaching about jihad and because Islam has been much maligned and subjected to much wilful and deliberate mis-representation on this account a somewhat detailed note is called for on this subject.</p><p>Man is God’s noblest handiwork. He is the acme of His creation, its aim and end. He is God’s vicegerent on earth and the king of His whole creation (2:30). To him even angels in heaven make obeisance and for him all animate and inanimate things—the earth, the heaven, the sun, moon, stars, mountains, oceans, rivers, animals, and birds, have been created and to him they have been made subservient (14:33, 34; 35:14). This is the Islamic conception of man’s high place in the universe. It is therefore only natural that that religion which has raised man to such a high pedestal should have attached very great importance and sanctity to his life. Of all things man’s life, according to the Quran, is most sacred and inviolable. It is a sacrilege to take it except under very rare circumstances which the Quran has specifically mentioned. According to the Quran the killing of a person without a just cause is tantamount to the killing of the whole of mankind (17:34; 5:33); so sacred and sanctified is man’s life.</p><p>No less important, according to Islam, is freedom of conscience. It is man’s most precious heritage—perhaps more precious than life itself. The Quran, which has attached the greatest sanctity to man’s life, could not have failed to acknowledge and declare the sacredness and inviolability of this, his most precious possession. \"Let there be no compulsion in religion,\" says the Quran (2:256). It abounds in verses of like import which shows that not only Islam does not encourage the use of force for the spread of its teaching but positively and in most emphatic terms forbids and condemns it and gives man unrestricted choice in the matter of his faith and belief. Here are some of them:</p><p>Say, 'O ye men, now has the truth come to you from your Lord. So whosoever follows the guidance, follows it only for the good of his own soul, and whosoever errs, errs only against it. And I am not a keeper over you (10:109).</p><p>And say, It is the truth from your Lord; therefore let him who will, believe, and let him who will, disbelieve (18:30).</p><p>We know best what they say; and thou hast not been appointed to compel them in any way. So admonish by means of the Quran him who fears My warning (50:46).</p><p>So remind. Thou art only one to remind. Thou art not a warden over them (88:22-23).</p><p>These verses, as it were, make an unequivocal declaration about the freedom of human conscience or the Magna Carta of the liberty of man’s beliefs and convictions. The injunctions embodied in these verses have not remained a dead letter. The Holy Prophet and his Companions lived up to them and strictly obeyed them even if acting upon them meant loss of prestige as it happened at the time of signing of the Treaty of Hudaibiya, or when the Jewish tribe of Banu Nadir, on their banishment from Medina, were allowed to take with them the scions of the Muslim families of Aus and Khazraj, much against the remonstrances of their Muslim relatives, because they (the scions) had chosen to go with the Jews (Abu Dawud <i>Kitabul-Jihad</i>, &amp; Manthur). It is also on record that ‘Umar, the second Caliph, presented Islam on several occasions to a Christian slave of his, Asbaq by name, but every time he refused to accept it (Manthur). Instances of such tolerant behaviour on the part of the leaders of Islam during the ages can easily be multiplied. In the face of such magnanimous display of religious tolerance it seems unbelievable that Islam should have been accused of fanaticism and bigotry or of having been spread by force, but it is a sad fact of history that it has been so maligned and accused by its hostile critics.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 40,
        "v_": 39,
        "topics": [
            {
                "id": 2875,
                "topic": "Arms",
                "verses": "4:103, 2:191-192, 9:41"
            },
            {
                "id": 9198,
                "topic": "Ijma‘: consensus",
                "verses": "4:25, 2:232, 3:145, 22:53, 36:2"
            },
            {
                "id": 9946,
                "topic": "Jihad: permission for",
                "verses": null
            },
            {
                "id": 13862,
                "topic": "Permission: Leave, <i>Idhn</i>: to fight",
                "verses": null
            },
            {
                "id": 14885,
                "topic": "Qadir: powerful: Allah has the power to do all",
                "verses": "46:34, 2:107, 2:285, 3:27, 3:30, 3:166, 3:190, 4:134, 6:18, 6:38, 6:66, 16:71, 17:100, 22:7, 23:19, 23:96, 25:55, 30:55, 33:28, 36:82, 42:30, 42:51, 60:8, 65:13, 66:9, 70:41, 75:5, 75:41, 86:9"
            },
            {
                "id": 17224,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 8:56-64, 9:1-16"
            },
            {
                "id": 18343,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:61, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "اُذِنَ لِلَّذِیۡنَ یُقٰتَلُوۡنَ بِاَنَّہُمۡ ظُلِمُوۡا ؕ وَ اِنَّ  اللّٰہَ  عَلٰی  نَصۡرِہِمۡ  لَقَدِیۡرُ ۣ ﴿ۙ۴۰﴾",
        "ur": "اُن لوگوں کو جن کے خلاف قتال کیا جا رہا ہے (قتال کی) اجازت دی جاتی ہے کیونکہ ان پر ظلم کئے گئے۔ اور یقیناً اللہ اُنکی مدد پر پوری قدرت رکھتا ہے۔",
        "v5": {
            "text": "Permission <i>to fight</i> is given to those against whom war is made, because they have been wronged—and Allah indeed has power to help them—[2470]",
            "notes": [
                {
                    "ref": "2470",
                    "note": "<p><strong>Commentary:</strong></p><p>According to consensus of scholarly opinion this is the first verse which gave Muslims permission to take up arms in self-defence. The verse was revealed very early in Medina. \"It is much more reasonable,\" says Wherry, to suppose with Muir that this command emanated from Medina. Nöldeke also relegated this command to Medina\" (Wherry’s Commentary).</p><p>The next verse also lends support to this inference. It states that the permission to fight was given after the Muslims had been driven out of their hearths and homes. If, as some commentators of the Quran hold, the verse was revealed at Mecca, it must have been revealed immediately before Hijrah when most of the Muslims had already migrated to Medina and the Holy Prophet with only a very few Muslims had remained behind in Mecca and their cup of hardships and privations had become full to the brim. But the former view seems to be more akin to fact and reality.</p><p>The verse lays down principles according to which Muslims can wage a defensive war, and clearly sets forth the reasons which led a handful of Muslims, without arms and other material means, to fight in self-defence after they had suffered at Mecca ceaseless persecution for years and had been pursued with relentless hatred to Medina and were harassed and harried there too. The first and foremost reason given is that \"they had been wronged.\" The Muslims had suffered untold persecution and war was actually forced upon them. The verse incidentally shows that the Muslims were also very weak in numbers, means and material when the permission to fight in self-defence was granted to them as the comforting and encouraging words, \"And Allah indeed has power to help them,\" indicate. These words also implied a prophecy that though the Muslims were weak and their enemy was proud and powerful, yet as they were fighting in the cause of truth God would help them and they would be victorious.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 41,
        "v_": 40,
        "topics": [
            {
                "id": 3069,
                "topic": "Attributes of Allah: Al-‘Aziz (The Mighty)",
                "verses": "4:57, 2:130, 2:210, 2:221, 2:229, 3:7, 3:19, 4:159, 4:166, 9:40, 9:71, 14:2, 16:61, 22:75, 26:192, 27:10, 27:79, 33:26, 34:7, 35:29, 38:10, 38:67, 40:3, 45:3, 46:3, 48:8, 48:20, 59:2, 59:24, 61:2, 62:2, 64:19"
            },
            {
                "id": 3476,
                "topic": "Attributes of Allah: Al-Qawiyy (The Powerful)",
                "verses": "33:26, 8:53, 22:75, 40:23, 42:20, 51:59, 57:26, 58:22"
            },
            {
                "id": 3914,
                "topic": "Biya‘un: protection of synagogues churches",
                "verses": null
            },
            {
                "id": 5187,
                "topic": "Compulsion in Faith: <i>Ikrah fid-Din</i>",
                "verses": "2:257, 2:191, 2:194, 5:49, 5:93, 6:150, 7:89, 8:40, 9:6, 10:100, 11:119, 13:32, 16:10, 18:21, 18:30, 22:39, 25:58, 26:5, 50:46, 76:4, 90:11, 95:6, 109:7"
            },
            {
                "id": 5269,
                "topic": "Conscience",
                "verses": "8:40, 2:194, 3:21, 7:52, 7:89, 14:25, 18:30, 22:39, 22:72, 27:63, 47:5, 50:38, 67:11, 69:40, 75:3"
            },
            {
                "id": 5652,
                "topic": "Dar: abode, home",
                "verses": "2:85, 71:27"
            },
            {
                "id": 9908,
                "topic": "Jews: of Arabia",
                "verses": "59:3-6, 2:86, 2:95-96, 2:103, 2:105, 2:109, 2:146, 3:113-115, 3:184, 4:52, 5:65, 5:83, 17:61, 17:86, 33:10, 33:16, 33:27, 33:61-62, 46:30, 48:16, 58:6, 60:14, 72:2"
            },
            {
                "id": 9946,
                "topic": "Jihad: permission for",
                "verses": null
            },
            {
                "id": 12682,
                "topic": "Muhammad<sup>(sa)</sup>: universality of",
                "verses": "7:159, 2:214, 3:85, 4:80, 6:93, 10:58, 14:5, 21:108, 22:50, 23:53, 25:2, 34:29"
            },
            {
                "id": 13862,
                "topic": "Permission: Leave, <i>Idhn</i>: to fight",
                "verses": null
            },
            {
                "id": 14046,
                "topic": "Power: Allah has the",
                "verses": "2:21, 2:107, 2:166, 3:30, 5:18, 5:121, 6:18, 7:189, 9:39, 10:50, 11:5, 11:67, 18:40, 22:75, 33:26, 40:23, 42:20, 51:59, 53:6-7, 57:26, 58:22"
            },
            {
                "id": 17224,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 8:56-64, 9:1-16"
            },
            {
                "id": 18343,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:61, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "الَّذِیۡنَ اُخۡرِجُوۡا مِنۡ دِیَارِہِمۡ  بِغَیۡرِ  حَقٍّ اِلَّاۤ  اَنۡ یَّقُوۡلُوۡا رَبُّنَا اللّٰہُ ؕ وَ لَوۡ لَا دَفۡعُ اللّٰہِ النَّاسَ بَعۡضَہُمۡ بِبَعۡضٍ لَّہُدِّمَتۡ صَوَامِعُ وَ بِیَعٌ وَّ صَلَوٰتٌ وَّ مَسٰجِدُ یُذۡکَرُ فِیۡہَا اسۡمُ اللّٰہِ کَثِیۡرًا ؕ وَ لَیَنۡصُرَنَّ اللّٰہُ مَنۡ یَّنۡصُرُہٗ ؕ اِنَّ اللّٰہَ لَقَوِیٌّ عَزِیۡزٌ ﴿۴۱﴾ ",
        "ur": "(یعنی) وہ لوگ جنہیں ان کے گھروں سے ناحق نکالا گیا محض اس بنا پر کہ وہ کہتے تھے کہ اللہ ہمارا ربّ ہے۔ اور اگر اللہ کی طرف سے لوگوں کا دفاع اُن میں سے بعض کو بعض دوسروں سے بِھڑا کر نہ کیا جاتا تو راہب خانے منہدم کر دیئے جاتے اور گرجے بھی اور یہود کے معابد بھی اور مساجد بھی جن میں بکثرت اللہ کا نام لیا جاتا ہے۔ اور یقیناً اللہ ضرور اُس کی مدد کرے گا جو اس کی مدد کرتا ہے۔ یقیناً اللہ بہت طاقتور (اور) کامل غلبہ والا ہے۔",
        "v5": {
            "text": "Those who have been driven out from their homes unjustly only because they said, ‘Our Lord is Allah’—[a]And if Allah did not repel some people by means of others, there would surely have been destroyed cloisters and churches and synagogues and mosques, wherein the name of Allah is oft commemorated. [b]And Allah will surely help one who helps Him. Allah is indeed Powerful, Mighty—[2471]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:252."
                },
                {
                    "ref": "b",
                    "note": "47:8."
                },
                {
                    "ref": "2471",
                    "note": "<p><strong>Important Words:</strong></p><p>صوامع is the plural of صومعة which is derived from صومع. They say صومع الشیء i.e. he collected together the thing. صومع البناء means, he raised the building. صومعة means a mountain; a high place where a monk lives or a holy man worships seeking solitude; a cloister; the cell of a recluse (Aqrab &amp; Lane).</p><p>بیع (churches) is the plural of بیعة which means, a church or, as some say, a Jewish place of worship (Aqrab &amp; Lane).</p><p>صلوات Places of worship of the Jews (Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse gives the second reason, which led the poor and weak Muslims to take up arms. It was that they were driven out from their hearths and homes without a just and legitimate cause, their only crime being that they believed in one God. For years the Muslims were persecuted at Mecca, then they were driven out from it and were not left in peace even in their exile at Medina. They continued to be harassed in that place also. Islam was threatened with complete extirpation by a combined attack from the Arabian tribes round Medina, among whom the influence of the Quraish, on account of their being the custodians of the Ka‘bah, was very great. Medina itself was honey-combed with sedition and treachery. The Jews, compact and united, were opposed to the Holy Prophet. ‘Abdullah bin Ubayy, whose designs to become the crowned king of Medina had been upset by the Holy Prophet’s arrival in that city, and the hypocrites were an additional source of great danger to Islam. The Quraish held out a threat to ‘Abdullah bin ‘Ubayy that if the people of Medinah gave shelter to the Holy Prophet and did not make common cause with them against Muslims they would attack Medina with all their powerful hosts and allies and would kill their men and carry their women to Mecca in captivity (Abu Dawud). Thus Islam had to defend itself against much more powerful enemies at Medina than at Mecca. The position of Muslims in the first few years of their life at Medina was decidedly much weaker than at Mecca and the Holy Prophet’s difficulties instead of lessening had greatly increased. It was under these highly unfavourable circumstances that Muslims had to take up arms to save themselves, their faith and their Holy Prophet from extermination. If ever a people had a legitimate cause to fight, it were the Holy Prophet Muhammad and his Companions, and yet the unconscionable critics of Islam have accused him of waging aggressive wars to impose his faith on an unwilling people. See also 9:13.</p><p>After having given reasons why the Muslims were obliged to take up arms, the verse proceeds to mention the object and purpose of the wars of Islam. The object was never to deprive anybody of his home and possessions or to deprive whole peoples of national freedom or compel them to submit to foreign yoke under the garb of making them civilized as Western nations do, or to explore new markets and get new colonies. It was to fight in self-defence and to save Islam from extermination and to establish freedom of conscience and liberty of thought. It was also to defend places of worship belonging to different religions against desecration or destruction. Having laid down the principle that all religions have their origin in Divine revelation and that the founders of all religions were Divine Messengers and should therefore be equally respected (35:25), the Quran in the present verse has enjoined upon the Muslims to defend, even with their lives, all the places of worship—the churches, the synagogues, the temples, the cloisters, etc. This subject also finds an echo in vv. 2:194; 2:257; 8:40; 8:73. Thus the first and foremost object of the wars of Islam was, and will always be, to establish freedom of belief and worship and to fight in defence of country, honour and freedom against an unprovoked attack. Could there be a better cause to fight for than this? The Islamic injunctions as embodied in the present verse did not remain merely pious principles. They were acted upon by Muslims in daily life. The Muslims in the heyday of their power and glory always allowed complete freedom of belief and worship to people who accepted their protection and guardianship. To show the broad-mindedness and catholicity of Islamic teaching in this respect, we give below only one of several charters of freedom which the Holy Prophet granted to the followers of other faiths:</p><p>This is the document which Muhammad, son of ‘Abdullah, God’s Prophet, Warner and Bearer of glad-tidings, has caused to be written so that there should remain no excuse for those coming after. I have caused this document to be written for Christians of the East and the West, for those who live near, and for those of the distant lands, for the Christians living at present and for those who will come after, for those Christians who are known to us and for those as well whom we do not know. Any Muslim violating and abusing what is therein ordered would be regarded as violator of God’s testament and would be the breaker of His promise and would make himself deserving of God’s curse, be he a king or a subject. I promise that any monk or wayfarer, etc. who will seek my help on the mountains, in forests, deserts or habitations, or in places of worship, I will repel his enemies with all my friends and helpers, with all my relatives and with all those who profess to follow me and will defend him, because they are my covenant. And I will defend the covenanted against the persecution, injury and embarrassment by their enemies in lieu of the poll-tax they have promised to pay. If they prefer themselves to defend their properties and persons, they will be allowed to do so and will not be put to any inconvenience on that account. No bishop will be expelled from his bishopric, no monk from his monastery, no priest from his place of worship, and no pilgrim will be detained in his pilgrimage. None of their churches and other places of worship will be desolated or destroyed or demolished. No material of their churches will be used for building mosques or houses for the Muslims, any Muslim so doing will be regarded as recalcitrant to God and His Prophet. Monks and bishops will be subject to no tax or indemnity whether they live in forests or on the rivers, or in the East or West, North or South. I give them my word of honour. They have my promise and covenant and will enjoy perfect immunity from all sorts of inconveniences. Every help shall be given them in the repair of their churches. They shall be absolved from wearing arms. They shall be protected by the Muslims. Let this document be not disobeyed till the Judgement Day (Baladhari).</p><p>Similar charters were granted to the followers of other faiths. True Muslims have always tried to follow faithfully the example of their Prophet.</p><p>The words, \"And Allah will surely help one who helps Him,\" signify that Muslim armies will receive Divine help because they fight Allah’s own battles and promote the sacred cause which is very dear to Him.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 42,
        "v_": 41,
        "topics": [
            {
                "id": 1459,
                "topic": "Allah: enjoins good, forbids evil",
                "verses": "9:112, 2:45, 2:178, 3:105, 3:111, 3:115, 5:3, 9:71, 31:18, 58:10"
            },
            {
                "id": 1477,
                "topic": "Allah: enjoins prayer, <i>Zakat</i>, charity...",
                "verses": "5:13, 2:44, 2:84, 2:111, 2:178, 2:278, 4:163, 5:56, 9:5, 9:11, 9:18, 9:71, 19:32, 19:56, 21:74, 22:79, 24:38, 24:57, 27:4, 31:5, 33:34, 58:14, 73:21, 98:6"
            },
            {
                "id": 2230,
                "topic": "Allah: regulates all affairs",
                "verses": "10:32, 2:211, 10:4, 13:3, 16:2, 32:6, 42:54"
            },
            {
                "id": 4334,
                "topic": "Believers: <i>Mu’min</i>: observe prayers",
                "verses": "4:163, 2:4, 2:178, 4:104, 5:56, 8:4, 9:18, 13:23, 14:32, 17:110, 19:59, 22:36, 23:3, 23:10, 24:38, 27:4, 31:5, 32:16, 35:30, 42:39, 70:24, 70:35, 73:21, 98:6"
            },
            {
                "id": 4351,
                "topic": "Believers: <i>Mu’min</i>: who enjoin good",
                "verses": "2:178, 3:18, 3:111, 3:115, 3:135, 7:158, 7:200, 9:112, 13:21-23, 23:4, 23:9, 23:62, 24:23, 25:64, 25:73, 26:228, 28:55-56, 32:17, 33:36, 41:35, 57:19, 70:33"
            },
            {
                "id": 9946,
                "topic": "Jihad: permission for",
                "verses": null
            },
            {
                "id": 16101,
                "topic": "Salah: rewards of offering",
                "verses": "23:2-3, 2:4, 2:178, 2:278, 4:163, 5:56, 13:23, 70:23-24, 87:15-16"
            },
            {
                "id": 17224,
                "topic": "State: rules of war",
                "verses": "2:248, 2:191-4, 4:76, 8:40, 8:56-64, 9:1-16"
            },
            {
                "id": 18343,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:61, 47:5, 47:36, 59:6"
            },
            {
                "id": 18990,
                "topic": "Zakat",
                "verses": "9:60, 2:44, 2:84, 2:111, 2:178, 2:278, 4:163, 5:13, 5:56, 7:157, 9:11, 9:18, 9:71, 19:32, 19:56, 21:74, 22:79, 23:2-5, 24:38, 24:57, 27:4, 30:40, 31:5, 33:34, 41:8, 58:14, 73:21, 98:6"
            }
        ],
        "ar": "اَلَّذِیۡنَ  اِنۡ مَّکَّنّٰہُمۡ  فِی الۡاَرۡضِ اَقَامُوا الصَّلٰوۃَ وَ اٰتَوُا الزَّکٰوۃَ وَ اَمَرُوۡا بِالۡمَعۡرُوۡفِ وَ  نَہَوۡا عَنِ الۡمُنۡکَرِ ؕ وَ لِلّٰہِ  عَاقِبَۃُ  الۡاُمُوۡرِ ﴿۴۲﴾ ",
        "ur": "جنہیں اگر ہم زمین میں تمکنت عطا کریں تو وہ نماز کو قائم کرتے ہیں اور زکوٰۃ ادا کرتے ہیں اور نیک باتوں کا حکم دیتے ہیں اور بُری باتوں سے روکتے ہیں اور ہر بات کا انجام اللہ ہی کے اختیار میں ہے۔",
        "v5": {
            "text": "Those who, if We establish them in the earth, will observe Prayer and pay the Zakah and enjoin good and forbid evil. And with Allah rests the final issue of all affairs.[2472]",
            "notes": [
                {
                    "ref": "2472",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse lays down some principles of universal application:</p><p>Firstly: Those true servants of God are entitled to receive God’s help, power and authority to use it for the good of humanity who do their duty to God and man, and are devout and God-fearing, who help their fellow beings with all the means at their disposal and not only themselves live righteous lives but exhort others to lead good and useful lives and abstain from evil.</p><p>Secondly: Any nation or people who seek to receive Divine help and rise to power and influence should act upon these principles.</p><p>Thirdly: a nation or people on whom God confers power and dominion continue to enjoy these blessings so long as they observe these principles. To this sublime principle another verse of the Quran also refers, viz. \"Verily, Allah changes not the condition of a people until they change their own condition\" (13:12).</p><p>The verse incidentally implies a commandment for the Muslims that when they get power, they should not use it for the furtherance of their own selfish ends but should employ it in ameliorating the lot of poor and downtrodden people and in establishing peace and tranquillity in their dominions and should particularly respect and protect places of worship. It also shows that the Companions of the Holy Prophet were granted power, dominion and wealth because they lived up to the principles enunciated in this verse and that when they attained power and wealth they used it in the service of humanity.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 43,
        "v_": 42,
        "topics": [
            {
                "id": 555,
                "topic": "‘Ad: people of: accused Prophets of falsehood",
                "verses": "38:13"
            },
            {
                "id": 7345,
                "topic": "Falsehood: <i>Batil</i>: Prophets accused of",
                "verses": "17:82, 6:34, 6:148-149, 16:106, 16:117, 18:57, 25:5, 28:35, 42:25, 68:10"
            },
            {
                "id": 13072,
                "topic": "Noah: <i>Nuh(as)</i>: mocked by people",
                "verses": "23:25-27, 7:65, 10:74, 25:38, 26:106, 26:118, 38:13, 40:6, 50:13, 54:10, 71:22"
            },
            {
                "id": 17658,
                "topic": "Thamud: rejected Allah, Messengers",
                "verses": "11:69, 7:77, 26:142, 54:24, 91:12"
            }
        ],
        "ar": "وَ اِنۡ یُّکَذِّبُوۡکَ فَقَدۡ کَذَّبَتۡ قَبۡلَہُمۡ قَوۡمُ  نُوۡحٍ  وَّ عَادٌ  وَّ  ثَمُوۡدُ ﴿ۙ۴۳﴾ ",
        "ur": "اور اگر وہ تجھے جھٹلا دیں تو اُن سے پہلے قومِ نوح نے بھی جھٹلا دیا تھا اور عاد اور ثمود نے بھی۔",
        "v5": {
            "text": "[a]And if they accuse thee of falsehood, even so, before them, the people of Noah and <i>the tribes of </i>‘Ad and Thamud <i>also</i> accused <i>their Prophets</i> of falsehood.[2473]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:35; 35:26; 40:6; 54:10."
                },
                {
                    "ref": "2473",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that those who reject God’s Prophets and do not observe the principles laid down in the preceding verses invite and incur Divine wrath. As an illustration the verse gives the instances of the people of Noah, and of the tribes of ‘Ad and Thamud. These peoples were visited with God’s punishment because they ignored and defied His commandments.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 44,
        "v_": 43,
        "topics": [
            {
                "id": 14,
                "topic": "Aaron: <i>Harun(as)</i>: commissioned to Pharaoh",
                "verses": "10:76, 26:16-17"
            },
            {
                "id": 7345,
                "topic": "Falsehood: <i>Batil</i>: Prophets accused of",
                "verses": "17:82, 6:34, 6:148-149, 16:106, 16:117, 18:57, 25:5, 28:35, 42:25, 68:10"
            }
        ],
        "ar": "وَ  قَوۡمُ   اِبۡرٰہِیۡمَ  وَ  قَوۡمُ  لُوۡطٍ ﴿ۙ۴۴﴾ ",
        "ur": "اور ابراہیم کی قوم نے بھی اور لوط کی قوم نے بھی۔",
        "v5": {
            "text": "And <i>so did</i> the people of Abraham and the people of Lot;[2474]",
            "notes": [
                {
                    "ref": "2474",
                    "note": "<p><strong>Commentary:</strong></p><p>This and the next verse give the instances of the people of Abraham and Lot and of the inhabitants of Midian and those who rejected Moses.All these peoples had their due share of Divine punishment for their evil deeds. They had been given sufficient time to mend their ways but they did not profit by the respite granted to them.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 45,
        "v_": 44,
        "topics": [
            {
                "id": 7345,
                "topic": "Falsehood: <i>Batil</i>: Prophets accused of",
                "verses": "17:82, 6:34, 6:148-149, 16:106, 16:117, 18:57, 25:5, 28:35, 42:25, 68:10"
            },
            {
                "id": 10687,
                "topic": "Madyan: Midian, <i>Mada’in-e-Salih</i>",
                "verses": "15:79, 2:251, 7:86-94, 11:85, 11:95-96, 18:61, 18:66, 20:41, 26:142, 27:19, 28:23-24, 28:46, 29:37, 29:41"
            },
            {
                "id": 15564,
                "topic": "Respite: opponent of Prophets",
                "verses": "7:196, 10:72, 11:56, 13:33"
            },
            {
                "id": 15573,
                "topic": "Respite: to disbelievers",
                "verses": "9:2, 2:163, 3:179, 6:9, 6:13, 10:23-24, 21:41, 32:30, 86:18"
            }
        ],
        "ar": "وَّ اَصۡحٰبُ مَدۡیَنَ ۚ وَ کُذِّبَ مُوۡسٰی فَاَمۡلَیۡتُ لِلۡکٰفِرِیۡنَ ثُمَّ  اَخَذۡتُہُمۡ ۚ فَکَیۡفَ کَانَ نَکِیۡرِ ﴿۴۵﴾ ",
        "ur": "نیز اصحابِ مدیَن نے۔ اور موسیٰ کو بھی جھٹلایا گیا۔ پس میں نے کافروں کو کچھ مہلت دی پھر میں نے انہیں پکڑ لیا۔ پس کیسی تھی میری عقوبت!",
        "v5": {
            "text": "And the inhabitants of Midian. And Moses <i>too</i> was accused of falsehood. But I gave respite to the disbelievers; then I seized them, and how <i>terrible</i> was <i>the consequence </i><i>of</i> denying Me!",
            "notes": null
        }
    },
    {
        "ch": 22,
        "v": 46,
        "v_": 45,
        "topics": [
            {
                "id": 5093,
                "topic": "City: <i>Ummul-Qura</i>: destroyed as punishment",
                "verses": "6:93, 7:5, 9:70, 11:103, 17:17, 18:60, 21:7, 28:59, 29:32, 29:35, 65:9"
            },
            {
                "id": 18882,
                "topic": "Wrongdoers: <i>Zalim</i>",
                "verses": "4:76, 3:95, 3:129, 5:46, 6:34, 8:55, 9:23, 11:103, 14:14, 14:43, 18:36, 21:12, 22:49, 25:28, 26:11, 29:15, 29:50, 35:33, 37:114"
            }
        ],
        "ar": "فَکَاَیِّنۡ مِّنۡ قَرۡیَۃٍ  اَہۡلَکۡنٰہَا وَ ہِیَ ظَالِمَۃٌ  فَہِیَ خَاوِیَۃٌ عَلٰی عُرُوۡشِہَا وَ بِئۡرٍ  مُّعَطَّلَۃٍ   وَّ  قَصۡرٍ  مَّشِیۡدٍ ﴿۴۶﴾ ",
        "ur": "اور کتنی ہی بستیاں ہیں جنہیں ہم نے ہلاک کر دیا جبکہ وہ ظلم کرنے والی تھیں۔ پس اب وہ اپنی چھتوں کے بل گری پڑی ہیں اور کتنے ہی متروک کنوئیں ہیں اور مضبوط بنائے ہوئے محل ہیں (جن سے ایسا ہی سلوک کیا گیا)۔",
        "v5": {
            "text": "[a]And how many a city have We destroyed, while it was given to wrongdoing, so that it is fallen down on its roofs; and <i>how many a</i> deserted well and lofty castle![2475]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:5; 21:12; 28:59; 65:9-10."
                },
                {
                    "ref": "2475",
                    "note": "<p><strong>Important Words:</strong></p><p>خاویة (fallen) is derived from خوی. They say خوی البیت i.e. (1) the house fell down in ruins; (2) it became empty and untenanted (Aqrab). See also 2:260.</p><p>معطلة (deserted) is derived from عطل. They say عطل الشیء (<i>attala</i>) i.e. he rendered the thing untended or neglected. عطل البئرmeans, he gave up going to the well to drink from it. عطل الابل means, the camels went away without a pastor to look after them (Aqrab). واذا العشار عطلت means, and when the she-camels ten-months pregnant are abandoned or are left without a pastor to look after them (81:5).</p><p>مشید (lofty) means, lofty, strongly or firmly built. See also 4:79.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 47,
        "v_": 46,
        "topics": [
            {
                "id": 2445,
                "topic": "Allah: travel in the earth..., <i>Siru fil-ard</i>",
                "verses": "29:21, 3:138, 6:12, 12:110, 27:70, 30:10, 30:43, 35:45, 40:22, 40:83, 47:11"
            },
            {
                "id": 4535,
                "topic": "Blind: of heart",
                "verses": null
            },
            {
                "id": 4736,
                "topic": "Breast: <i>Fu‘ad, Qalb</i>",
                "verses": "6:126, 3:120, 3:155, 7:3, 7:180, 11:13, 15:98, 16:79, 16:107, 20:26, 25:33, 26:14, 37:85, 39:23, 40:20, 40:57, 53:12, 94:2, 100:11"
            },
            {
                "id": 6864,
                "topic": "Ears: disbelievers do not hear",
                "verses": "2:8, 2:172, 6:26, 7:180, 16:109, 17:47, 18:58, 31:8, 37:9, 41:5, 41:21, 41:45, 71:8"
            },
            {
                "id": 7038,
                "topic": "Earth: <i>Al-Ard</i>: travel through the",
                "verses": "3:138, 3:157, 4:102, 6:12, 12:109, 14:39, 29:20, 30:10, 30:43, 35:45, 40:22, 40:83, 47:11, 67:16"
            },
            {
                "id": 8429,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>",
                "verses": "53:12, 3:30, 3:120, 7:44, 9:14, 10:58, 15:48, 17:37, 25:33, 28:11, 29:50, 40:20, 100:10-11, 104:8, 114:6"
            },
            {
                "id": 8503,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: sealed, veiled, rusted, blind, straitened",
                "verses": "53:12, 18:58, 2:8, 2:89, 4:156, 6:26, 6:47, 6:111, 7:101-102, 7:180, 9:87, 9:93, 9:110, 10:75, 11:13, 14:44, 15:98, 16:109, 17:47, 18:29, 23:64, 26:14, 30:60, 40:36, 41:6, 42:25, 45:24, 47:17, 47:25, 59:15, 63:4, 83:15"
            },
            {
                "id": 17825,
                "topic": "Travel",
                "verses": "67:16, 3:46, 3:138, 4:44, 9:2, 9:60, 12:110, 16:15, 17:71, 29:21, 47:11, 73:21"
            }
        ],
        "ar": "اَفَلَمۡ یَسِیۡرُوۡا فِی الۡاَرۡضِ فَتَکُوۡنَ لَہُمۡ قُلُوۡبٌ یَّعۡقِلُوۡنَ بِہَاۤ  اَوۡ اٰذَانٌ یَّسۡمَعُوۡنَ بِہَا ۚ فَاِنَّہَا لَا تَعۡمَی الۡاَبۡصَارُ  وَ لٰکِنۡ  تَعۡمَی الۡقُلُوۡبُ الَّتِیۡ فِی الصُّدُوۡرِ ﴿۴۷﴾",
        "ur": "پس کیا وہ زمین میں نہیں پھرے تا انہیں وہ دل ملتے جن سے وہ عقل سے کام لیتے یا ایسے کان نصیب ہوتے جن سے وہ سن سکتے۔ پس آنکھیں اندھی نہیں ہوتیں بلکہ دل اندھے ہوتے ہیں جو سینوں میں ہیں۔",
        "v5": {
            "text": "[b]Have they not travelled in the land, so that they may have hearts wherewith to understand, or ears wherewith to hear? For surely it is not the eyes that are blind, but blind are the hearts which are in the breasts.[2476]",
            "notes": [
                {
                    "ref": "b",
                    "note": "12:110; 30:10; 35:45; 40:22; 47:11."
                },
                {
                    "ref": "2476",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse exhorts disbelievers to study the histories of and to learn a lesson from the fate of those people who rejected the former Prophets. It is also clear from this verse that the dead, the blind and the deaf spoken of here and elsewhere in the Quran are the spiritually blind, deaf and dead. See also 17:73.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 48,
        "v_": 47,
        "topics": [
            {
                "id": 2749,
                "topic": "Antichrist: <i>Dajjal</i>",
                "verses": "18:111, 18:41, 40:58"
            },
            {
                "id": 5762,
                "topic": "Day: measure of",
                "verses": "32:6, 70:5"
            },
            {
                "id": 14268,
                "topic": "Promise: Allah true to His",
                "verses": "3:195, 3:10, 4:123, 6:135, 7:45, 10:5, 10:56, 11:46, 14:48, 16:39, 17:109, 18:22, 18:99, 21:10, 28:14, 30:61, 31:10, 31:34, 35:6, 40:56, 40:78, 43:43, 45:33, 46:18, 51:6, 77:8"
            }
        ],
        "ar": "وَ  یَسۡتَعۡجِلُوۡنَکَ بِالۡعَذَابِ وَ لَنۡ یُّخۡلِفَ اللّٰہُ وَعۡدَہٗ ؕ وَ اِنَّ یَوۡمًا عِنۡدَ رَبِّکَ  کَاَلۡفِ  سَنَۃٍ   مِّمَّا  تَعُدُّوۡنَ ﴿۴۸﴾ ",
        "ur": "اور وہ تجھ سے جلد تر عذاب مانگتے ہیں جبکہ اللہ ہرگز اپنے وعدہ کے خلاف نہیں کرے گا اور یقیناً تیرے ربّ کے پاس ایسا بھی دن ہے جو اس شمار کے مطابق جو تم کرتے ہو ایک ہزار برس کا ہے۔ ",
        "v5": {
            "text": "[c]And they ask thee to hasten on the punishment, but Allah will never break His promise. And verily, a day with thy Lord is <i>sometimes</i> as a thousand years of your reckoning.[2477]",
            "notes": [
                {
                    "ref": "c",
                    "note": "26:205; 27:72; 29:54-55;37:177; 51:15."
                },
                {
                    "ref": "2477",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference in this verse is to a mighty event in the history of Islam. The Holy Prophet is reported to have said that the first three centuries of Islam would be its best period after which falsehood would spread and a period of darkness would come and this period of darkness would extend to over a thousand years (Tirmidhi). This period is likened to one day in the present verse and in 32:6. In this period of moral and spiritual decadence of Muslims a people having blue eyes were to arise who were to spread all over the earth and at whose hands Islam was destined to receive a serious setback (20:103-104). This period of political decadence of Islam and moral degeneration of Muslims in which they faced defeat and discomfiture at the hands of western Christian nations having blue eyes, began after the expiry of the third century of Hijrah and lasted up to the dawn of the 14th century when the Promised Messiah made his appearance. It is to these western people that the reference has been made in the words \"And they ask thee to hasten on the punishment.\" In their conceit and arrogance born of material glory and political power, the western peoples came to labour under the misconception that their progress and glory would last forever. So they are depicted in the verse under comment as challenging the Holy Prophet to hasten on the punishment which he said would overtake them. To their implied taunt and gibe, the verse makes a reply that God had already made a promise that these western nations would be granted respite for one thousand years after which a terrible tribulation would overtake them and all their greatness and glory would become a thing of the past. Divine punishment would descend on their houses and the very soil on which they would be living would be rendered bleak and barren. They are warned that the punishment would be so severe, overwhelming and enveloping that one day of it would appear to them as a thousand years. See also 18:9 &amp; 32:6.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 49,
        "v_": 48,
        "topics": [
            {
                "id": 18883,
                "topic": "Wrongdoers: <i>Zalim</i>",
                "verses": "4:76, 3:95, 3:129, 5:46, 6:34, 8:55, 9:23, 11:103, 14:14, 14:43, 18:36, 21:12, 22:46, 25:28, 26:11, 29:15, 29:50, 35:33, 37:114"
            }
        ],
        "ar": "وَ کَاَیِّنۡ مِّنۡ قَرۡیَۃٍ  اَمۡلَیۡتُ لَہَا وَ ہِیَ ظَالِمَۃٌ  ثُمَّ اَخَذۡتُہَا ۚ وَ اِلَیَّ الۡمَصِیۡرُ ﴿٪۴۹﴾ ",
        "ur": "اور کتنی ہی بستیاں ہیں جنہیں میں نے مہلت دی جبکہ وہ ظالم تھیں۔ پھر میں نے اُن کو پکڑ لیا۔ اور میری ہی طرف لوٹنا ہے۔",
        "v5": {
            "text": "And how many a city there is to which I gave respite, while it was given to wrongdoing. Then I seized it, and unto Me is the return.[2478]",
            "notes": [
                {
                    "ref": "2478",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse is of general application but it specially alludes to the punishment in store for the peoples mentioned in the preceding verses.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 50,
        "v_": 49,
        "topics": [
            {
                "id": 10962,
                "topic": "Mankind: Holy Prophet<sup>(sa)</sup> &amp;",
                "verses": "7:159, 4:80, 4:171, 6:91, 10:3, 16:45, 18:7, 21:108, 25:2, 28:88, 34:29, 42:16, 42:53"
            },
            {
                "id": 12683,
                "topic": "Muhammad<sup>(sa)</sup>: universality of",
                "verses": "7:159, 2:214, 3:85, 4:80, 6:93, 10:58, 14:5, 21:108, 22:41, 23:53, 25:2, 34:29"
            },
            {
                "id": 18418,
                "topic": "Warner: <i>Nadhir</i>",
                "verses": "35:24-25, 2:120, 2:214, 4:166, 5:20, 7:185, 7:189, 11:3, 11:13, 11:26, 15:90, 17:106, 25:2, 25:8, 25:52, 25:57, 26:115-116, 27:93, 28:47, 29:51, 32:4, 33:46, 34:29, 34:35, 34:47, 35:38, 35:43, 38:71, 41:5, 46:10, 48:9, 51:51, 53:57, 67:9-10, 67:27, 71:3"
            }
        ],
        "ar": "قُلۡ یٰۤاَیُّہَا النَّاسُ اِنَّمَاۤ  اَنَا لَکُمۡ نَذِیۡرٌ  مُّبِیۡنٌ ﴿ۚ۵۰﴾ ",
        "ur": "تو کہہ دے کہ اے تمام انسانو! میں تمہارے لئے محض ایک کھلا کھلا ڈرانے والا ہوں۔",
        "v5": {
            "text": "Say, ‘O mankind, [a]I am but a plain Warner to you.’[2479]",
            "notes": [
                {
                    "ref": "a",
                    "note": "26:116; 29:51; 51:51; 67:27."
                },
                {
                    "ref": "2479",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse refers to the universality of the Message of Islam. The Holy Prophet was sent for the whole of mankind and the Quran is humanity’s infallible guide till the end of time.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 51,
        "v_": 50,
        "topics": [
            {
                "id": 2160,
                "topic": "Allah: promised forgiveness, reward",
                "verses": "48:30, 2:269, 3:137, 8:5, 24:27, 33:36, 34:5, 35:8, 36:12, 47:16, 49:4, 67:13"
            },
            {
                "id": 7739,
                "topic": "Forgiveness: <i>‘Afw</i>: Allah grants",
                "verses": "3:136-137, 2:222, 2:269, 3:133, 4:97, 8:5, 24:27, 33:36, 34:5, 35:8, 36:12, 47:16, 48:30, 49:4, 67:13"
            },
            {
                "id": 7791,
                "topic": "Forgiveness: <i>‘Afw</i>: promised",
                "verses": "48:30, 2:269, 3:137, 8:5, 24:27, 33:36, 34:5, 35:8, 36:12, 47:16, 49:4, 67:13"
            },
            {
                "id": 8955,
                "topic": "Honour: of believers",
                "verses": "49:14, 4:32, 4:140, 4:176, 8:5, 8:75, 10:3, 19:86, 30:16, 57:19, 70:35-36, 89:16, 89:18"
            },
            {
                "id": 14665,
                "topic": "Provisions: Allah provides",
                "verses": "20:132, 5:115, 2:58, 2:173, 2:213, 3:38, 5:89, 7:161, 8:75, 11:7, 16:72, 16:115, 20:82, 20:132, 22:59, 23:73, 24:39, 29:61, 34:5, 51:23, 51:59, 62:12"
            },
            {
                "id": 14697,
                "topic": "Provisions: worldly",
                "verses": "20:132, 2:241, 2:237, 3:15, 5:97, 8:5, 8:75, 10:60, 10:99, 11:4, 11:7, 11:89, 12:60, 12:66, 14:31, 16:72, 16:76, 17:19, 20:132-133, 22:59, 24:27, 28:58, 33:32, 33:50, 34:5, 34:16, 40:40, 42:37, 43:30, 43:36, 45:6, 50:12, 67:16, 67:22, 79:34"
            }
        ],
        "ar": "فَالَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَہُمۡ مَّغۡفِرَۃٌ  وَّ  رِزۡقٌ  کَرِیۡمٌ ﴿۵۱﴾ ",
        "ur": "پس وہ لوگ جو ایمان لائے اور نیک اعمال بجا لائے ان کے لئے بخشش ہے اور ایک عزت والا رزق ہے۔",
        "v5": {
            "text": "Those who believe and do good works, [b]for them is forgiveness and an honourable provision.[2480]",
            "notes": [
                {
                    "ref": "b",
                    "note": "8:75; 24:27; 34:5."
                },
                {
                    "ref": "2480",
                    "note": "<p><strong>Important Words:</strong></p><p>کریم (excellent) is derived from کرم which means, it was or became highly esteemed or prized or valued, excellent, precious or rare. کرمت ارضه means, his land became productive or fertile. کرائم المال are such as are held in high estimation; precious or excellent of cattle or other possessions; the choicest or best thereof. کریم which is contrary of لئیم, means, generous; liberal; honourable; noble, high-born (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The words \"honourable provision,\" cover both physical and spiritual sustenance.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 52,
        "v_": 51,
        "topics": [
            {
                "id": 9254,
                "topic": "Inmates of Hell",
                "verses": "2:120, 5:11, 5:87, 9:113, 44:48, 44:57, 56:93-95, 57:20, 69:31-32, 79:37, 79:39-40, 81:13, 82:15, 102:7"
            }
        ],
        "ar": "وَ الَّذِیۡنَ سَعَوۡا فِیۡۤ  اٰیٰتِنَا مُعٰجِزِیۡنَ اُولٰٓئِکَ  اَصۡحٰبُ  الۡجَحِیۡمِ ﴿۵۲﴾ ",
        "ur": "اور وہ لوگ جنہوں نے ہماری آیات کو عاجز کرنے کی کوشش کرتے ہوئے بہت بھاگ دوڑ کی یہی دوزخ والے ہیں۔",
        "v5": {
            "text": "But [c]those who strive against Our Signs, seeking to frustrate <i>Our purpose</i>—these shall be the inmates of the Fire.[2481]",
            "notes": [
                {
                    "ref": "c",
                    "note": "34:6, 39."
                },
                {
                    "ref": "2481",
                    "note": "<p><strong>Commentary:</strong></p><p>It is writ large on the pages of the history of all religions that in spite of all the ups and downs through which truth has to pass, it triumphs in the long run. The enemies of truth have never been able to impede its onward march. They cannot frustrate the Divine plan that truth must prevail.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 53,
        "v_": 52,
        "topics": [
            {
                "id": 3243,
                "topic": "Attributes of Allah: Al-Hakim (The Wise)",
                "verses": "2:130, 2:33, 2:210, 2:221, 2:229, 2:261, 3:7, 4:12, 4:57, 4:131, 4:166, 5:119, 9:15, 9:40, 11:2, 12:101, 15:26, 16:61, 24:19, 27:7, 27:10, 31:28, 34:2, 35:3, 41:43, 42:52, 43:85, 44:5, 46:3, 48:5, 48:8, 48:20, 49:9, 57:2, 59:2, 59:25, 62:2, 64:19, 66:3"
            },
            {
                "id": 9199,
                "topic": "Ijma‘: consensus",
                "verses": "4:25, 2:232, 3:145, 22:40, 36:2"
            },
            {
                "id": 14587,
                "topic": "Prophets<sup>(as)</sup>: <i>Anbiya’</i>: opposition to",
                "verses": "19:52, 10:20, 21:42, 23:45, 25:32, 26:154, 34:35, 34:44, 41:44, 51:53-54, 54:24"
            },
            {
                "id": 16281,
                "topic": "Satan: and Prophets<sup>(as)</sup>",
                "verses": "6:113, 38:42, 53:21"
            }
        ],
        "ar": "وَ مَاۤ  اَرۡسَلۡنَا مِنۡ قَبۡلِکَ مِنۡ رَّسُوۡلٍ وَّ لَا نَبِیٍّ  اِلَّاۤ  اِذَا تَمَنّٰۤی اَلۡقَی الشَّیۡطٰنُ فِیۡۤ اُمۡنِیَّتِہٖ ۚ فَیَنۡسَخُ اللّٰہُ مَا یُلۡقِی الشَّیۡطٰنُ ثُمَّ  یُحۡکِمُ  اللّٰہُ  اٰیٰتِہٖ ؕ وَ  اللّٰہُ عَلِیۡمٌ  حَکِیۡمٌ  ﴿ۙ۵۳﴾",
        "ur": "اور ہم نے تجھ سے پہلے نہ کوئی رسول بھیجا اور نہ نبی مگر جب بھی اُس نے (کوئی) تمنّا کی (نفس کے) شیطان نے اس کی تمنّا میں (بطور ملاوٹ کچھ) ڈال دیا۔ تب اللہ اُسے منسوخ کر دیتا ہے جو شیطان ڈالتا ہے۔ پھر اللہ اپنی آیات کو مستحکم کر دیتا ہے۔ اور اللہ دائمی علم رکھنے والا (اور) بہت حکمت والا ہے۔ ",
        "v5": {
            "text": "Never sent We a Messenger or a Prophet before thee, but when he sought <i>to attain his object</i>, Satan put <i>obstacles</i> in<i> the way of</i> what he sought after. But Allah removes <i>the obstacles</i> that are placed by Satan. Then Allah firmly establishes His Signs. And Allah is All-Knowing, Wise.[2482]",
            "notes": [
                {
                    "ref": "2482",
                    "note": "<p><strong>Important Words:</strong></p><p>تمنی (he sought or desired to obtain). تمنی الشیء means, he desired the thing. تمنی الرجل means, the man lied. تمنی الکتاب means, he read or recited the book. أمنیة (أمانی plural) means, what is desired; a lie; an object of wish (Aqrab).</p><p><strong>Commentary:</strong></p><p>This verse has been subjected to much conjecture and speculation by some ignorant and careless commentators and has been deliberately misinterpreted and its meaning purposely distorted by prejudiced Christian writers. It is said that one day at Mecca when the Holy Prophet recited the Quranic verse, أفرأیتم اللات والعزی و مناة الثالثة الاخری i.e. \"now tell me about Lat and ‘Uzza, and Manat, the third one, another goddess\" (53:21), Satan put in his mouth the words تلک الغرانیق العلی وان شفا عتھن لترتجی i.e. these are exalted goddesses and their intercession is hoped for. They call it the 'lapse of Muhammad' or his 'compromise with idolatry'. In fact the Holy Prophet never made any compromise with idolatry nor was there any lapse on his part. The lapse, if any, occurred in the minds of these hostile critics of Islam. It is a case of wish being father to the thought. These people are always on the lookout to discover a lapse in the Holy Prophet and when they find none, they invent one and impute it to him.</p><p>They say that the verse under comment refers to the above incident. We shall deal at length with the whole episode when we come to the relevant verse i.e. 53:21. Suffice it here to say that the whole story is belied by the fact that 53rdchapter was, according to consensus of scholarly opinion, revealed in the 5th year of the Call at Mecca while the present <i>Surah</i> was revealed at Medina or on the eve of his departure from Mecca. It is inconceivable that God should have waited for eight long years to refer in this verse to that incident. Moreover, the story has been rejected as totally unfounded by all learned commentators of the Quran, Ibn Kathir, being one of them. It appears to have been based on some reports narrated by Waqidi, whom all competent authorities regard as quite untrustworthy. It seems strange that the utterance of this blasphemy should have been attributed to that great and uncompromising iconoclast i.e. the Holy Prophet, whose whole life was spent in denouncing and condemning idolatry and idol worship. Besides this the whole context of 53:21 belies this story. The verses preceding and succeeding 53:21 contain an unsparing denunciation of idolatry. In fact the whole <i>Surah</i> (53) is a condemnation of شرک (idol worship).</p><p>Moreover, there is nothing in the words of the verse itself to warrant the forging of such a blatant lie. The meaning of the verse is quite clear. It purports to say that whenever a Prophet desires to attain his object, i.e. whenever he preaches the message of truth and desires that Divine Unity may be established on earth, Satan places all sorts of obstacles and impediments in his way, i.e. wicked people seek to retard the progress of truth by putting all sorts of obstacles in the way of the Prophet. They wish to see his mission fail. But they cannot frustrate the Divine plan and God removes all those impediments and makes the cause of truth prevail and triumph. This meaning of the verse is quite simple and clear and is in perfect harmony with the text. The words \"But Allah removes the obstacles placed by Satan,\" lend powerful support to this meaning. The verse is of general import. What it refers to happens in the case of every prophet. There is no warrant for suggesting that the verse applies exclusively to the Holy Prophet. History too supports the view that the verse is of general application. In their impatience to find fault with the Holy Prophet, however, hostile Christian writers have singled him out, and, misinterpreting the verse, have attributed a supposed lapse to him.</p><p>Moreover, it is wrong to suggest, as some commentators have done, that it is possible for Satan to interfere with the purity of the Quranic revelation. God has taken upon Himself to protect and safeguard it against all interference and interpolation. See also 15:10 &amp; 72:27-29.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 54,
        "v_": 53,
        "topics": [
            {
                "id": 6592,
                "topic": "Disease",
                "verses": "2:11, 2:220, 4:4, 5:53, 8:50, 9:125, 10:58, 20:98, 24:51, 33:13, 33:33, 33:61, 38:42-43, 47:21, 47:30, 74:32"
            },
            {
                "id": 8456,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: diseased",
                "verses": "53:12, 2:11, 5:53, 8:50, 9:125, 24:51, 33:13, 33:33, 33:61, 47:21, 47:30, 74:32"
            },
            {
                "id": 10906,
                "topic": "Man: trial on earth",
                "verses": "2:156-157, 2:103, 3:187, 6:166, 8:29, 10:86, 14:7, 21:36, 21:112, 22:12, 25:29, 39:50, 54:28, 64:16, 94:16"
            },
            {
                "id": 16281,
                "topic": "Satan: and Prophets<sup>(as)</sup>",
                "verses": "6:113, 38:42, 53:21"
            },
            {
                "id": 17900,
                "topic": "Trial: Fitnah",
                "verses": "7:156, 2:103, 5:72, 8:29, 8:74, 9:49, 10:86, 17:61, 21:36, 21:112, 22:12, 24:64, 25:21, 29:11, 37:64, 39:50, 54:28, 60:6, 64:16, 74:32"
            }
        ],
        "ar": "لِّیَجۡعَلَ مَا یُلۡقِی الشَّیۡطٰنُ فِتۡنَۃً لِّلَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ وَّ الۡقَاسِیَۃِ  قُلُوۡبُہُمۡ ؕ وَ اِنَّ الظّٰلِمِیۡنَ لَفِیۡ شِقَاقٍۭ بَعِیۡدٍ ﴿ۙ۵۴﴾ ",
        "ur": "(یہ اس لئے ہے) تا کہ وہ اسے جو شیطان اپنی طرف سے ڈالے صرف ان لوگوں کے لئے فتنہ بنا دے جن کے دلوں میں بیماری ہے اور جن کے دل سخت ہوچکے ہیں۔ اور یقیناً ظلم کرنے والے بہت دور کی مخالفت میں پڑے ہوئے ہیں۔",
        "v5": {
            "text": "<i>He permits this</i> that He may make <i>the obstacles</i> which Satan puts <i>in the way of the Prophets</i> a trial for those in whose hearts is a disease and those whose hearts are hardened—and surely, the wrongdoers are gone far in error—[2483]",
            "notes": [
                {
                    "ref": "2483",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse also supports the interpretation we have placed on the preceding verse. There is absolutely no warrant for such a baseless story as some ignorant commentators have taken into their heads to forge in connection with it, i.e. the preceding verse. The verse under comment means to say that satanic people seek to place all sorts of obstacles in the way of the mission of a Prophet, so that the progress of the faith may be retarded and \"those in whose hearts is a disease\" may be misled. But God removes all such obstacles and after initial and temporary setbacks truth marches on its course of uniform progress. Thus the Prophets of God are faced with trials and tribulations so that sincere believers may be differentiated and separated from insincere hypocrites.</p><p>The words, \"in whose hearts is a disease,\" refer to the hypocrites, who always stand on an edge, as it were, between truth and falsehood (22:12). They are always on the lookout to join the party whose cause they see triumphing. The words, \"those whose hearts are hardened,\" refer to those inveterate disbelievers whose hearts become hardened on account of persistent denial of truth.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 55,
        "v_": 54,
        "topics": [
            {
                "id": 3201,
                "topic": "Attributes of Allah: Al-Hadi (The Guide)",
                "verses": "19:2, 25:32"
            },
            {
                "id": 10180,
                "topic": "Knowledge: <i>‘Ilm</i>: Allah bestows",
                "verses": "20:115, 2:248, 12:77, 21:80, 28:81, 33:64, 35:29, 39:10, 47:32, 58:12"
            },
            {
                "id": 10218,
                "topic": "Knowledge: <i>‘Ilm</i>: and believers",
                "verses": "4:163, 2:248, 3:8, 6:36, 6:58, 6:98, 6:106, 12:23, 12:56, 12:69, 12:109, 15:76, 16:28, 17:108, 28:81, 29:48, 29:50, 30:57, 31:16, 34:7, 58:12"
            },
            {
                "id": 11769,
                "topic": "Moral Traits: humility, humbleness",
                "verses": "49:4, 33:36, 31:20, 31:19, 27:88, 27:38, 23:77, 23:3, 22:35, 21:91, 20:135, 20:112, 17:110, 17:38-39, 17:25, 16:49, 12:33, 11:24, 7:162, 7:95, 7:56, 6:64, 6:44, 6:43, 5:55, 3:18, 2:75, 2:46, 1:5, 25:64, 57:17"
            },
            {
                "id": 17251,
                "topic": "Straight Path",
                "verses": "1:6, 2:109, 2:171, 2:214, 2:273, 3:52, 3:102, 4:68-69, 4:176, 5:17, 6:40, 6:88, 6:154, 6:162, 10:26, 11:57, 14:2-3, 16:77, 16:122, 19:37, 19:44, 20:136, 23:74-5, 24:47, 36:5, 36:62, 37:119, 42:53, 43:44, 43:62, 43:65, 46:31, 48:3, 48:21, 67:23"
            }
        ],
        "ar": "وَّ لِیَعۡلَمَ الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ اَنَّہُ الۡحَقُّ مِنۡ رَّبِّکَ فَیُؤۡمِنُوۡا بِہٖ فَتُخۡبِتَ لَہٗ قُلُوۡبُہُمۡ ؕ وَ اِنَّ اللّٰہَ لَہَادِ الَّذِیۡنَ اٰمَنُوۡۤا  اِلٰی  صِرَاطٍ  مُّسۡتَقِیۡمٍ ﴿۵۵﴾ ",
        "ur": "اور(یہ اس لئے ہے) تا کہ وہ لوگ جنہیں علم عطا کیا گیا جان لیں کہ یہ تیرے ربّ کی طرف سے حق ہے پس وہ اُس پر ایمان لے آئیں اور اُس کی طرف اُن کے دل جھک جائیں۔ اور یقیناً اللہ ان لوگوں کو جو ایمان لائے سیدھے رستے کی طرف ہدایت دینے والا ہے۔",
        "v5": {
            "text": "And that [a]those to whom knowledge has been given may know that it is the truth from thy Lord, so that they may believe therein and their hearts may be humble unto Him. And surely, Allah guides those who believe to the right path.[2484]",
            "notes": [
                {
                    "ref": "a",
                    "note": "13:20; 34:7; 35:32; 47:3; 56:96."
                },
                {
                    "ref": "2484",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse also supports our interpretation of v. 53 above. It means to say that Satan puts obstacles in the way of a Prophet so that Allah may make it \"a trial for those in whose hearts is a disease and those whose hearts are hardened,\" and \"that those to whom knowledge has been given may know that it is the truth from the Lord, so that they believe therein.\" These are the two objects which the satanic activities of the enemies of truth become the means of serving.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 56,
        "v_": 55,
        "topics": [
            {
                "id": 5943,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: is sure to come",
                "verses": "37:21, 6:13, 6:32, 12:108, 15:86, 18:22, 20:16, 22:8, 34:4, 40:60, 42:8, 43:67, 45:33, 47:19, 51:7, 56:3"
            },
            {
                "id": 9001,
                "topic": "Hour: <i>Sa‘ah</i>",
                "verses": "25:12, 6:32, 6:41, 7:188, 12:108, 15:86, 16:78, 18:22, 20:16, 21:50, 22:2, 22:8, 30:13, 30:56, 31:35, 33:64, 34:4, 40:60, 41:48, 41:51, 42:18-19, 43:62, 43:67, 43:86, 45:28, 45:33, 47:19, 54:2, 54:47, 79:43, 79:44"
            }
        ],
        "ar": "وَ لَا یَزَالُ الَّذِیۡنَ  کَفَرُوۡا فِیۡ  مِرۡیَۃٍ  مِّنۡہُ حَتّٰی تَاۡتِیَہُمُ السَّاعَۃُ بَغۡتَۃً اَوۡ یَاۡتِیَہُمۡ  عَذَابُ  یَوۡمٍ  عَقِیۡمٍ ﴿۵۶﴾ ",
        "ur": "اور وہ لوگ جنہوں نے کفر کیا ہمیشہ اس کے متعلق شک میں مبتلا رہیں گے یہاں تک کہ اچانک ان تک انقلاب کی گھڑی آپہنچے گی یا ایسے دن کا عذاب انہیں آلے گا جو خوشیوں سے عاری ہوگا۔",
        "v5": {
            "text": "And those who disbelieve will not cease [b]to be in doubt about it until the Hour comes suddenly upon them or there comes to them the punishment of a destructive day.[2485]",
            "notes": [
                {
                    "ref": "b",
                    "note": "11:18."
                },
                {
                    "ref": "2485",
                    "note": "<p><strong>Important Words:</strong></p><p>عقیم (destructive) is derived from عقم. They say عقمت المرأة i.e. the woman was or became barren. امرأة عقیم means, a barren woman, a woman that does not conceive or give birth to a child. یوم عقیم means, a severe fighting. یوم عقیم means, a day having no day after it; a destructive day, a day of hard fighting, so called because many women having lost their sons in the fighting become عقیم (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>\"Hour\" in the verse signifies the final triumph of Islam. It may also refer to the Fall of Mecca, when the power of the disbelieving Quraish was finally broken. The fall took place quite suddenly. The Quraish had not had the least inkling of the approach of Muslim army till it reached the very gates of Mecca.</p><p>The words, \"the punishment of a destructive day,\" may refer to any form of punishment, preferably to the day of the Battle of Badr.</p><p>This and the following two verses imply a prophecy about the ultimate triumph of Islam, and the defeat and discomfiture of disbelievers.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 57,
        "v_": 56,
        "topics": [
            {
                "id": 485,
                "topic": "Actions: <i>A‘mal</i>: rewarded",
                "verses": "28:85, 3:196, 4:41, 4:58, 4:174, 5:10, 7:9, 7:44, 9:121, 11:16, 11:112, 16:98, 17:10, 18:3, 18:47, 18:108-9, 19:77, 20:76-77, 22:15, 24:39, 29:8, 29:10, 31:9-10, 32:18, 32:20, 33:30, 34:38, 35:8, 35:11, 35:33, 39:36, 41:9, 42:23-24, 42:27, 43:73-74, 45:31, 46:20, 47:13, 47:36, 48:30, 52:18-21, 65:12, 84:26, 85:12, 95:7, 98:8-9, 99:8, 101:7-8"
            },
            {
                "id": 3362,
                "topic": "Attributes of Allah: Al-Malik (The Sovereign)",
                "verses": "59:24, 1:4, 20:115, 23:117, 25:27, 54:56, 62:2, 114:3"
            },
            {
                "id": 3765,
                "topic": "Attributes of Allah: Malikul-Mulk (Lord of Sovereignty)",
                "verses": "3:27, 5:19, 5:41, 35:14, 40:17, 48:15"
            },
            {
                "id": 5980,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: on that day",
                "verses": "37:21, 27:88, 2:282, 3:26, 3:162, 3:186, 4:88, 6:13, 6:23, 6:74, 10:46, 10:55, 15:26, 17:14, 17:72, 18:49, 18:50, 19:69, 19:72, 19:73, 19:96, 20:109, 21:48, 23:102, 25:27, 30:13, 30:15, 36:50, 36:51, 36:55, 39:69, 40:17, 40:18, 45:27-29, 46:20, 50:45, 52:17, 54:7-9, 56:2-12, 66:8, 70:44-45, 101:5"
            },
            {
                "id": 8341,
                "topic": "Hakam: Allah as",
                "verses": "3:56, 4:142, 6:58, 6:115, 7:88, 7:187, 10:94, 10:110, 11:46, 12:81, 16:125, 21:113, 22:18, 22:70, 24:52, 26:119, 34:27, 39:4, 39:24, 39:47, 40:35, 42:45, 45:18, 45:24, 60:11, 95:9"
            },
            {
                "id": 13439,
                "topic": "Paradise: <i>Jannah</i>: believers who do good works will enter",
                "verses": "2:26, 2:83, 3:199, 4:58, 4:123, 4:125, 7:43, 10:10, 11:24, 14:24, 15:46, 16:31-32, 18:108, 19:61, 19:64, 20:76-77, 22:15, 22:24, 25:16, 29:59, 30:16, 31:9, 32:20, 38:50-51, 40:41, 42:23, 44:52-53, 47:13, 51:16, 54:55, 64:10, 65:12, 68:35, 85:12, 89:29-31, 98:8-9"
            },
            {
                "id": 13577,
                "topic": "Paradise: <i>Jannah</i>: <i>Jannatun-Na ‘im</i>",
                "verses": "26:86, 5:66, 10:10, 31:9, 37:44, 56:13, 56:90, 68:35, 70:39"
            }
        ],
        "ar": "اَلۡمُلۡکُ یَوۡمَئِذٍ لِّلّٰہِ ؕ یَحۡکُمُ بَیۡنَہُمۡ ؕ فَالَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فِیۡ جَنّٰتِ النَّعِیۡمِ ﴿۵۷﴾ ",
        "ur": "سلطنت اس دن اللہ ہی کی ہوگی۔ وہ ان کے درمیان فیصلہ کرے گا۔ پس وہ لوگ جو ایمان لائے اور نیک عمل بجا لائے نعمتوں والی جنتوں میں ہوں گے۔",
        "v5": {
            "text": "[a]The kingdom on that day shall be Allah’s. He will judge between them. So [b]those who believe and do good deeds will be in Gardens of Bliss.[2486]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:74; 25:27."
                },
                {
                    "ref": "b",
                    "note": "13:30; 14:24; 18:31; 30:16; 68:35; 78:32-37."
                },
                {
                    "ref": "2486",
                    "note": "<p><strong>Commentary:</strong></p><p>Besides being of general application the verse may particularly refer to the Fall of Mecca. On that day the Kingdom of God became established in Arabia and idolatry departed from its stronghold never to return, and Divine judgement was pronounced in the words, \"Truth has come and falsehood has vanished away. Falsehood does indeed vanish away fast\" (17:82).</p><p>The words, \"Gardens of Bliss\" may refer to the fertile lands of Iraq, Syria and Egypt which after the conquest of Arabia fell to the victorious arms of the Muslims.</p><p>Here as also in 25:27 it is said that \"The Kingdom on that day will be Allah’s.\" In 1:4 it is stated, \"Allah is the Master of the Day of Judgement\" and in 3:27, \"He is the Lord of Sovereignty.\" So God as represented by Islam is not only ملک (<i>Malik</i>) meaning King, but He is also مالک (<i>Malik</i>) i.e. Master and even مالک الملک, which signifies that He is such a King that He has complete possession, and undisputed and undivided ownership of all those things of which He is the Master.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 58,
        "v_": 57,
        "topics": [],
        "ar": "وَ الَّذِیۡنَ کَفَرُوۡا وَ کَذَّبُوۡا بِاٰیٰتِنَا فَاُولٰٓئِکَ  لَہُمۡ  عَذَابٌ  مُّہِیۡنٌ ﴿٪۵۸﴾ ",
        "ur": "اور وہ لوگ جنہوں نے کفر کیا اور ہمارے نشانات کو جھٹلایا تو یہی ہیں وہ جن کے لئے رسوا کن عذاب (مقدر) ہے۔",
        "v5": {
            "text": "But [c]those who disbelieve and reject Our Signs, will have an humiliating punishment.[2487]",
            "notes": [
                {
                    "ref": "c",
                    "note": "2:40; 7:37; 30:17; 57:20; 64:11;78:22-27."
                },
                {
                    "ref": "2487",
                    "note": "<p><strong>Commentary:</strong></p><p>There could have been no greater and more humiliating and ignominious punishment for the enemies of the Holy Prophet than the fall of their capital which placed the whole of Arabia at the feet of him whom they had turned out from his native town, putting a price on his head. Eventual defeat and destruction is the inevitable lot of falsehood and its votaries.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 59,
        "v_": 58,
        "topics": [
            {
                "id": 3567,
                "topic": "Attributes of Allah: Ar-Razzaq (Sustainer, Provider)",
                "verses": "51:59, 62:12"
            },
            {
                "id": 3757,
                "topic": "Attributes of Allah: Khairur-Raziqin (Best of Sustainers)",
                "verses": "5:115, 23:73, 34:40, 62:12"
            },
            {
                "id": 7118,
                "topic": "Emigration: <i>Hijrah</i>: of believers",
                "verses": "4:98-101, 2:219, 3:196, 4:90, 8:73, 9:20, 16:111"
            },
            {
                "id": 11425,
                "topic": "Migration: <i>Hijrah</i>: of believers",
                "verses": "4:98, 4:75, 4:101, 16:42, 16:111"
            },
            {
                "id": 12742,
                "topic": "Murder",
                "verses": "17:34, 2:155, 2:179, 3:158, 3:170, 3:196, 4:30, 4:75, 4:93-94, 5:31, 5:33-34, 6:152, 9:111, 17:32, 22:39, 25:69, 47:5-7, 60:13"
            },
            {
                "id": 14666,
                "topic": "Provisions: Allah provides",
                "verses": "20:132, 5:115, 2:58, 2:173, 2:213, 3:38, 5:89, 7:161, 8:75, 11:7, 16:72, 16:115, 20:82, 20:132, 22:51, 23:73, 24:39, 29:61, 34:5, 51:23, 51:59, 62:12"
            },
            {
                "id": 14698,
                "topic": "Provisions: worldly",
                "verses": "20:132, 2:241, 2:237, 3:15, 5:97, 8:5, 8:75, 10:60, 10:99, 11:4, 11:7, 11:89, 12:60, 12:66, 14:31, 16:72, 16:76, 17:19, 20:132-133, 22:51, 24:27, 28:58, 33:32, 33:50, 34:5, 34:16, 40:40, 42:37, 43:30, 43:36, 45:6, 50:12, 67:16, 67:22, 79:34"
            }
        ],
        "ar": "وَ الَّذِیۡنَ ہَاجَرُوۡا فِیۡ سَبِیۡلِ اللّٰہِ ثُمَّ قُتِلُوۡۤا اَوۡ مَاتُوۡا لَیَرۡزُقَنَّہُمُ اللّٰہُ رِزۡقًا حَسَنًا ؕ وَ اِنَّ اللّٰہَ  لَہُوَ  خَیۡرُ  الرّٰزِقِیۡنَ ﴿۵۹﴾ ",
        "ur": "اور وہ لوگ جنہوں نے اللہ کی راہ میں ہجرت کی پھر وہ قتل کئے گئے یا طبعی موت مر گئے اللہ ان کو یقیناً رزقِ حسن عطا کرے گا اور یقیناً اللہ ہی ہے جو رزق دینے والوں میں سب سے بہتر ہے۔",
        "v5": {
            "text": "[d]And those who leave their homes for the cause of Allah, and are then slain or die, Allah will surely provide for them a goodly provision. And surely, Allah is the Best of providers.[2488]",
            "notes": [
                {
                    "ref": "d",
                    "note": "3:196; 8:75; 9:20-22; 16:42."
                },
                {
                    "ref": "2488",
                    "note": "<p><strong>Commentary:</strong></p><p>In v. 57 above God had referred to the reward of believers in general. In this and the next verse the Quran particularly mentions the reward of those believers who left their hearths and homes, their belongings and their dear and near ones for the sake of God. To these \"living\" martyrs, the verse holds out a promise that they will be specially rewarded for their sacrifices. In fact those who leave their homes and all that is dear to them for the sake of God and spend their lives in serving His cause and then die in harness deserve to be classed with \"the martyrs\", for their sacrifice is as great as that of the actual martyrs, only, God in His infallible wisdom, spares their lives. This is the significance of the words, \"or die\". In fact there are two categories of martyrs—\"the dead martyrs\" and \"the living martyrs\". The \"dead\" martyrs are actually slain in the cause of God while the \"living\" martyrs live a life of perpetual sacrifice for His sake and then die a natural death. The verse under comment places both these classes of \"martyrs\" in the same category. Those who are slain, or those who die a natural death, serving the cause of God, will have the same reward—a goodly provision and a place with which they will be well-pleased.</p><p>Incidentally, the verse shows that it was revealed after the Hijrah, because it was after the Hijrah that fighting in self-defence was permitted and some of the Muslims were killed in the fighting. In fact, some parts of the <i>Surah</i> were revealed at Mecca and others at Medina. The <i>Surah</i> may thus be said to have been revealed both at Mecca and Medina.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 60,
        "v_": 59,
        "topics": [
            {
                "id": 3037,
                "topic": "Attributes of Allah: Al-‘Alim (All-Knowing)",
                "verses": "19:2, 2:116, 2:128, 2:138, 2:159, 2:182, 2:228, 2:245, 2:257, 2:262, 2:269, 2:274, 3:93, 4:12, 4:36, 4:71, 4:171, 6:14, 6:116, 9:15, 9:28, 15:87, 24:22, 24:42, 33:41, 33:52, 34:27, 35:39, 35:45, 36:39, 40:3, 57:4, 57:7, 59:23, 64:12"
            },
            {
                "id": 3270,
                "topic": "Attributes of Allah: Al-Halim (Forbearing)",
                "verses": "2:226, 2:236, 2:264, 17:45, 33:52, 35:42, 64:18"
            }
        ],
        "ar": "لَیُدۡخِلَنَّہُمۡ مُّدۡخَلًا  یَّرۡضَوۡنَہٗ ؕ وَ اِنَّ اللّٰہَ  لَعَلِیۡمٌ  حَلِیۡمٌ ﴿۶۰﴾ ",
        "ur": "وہ ضرور انہیں ایسے مقام میں داخل کرے گا جسے وہ پسند کریں گے۔ اور یقیناً اللہ دائمی علم رکھنے والا (اور) برد بار ہے۔",
        "v5": {
            "text": "He will surely cause them to enter a place with which they will be well pleased. And Allah is indeed All-Knowing, Forbearing.[2489]",
            "notes": [
                {
                    "ref": "2489",
                    "note": "<p><strong>Important Words:</strong></p><p>مدخل is pass. part. noun from أدخل. They say أدخله i.e. he made him enter. It is used as syn. with إدخال (to make one enter) and also as a noun of place and time (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse means to say that those who left their homes for the sake of God will be made to live in a place which they will like and the manner of their entering the place will also be so honourable that they will be highly pleased with it.</p><p>The words, \"And Allah is indeed All-Knowing, Forbearing,\" signify that Allah knows full well the sincerity with which they serve the cause of truth, so while rewarding them He will overlook their shortcomings and faults.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 61,
        "v_": 60,
        "topics": [
            {
                "id": 2994,
                "topic": "Attributes of Allah: Al-‘Afw (The Effacer of sins)",
                "verses": "4:150, 4:44, 4:100, 58:3"
            },
            {
                "id": 3143,
                "topic": "Attributes of Allah: Al-Ghafur (Most Forgiving)",
                "verses": "2:174, 2:183, 2:193, 2:200, 2:219, 2:226, 2:227, 2:236, 4:24, 4:44, 4:97, 4:100-101, 5:99, 8:70, 9:5, 16:111, 17:26, 17:45, 18:59, 25:7, 25:71, 33:6, 33:25, 33:51, 33:74, 34:16, 35:35, 35:42, 41:33, 42:6, 42:24, 48:15, 58:3, 60:8, 60:13, 64:15, 85:15"
            },
            {
                "id": 11903,
                "topic": "Moral Traits: retaliation",
                "verses": "41:35"
            },
            {
                "id": 15639,
                "topic": "Retaliation: <i>Qisas</i>",
                "verses": "2:179-180, 2:195, 5:46"
            },
            {
                "id": 18344,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 47:5, 47:36, 59:6"
            }
        ],
        "ar": "ذٰلِکَ ۚ وَ مَنۡ عَاقَبَ بِمِثۡلِ مَا عُوۡقِبَ بِہٖ ثُمَّ بُغِیَ عَلَیۡہِ لَیَنۡصُرَنَّہُ اللّٰہُ ؕ اِنَّ اللّٰہَ  لَعَفُوٌّ  غَفُوۡرٌ ﴿۶۱﴾ ",
        "ur": "یہ اسی طرح ہوگا۔ اور جو (کسی پر) ویسی ہی سختی کرے جیسی سختی اس پر کی گئی ہو اور پھر اُس کے خلاف (اس کے نتیجہ میں) سر کشی کی جائے تو یقیناً اللہ اُس کی ضرور مدد کرے گا۔ اللہ یقیناً بہت عفو کرنے والا (اور) بہت بخشش کرنے والا ہے۔",
        "v5": {
            "text": "That <i>shall be so</i>. And whoso retaliates with the like of that with which he has been afflicted and is then transgressed against, Allah will surely help him. Allah is indeed the Effacer of sins <i>and</i> <i>is</i> Forgiving.[2490]",
            "notes": [
                {
                    "ref": "2490",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse has twofold significance. It holds out a promise of help to Muslims and also implies a prophecy about their eventual success. In the former sense it purports to say that the Muslims have been oppressed and transgressed against. They may retaliate but their retaliation should not exceed legitimate bounds. The injury they should inflict on the enemy should not be greater than the injury they have received.</p><p>But the fear that the enemy being more powerful would inflict greater injury on them if they retaliated, should not deter them from retaliating. In that event they would be entitled to help and protection from God and would receive it in ample measure.</p><p>According to the second meaning Muslims are told that they are going to have their enemies in their power and they will be perfectly justified in inflicting as much injury on them as they had received from them but it would be far better if in the hour of victory and success they pardoned and forgave them, imitating the Divine attributes of mercy and forgiveness.</p><p>Incidentally, four very sound principles are deducible from this verse: (a) Muslims can and should fight in self-defence if they are attacked; but in no case should they take the initiative in attacking. (b) If they retaliate, their retaliation should be proportionate to the wrong done to them; they are not allowed to inflict a greater injury. (c) If they inflicted greater injury than the injury they had received, then they would be condemned as transgressors and would forfeit God’s help and protection. (d) If the party on whom punishment has been inflicted for the wrong it had done seeks again to attack the retaliators, it shall be regarded as guilty of further aggression.</p><p>It should be noted that the verse does not speak of individual retaliation. It is retaliation on national or government basis. Individuals are not allowed to take the law into their own hands for the redress of any wrong. They should have recourse to the properly constituted authorities.</p><p>The verse should be read in conjunction with vv. 39, 40 above which deal with the basic and principal subject of the <i>Surah</i> i.e. jihad.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 62,
        "v_": 61,
        "topics": [
            {
                "id": 3590,
                "topic": "Attributes of Allah: As-Sami‘ (The All-Hearing)",
                "verses": "2:182, 2:128, 2:138, 2:228, 2:245, 2:257, 4:59, 4:135, 4:149, 6:14, 6:116, 8:18, 8:43, 24:22, 24:61, 40:21, 42:12, 49:2"
            },
            {
                "id": 13026,
                "topic": "Night: signs of Allah",
                "verses": "17:13, 3:28, 3:191, 6:14, 6:97, 7:5, 7:55, 7:98, 10:7, 10:68, 13:4, 14:34, 16:13, 21:34, 23:81, 24:45, 25:63, 28:72-74, 31:30, 35:14, 36:38, 36:41, 45:6, 79:30"
            }
        ],
        "ar": "ذٰلِکَ بِاَنَّ اللّٰہَ یُوۡلِجُ الَّیۡلَ  فِی النَّہَارِ  وَ یُوۡلِجُ النَّہَارَ فِی الَّیۡلِ وَ اَنَّ اللّٰہَ سَمِیۡعٌۢ  بَصِیۡرٌ ﴿۶۲﴾ ",
        "ur": "یہ اس لئے ہے کہ اللہ رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے اور اللہ بہت سننے والا (اور) گہری نظر رکھنے والا ہے۔",
        "v5": {
            "text": "That <i>system of punishment and reward operates</i> because [a]Allah causes the night to enter into the day, and causes the day to enter into the night, and because Allah is All-Hearing, All-Seeing.[2491]",
            "notes": [
                {
                    "ref": "a",
                    "note": "31:30; 35:14; 57:7."
                },
                {
                    "ref": "2491",
                    "note": "<p><strong>Commentary:</strong></p><p>The word النھار (day) in the verse represents power and prosperity and اللیل (night) signifies the loss of power combined with decline and decadence. The verse uses this metaphor to point to the fact hinted at in the preceding verse that the night of misery and oppression to which Muslims were subjected for so long was about to pass away and the day of their glory and might was about to dawn. The verse further consoles and comforts the oppressed Muslims that God is not oblivious of their troubles.</p><p>From Him nothing is hidden and He hears their prayers.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 63,
        "v_": 62,
        "topics": [
            {
                "id": 3009,
                "topic": "Attributes of Allah: Al-‘Aliyy (The High)",
                "verses": "4:35, 2:256, 31:31, 34:24, 40:13, 42:5, 42:52"
            },
            {
                "id": 3206,
                "topic": "Attributes of Allah: Al-Haqq (The truth, True Lord)",
                "verses": "6:63, 10:33, 20:115, 22:7, 23:117, 24:26, 31:31"
            },
            {
                "id": 3299,
                "topic": "Attributes of Allah: Al-Kabir (the Great)",
                "verses": "4:35, 13:10, 31:31, 34:24, 40:13"
            },
            {
                "id": 3742,
                "topic": "Attributes of Allah: Al-Haqqul-Mubin (The Manifest Truth)",
                "verses": "24:26, 23:117"
            },
            {
                "id": 7353,
                "topic": "Falsehood: <i>Batil</i>: who believe in",
                "verses": "17:82, 29:53, 7:140, 21:30, 29:68, 45:28, 47:4, 58:15"
            }
        ],
        "ar": "ذٰلِکَ بِاَنَّ اللّٰہَ ہُوَ الۡحَقُّ وَ اَنَّ مَا یَدۡعُوۡنَ مِنۡ دُوۡنِہٖ ہُوَ الۡبَاطِلُ وَ اَنَّ اللّٰہَ  ہُوَ  الۡعَلِیُّ الۡکَبِیۡرُ ﴿۶۳﴾ ",
        "ur": "یہ اسی طرح ہے کیونکہ اللہ ہی حق ہے اور جسے وہ اس کے سوا پکارتے ہیں وہی باطل ہے اور یقیناً اللہ ہی بہت بلند شان والا ہے (اور) بہت بڑا ہے۔",
        "v5": {
            "text": "That is because [b]it is Allah Who is the Truth, and that which they call on beside Him is falsehood, and because Allah is the High, the Great.[2492]",
            "notes": [
                {
                    "ref": "b",
                    "note": "20:115; 23:117; 24:26."
                },
                {
                    "ref": "2492",
                    "note": "<p><strong>Commentary:</strong></p><p>The metaphor of the last verse is continued in the present verse. It purports to say that Muslims will grow and prosper because God is Truth. He has revealed the truth which the Muslims follow and practise. Islam has come to stay because it is truth and truth is invincible while falsehood is perishable.</p><p>The words \"Allah is the High, the Great\" signify that it is impossible that a dispensation established by God should fail, as this would constitute a serious reflection on His Greatness and Glory.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 64,
        "v_": 63,
        "topics": [
            {
                "id": 1038,
                "topic": "Agriculture: Allah sends down water for",
                "verses": "6:100, 2:23, 10:25, 13:18, 14:33, 16:11-12, 16:66, 18:46, 20:54, 25:49-50, 27:61, 32:28, 35:28, 39:22, 50:10, 79:32"
            },
            {
                "id": 1548,
                "topic": "Allah: favours of",
                "verses": "31:32, 2:23, 31:32, 2:23, 6:100, 6:142, 7:55, 13:3-5, 13:18, 14:33-35, 15:20-23, 16:6-17, 16:67-70, 16:72-73, 16:79, 16:81-82, 17:21, 20:54-55, 21:32-34, 22:66, 23:20-23, 27:62-64, 31:21, 35:13, 35:28, 36:35, 40:62, 40:65, 40:80-81, 43:11-14, 45:13-14, 51:49, 55:17, 56:65, 56:69, 56:72, 67:24, 71:17-21, 77:28, 78:7-17"
            },
            {
                "id": 3320,
                "topic": "Attributes of Allah: Al-Khabir (All-Aware)",
                "verses": "6:104, 2:272, 4:36, 4:136, 5:9, 6:19, 6:74, 11:2, 17:18, 17:31, 31:17, 33:35, 35:15, 35:32, 42:28, 49:14, 57:11, 58:14, 59:19, 63:12, 64:9, 66:4, 67:15, 100:12"
            },
            {
                "id": 3348,
                "topic": "Attributes of Allah: Al-Latif (Benignant, Knower of all hidden secrets, subtleties)",
                "verses": "6:104, 12:101, 31:17, 33:35, 42:20, 67:15"
            },
            {
                "id": 8137,
                "topic": "Green",
                "verses": "6:100, 12:44, 18:32, 23:51, 36:81, 55:65, 55:77, 76:22"
            },
            {
                "id": 18476,
                "topic": "Water: <i>Ma’</i>: sent from heaven",
                "verses": "16:11-12, 2:23, 2:165, 6:100, 7:58, 8:12, 10:25, 13:18, 14:33, 15:23, 16:66, 18:46, 22:6, 23:19, 27:61, 30:25, 32:28, 35:28, 37:68, 38:58, 39:22, 41:40, 43:12, 50:10, 55:45, 78:15, 88:6"
            }
        ],
        "ar": "اَلَمۡ  تَرَ  اَنَّ اللّٰہَ  اَنۡزَلَ  مِنَ  السَّمَآءِ  مَآءً ۫ فَتُصۡبِحُ  الۡاَرۡضُ  مُخۡضَرَّۃً ؕ اِنَّ  اللّٰہَ لَطِیۡفٌ خَبِیۡرٌ ﴿ۚ۶۴﴾ ",
        "ur": "کیا تو نے دیکھا نہیں کہ اللہ نے آسمان سے پانی اتارا تو زمین اس سے سرسبز ہو جاتی ہے۔ یقیناً اللہ بہت باریک بین (اور) ہمیشہ باخبر رہتا ہے۔",
        "v5": {
            "text": "Hast thou not seen that [c]Allah sends down water from the sky and the earth becomes green? Allah is indeed the Knower of subtleties, the All-Aware.[2493]",
            "notes": [
                {
                    "ref": "c",
                    "note": "22:6; 30:51; 35:28; 39:22; 45:6."
                },
                {
                    "ref": "2493",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse draws the attention of disbelievers to the natural phenomenon that is unfolding itself before their very eyes. Do they not see, it purports to say, that divine rain has fallen on the bleak, barren and dead land of Arabia and that it has begun to vibrate with new life and there is verdure and greenness all over it i.e. there is spiritual awakening all over the country and Islam has taken deep roots? It will now grow and expand and prevail over all false faiths.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 65,
        "v_": 64,
        "topics": [
            {
                "id": 3189,
                "topic": "Attributes of Allah: Al-Ghani (Self-sufficient)",
                "verses": "2:268, 2:264, 3:98, 4:132, 6:134, 9:28, 10:69, 14:9, 27:41, 29:7, 31:13, 31:27, 35:16, 39:8, 47:39, 57:25, 60:7, 64:7"
            },
            {
                "id": 3274,
                "topic": "Attributes of Allah: Al-Hamid (Praiseworthy)",
                "verses": "2:268, 4:132, 11:74, 14:2, 14:9, 22:25, 31:13, 31:27, 41:43, 42:29, 60:7, 85:9"
            }
        ],
        "ar": "لَہٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ اِنَّ  اللّٰہَ  لَہُوَ  الۡغَنِیُّ  الۡحَمِیۡدُ ﴿٪۶۵﴾ ",
        "ur": "اسی کا ہے جو آسمانوں میں ہے اور جو زمین میں ہے اور یقیناً اللہ ہی ہے جو غنی ہے (اور) صاحبِ حمد ہے۔",
        "v5": {
            "text": "[a]To Him belongs all that is in the heavens and all that is in the earth. And surely Allah is Self-Sufficient, Praiseworthy.[2494]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:256; 10:56; 31:27."
                },
                {
                    "ref": "2494",
                    "note": "<p><strong>Commentary:</strong></p><p>The theme of the previous verse is continued in this verse, viz. Islam will prosper and make vast conquests because God Who is the Lord of the heavens and the earth has sent it and He is at its back. God has willed that His kingdom shall be established in the earth and His worship shall take the place of the worship of false deities. He has decreed that His glory shall be extolled and His praises sung in the world because He is worthy of all praise.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 66,
        "v_": 65,
        "topics": [
            {
                "id": 1549,
                "topic": "Allah: favours of",
                "verses": "31:32, 2:23, 31:32, 2:23, 6:100, 6:142, 7:55, 13:3-5, 13:18, 14:33-35, 15:20-23, 16:6-17, 16:67-70, 16:72-73, 16:79, 16:81-82, 17:21, 20:54-55, 21:32-34, 22:64, 23:20-23, 27:62-64, 31:21, 35:13, 35:28, 36:35, 40:62, 40:65, 40:80-81, 43:11-14, 45:13-14, 51:49, 55:17, 56:65, 56:69, 56:72, 67:24, 71:17-21, 77:28, 78:7-17"
            },
            {
                "id": 6997,
                "topic": "Earth: <i>Al-Ard</i>: creations on",
                "verses": "15:20, 2:165, 2:169, 3:84, 3:191, 6:39, 10:24, 10:67, 13:16, 16:16, 16:50, 21:20, 21:32, 23:80, 26:8, 27:83, 30:23, 31:11, 31:21, 45:14, 50:8, 64:4, 71:18"
            },
            {
                "id": 8536,
                "topic": "Heaven: <i>Sama’</i>",
                "verses": "2:36, 21:17, 21:31, 50:7, 51:8, 51:48, 55:88, 67:4, 78:20, 81:12"
            },
            {
                "id": 8648,
                "topic": "Heaven: <i>Sama’</i>: as a roof",
                "verses": "21:33, 2:20, 2:23, 13:3, 31:11, 40:65, 52:6, 78:13, 79:29, 88:19"
            },
            {
                "id": 10760,
                "topic": "Man: all subordinated to",
                "verses": "15:30, 7:12, 17:62, 18:51, 20:117, 31:21, 45:13-14"
            },
            {
                "id": 13854,
                "topic": "Permission: Leave, <i>Idhn</i>: of Allah",
                "verses": "64:12, 2:98, 2:103, 2:214, 2:222, 2:250, 2:252, 2:256, 3:50, 3:146, 3:153, 3:167, 4:65, 5:17, 5:111, 7:59, 8:67, 10:4, 10:101, 11:106, 13:39, 14:2, 14:12, 14:24, 14:26, 33:47, 34:13, 35:33, 42:52, 58:11, 59:6, 97:5"
            },
            {
                "id": 16447,
                "topic": "Sea: body of water, <i>Bahr</i>: ships sail on",
                "verses": "55:20-21, 55:25, 2:165, 10:23, 17:67-68, 27:64, 31:32, 35:13, 36:42, 40:81, 42:33, 43:13, 45:13"
            }
        ],
        "ar": "اَلَمۡ تَرَ اَنَّ اللّٰہَ سَخَّرَ لَکُمۡ مَّا فِی الۡاَرۡضِ وَ الۡفُلۡکَ  تَجۡرِیۡ فِی الۡبَحۡرِ بِاَمۡرِہٖ ؕ وَ  یُمۡسِکُ  السَّمَآءَ   اَنۡ تَقَعَ عَلَی الۡاَرۡضِ اِلَّا بِاِذۡنِہٖ ؕ اِنَّ اللّٰہَ بِالنَّاسِ  لَرَءُوۡفٌ  رَّحِیۡمٌ ﴿۶۶﴾ ",
        "ur": "کیا تو نے نہیں دیکھا کہ اللہ نے جو کچھ زمین میں ہے تمہارے لئے مسخر کر دیا ہے اور کشتیوں کو بھی۔ وہ اس کے حکم سے سمندر میں چلتی ہیں۔ اور وہ آسمان کو روکے ہوئے ہے کہ زمین پر گرے مگر اس کے حکم سے۔ یقیناً اللہ انسانوں پر بہت ہی مہربان (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "Hast thou not seen that [b]Allah has subjected to you whatever is in the earth, and the ships that sail through the sea by His command? And He withholds the rain from falling on the earth save by His leave. Surely, Allah is Compassionate <i>and</i> Merciful to men.[2495]",
            "notes": [
                {
                    "ref": "b",
                    "note": "16:15; 35:13."
                },
                {
                    "ref": "2495",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse constitutes a beautiful commentary on the futility of idol-worship and gives two very strong arguments against it. First, God is the Creator of the heavens and the earth. He has subjected all that is in the earth, in the sea and even in the air to the service of man. It is this Lord of all life Who is entitled to our worship and not the idols of wood and stone or those of man’s own fancy. Secondly, when God has pressed the whole universe into the service of man and has made him the lord of the whole creation and His own chief handiwork, it is foolish on his part to degrade himself so low as to worship anything besides God.</p><p>The verse possesses another significance. The realization that all things are created for the service of man draws our attention to the uses and properties of different objects and urges us to study them and then turn them to our benefit. It is this study of natural objects that led to new discoveries and inventions and consequently to the great material progress which the early Muslims made in the heyday of their intellectual glory.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 67,
        "v_": 66,
        "topics": [
            {
                "id": 1153,
                "topic": "Allah: alone creates life, causes death",
                "verses": "15:24, 2:29, 13:17, 30:41, 40:12, 40:69, 45:27, 50:44, 53:45"
            },
            {
                "id": 3385,
                "topic": "Attributes of Allah: Al-Muhyi (Life-giver)",
                "verses": "30:51, 2:29, 3:157, 7:159, 15:24, 30:41, 40:12, 40:69, 45:27, 57:3"
            },
            {
                "id": 6108,
                "topic": "Dead, Death: <i>Maut</i>: Allah alone causes",
                "verses": "15:24, 2:29, 2:259, 3:157, 6:96, 13:17, 16:71, 30:41, 40:12, 40:69, 45:27, 50:44, 53:45, 57:3"
            },
            {
                "id": 6159,
                "topic": "Dead, Death: <i>Maut</i>: God restores to life",
                "verses": "2:260-261, 2:57, 2:74, 2:244, 6:37, 8:25, 8:43, 22:7, 26:82, 30:20, 30:25, 30:51, 36:13, 36:34, 40:12, 41:40, 42:10, 43:12, 46:34, 50:12, 75:41"
            },
            {
                "id": 10836,
                "topic": "Man: nature of, <i>Fitrah</i>",
                "verses": "30:31, 4:29, 10:13, 11:10-11, 14:35, 16:5, 17:12, 17:68-70, 17:101, 18:55, 21:38, 22:6, 23:78-79, 25:51, 30:37, 31:7-8, 31:22, 33:73, 34:32, 36:78-79, 38:61, 39:50, 40:11, 41:50-52, 42:49, 43:16, 57:9, 70:20-22, 75:21, 80:18, 89:16-21, 90:5, 91:8-9, 95:5, 96:7-8, 100:7, 100:9, 103:3-4"
            },
            {
                "id": 18106,
                "topic": "Uhud: Battle of",
                "verses": "33:22, 3:122-130, 3:142, 3:153-156, 3:160, 3:167-175, 8:67, 59:3, 71:29"
            }
        ],
        "ar": "وَ ہُوَ الَّذِیۡۤ  اَحۡیَاکُمۡ ۫ ثُمَّ یُمِیۡتُکُمۡ  ثُمَّ  یُحۡیِیۡکُمۡ ؕ اِنَّ  الۡاِنۡسَانَ لَکَفُوۡرٌ ﴿۶۷﴾ ",
        "ur": "اور وہی ہے جس نے تمہیں زندہ کیا ہے پھر وہ تمہیں مارے گا پھر تمہیں زندہ کرے گا۔ یقیناً انسان بہت ناشکرا ہے۔",
        "v5": {
            "text": "[a]And He it is Who gave you life, then He will cause you to die, then will He give you life <i>again</i>. Surely, man is most ungrateful.[2496]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:29; 16:71; 30:41; 40:69."
                },
                {
                    "ref": "2496",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse speaks of another Divine favour. God gave us life, then He will cause us to die and then will He give us a new life again. Death has been mentioned here as a Divine boon because it is the door through which man passes to a fuller life, which is eternal and is of growing and unending progress. That life which knows no end is described here by the words ثم یحییکم i.e. then will He give you life again. In yet another sense death is a great Divine blessing. If there had been no death, human life would have become intolerable and there would have been disorder, confusion and chaos on earth.</p><p>The words, \"then He will cause you to die; then will He give you life,\" further signify that the process of life and death continues simultaneously. Every death is followed by and brings the message of a new life. A few Muslims killed at the battlefields of Badr, Uhud, etc., brought about the spiritual resurrection of the whole of Arabia.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 68,
        "v_": 67,
        "topics": [
            {
                "id": 6209,
                "topic": "Debate",
                "verses": "37:2-5, 2:112, 3:62, 10:51, 16:126, 25:53, 29:47, 38:70, 103:4"
            },
            {
                "id": 6649,
                "topic": "Dispute",
                "verses": "8:7, 2:85, 2:140, 3:21, 3:62, 3:66, 3:153, 4:66, 4:106, 7:72, 8:47, 11:33, 13:14, 16:5, 18:22, 22:4, 22:9, 22:20, 31:21, 40:5-6, 40:36, 40:48, 40:70, 42:17, 42:19, 42:36, 49:11, 53:13"
            },
            {
                "id": 12523,
                "topic": "Muhammad<sup>(sa)</sup>: message of",
                "verses": "5:68, 6:20, 6:51, 6:107, 6:163-164, 7:158-159, 7:204, 8:25, 10:16, 10:110, 21:46, 23:74-75, 25:2, 25:53, 29:19, 33:3, 34:44, 34:47, 36:2-8, 42:53, 43:44, 46:10, 53:3, 62:3"
            },
            {
                "id": 14210,
                "topic": "Preaching: with wisdom",
                "verses": "16:126, 3:188, 23:74, 26:215, 28:88, 29:47, 41:34-35, 51:56, 62:3"
            },
            {
                "id": 18122,
                "topic": "Ummah: people, nation, body of men",
                "verses": "16:121, 2:129, 2:135, 2:142, 2:144, 2:214, 3:105, 3:111, 10:20, 10:50, 16:37, 21:93, 27:84, 28:76, 33:41, 35:25, 42:9, 45:29"
            },
            {
                "id": 18869,
                "topic": "Worship: <i>‘Ibadah</i>",
                "verses": "1:5, 2:22, 7:32"
            }
        ],
        "ar": "لِکُلِّ اُمَّۃٍ جَعَلۡنَا مَنۡسَکًا ہُمۡ نَاسِکُوۡہُ فَلَا یُنَازِعُنَّکَ  فِی الۡاَمۡرِ وَ ادۡعُ  اِلٰی رَبِّکَ ؕ اِنَّکَ  لَعَلٰی ہُدًی مُّسۡتَقِیۡمٍ ﴿۶۸﴾ ",
        "ur": "ہر ملت کے لئے ہم نے قربانی کا طریق مقرر کیا ہے جس کے مطابق وہ قربانی کرتے ہیں۔ پس وہ اس بارہ میں تجھ سے ہرگز کوئی جھگڑا نہ کریں اور تو اپنے ربّ کی طرف بلا۔ یقیناً تو ہدایت کی سیدھی راہ پر (گامزن) ہے۔",
        "v5": {
            "text": "For every people have We appointed ways of worship which they observe; so let them not dispute with thee in the matter; and call thou <i>the people</i> to thy Lord, for surely, thou followest the right guidance.[2497]",
            "notes": [
                {
                    "ref": "2497",
                    "note": "<p><strong>Important Words:</strong></p><p>منسک (ways of worship) means, rites of sacrifice; religious rites and ceremonies of the Pilgrimage; animals of sacrifice; ways of worship; acts of devotion. See also 6:163 &amp; 22:35.</p><p><strong>Commentary:</strong></p><p>Taking منسک in the sense of animals of sacrifice or the rites of sacrifice the verse signifies (a) that the ritual of sacrifice in one form or another is common to all religions; and (b) that it was the sacrifice of animals that was at first enjoined by God and not human sacrifice which was invented afterwards.</p><p>Taking the word منسک in the sense of 'ways of worship,' the verse means that Divine worship is found in one form or another among all nations and peoples. This fact leads to another great truth which Islam, among all religions, was the first to proclaim, viz. that Divine Messengers appeared at different times among all nations and peoples to teach them the different forms and ways of worship.</p><p>The words فی الامر (in the matter) mean, 'in the matter of Islam' or 'in the matter of the Quran.' In this sense of the words the verse purports to say that when it has been made clear that Prophets were raised among all peoples, the disbelievers have no right or justification to say that the Holy Prophet has brought a novel teaching. He has done no new thing and has introduced no innovation. See 46:10.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 69,
        "v_": 68,
        "topics": [],
        "ar": "وَ اِنۡ جٰدَلُوۡکَ فَقُلِ اللّٰہُ  اَعۡلَمُ بِمَا تَعۡمَلُوۡنَ ﴿۶۹﴾ ",
        "ur": "اور اگر وہ تجھ سے جھگڑا کریں تو کہہ دے کہ اللہ اُسے خوب جانتا ہے جو تم کرتے ہو۔",
        "v5": {
            "text": "And if they contend with thee, say, ‘Allah knows best what you do.[2498]",
            "notes": [
                {
                    "ref": "2498",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that if in spite of the fact that Divine Prophets appeared among all nations and the advent of the Holy Prophet was not an innovation and in spite of the irrefutable arguments and innumerable signs that God had shown in his favour, the disbelievers prefer to doubt and dispute the truth of his mission, then let them wait and see what the future has in store for them and what evil consequences their rejection of the truth will lead to.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 70,
        "v_": 69,
        "topics": [
            {
                "id": 3219,
                "topic": "Attributes of Allah: Al-Hakam (The Judge)",
                "verses": "2:214, 4:142, 39:47, 42:11, 60:11"
            },
            {
                "id": 6053,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>: render justice on the",
                "verses": "37:21, 17:14-15, 2:114, 3:186, 4:142, 10:94, 16:125, 21:48, 22:18, 32:26, 45:18, 60:4"
            },
            {
                "id": 8342,
                "topic": "Hakam: Allah as",
                "verses": "3:56, 4:142, 6:58, 6:115, 7:88, 7:187, 10:94, 10:110, 11:46, 12:81, 16:125, 21:113, 22:18, 22:57, 24:52, 26:119, 34:27, 39:4, 39:24, 39:47, 40:35, 42:45, 45:18, 45:24, 60:11, 95:9"
            }
        ],
        "ar": "اَللّٰہُ  یَحۡکُمُ  بَیۡنَکُمۡ  یَوۡمَ الۡقِیٰمَۃِ  فِیۡمَا کُنۡتُمۡ  فِیۡہِ  تَخۡتَلِفُوۡنَ ﴿۷۰﴾ ",
        "ur": "اللہ قیامت کے دن تمہارے درمیان اس بارہ میں فیصلہ کرے گا جس میں تم اختلاف کرتے تھے۔",
        "v5": {
            "text": "[a]Allah will judge between you on the Day of Resurrection, concerning that about which you differ.’[2499]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:114; 4:142."
                },
                {
                    "ref": "2499",
                    "note": "<p><strong>Commentary:</strong></p><p>The argument commenced in the preceding verse is continued here. If the disbelievers, the verse purports to say, persist in their rejection of truth, God will judge between them on the Day of Resurrection i.e. the day of the triumph of Islam and of the discomfiture and destruction of disbelief.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 71,
        "v_": 70,
        "topics": [
            {
                "id": 4616,
                "topic": "Book: <i>Kitab</i>: repository of Divine knowledge",
                "verses": "10:62, 2:3, 3:4, 4:106, 5:49, 6:39, 6:60, 6:93, 7:3, 11:7, 27:76, 34:4, 50:5"
            },
            {
                "id": 6947,
                "topic": "Earth: <i>Al-Ard</i>: Allah knows the secrets of the",
                "verses": "10:62, 2:34, 3:6, 3:30, 5:98, 6:60, 17:56, 18:27, 25:7, 27:66, 34:3-4, 39:47, 49:17, 57:5, 58:8, 64:5"
            }
        ],
        "ar": "اَلَمۡ  تَعۡلَمۡ  اَنَّ اللّٰہَ یَعۡلَمُ  مَا فِی السَّمَآءِ وَ الۡاَرۡضِ ؕ اِنَّ  ذٰلِکَ فِیۡ   کِتٰبٍ ؕ اِنَّ  ذٰلِکَ عَلَی   اللّٰہِ  یَسِیۡرٌ ﴿۷۱﴾ ",
        "ur": "کیا تجھے علم نہیں کہ اللہ اُسے جانتا ہے جو آسمان اور زمین میں ہے۔ یقیناً یہ (سب کچھ) ایک کتاب میں ہے۔ یقیناً یہ بات اللہ پر آسان ہے۔",
        "v5": {
            "text": "Dost thou not know that [a]Allah knows whatsoever is in the heavens and the earth? Surely, it is <i>all preserved</i> in a Book, <i>and</i> that is easy for Allah.",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:8; 27:66; 49:17."
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 72,
        "v_": 71,
        "topics": [
            {
                "id": 5270,
                "topic": "Conscience",
                "verses": "8:40, 2:194, 3:21, 7:52, 7:89, 14:25, 18:30, 22:39, 22:41, 27:63, 47:5, 50:38, 67:11, 69:40, 75:3"
            },
            {
                "id": 10240,
                "topic": "Knowledge: <i>‘Ilm</i>: and disbelievers",
                "verses": "6:149, 2:119, 3:62, 4:158, 5:105, 6:101, 6:120, 6:141, 9:6, 10:40, 16:28, 17:37, 22:4, 22:9, 27:67, 30:8, 30:59-60, 40:84, 46:5, 47:17"
            },
            {
                "id": 18905,
                "topic": "Wrongdoers: <i>Zalim</i>: are not helped",
                "verses": "4:76, 2:271, 3:193, 5:73, 35:38, 40:19, 42:9"
            }
        ],
        "ar": "وَ یَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ مَا لَمۡ  یُنَزِّلۡ بِہٖ سُلۡطٰنًا وَّ مَا لَیۡسَ لَہُمۡ بِہٖ عِلۡمٌ ؕ وَ مَا  لِلظّٰلِمِیۡنَ  مِنۡ  نَّصِیۡرٍ ﴿۷۲﴾ ",
        "ur": "اور وہ اللہ کے سوا اُس کی عبادت کرتے ہیں جس کے بارہ میں اس نے کوئی فیصلہ کُن دلیل نہیں اتاری اور جس کا انہیں کوئی علم نہیں۔ اور ظالموں کے لئے کوئی مددگار نہیں ہو گا۔",
        "v5": {
            "text": "[b]And they worship beside Allah that for which He has sent down no authority, and that of which they have no knowledge. And for the wrongdoers there is no helper.[2500]",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:72; 12:41; 53:24."
                },
                {
                    "ref": "2500",
                    "note": "<p><strong>Commentary:</strong></p><p>Three arguments have been given in this verse in support of belief in the Unity of God and against idolatry: (a) There is to be found no authority in any revealed book for idol worship; (b) human reason and conscience are against it and idolaters can give no sound argument based on their personal experience and observation in support of it and (c) in the struggle during the ages between idolaters and believers, the latter have invariably come off triumphant. Thus Divine revelation, human reason and the verdict of history are all against idolatry. This is a truth writ large on the history of all religions.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 73,
        "v_": 72,
        "topics": [
            {
                "id": 6490,
                "topic": "Disbelief: <i>Kufr</i>: punishment of a",
                "verses": "2:7-21, 2:25, 2:40, 2:91, 2:105, 2:127, 2:176, 3:11, 3:23, 3:57, 3:92, 3:132, 3:142, 4:19, 4:38, 4:57, 4:141, 4:152, 4:162, 5:11, 5:87, 6:31, 6:111, 7:51, 8:15, 8:37, 9:26, 9:49, 9:68, 13:36, 14:3, 16:28, 17:9, 18:103, 18:107, 21:40, 22:20, 29:55, 33:65-66, 34:34, 35:37, 36:64-65, 38:28, 39:33, 39:72, 41:51, 48:14, 67:7, 70:2-3, 76:5, 98:7"
            },
            {
                "id": 9188,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: punishment for",
                "verses": "9:3-14, 2:166-168, 3:152, 19:46, 22:19, 22:32, 71:24-26"
            },
            {
                "id": 14335,
                "topic": "Promise: to disbelievers, to hypocrites",
                "verses": "2:81, 7:136, 9:68, 9:77, 11:66, 13:32, 14:45, 15:44, 19:79, 21:98, 21:110, 23:84, 26:207, 27:69, 33:13, 35:41, 36:53, 36:64, 43:84, 51:61, 54:47, 70:43, 70:45, 72:25-26, 73:19"
            }
        ],
        "ar": "وَ اِذَا تُتۡلٰی عَلَیۡہِمۡ اٰیٰتُنَا بَیِّنٰتٍ تَعۡرِفُ فِیۡ  وُجُوۡہِ  الَّذِیۡنَ کَفَرُوا الۡمُنۡکَرَ ؕ یَکَادُوۡنَ یَسۡطُوۡنَ بِالَّذِیۡنَ یَتۡلُوۡنَ عَلَیۡہِمۡ اٰیٰتِنَا ؕ قُلۡ اَفَاُنَبِّئُکُمۡ بِشَرٍّ مِّنۡ ذٰلِکُمۡ ؕ اَلنَّارُ ؕ وَعَدَہَا اللّٰہُ  الَّذِیۡنَ   کَفَرُوۡا ؕ وَ  بِئۡسَ الۡمَصِیۡرُ ﴿٪۷۳﴾ ",
        "ur": "اور جب اُن پر ہماری کھلی کھلی آیات پڑھی جاتی ہیں تو اُن کے چہروں پر جنہوں نے انکار کیا تُو ناپسندیدگی (کے آثار) پہچان لیتا ہے۔ قریب ہے کہ وہ ان پر جھپٹ پڑیں جو اُن کے سامنے ہماری آیات پڑھتے ہیں۔ پس تُو کہہ دے کہ کیا میں تمہیں اس سے زیادہ شر والی بات سے آگاہ کروں۔ آگ۔ اس کا اللہ نے ان سے وعدہ کیا ہے جنہوں نے کفر کیا اور بہت ہی برا ٹھکانا ہے۔",
        "v5": {
            "text": "[c]And when Our clear Signs are recited unto them, thou wilt notice a denial on the faces of those who disbelieve. They would well-nigh attack those who recite Our Signs to them. Say, [d]‘Shall I tell you of something worse than that? <i>It is</i> the Fire! Allah has promised it to those who disbelieve. And a vile destination it is!’[2501]",
            "notes": [
                {
                    "ref": "c",
                    "note": "17:47; 23:67-68; 39:46."
                },
                {
                    "ref": "d",
                    "note": "5:61."
                },
                {
                    "ref": "2501",
                    "note": "<p><strong>Important Words:</strong></p><p>یسطون (would attack) is formed from سطا. They say سطا به او علیه i.e. he sprang or rushed upon him and overpowered him; he made an assault or attack upon him. سطا الفرس means, the horse went at random or in a headlong manner, not obeying guidance; he went with wide step or raised his tail in running. سطا الماء means, the water was or became abundant (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 74,
        "v_": 73,
        "topics": [
            {
                "id": 2038,
                "topic": "Allah: intercessors, gods, besides have no power",
                "verses": "39:44, 17:57, 19:88, 21:29, 25:4, 34:23-4, 43:87, 53:27, 74:49"
            },
            {
                "id": 2124,
                "topic": "Allah: parables set forth by, <i>Amthal</i>",
                "verses": "13:18, 2:18, 2:27, 2:172, 2:262, 2:265, 7:177, 13:36, 14:19, 14:25-27, 14:46, 16:75-77, 16:113, 18:33, 24:36, 25:40, 29:42, 29:44, 30:29, 30:59, 36:14, 39:28, 39:30, 43:9, 47:4, 47:16, 59:22, 62:6, 66:11-12"
            },
            {
                "id": 9169,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: their gods produce nothing, are helpless, dead",
                "verses": "9:3-14, 7:192-196, 6:72, 10:19, 10:35, 10:107, 13:34, 16:21-22, 20:90, 21:23-25, 28:72, 29:18, 29:42, 30:41, 35:14, 35:41, 43:19, 46:5-6"
            },
            {
                "id": 13403,
                "topic": "Parable of: powerlessness gods",
                "verses": null
            }
        ],
        "ar": "یٰۤاَیُّہَا النَّاسُ ضُرِبَ مَثَلٌ  فَاسۡتَمِعُوۡا لَہٗ  ؕ اِنَّ الَّذِیۡنَ تَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ لَنۡ یَّخۡلُقُوۡا ذُبَابًا وَّ لَوِ اجۡتَمَعُوۡا  لَہٗ ؕ وَ اِنۡ یَّسۡلُبۡہُمُ الذُّبَابُ شَیۡئًا لَّا یَسۡتَنۡقِذُوۡہُ  مِنۡہُ ؕ ضَعُفَ الطَّالِبُ وَ الۡمَطۡلُوۡبُ ﴿۷۴﴾ ",
        "ur": "اے انسانو! ایک اہم مثال بیان کی جا رہی ہے پس اسے غور سے سنو۔ یقیناً وہ لوگ جنہیں تم اللہ کے سوا پکارتے ہو ہرگز ایک مکھی بھی نہ بنا سکیں گے خواہ وہ اِس کے لئے اکٹھے ہوجائیں اور اگر مکھی ان سے کچھ چھین لے تو وہ اُس کو اس سے چھڑا نہیں سکتے۔ کیا ہی بے بس ہے (فیض کا) طالب اور وہ جس سے (فیض) طلب کیا جاتا ہے۔",
        "v5": {
            "text": "O men, a similitude is set forth, so listen to it. [a]Surely, those on whom you call instead of Allah cannot create <i>even</i> a fly, though they combine together for the purpose. And if the fly should snatch away anything from them, they cannot recover it therefrom. Weak indeed are <i>both</i> the seeker and the sought.[2502]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:72; 16:21."
                },
                {
                    "ref": "2502",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse brings home to disbelievers the utter powerlessness and helplessness of their gods and their own folly in worshipping them. Their gods, it says, have no control over creation. They cannot create anything, not even a fly. Let alone creating anything—a worm, a fly, they do not possess even the power to recover from a fly anything which it snatches away from them, so weak are these gods and such hopeless idiots are their votaries!</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 75,
        "v_": 74,
        "topics": [
            {
                "id": 3070,
                "topic": "Attributes of Allah: Al-‘Aziz (The Mighty)",
                "verses": "4:57, 2:130, 2:210, 2:221, 2:229, 3:7, 3:19, 4:159, 4:166, 9:40, 9:71, 14:2, 16:61, 22:41, 26:192, 27:10, 27:79, 33:26, 34:7, 35:29, 38:10, 38:67, 40:3, 45:3, 46:3, 48:8, 48:20, 59:2, 59:24, 61:2, 62:2, 64:19"
            },
            {
                "id": 3477,
                "topic": "Attributes of Allah: Al-Qawiyy (The Powerful)",
                "verses": "33:26, 8:53, 22:41, 40:23, 42:20, 51:59, 57:26, 58:22"
            },
            {
                "id": 14047,
                "topic": "Power: Allah has the",
                "verses": "2:21, 2:107, 2:166, 3:30, 5:18, 5:121, 6:18, 7:189, 9:39, 10:50, 11:5, 11:67, 18:40, 22:41, 33:26, 40:23, 42:20, 51:59, 53:6-7, 57:26, 58:22"
            }
        ],
        "ar": "مَا قَدَرُوا اللّٰہَ حَقَّ قَدۡرِہٖ ؕ اِنَّ اللّٰہَ لَقَوِیٌّ عَزِیۡزٌ ﴿۷۵﴾ ",
        "ur": "انہوں نے اللہ کی ویسی قدر نہ کی جیسا اس کی قدر کا حق تھا۔ یقیناً اللہ بہت طاقتور (اور) کامل غلبہ والا ہے۔",
        "v5": {
            "text": "[b]They esteem not Allah with the estimation which is His due. Surely, Allah is Powerful, Mighty.[2503]",
            "notes": [
                {
                    "ref": "b",
                    "note": "6:92; 39:68."
                },
                {
                    "ref": "2503",
                    "note": "<p><strong>Commentary:</strong></p><p>The fact that idolaters degrade themselves so low as to worship idols shows that they have a very poor conception of the powers and attributes of God the Almighty, the Great Creator. In fact all polytheistic beliefs and idolatrous ideas spring from this poor conception of God’s powers and attributes being limited and defective like those of man. The essential characteristics of a Being Who demands and is entitled to our worship are (a) that He should be قوی i.e. He should have the power to create; and (b) that He should be عزیز i.e. He should have complete control over the whole creation. Both these attributes the idols of the polytheists utterly lack.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 76,
        "v_": 75,
        "topics": [
            {
                "id": 1281,
                "topic": "Allah: chooses His Messengers",
                "verses": "2:131, 2:106, 3:34, 3:75, 7:145, 12:7, 19:52, 19:59, 20:14, 20:123, 27:60, 38:47, 42:14, 68:51, 72:28"
            },
            {
                "id": 2559,
                "topic": "Angels: <i>Mala’ikah</i>: Allah chooses Messengers from",
                "verses": null
            },
            {
                "id": 3114,
                "topic": "Attributes of Allah: Al-Basir (All-Seeing)",
                "verses": "4:135, 2:97, 4:59, 17:2, 40:21, 40:57, 42:12, 42:28, 57:5, 60:4, 67:20"
            },
            {
                "id": 9619,
                "topic": "Istifa’: Allah chooses",
                "verses": "2:131, 2:133, 3:34, 3:43, 7:145, 27:60"
            },
            {
                "id": 10146,
                "topic": "Khatamun-Nubuwwah: blessings to continue, revelation to continue",
                "verses": "33:41, 2:39, 3:80, 3:82, 3:180, 4:70, 6:125, 7:36, 16:3, 18:57, 20:124, 24:56, 33:8, 36:66, 40:16, 40:35, 72:8"
            },
            {
                "id": 11294,
                "topic": "Messengers: <i>Rusul</i>: Allah chooses",
                "verses": "3:180"
            },
            {
                "id": 11336,
                "topic": "Messengers: <i>Rusul</i>: as Angels, men",
                "verses": "11:70, 6:62, 10:22, 11:78, 11:82, 12:51, 19:20, 21:9, 25:9, 25:21, 29:32, 29:34, 35:2"
            },
            {
                "id": 12447,
                "topic": "Muhammad<sup>(sa)</sup>: finality of",
                "verses": "24:52-55, 3:82, 3:180, 4:70, 6:125, 7:36, 16:3, 33:8, 33:41, 36:66, 40:16, 44:6, 44:7, 62:4, 72:8"
            },
            {
                "id": 14518,
                "topic": "Prophethood: continuity of",
                "verses": "7:36, 1:7, 4:70"
            },
            {
                "id": 14544,
                "topic": "Prophets<sup>(as)</sup>: <i>Anbiya’</i>: Allah chooses His",
                "verses": "19:52, 6:125, 4:70, 14:12, 16:3, 19:52"
            },
            {
                "id": 14546,
                "topic": "Prophets<sup>(as)</sup>: <i>Anbiya’</i>: Allah chooses men as",
                "verses": "19:52, 12:110"
            }
        ],
        "ar": "اَللّٰہُ یَصۡطَفِیۡ مِنَ الۡمَلٰٓئِکَۃِ  رُسُلًا وَّ مِنَ النَّاسِ ؕ اِنَّ اللّٰہَ سَمِیۡعٌۢ  بَصِیۡرٌ ﴿ۚ۷۶﴾ ",
        "ur": "اللہ فرشتوں میں سے رسول چنتاہے اور انسانوں میں سے بھی۔ یقیناً اللہ بہت سننے والا (اور) گہری نظر رکھنے والا ہے۔",
        "v5": {
            "text": "Allah chooses <i>His</i> Messengers from among angels, and from among men. Surely, Allah is All-Hearing, All-Seeing.[2504]",
            "notes": [
                {
                    "ref": "2504",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse gives another argument to bring home to idolaters the stupidity and uselessness of idol-worship. The idolaters, it says, take angels and men for gods, while the angels themselves are only the bearers of Divine Messages, and the highest spiritual status to which man can rise is only that of Messengership. It is foolish therefore, to worship beings who are no more than mere instruments of conveying Divine will to mankind.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 77,
        "v_": 76,
        "topics": [
            {
                "id": 15301,
                "topic": "Raja‘: return to Allah",
                "verses": "96:9, 2:47, 2:157, 2:211, 2:246, 2:282, 3:56, 3:84, 3:110, 5:49, 5:106, 6:61, 6:109, 6:165, 10:5, 10:24, 10:47, 10:71, 11:5, 11:35, 19:41, 21:36, 21:94, 24:65, 29:9, 31:16, 31:24, 39:8, 41:51, 57:6, 89:29"
            }
        ],
        "ar": "یَعۡلَمُ مَا بَیۡنَ اَیۡدِیۡہِمۡ وَ مَا خَلۡفَہُمۡ ؕ وَ اِلَی اللّٰہِ  تُرۡجَعُ الۡاُمُوۡرُ ﴿۷۷﴾",
        "ur": "وہ جانتا ہے جو ان کے سامنے ہے اور جو اُن کے پیچھے ہے۔ اور اللہ ہی کی طرف معاملات لوٹائے جائیں گے۔",
        "v5": {
            "text": "[a]He knows what is before them and what is behind them; and to Allah shall <i>all</i> affairs be returned <i>for decision</i>.[2505]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:256; 27:66; 49:17."
                },
                {
                    "ref": "2505",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse implies that the great boon of prophethood is bestowed only on those who are fitted to receive it and discharge its great responsibilities. The words, \"what is before them and what is behind them,\" may signify the attributes and qualities they already possess and those which they later on develop.</p>"
                }
            ]
        }
    },
    {
        "ch": 22,
        "v": 78,
        "v_": 77,
        "topics": [
            {
                "id": 711,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:14, 13:16, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 37:167, 38:19, 39:10, 39:76, 41:38-39, 48:10, 50:40-41, 55:7, 59:25, 61:2, 62:2, 64:2, 87:2, 96:20, 110:4"
            },
            {
                "id": 3499,
                "topic": "Attributes of Allah: Ar-Rabb (The Lord)",
                "verses": "1:2, 2:22, 4:2, 5:29, 5:73, 5:118, 6:2, 6:46, 6:165, 10:11, 39:76, 45:37"
            },
            {
                "id": 14629,
                "topic": "Prostration: <i>Sajdah</i>",
                "verses": "13:16, 3:114, 4:103, 7:207, 9:112, 16:50-51, 17:110, 19:59, 22:19, 25:61, 27:26-27, 32:16, 38:25, 41:39, 48:30, 53:63, 55:7, 76:27, 84:22, 96:20"
            },
            {
                "id": 15321,
                "topic": "Raka‘: Bow down",
                "verses": "2:44, 2:126, 3:44, 5:56, 9:112, 22:27, 48:30, 77:49"
            },
            {
                "id": 17328,
                "topic": "Success: <i>Falah</i>, believers, obedient, shall achieve",
                "verses": "3:201, 2:6, 2:190, 3:105, 3:131, 5:36, 5:91, 5:101, 7:9, 7:70, 7:158, 8:46, 9:88, 20:65, 23:2, 23:103, 24:32, 24:52, 28:68, 30:39, 31:6, 59:10, 62:11, 64:17, 87:15, 91:10"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا ارۡکَعُوۡا  وَ اسۡجُدُوۡا وَ اعۡبُدُوۡا رَبَّکُمۡ وَ افۡعَلُوا الۡخَیۡرَ  لَعَلَّکُمۡ  تُفۡلِحُوۡنَ ﴿ۚٛ۷۸﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! رکوع کرو اور سجدہ کرو اور اپنے ربّ کی عبادت کرو اور اچھے کام کرو تاکہ تم کامیاب ہو جاؤ۔",
        "v5": {
            "text": "O ye who believe! [b]bow down and prostrate yourselves in Prayer, and worship your Lord, and do good deeds that you may prosper.[2506]",
            "notes": [
                {
                    "ref": "b",
                    "note": "3:44; 41:38; 96:20."
                },
                {
                    "ref": "2506",
                    "note": "<p><strong>Important Words:</strong></p><p>ارکعوا (bow down) is derived from رکع which means, he bowed down, his condition became lowered or abased. رکعت النخلةmeans, the palm-tree inclined. رکع الی اللّٰه means he completely turned towards God and leaned upon Him, he humbled himself to Him, and found peace of mind in Him. The word راکع as used by the Arabs meant, one who worshipped God alone to the exclusion of all sorts of idols and images (Asas). The famous pre-Islamic poet Nabighah says:</p><p>سیبلغ عذراً اونجاحاً من امرئ</p><p>الی ربه رب البریة راکع</p><p>i.e. he who turns to God alone, the Creator of the world, will have a sound argument in his favour and will obtain salvation ( Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse points to the following four means which it is very essential to adopt for attaining spiritual eminence and success and prosperity in life: (a) To possess firm, sincere and unadulterated faith in God. This is the meaning of the word آمنوا. (b) To have full and complete reliance and dependence on God and to renounce all unfair and doubtful means for the attainment of one’s object. This is the significance of ارکعوا. (c) To give unquestioning obedience to God’s commandments and unqualified submission to His will, and to develop in oneself Divine attributes so as to become God’s own manifestation. This is the import and purport of the expression واسجدوا واعبدوا (d) To do righteous deeds and serve mankind (وافعلواالخیر). Thus this brief verse covers the entire extent and scope of the ways and means that lead to material and moral progress.</p>"
                }
            ]
        }
    }
]
