[
    {
        "ch": 113,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 113,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 2350,
                "topic": "Allah: seeking refuge with, <i>A‘udhu-billah</i>",
                "verses": "23:98-99, 2:68, 7:201, 9:118, 12:24, 16:99, 19:19, 40:28, 40:57, 41:37, 44:21, 72:23, 114:2"
            },
            {
                "id": 3136,
                "topic": "Attributes of Allah: Al-Faliq (The Breaker, Cleaver)",
                "verses": "6:96, 6:97, 26:64"
            },
            {
                "id": 3777,
                "topic": "Attributes of Allah: Rabbul-Falaq (Lord of the dawn)",
                "verses": null
            },
            {
                "id": 5761,
                "topic": "Dawn: remember Allah at",
                "verses": "2:188, 17:79, 3:18, 3:42, 51:19"
            },
            {
                "id": 7174,
                "topic": "Environment: <i>Mahaul</i>",
                "verses": "2:52, 2:18, 4:98, 4:101, 5:101, 8:26, 11:104, 17:2, 30:31"
            },
            {
                "id": 14172,
                "topic": "Prayers of the Holy Qur’an: for protection",
                "verses": "11:48, 11:42, 43:14-15, 23:30, 114:2-5"
            }
        ],
        "ar": "قُلۡ اَعُوۡذُ  بِرَبِّ الۡفَلَقِ ۙ﴿۲﴾ ",
        "ur": "تُو کہہ دے کہ میں (چیزوں کو) پھاڑ کر (نئی چیز) پیدا کرنے والے ربّ کی پناہ مانگتا ہوں۔",
        "v5": {
            "text": "Say, ‘I seek refuge in the Lord of the dawn,[b] [4871]",
            "notes": [
                {
                    "ref": "b",
                    "note": "6:96."
                },
                {
                    "ref": "4871",
                    "note": "<p><strong>Important Words:</strong></p><p>الفلق (dawn) is subs. noun from فلق. They say فلق الصبح i.e. He (God) made the dawn to break. ‘Ali, the Holy Prophet’s Fourth Successor used generally to swear by the words والذی فلق الحبة و برأ النسمة i.e. By Him Who clove the grain, making it to germinate and Who created man or the soul. فلق among other things means, the daybreak or dawn; the whole creation; Hell; the plain appearance of the truth after it had been dubious; a low or depressed place of the earth between two hills; an elevated ground (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>A believer is enjoined to invoke the protection of God, the Lord of فلق. In view of different meanings of the word, he is told to pray:</p><p>(1) That when the night of darkness over Islam has passed away and the morning of its bright future dawns, its sun should continue to shine till it reaches the Meridian.</p><p>(2) That God might protect him from the hidden and manifest evil of all that He has created, including the evils of heredity, bad environment, defective education or other corrupting influences.</p><p>(3) That God should save him from the torments of Hell in this life and in the Hereafter.</p><p>(4) That God should enable him to avoid extremes and to adopt the middle course in all things which is the safest course, since the idea implied in ربوبیة is development by degrees and in stages. See also v. 6 below.</p>"
                }
            ]
        }
    },
    {
        "ch": 113,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 14172,
                "topic": "Prayers of the Holy Qur’an: for protection",
                "verses": "11:48, 11:42, 43:14-15, 23:30, 114:2-5"
            }
        ],
        "ar": "مِنۡ  شَرِّ مَا خَلَقَ ۙ﴿۳﴾ ",
        "ur": "اُس کے شر سے جو اس نے پیدا کیا۔",
        "v5": {
            "text": "From the evil of that which He has created,",
            "notes": null
        }
    },
    {
        "ch": 113,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 14172,
                "topic": "Prayers of the Holy Qur’an: for protection",
                "verses": "11:48, 11:42, 43:14-15, 23:30, 114:2-5"
            }
        ],
        "ar": "وَ مِنۡ  شَرِّ غَاسِقٍ  اِذَا وَقَبَ ۙ﴿۴﴾ ",
        "ur": "اور اندھیرا کرنے والے کے شر سے جب وہ چھا چکا ہو۔",
        "v5": {
            "text": "And from the evil of darkness when it overspreads,[4872]",
            "notes": [
                {
                    "ref": "4872",
                    "note": "<p><strong>Commentary:</strong></p><p>غاسق (darkness) is derived from غسق which means, it became dark or intensely dark. غسقت العین means, the eyes flowed with water. غسق اللبن means, the milk poured fourth from the udder. الغاسق means, the night; darkness; the Pleiades when it sets; the moon when it is eclipsed; the sun when it sets; the day when it enters upon the night, etc. (Lane &amp; Aqrab).</p><p>وقب (overspreads). They say وقب الظلام i.e. the darkness overspread. وقبت الشمس means, the sun set. وقب الرجل means, the eyes of the man sank. وقب القمر means, the moon became eclipsed (Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse may refer to the evils of the time when the light of truth becomes extinguished and the darkness of sin and iniquity spreads over the entire face of the earth. Or it may refer to the evils of the time when one is overwhelmed by distress and privation, when it is darkness all around him, and the last ray of hope disappears. See also last verse of the <i>Surah</i>.</p>"
                }
            ]
        }
    },
    {
        "ch": 113,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 6516,
                "topic": "Discord: <i>Fitnah</i>",
                "verses": "2:214, 3:8, 3:106, 4:92, 5:42, 9:47, 9:48, 12:101, 17:54, 33:15, 51:15"
            },
            {
                "id": 11474,
                "topic": "Mischief",
                "verses": "10:82, 10:92, 11:79, 12:30, 12:74, 28:5, 28:78, 38:42"
            },
            {
                "id": 14172,
                "topic": "Prayers of the Holy Qur’an: for protection",
                "verses": "11:48, 11:42, 43:14-15, 23:30, 114:2-5"
            }
        ],
        "ar": "وَ مِنۡ  شَرِّ النَّفّٰثٰتِ فِی الۡعُقَدِ ۙ﴿۵﴾ ",
        "ur": "اور گِرہوں میں پھونکنے والیوں کے شر سے۔",
        "v5": {
            "text": "And from the evil of those who blow upon the knots <i>of mutual relationships</i> <i>to undo them</i>,[4873]",
            "notes": [
                {
                    "ref": "4873",
                    "note": "<p><strong>Important Words:</strong></p><p>النفاثات (who blow) is derived from نفث which means, he spat. نفثت الحیة الدم means, the serpent emitted poison. نفث الله الشیء فی القلب means, God inspired him with a thing. نفاثات means; those groups that spit or emit much poison; those who whisper evil suggestions (Aqrab).</p><p><strong>Commentary:</strong></p><p>The reference in the verse is to those whisperers of evil suggestions who cause solemn contracts and friendships to break down, and who inspire people with a spirit of defiance of established authority or with violating the oath of fealty, and thus seek to create discord and dissension in the Muslim Community and to encourage fissiparous tendencies among them. For a detailed note on the whole <i>Surah</i> see next verse.</p>"
                }
            ]
        }
    }
]
