[
    {
        "ch": 106,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 106,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 14937,
                "topic": "Quraysh",
                "verses": "2:74, 2:130, 2:218, 3:126, 8:31, 12:93, 21:41, 23:95, 26:215, 27:49, 30:5, 33:10, 48:2, 48:12, 53:21, 54:2, 54:10, 59:3, 59:15, 60:2, 80:2, 106:5"
            }
        ],
        "ar": "لِاِیۡلٰفِ قُرَیۡشٍ ۙ﴿۲﴾ ",
        "ur": "قریش میں باہم ربط پیدا کرنے کے لئے۔",
        "v5": {
            "text": "For the attachment of the Quraish—[4846]",
            "notes": [
                {
                    "ref": "4846",
                    "note": "<p><strong>Important Words:</strong></p><p>ل is a particle which, besides many other meanings, is used in exclamation of wonder (Steingass).</p><p>ایلاف (attachment) is inf. noun from الف (<i>alafa</i>). They say الفه i.e. he made him to cleave or keep to the place; he made him love him or it; he made him stick to it; he made a covenant with him for the purpose of trade, he traded with him; he provided him with necessary things and prepared him. ایلاف means, sticking or making one stick to a thing; loving and making one love a person or thing; providing a person with a thing; a covenant or an obligation involving responsibility for safety; protection (Lane &amp; Aqrab).</p><p>قریش (the Quraish) is derived from قرش. They say قرشه i.e. he collected it from here and there and attached one part of it to another (Aqrab). The Quraish were so called because one of their ancestors Qussayy bin Kilab bin Nadr had prevailed upon them to migrate from all parts of Arabia where they had lived a scattered life, and to settle in Mecca. Of BanuKananah only the progeny of Nadr settled in Mecca and as they (Quraish) were a small group, they were called قریش which means, a small group gathered from here and there.</p><p><strong>Commentary:</strong></p><p>See next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 106,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 2813,
                "topic": "Arabs: before the Holy Prophet<sup>(sa)</sup>",
                "verses": "3:104"
            }
        ],
        "ar": "اٖلٰفِہِمۡ  رِحۡلَۃَ  الشِّتَآءِ  وَ الصَّیۡفِ ۚ﴿۳﴾ ",
        "ur": "(ہاں) اُن میں ربط بڑھانے کے لئے (ہم نے) سردیوں اور گرمیوں کے سفر بنائے ہیں۔",
        "v5": {
            "text": "<i>His</i> making them attached to <i>their</i> journey in winter and summer—[4847]",
            "notes": [
                {
                    "ref": "4847",
                    "note": "<p><strong>Commentary:</strong></p><p>As ل is a particle and in Arabic a new sentence never begins with a particle, a sentence or clause or expression therefore must be taken as understood before the words لایلاف قریش as before بسم الله الرحمان الرحیم the word أقرء (I read) or أشرع (I begin) is taken to be understood. In the present case the understood expression, according to some commentators, is اعجب یا محمد and the verse is supposed to read something like this: اعجب یا محمد لنعم الله علی قریش فی ایلافھم رحلة الشتاء والصیف i.e. do thou wonder O Muhammad at God’s great favour upon the Quraish that He has created in their hearts love for journeying in winter and summer. The Divine favour consisted in the fact that by taking trade caravans in winter to Yemen and in summer to Syria and Palestine, the Quraish brought necessities of life to Mecca. By this trading activity, they developed a certain prestige and also became acquainted with the prophecies about the appearance of a great Prophet in Arabia by coming into contact with Jews of Yemen and Christians of Syria who knew those prophecies. It was indeed a great Divine favour that God created in the hearts of the Quraish a liking, for making journeys to Yemen and Syria. They were so rooted in the soil and had such great attachment for the Ka‘bah that they would rather starve than leave it, even temporarily. It was by the exhortation of Hashim, the Holy Prophet’s great grandfather, that they took to this calling. Thus it constituted a great Divine favour upon the Quraish that by their journeys to these places they, besides other advantages of these journeys, were being prepared to accept the coming Prophet when he appeared.</p><p>Apart from the expression اعجب یا محمد لنعم الله علی قریش taken as understood, there is another explanation of the verses which fits in, perhaps more appropriately, with the context. This is as follows: \"Thy Lord destroyed the Owner of the Elephant to attach the hearts of the Quraish to their journeying freely in winter and summer, which constituted a great Divine favour upon them.\" This is because if Abraha had not been destroyed it would have been impossible for the Quraish to make journeys to Yemen. The destruction of Abraha, therefore, besides opening the way for trade journeys to Yemen, made the Ka‘bah all the more sacred in the eyes of the Arabs for whom it was already a place of Pilgrimage. This in its turn gave added impetus to the trade of the Quraish.</p>"
                }
            ]
        }
    },
    {
        "ch": 106,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 3945,
                "topic": "Baitul-Haram: <i>Ka‘bah</i>",
                "verses": "17:2, 2:126, 2:128, 2:159, 5:3, 5:98, 8:36, 14:38, 22:27, 22:30, 28:58"
            }
        ],
        "ar": "فَلۡیَعۡبُدُوۡا  رَبَّ ہٰذَا الۡبَیۡتِ ۙ﴿۴﴾ ",
        "ur": "پس وہ عبادت کریں اس گھر کے ربّ کی۔",
        "v5": {
            "text": "They should worship the Lord of this House,[a]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:97; 27:92."
                }
            ]
        }
    }
]
