[
    {
        "ch": 59,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 3084,
                "topic": "Attributes of Allah: Al-‘Aziz (The Mighty)",
                "verses": "4:57, 2:130, 2:210, 2:221, 2:229, 3:7, 3:19, 4:159, 4:166, 9:40, 9:71, 14:2, 16:61, 22:41, 22:75, 26:192, 27:10, 27:79, 33:26, 34:7, 35:29, 38:10, 38:67, 40:3, 45:3, 46:3, 48:8, 48:20, 59:24, 61:2, 62:2, 64:19"
            },
            {
                "id": 3260,
                "topic": "Attributes of Allah: Al-Hakim (The Wise)",
                "verses": "2:130, 2:33, 2:210, 2:221, 2:229, 2:261, 3:7, 4:12, 4:57, 4:131, 4:166, 5:119, 9:15, 9:40, 11:2, 12:101, 15:26, 16:61, 22:53, 24:19, 27:7, 27:10, 31:28, 34:2, 35:3, 41:43, 42:52, 43:85, 44:5, 46:3, 48:5, 48:8, 48:20, 49:9, 57:2, 59:25, 62:2, 64:19, 66:3"
            }
        ],
        "ar": "سَبَّحَ  لِلّٰہِ  مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ۚ وَ ہُوَ الۡعَزِیۡزُ  الۡحَکِیۡمُ ﴿۲﴾ ",
        "ur": "اللہ کی تسبیح کرتا ہے جو آسمانوں میں ہے اور جو زمین میں ہے۔ اور وہ کامل غلبہ والا (اور) صاحبِ حکمت ہے۔",
        "v5": {
            "text": "[b]All that is in the heavens and all that is in the earth glorifies Allah; and He is the Mighty, the Wise.[4189]",
            "notes": [
                {
                    "ref": "b",
                    "note": "17:45; 24:42; 61:2; 62:2; 64:2."
                },
                {
                    "ref": "4189",
                    "note": "<p><strong>Commentary:</strong></p><p>For note on سبح للّٰه see 57:2. But whereas تسبیح (glorifying) is used with regard to God’s attributes, تقدیس (extolling His holiness) is used concerning His actions.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 4027,
                "topic": "Banu Nadir",
                "verses": null
            },
            {
                "id": 5253,
                "topic": "Conjecture: <i>Zann</i>: thinking, doubt",
                "verses": "4:158, 7:172, 11:28, 12:43, 17:102-103, 26:187, 28:39, 28:40, 33:11, 38:25, 40:38, 41:23, 41:24, 48:13, 72:6, 72:8, 84:15"
            },
            {
                "id": 8451,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: cast terror in their",
                "verses": "53:12, 3:152, 8:13, 33:27"
            },
            {
                "id": 9894,
                "topic": "Jews: of Arabia",
                "verses": "2:86, 2:95-96, 2:103, 2:105, 2:109, 2:146, 3:113-115, 3:184, 4:52, 5:65, 5:83, 17:61, 17:86, 22:41, 33:10, 33:16, 33:27, 33:61-62, 46:30, 48:16, 58:6, 60:14, 72:2"
            },
            {
                "id": 10423,
                "topic": "Lesson: <i>‘Ibrah</i>",
                "verses": "16:67, 3:14, 12:112, 23:22, 24:45, 79:27"
            },
            {
                "id": 11171,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 37:178, 44:11, 54:46, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            },
            {
                "id": 12391,
                "topic": "Muhammad<sup>(sa)</sup>: battles of",
                "verses": null
            },
            {
                "id": 13786,
                "topic": "People of the Book: <i>Ahlul-Kitab</i>",
                "verses": "4:160, 2:106, 2:110, 3:21, 3:65-66, 3:70, 3:72-73, 3:76, 3:99-100, 3:111, 3:114, 3:200, 4:48, 4:124, 4:154, 4:172, 5:6, 5:16, 5:20, 5:60, 5:66, 5:69, 5:78, 9:29, 29:47, 33:27, 42:15, 45:17, 57:30, 98:2, 98:7"
            },
            {
                "id": 14955,
                "topic": "Quraysh",
                "verses": "106:2, 2:74, 2:130, 2:218, 3:126, 8:31, 12:93, 21:41, 23:95, 26:215, 27:49, 30:5, 33:10, 48:2, 48:12, 53:21, 54:2, 54:10, 59:15, 60:2, 80:2, 106:5"
            },
            {
                "id": 17438,
                "topic": "Syria",
                "verses": "7:66, 7:74, 7:85, 9:32, 9:42, 9:107, 11:51, 15:77, 20:78, 21:84, 23:51, 25:41, 26:142, 30:5, 34:13, 34:16, 34:19, 37:126, 71:24"
            },
            {
                "id": 18107,
                "topic": "Uhud: Battle of",
                "verses": "33:22, 3:122-130, 3:142, 3:153-156, 3:160, 3:167-175, 8:67, 22:67, 71:29"
            }
        ],
        "ar": "ہُوَ الَّذِیۡۤ  اَخۡرَجَ الَّذِیۡنَ کَفَرُوۡا مِنۡ اَہۡلِ الۡکِتٰبِ مِنۡ دِیَارِہِمۡ  لِاَوَّلِ الۡحَشۡرِ ؕؔ مَا ظَنَنۡتُمۡ اَنۡ  یَّخۡرُجُوۡا وَ ظَنُّوۡۤا  اَنَّہُمۡ  مَّانِعَتُہُمۡ حُصُوۡنُہُمۡ مِّنَ اللّٰہِ  فَاَتٰٮہُمُ اللّٰہُ مِنۡ حَیۡثُ لَمۡ یَحۡتَسِبُوۡا ٭  وَ قَذَفَ فِیۡ  قُلُوۡبِہِمُ  الرُّعۡبَ یُخۡرِبُوۡنَ بُیُوۡتَہُمۡ  بِاَیۡدِیۡہِمۡ  وَ اَیۡدِی الۡمُؤۡمِنِیۡنَ ٭  فَاعۡتَبِرُوۡا یٰۤاُولِی الۡاَبۡصَارِ ﴿۳﴾ ",
        "ur": "وہی ہے جس نے اہلِ کتاب میں سے ان کو جنہوں نے کفر کیا پہلے حشر کے وقت ان کے گھروں سے نکالا۔ تم گمان نہیں کرتے تھے کہ وہ نکل جائیں گے جبکہ وہ یہ سمجھتے تھے کہ ان کے قلعے اللہ سے ان کی حفاظت کریں گے۔ پس اللہ ان تک آ پہنچا جہاں سے وہ خیال تک نہ کرسکے۔ اور اُس نے اُنکے دلوں میں رعب ڈال دیا۔ وہ خود اپنے ہی ہاتھوں اور مومنوں کے ہاتھوں سے بھی اپنے گھروں کو برباد کرنے لگے۔ پس اے صاحبِ بصیرت لوگو! عبرت حاصل کرو۔",
        "v5": {
            "text": "He it is Who turned out the disbelievers among the People of the Book from their homes at <i>the time of</i> the first banishment. You did not think that they would go forth, and they thought that their fortresses would defend them against Allah. But Allah came upon them[c] whence they did not expect, and cast terror into their hearts,[d] so that they destroyed their houses with their own hands and the hands of the believers. So take a lesson, O ye who have eyes![4190]",
            "notes": [
                {
                    "ref": "c",
                    "note": "16:27; 39:26."
                },
                {
                    "ref": "d",
                    "note": "3:152; 8:13."
                },
                {
                    "ref": "4190",
                    "note": "<p><strong>Commentary:</strong></p><p>There lived at Medina three Jewish tribes—Banu Qainuqa‘, Banu Nadir and Banu Quraizah. The present verse refers to the banishment from Medina of the Banu Nadir. This tribe like Banu Qainuqa‘ before them, had acted treacherously towards Muslims on several occasions. They had hatched plots and had entered into secret alliances against them, with their enemies. They had repeatedly broken their plighted word and had repudiated the solemn agreement that they would remain neutral between the Holy Prophet and his enemies, and even had conspired to take his life. Their leader Ka‘b bin Ashraf had gone to Mecca to enlist the help of the Quraish and of other pagan tribes around Mecca in order to drive out the Muslims from Medina. After the temporary reverse suffered by Muslims at Uhud, their machinations and defiance of the Prophet had greatly increased. It was when the cup of their iniquities had become full to the brim and their presence in Medina had proved to be a constant source of mortal danger to Muslims and the Islamic State that the Holy Prophet had to take action against them. They were told to leave Medina. But the Prophet was exceptionally kind and considerate to them. He allowed them to carry their goods and chattels with them, and they departed from Medina in perfect safety, but not until they had despaired of the help they had expected from their Meccan allies and from the hypocrites of Medina, and had also found that their fortresses which they thought were impregnable could not save them. The Holy Prophet laid siege to the fortresses and after vainly holding out for about 21 days, they surrendered. They all left for Syria, only two families choosing to remain behind at Khaibar.</p><p>The reference in the words, \"at the time of the first banishment\" may be to the banishment of the Jewish tribe of BanuQainuqa‘ who had been expelled from Medina, sometime after the Battle of Badr, for their intrigues and defiance of the authority of the Holy Prophet, to whom they had pledged allegiance as the acknowledged Head of the Medina Republic. Or the words may refer to the banishment by the Holy Prophet from Medina of the three above-mentioned Jewish tribes. This was the first banishment. ‘Umar, the Holy Prophet’s Second Successor, however, banished all Jews from the whole of Arabia for the second and last time. Thus the words, \"at the time of the first banishment\" may be taken as embodying a prophecy that after the Jewish tribes of Medina will have been banished by the Holy Prophet, all the Jews of Arabia would suffer the same fate at some later time.</p><p>Before departing from Medina the Banu Nadir had destroyed their houses and other movable property before the very eyes of Muslims, because the Holy Prophet had given them ten days to dispose of their affairs as they liked. Thus the Jews of Medina were the originators of the scorched earth policy, centuries before the Russians had adopted it in the World War I1. The reference in the words \"they destroyed their houses with their own hands,\" is to that policy.</p><p>The words, \"you would not think that they would go forth,\" show that in view of the material resources, political alliances and organization of the Jews of Medina, the Muslims could not conceive that they could be driven out of Medinaso easily and without any loss of human life on either side.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 6275,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 97:2-5"
            },
            {
                "id": 9894,
                "topic": "Jews: of Arabia",
                "verses": "2:86, 2:95-96, 2:103, 2:105, 2:109, 2:146, 3:113-115, 3:184, 4:52, 5:65, 5:83, 17:61, 17:86, 22:41, 33:10, 33:16, 33:27, 33:61-62, 46:30, 48:16, 58:6, 60:14, 72:2"
            },
            {
                "id": 14832,
                "topic": "Qada’ Qadr: Allah’s Will prevails",
                "verses": "54:50, 24:44, 3:155, 6:59, 9:51, 10:20, 11:57, 11:111, 12:42, 13:40, 15:5, 16:105, 31:35, 32:6, 33:39, 41:46, 41:48, 64:12"
            }
        ],
        "ar": "وَ لَوۡ لَاۤ  اَنۡ  کَتَبَ اللّٰہُ عَلَیۡہِمُ  الۡجَلَآءَ لَعَذَّبَہُمۡ  فِی الدُّنۡیَا ؕ وَ لَہُمۡ  فِی الۡاٰخِرَۃِ عَذَابُ النَّارِ ﴿۴﴾ ",
        "ur": "اور اگر اللہ نے اُن کےلئے جلاوطنی مقدّر نہ کر رکھی ہوتی تو انہیں اسی دنیا میں عذاب دیتا جبکہ آخرت میں اُن کےلئے (بہرحال) آگ کا عذاب (مقدر) ہے۔",
        "v5": {
            "text": "And had it not been that Allah had decreed exile for them, He would have surely punished them <i>otherwise</i> in this world. And in the Hereafter they will certainly have the punishment of the Fire.[4191]",
            "notes": [
                {
                    "ref": "4191",
                    "note": "<p><strong>Important Words:</strong></p><p>الجلاء (the banishment) is derived from جلا (<i>jala</i>). They say جلا عن بلدہ i.e. he migrated from his home. جلا عنه الھم means, he removed the grief from him or banished him. أجلاہ means he exiled (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse means that by their persistent evil designs and treachery the Jews of Medina, particularly the Banu Nadir, had incurred God’s wrath. Their exile from Medina was a very light punishment. They had deserved a much heavier punishment, and had they not been exiled they would have been severely punished in some other form.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 9894,
                "topic": "Jews: of Arabia",
                "verses": "2:86, 2:95-96, 2:103, 2:105, 2:109, 2:146, 3:113-115, 3:184, 4:52, 5:65, 5:83, 17:61, 17:86, 22:41, 33:10, 33:16, 33:27, 33:61-62, 46:30, 48:16, 58:6, 60:14, 72:2"
            },
            {
                "id": 15655,
                "topic": "Retribution: and Allah",
                "verses": "7:168, 2:197, 2:212, 3:5, 5:96, 7:127, 8:14, 13:7, 14:48, 32:23, 39:38, 40:6, 43:26, 44:17, 59:8"
            }
        ],
        "ar": "ذٰلِکَ بِاَنَّہُمۡ  شَآقُّوا اللّٰہَ وَ رَسُوۡلَہٗ ۚ وَ مَنۡ یُّشَآقِّ  اللّٰہَ  فَاِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ﴿۵﴾ ",
        "ur": "یہ اس وجہ سے ہے کہ انہوں نے اللہ اور اس کے رسول کی شدید مخالفت کی۔ اور جو اللہ کی مخالفت کرتا ہے تو یقینا اللہ سزا دینے میں بہت سخت ہے۔",
        "v5": {
            "text": "That is because they opposed Allah and His Messenger;[a] and whoso opposes Allah—then surely Allah is Severe in retribution.[4191A]",
            "notes": [
                {
                    "ref": "a",
                    "note": "4:116; 8:14; 47:33."
                },
                {
                    "ref": "4191A",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse shows that opposition to a Prophet is tantamount to opposing God Himself.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 5711,
                "topic": "Date Palms: dates",
                "verses": "36:35, 2:267, 6:100, 6:142, 13:5, 16:12, 16:68, 17:92, 18:33, 19:26, 23:20, 26:149, 50:10-11, 55:12, 55:69, 80:30"
            },
            {
                "id": 7658,
                "topic": "Fisq: abhorrence, disobedience",
                "verses": "2:100, 2:283, 3:83, 3:111, 5:4, 5:48, 5:50, 5:60, 5:82, 5:109, 6:122, 6:146, 7:103, 7:146, 9:8, 9:24, 9:53, 9:67, 9:84, 9:96, 24:5, 24:56, 27:13, 28:33, 43:55, 46:36, 49:8, 51:47, 57:17, 57:28, 59:20, 61:6"
            },
            {
                "id": 9894,
                "topic": "Jews: of Arabia",
                "verses": "2:86, 2:95-96, 2:103, 2:105, 2:109, 2:146, 3:113-115, 3:184, 4:52, 5:65, 5:83, 17:61, 17:86, 22:41, 33:10, 33:16, 33:27, 33:61-62, 46:30, 48:16, 58:6, 60:14, 72:2"
            },
            {
                "id": 13860,
                "topic": "Permission: Leave, <i>Idhn</i>: of Allah",
                "verses": "64:12, 2:98, 2:103, 2:214, 2:222, 2:250, 2:252, 2:256, 3:50, 3:146, 3:153, 3:167, 4:65, 5:17, 5:111, 7:59, 8:67, 10:4, 10:101, 11:106, 13:39, 14:2, 14:12, 14:24, 14:26, 22:66, 33:47, 34:13, 35:33, 42:52, 58:11, 97:5"
            },
            {
                "id": 18347,
                "topic": "War: <i>Qital</i>: conditions for",
                "verses": "2:191-192, 2:194, 2:218, 4:76, 4:91, 5:34, 8:40, 8:46-47, 8:59, 8:61-62, 8:68-72, 9:5-8, 9:36, 16:127, 22:40-42, 22:61, 47:5, 47:36"
            }
        ],
        "ar": "مَا  قَطَعۡتُمۡ مِّنۡ  لِّیۡنَۃٍ  اَوۡ  تَرَکۡتُمُوۡہَا قَآئِمَۃً  عَلٰۤی  اُصُوۡلِہَا فَبِاِذۡنِ اللّٰہِ وَ لِیُخۡزِیَ الۡفٰسِقِیۡنَ ﴿۶﴾ ",
        "ur": "جو بھی کھجور کا درخت تم نے کاٹا یا اُسے اپنی جڑوں پر کھڑا رہنے دیا تو اللہ کے حکم کے ساتھ ایسا کیا اور یہ اس غرض سے تھا کہ وہ فاسقوں کو رُسوا کردے۔",
        "v5": {
            "text": "Whatever palm-trees you cut down or left standing on their roots, it was by Allah’s leave, and that He might disgrace the transgressors.[4192]",
            "notes": [
                {
                    "ref": "4192",
                    "note": "<p><strong>Important Words:</strong></p><p>لینة (palm tree) is derived from لان which means, it was or became tender, smooth, gentle. لینة means, a palm tree. It is a kind of palm tree of which the dates are of very inferior quality and are unfit for human consumption (Aqrab &amp; Ar-Raudul-Anaf).</p><p><strong>Commentary:</strong></p><p>The reference in the verse is to the cutting, by orders of the Holy Prophet, of the palm trees of the Banu Nadir who, as stated in v. 3, had shut themselves up in their fortresses in defiance of the Holy Prophet’s orders to surrender. After the siege had lasted for a few days, the Holy Prophet, in order to compel them to surrender, ordered that some of their palm trees of the <i>lina</i> (لینة) kind of which the dates are of very inferior quality and are quite unfit for human consumption should be cut down. It was after only six trees had been cut down, that the Banu Nadir surrendered (Zurqani). The orders of theHoly Prophet were extremely lenient and were legitimate and quite in conformity with the laws of civilized warfare.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 1765,
                "topic": "Allah: has the power to do all that He wills",
                "verses": "2:21, 2:110, 2:149, 2:260, 3:30, 3:166, 3:190, 5:18, 5:20, 5:41, 5:121, 8:42, 9:39, 11:5, 16:78, 24:46, 29:21, 30:51, 35:2, 41:40, 42:10, 46:34, 48:22, 57:3, 64:2, 67:2"
            },
            {
                "id": 8093,
                "topic": "Grace: <i>Fadl</i>: bestowed on believers",
                "verses": "62:11, 2:65, 3:104, 4:84, 4:114, 4:174, 4:176, 5:55, 14:41, 20:123, 24:11, 24:15, 24:21, 24:22, 27:17, 27:41, 34:11, 37:58, 42:27, 48:30, 49:9, 52:30, 57:22, 59:9, 62:5, 68:3"
            },
            {
                "id": 8987,
                "topic": "Horses: <i>Khail</i>",
                "verses": "16:9, 3:15, 3:201, 4:72, 9:41, 17:65, 27:18, 38:32-33, 100:2"
            },
            {
                "id": 17136,
                "topic": "Spoils: <i>Anfal</i>",
                "verses": "8:2, 3:162, 8:42, 48:16, 60:12"
            },
            {
                "id": 18389,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "8:2, 8:42, 8:70, 33:51"
            }
        ],
        "ar": "وَ مَاۤ  اَفَآءَ اللّٰہُ  عَلٰی رَسُوۡلِہٖ  مِنۡہُمۡ فَمَاۤ اَوۡجَفۡتُمۡ عَلَیۡہِ مِنۡ خَیۡلٍ وَّ لَا رِکَابٍ وَّ لٰکِنَّ اللّٰہَ یُسَلِّطُ رُسُلَہٗ  عَلٰی مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ  عَلٰی کُلِّ شَیۡءٍ  قَدِیۡرٌ ﴿۷﴾",
        "ur": "اور اللہ نے اُن (کے اموال میں) سے اپنے رسول کو جو بطور غنیمت عطا کیا تو اُس پر تم نے نہ گھوڑے دوڑائے اور نہ اونٹ۔ لیکن اللہ اپنے رسولوں کو جن پر چاہتا ہے مسلّط کر دیتا ہے اور اللہ ہر چیز پر جسے وہ چاہے دائمی قدرت رکھتا ہے۔",
        "v5": {
            "text": "And whatever Allah has given to His Messenger as spoils from them, you urged neither horse nor camel for that; but Allah gives authority to His Messenger over whomsoever He pleases; and Allah has power over all things.[4193]",
            "notes": [
                {
                    "ref": "4193",
                    "note": "<p><strong>Important Words:</strong></p><p>أفاء (given as spoils) is transitive verb from فاء which means, he returned, particularly he returned to a good state or condition. أفاته means, I made it to return. فییء means, afternoon shade; spoil or booty, so called because it returns from one party without difficulty; such of the possessions of disbelievers as accrue to Muslims without war or such as are obtained from them after laying down of arms. Loosely, the three words نفل and غنیمة and فییء are used synonymously. But whereas according to some غنیمة signifies, what is obtained from disbelievers by force during war, فییء signifies, what is obtained from them after laying down of arms or what God has given to Muslims of the goods of disbelievers such as poll-tax and that for which peace has been made with them or which they acquire without difficulty. According to some authorities غنیمة is more general in signification than نفل, and فییء is more so than غنیمة. According to the lawyers everything that may be lawfully taken of the property and goods of disbelievers is فییء. Thus غنیمة is that which is acquired with or without difficulty or labour, before or after the victory and نفل is that which is had before the division of غنیمة or which is acquired without fighting, and it differs from فییء in this respect that whereas فییء is applied to the spoil from the disbelievers after they have made preparation for war against Muslims, this condition does not apply to نفل (Lane &amp; Aqrab).</p><p>رکاب (camels) is derived from رکب. They say رکب الدابة او علی الدابة i.e. he rode upon the beast. رکاب means camels used for riding. It has no proper singular; the word used for singular is راحلة. رکاب السحاب means, the winds (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse may have special reference to the spoils the Muslims got from the Jews of Khaibar. See next verse also.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 2510,
                "topic": "Alms: <i>Sadaqah</i>: collection &amp; distribution of",
                "verses": "2:274, 9:60, 9:103"
            },
            {
                "id": 13345,
                "topic": "Orphans: <i>Yatim</i>: welfare of",
                "verses": "2:221, 2:178, 2:216, 4:3-4, 4:128, 8:42, 76:9, 90:15-16"
            },
            {
                "id": 15656,
                "topic": "Retribution: and Allah",
                "verses": "7:168, 2:197, 2:212, 3:5, 5:96, 7:127, 8:14, 13:7, 14:48, 32:23, 39:38, 40:6, 43:26, 44:17, 59:5"
            },
            {
                "id": 16994,
                "topic": "Son of…: <i>Ibnus-Sabil</i>, wayfarer",
                "verses": "8:42, 2:178, 2:216, 4:37, 9:60, 17:27, 30:39"
            },
            {
                "id": 17054,
                "topic": "Society",
                "verses": "20:120, 2:141, 2:180, 2:189, 2:216, 2:281, 2:283, 2:284, 3:135, 5:3, 17:27-30, 17:36, 24:5, 24:62, 25:68, 30:40, 33:22, 33:34, 34:35, 43:36, 49:13-14, 53:40-41, 71:15, 89:21, 104:2"
            },
            {
                "id": 17136,
                "topic": "Spoils: <i>Anfal</i>",
                "verses": "8:2, 3:162, 8:42, 48:16, 60:12"
            },
            {
                "id": 17530,
                "topic": "Taqwa: fear of God",
                "verses": "2:3, 2:190, 2:197-198, 2:204, 2:213, 2:224, 2:232, 2:234, 2:238, 2:279, 2:283-284, 3:16, 3:51, 3:77, 3:103, 3:131, 3:201, 4:2, 4:10, 4:132, 5:3, 5:5, 5:8-9, 5:12, 5:36, 5:58, 5:89, 5:94, 5:97, 5:113, 6:70, 6:73, 7:27, 7:36, 7:66, 8:2, 8:70, 9:7, 9:108, 9:109, 11:79, 15:70, 20:133, 22:2, 22:33, 22:38, 26:109, 26:133, 26:185, 33:56, 33:71, 43:64, 47:18, 48:27, 49:4, 49:11, 49:13, 57:29, 58:10, 59:19, 60:12, 65:2, 65:11, 74:57, 78:32, 96:13"
            },
            {
                "id": 18389,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "8:2, 8:42, 8:70, 33:51"
            }
        ],
        "ar": "مَاۤ  اَفَآءَ  اللّٰہُ  عَلٰی رَسُوۡلِہٖ  مِنۡ  اَہۡلِ الۡقُرٰی  فَلِلّٰہِ  وَ لِلرَّسُوۡلِ وَ  لِذِی الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ ابۡنِ السَّبِیۡلِ ۙ کَیۡ لَا یَکُوۡنَ  دُوۡلَۃًۢ  بَیۡنَ الۡاَغۡنِیَآءِ مِنۡکُمۡ ؕ وَ مَاۤ  اٰتٰٮکُمُ الرَّسُوۡلُ  فَخُذُوۡہُ ٭ وَ مَا نَہٰٮکُمۡ  عَنۡہُ فَانۡتَہُوۡا ۚ وَ  اتَّقُوا اللّٰہَ ؕ اِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ۘ﴿۸﴾ ",
        "ur": "اللہ نے بعض بستیوں کے باشندوں (کے اموال میں) سے اپنے رسول کو جو بطور غنیمت عطا کیا ہے تو وہ اللہ کے لئے اور رسول کے لئے ہے اور اقرباء، یتامیٰ اور مسکینوں اور مسافروں کے لئے۔ تا ایسا نہ ہو کہ یہ (مالِ غنیمت) تمہارے امراءہی کے دائرے میں چکر لگاتا رہے۔ اور رسول جو تمہیں عطا کرے تو اسے لے لو اور جس سے تمہیں روکے اُس سے رُک جاؤ اور اللہ کا تقویٰ اختیار کرو۔ یقیناً اللہ سزا دینے میں بہت سخت ہے۔",
        "v5": {
            "text": "Whatever Allah has given to His Messenger as spoils[a] from the people of the towns is for Allah and for the Messenger and for the near of kin and the orphans and the needy and the wayfarer, that it may not circulate <i>only</i> among those of you who are rich. And whatsoever the Messenger gives you, take it[b]; and whatsoever he forbids you, abstain from it. And fear Allah; surely, Allah is Severe in retribution.[4194]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:2, 42."
                },
                {
                    "ref": "b",
                    "note": "47:34; 49:8."
                },
                {
                    "ref": "4194",
                    "note": "<p><strong>Important Words:</strong></p><p>دولة (to circulate) is derived from دال. They say دالت الایام i.e. the days came round in their turns. دالت له الدولة means, good fortune came to him i.e. the turn of fortune was his. داول اللّٰه الایام بین الناس means, God made days to compound among men in turns. دولة (<i>daulatun</i>) as also دولة (<i>dulatun</i>) means, a turn of good fortune; a turn to share in wealth and to prevail in war; a turn of taking a thing. Or دولة (<i>dulatun</i>) is in wealth and دولة (<i>daulatun</i>) is in war; according to some the former signifies a thing that is taken by turns and the latter the act of taking by turns and a transition from one state to another. Or the former relates to the next world and the latter to the present world and it is said that the former signifies the transition of wealth from one people to another and the latter, prevalence, predominance or victory (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse deals with the subject as to how فییء should be spent. As فییء consists of such booty as is attained without difficulty or labour and accrues to Muslims without war, the soldiers have no share in it and the whole of it forms part of the public treasury to be spent as mentioned in the verse.</p><p>Where soldiers are paid by the State, all spoils of war go to the public treasury i.e. <i>Baitu1-Mal</i>. Islam being a great advocate and protagonist of the cause of the poor and supporter and protector of their interests, the verse incidentally lays down the principle that the circulation of wealth should not remain continued to the privileged and propertied class. As an individual’s health requires that his physical needs be reasonably met, a society’s health requires that material goods be widely distributed and wealth be in easy circulation. This is the basic principle of Muslim economics and nowhere did the Holy Prophet’s democratic thunder speak with greater force or clarity than in this field. Finding humanity ground down under the tyranny of vested interests, he propounded measures that broke the barriers of economic caste and enormously reduced the injustices of special privilege. The main principle of Muslim economics is that the wealth of the people be widely shared. Islam does not oppose the profit motive or economic competition. It does not discourage a man from working harder than his neighbour, nor does it object to his earning a large income. It simply insists that acquisitiveness and competition be balanced by fair play and compassion. Since human nature automatically takes care of the former, it falls to social laws to safeguard the latter. The Zakah is Islam’s basic device for institutionalizing regard for others, but it is supplemented by a number of other measures (<i>The Religions of Man</i> by Huston Smith).</p><p>The words, \"whatever the Messenger gives you, take it,\" shows conclusively that the <i>Sunnah</i> forms an integral part of the Islamic Law.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 4720,
                "topic": "Bounty: seek Allah’s",
                "verses": "62:11, 5:3, 16:15, 17:13, 17:67, 30:24, 35:13, 45:13, 73:21"
            },
            {
                "id": 8094,
                "topic": "Grace: <i>Fadl</i>: bestowed on believers",
                "verses": "62:11, 2:65, 3:104, 4:84, 4:114, 4:174, 4:176, 5:55, 14:41, 20:123, 24:11, 24:15, 24:21, 24:22, 27:17, 27:41, 34:11, 37:58, 42:27, 48:30, 49:9, 52:30, 57:22, 59:7, 62:5, 68:3"
            },
            {
                "id": 15759,
                "topic": "Ridwan: Allah’s pleasure",
                "verses": "5:17, 3:16, 3:163, 3:175, 5:3, 9:21, 9:72, 9:109, 47:29, 57:21, 57:28"
            },
            {
                "id": 17136,
                "topic": "Spoils: <i>Anfal</i>",
                "verses": "8:2, 3:162, 8:42, 48:16, 60:12"
            },
            {
                "id": 18389,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "8:2, 8:42, 8:70, 33:51"
            }
        ],
        "ar": "لِلۡفُقَرَآءِ  الۡمُہٰجِرِیۡنَ  الَّذِیۡنَ  اُخۡرِجُوۡا  مِنۡ  دِیَارِہِمۡ وَ اَمۡوَالِہِمۡ یَبۡتَغُوۡنَ  فَضۡلًا مِّنَ اللّٰہِ  وَ رِضۡوَانًا وَّ یَنۡصُرُوۡنَ اللّٰہَ وَ رَسُوۡلَہٗ ؕ اُولٰٓئِکَ ہُمُ الصّٰدِقُوۡنَ ۚ﴿۹﴾ ",
        "ur": "اُن درویش مہاجرین کے لئے بھی ہے جو اپنے گھروں سے نکالے گئے اور اپنے اموال سے (الگ کئے گئے)۔ وہ اللہ ہی سے فضل اور اس کی رضا چاہتے ہیں اور اللہ اور اس کے رسول کی مدد کرتے ہیں۔ یہی ہیں وہ جو سچے ہیں۔",
        "v5": {
            "text": "<i>These spoils are</i> for the poor Refugees who have been driven out from their homes and their possessions while seeking grace from Allah and <i>His</i> pleasure,[a] and helping Allah and His Messenger. These it is who are true <i>in their faith</i>.[4195]",
            "notes": [
                {
                    "ref": "a",
                    "note": "5:3; 48:30."
                },
                {
                    "ref": "4195",
                    "note": "<p><strong>Commentary:</strong></p><p>الفقراء seems to be case in apposition to the categories of recipients of the فییء mentioned in the preceding verse. From Hadith it appears that the poor Refugees were the greatest beneficiaries from فییء obtained from Banu Nadir.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 825,
                "topic": "Affection",
                "verses": "48:30, 3:104, 5:55, 8:64"
            },
            {
                "id": 2725,
                "topic": "Ansar: helpers",
                "verses": "2:271, 3:53, 3:193, 8:75, 9:100, 9:117, 61:15, 71:26"
            },
            {
                "id": 12024,
                "topic": "Moral Traits: selflessness",
                "verses": "2:208, 2:263, 11:52, 64:17, 76:9-10, 92:20-21"
            },
            {
                "id": 17311,
                "topic": "Success: <i>Fauz</i>, <i>Ghalabah</i>",
                "verses": "23:2, 3:186, 4:14, 4:74, 5:57, 9:1, 9:20, 9:72, 9:89, 9:100, 9:111, 10:10, 24:53, 33:72, 37:61, 39:62, 40:10, 47:6, 58:23, 61:13, 78:32"
            },
            {
                "id": 17336,
                "topic": "Success: <i>Falah</i>, believers, obedient, shall achieve",
                "verses": "3:201, 2:6, 2:190, 3:105, 3:131, 5:36, 5:91, 5:101, 7:9, 7:70, 7:158, 8:46, 9:88, 20:65, 22:78, 23:2, 23:103, 24:32, 24:52, 28:68, 30:39, 31:6, 62:11, 64:17, 87:15, 91:10"
            },
            {
                "id": 18389,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "8:2, 8:42, 8:70, 33:51"
            }
        ],
        "ar": "وَ الَّذِیۡنَ  تَبَوَّؤُ الدَّارَ وَ الۡاِیۡمَانَ مِنۡ قَبۡلِہِمۡ یُحِبُّوۡنَ مَنۡ  ہَاجَرَ  اِلَیۡہِمۡ وَ لَا یَجِدُوۡنَ  فِیۡ صُدُوۡرِہِمۡ حَاجَۃً  مِّمَّاۤ اُوۡتُوۡا وَ یُؤۡثِرُوۡنَ  عَلٰۤی  اَنۡفُسِہِمۡ وَ لَوۡ کَانَ بِہِمۡ خَصَاصَۃٌ ؕ۟ وَ مَنۡ یُّوۡقَ شُحَّ نَفۡسِہٖ  فَاُولٰٓئِکَ ہُمُ  الۡمُفۡلِحُوۡنَ ۚ﴿۱۰﴾ ",
        "ur": "اور وہ لوگ جنہوں نے ان سے پہلے ہی گھر تیار کر رکھے تھے اور ایمان کو (دلوں میں) جگہ دی تھی وہ ان سے محبت کرتے تھے جو ہجرت کرکے ان کی طرف آئے اور اپنے سینوں میں اس کی کچھ حاجت نہیں پاتے تھے جو اُن (مہاجروں) کو دیا گیا اور خود اپنی جانوں پر دوسروں کو ترجیح دیتے تھے باوجود اس کے کہ انہیں خود تنگی درپیش تھی۔ پس جو کوئی بھی نفس کی خساست سے بچایا جائے تو یہی وہ لوگ ہیں جو کامیاب ہونے والے ہیں۔",
        "v5": {
            "text": "And <i>for</i> those who had established <i>their</i> home <i>in this city</i> and <i>had accepted</i> the faith before them, they love those who come to them for refuge, and find not in their breasts any desire for that which is given them (Refugees), but prefer <i>the Refugees</i> alone themselves, even though poverty be their <i>own lot</i>. And whoso is rid of the covetousness of his own soul—it is these who will be successful.[a] [4196]",
            "notes": [
                {
                    "ref": "a",
                    "note": "64:17."
                },
                {
                    "ref": "4196",
                    "note": "<p><strong>Important Words:</strong></p><p>حاجة (desire) is derived from حاج which means, he was or became poor; he desired, sought or sought after. حاج و احتاج الیهmeans, he needed it. حاجة means, want, need, necessity; a thing wanted; an object of want; desire (Lane &amp; Aqrab).</p><p>خصاصة (poverty) is inf. noun from خص which means, he was or became poor, in a state of poverty. خصاصة means, poverty, need; straightness or difficulty; an evil state or condition; thirst; hunger (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>Whereas the preceding verse constituted an eloquent commentary on the sincerity and devotion of the Refugees (مھاجرین)to their faith, in that they left their hearths and homes for the sake of God and his Messenger, the verse under comment embodies a great testimonial to the spirit of self-sacrifice, hospitality and goodwill of the Helpers (انصار). The Refugees from Mecca came to the Helpers, deprived and denuded of all their possessions, and the latter received them with open arms and made them equal partners in their belongings. The bond of love and brotherhood which the Holy Prophet established between the Refugees and the Helpers, and to which this verse bears an eloquent testimony, stands unrivalled in the whole history of human relationships. The verse may have special reference to the Helpers having foregone their share in the spoils that accrued to Muslims from the Jewish tribe of Banu Nadir.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 825,
                "topic": "Affection",
                "verses": "48:30, 3:104, 5:55, 8:64"
            },
            {
                "id": 3566,
                "topic": "Attributes of Allah: Ar-Ra’uf (The Compassionate)",
                "verses": "3:31, 2:208, 9:117, 24:21, 57:10"
            },
            {
                "id": 4263,
                "topic": "Believers: <i>Mu’min</i>: are brothers",
                "verses": "3:104, 9:11, 15:48, 33:6, 49:11"
            },
            {
                "id": 7785,
                "topic": "Forgiveness: <i>‘Afw</i>: prayers for",
                "verses": "3:194-195, 2:287, 3:17, 3:148, 11:48, 14:42, 23:110, 23:119, 26:83, 66:9"
            },
            {
                "id": 14130,
                "topic": "Prayers of the Holy Qur’an: for forgiveness",
                "verses": "3:17, 2:286-287, 3:148, 3:194-195, 7:24, 7:150, 7:152, 7:156-157, 11:48, 12:102, 18:11, 21:88, 23:95, 23:110, 23:119, 25:66-67, 28:17, 35:38, 38:36, 40:8, 66:9, 71:27-29"
            },
            {
                "id": 14145,
                "topic": "Prayers of the Holy Qur’an: for deliverance",
                "verses": "2:287, 3:192, 4:76, 10:86-87, 21:84, 21:88-89, 23:98-9, 25:66-67, 26:170, 28:22, 38:42, 40:8-10, 66:12"
            },
            {
                "id": 18389,
                "topic": "War: <i>Qital</i>: spoils of",
                "verses": "8:2, 8:42, 8:70, 33:51"
            }
        ],
        "ar": "وَ الَّذِیۡنَ جَآءُوۡ مِنۡۢ  بَعۡدِہِمۡ یَقُوۡلُوۡنَ رَبَّنَا  اغۡفِرۡ لَنَا وَ لِاِخۡوَانِنَا  الَّذِیۡنَ سَبَقُوۡنَا بِالۡاِیۡمَانِ وَ لَا تَجۡعَلۡ  فِیۡ قُلُوۡبِنَا غِلًّا  لِّلَّذِیۡنَ  اٰمَنُوۡا  رَبَّنَاۤ  اِنَّکَ رَءُوۡفٌ  رَّحِیۡمٌ ﴿٪۱۱﴾",
        "ur": "اور جو لوگ اُن کے بعد آئے وہ کہتے ہیں کہ اے ہمارے ربّ! ہمیں بخش دے اور ہمارے اُن بھائیوں کو بھی جو ایمان میں ہم پر سبقت لے گئے اور ہمارے دلوں میں اُن لوگوں کے لئے جو ایمان لائے کوئی کینہ نہ رہنے دے۔ اے ہمارے ربّ! یقینا تو بہت شفیق (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "And <i>the spoils are also for</i> those who came after them. They say, ‘Our Lord, forgive us and our brothers who preceded us in the faith, and leave not in our hearts any rancour against those who believe. Our Lord! Thou art indeed Compassionate, Merciful.’[4197]",
            "notes": [
                {
                    "ref": "4197",
                    "note": "<p><strong>Commentary:</strong></p><p>The words \"those who came after them,\" may apply to the Refugees who came later to Medina, or to all the coming generations of Muslims, or particularly to the followers of the Promised Messiah to whom a pointed reference is made in 62:3.</p><p>The later generations of Muslims have been commanded here to pray for their brethren in Faith of earlier generations and to pray also that their own hearts be completely cleansed of all bitterness and spite towards true and sincere Muslims. What a beautiful recipe by which Muslims can become cemented into a well-knit community!</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 9089,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 37:8, 47:24, 57:14-16"
            },
            {
                "id": 11184,
                "topic": "Medinah: <i>Yathrib</i>",
                "verses": "8:31, 9:74, 9:101, 9:120, 17:81, 33:14, 33:61, 63:9"
            },
            {
                "id": 18726,
                "topic": "Witness: Allah bears witness",
                "verses": "4:136, 3:82, 2:205, 3:19, 4:80, 4:167, 10:30, 13:44, 17:97, 29:53, 33:56, 34:48, 41:54, 46:9, 48:29, 58:7, 63:2, 85:10"
            }
        ],
        "ar": "اَلَمۡ  تَرَ  اِلَی الَّذِیۡنَ نَافَقُوۡا یَقُوۡلُوۡنَ لِاِخۡوَانِہِمُ  الَّذِیۡنَ کَفَرُوۡا مِنۡ  اَہۡلِ الۡکِتٰبِ  لَئِنۡ  اُخۡرِجۡتُمۡ  لَنَخۡرُجَنَّ مَعَکُمۡ  وَ لَا  نُطِیۡعُ  فِیۡکُمۡ  اَحَدًا  اَبَدًا ۙ وَّ اِنۡ  قُوۡتِلۡتُمۡ  لَنَنۡصُرَنَّکُمۡ ؕ وَ اللّٰہُ  یَشۡہَدُ  اِنَّہُمۡ   لَکٰذِبُوۡنَ ﴿۱۲﴾ ",
        "ur": "کیا تُو نے ان کی طرف نظر نہیں دوڑائی جنہوں نے نفاق کیا۔ وہ اہل کتاب میں سے اپنے ان بھائیوں سے جنہوں نے کفر کیا کہتے ہیں کہ اگر تم نکال دیئے گئے تو تمہارے ساتھ ہم بھی ضرور نکلیں گے اور تمہارے بارے میں کبھی کسی کی اطاعت نہیں کریں گے اور اگر تمہارے خلاف لڑائی کی گئی تو ہم ضرور تمہاری مدد کریں گے۔ اور اللہ گواہی دیتا ہے کہ یقینا وہ جھوٹے ہیں۔",
        "v5": {
            "text": "Hast thou not seen those who are hypocrites? They say to their brethren who disbelieve among the People of the Book, ‘If you are turned out, we will surely go out with you, and we will never obey anyone against you: and if you are fought against, we will certainly help you.’ But Allah bears witness that surely they are liars.[4198]",
            "notes": [
                {
                    "ref": "4198",
                    "note": "<p><strong>Commentary:</strong></p><p>A hypocrite is a liar and a coward. He is completely unreliable and devoid of all honour. The hypocrites of Medina had urged the Jews of Medina to defy the Holy Prophet and break their plighted word with him, holding out to them false promises of help and succour in time of need. But when relying upon their promises the Jews defied the Prophet and he, in order to punish them, marched against them, the Hypocrites left them in the lurch.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 9089,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 37:8, 47:24, 57:14-16"
            },
            {
                "id": 11184,
                "topic": "Medinah: <i>Yathrib</i>",
                "verses": "8:31, 9:74, 9:101, 9:120, 17:81, 33:14, 33:61, 63:9"
            }
        ],
        "ar": "لَئِنۡ  اُخۡرِجُوۡا لَا یَخۡرُجُوۡنَ  مَعَہُمۡ ۚ وَ لَئِنۡ  قُوۡتِلُوۡا  لَا یَنۡصُرُوۡنَہُمۡ ۚ وَ لَئِنۡ نَّصَرُوۡہُمۡ  لَیُوَلُّنَّ  الۡاَدۡبَارَ ۟  ثُمَّ لَا یُنۡصَرُوۡنَ ﴿۱۳﴾ ",
        "ur": "اگر وہ نکال دیئے گئے تو ان کے ساتھ یہ نہیں نکلیں گے اور اگر ان سے لڑائی کی گئی تو یہ کبھی ان کی مدد نہیں کریں گے اور اگر یہ ان کی مدد کریں گے بھی تو ضرور پیٹھ دکھا جائیں گے پھر اُن کی کوئی مدد نہ کی جائے گی۔",
        "v5": {
            "text": "If they are turned out, they will never go out with them; and if they are fought against they will never help them. And even if they help them, they will assuredly turn <i>their</i> backs;[a] and then they shall not be helped.[4199]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:112."
                },
                {
                    "ref": "4199",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse, like vv. 15-16 below, is a sad commentary on the infidelity of the hypocrites. When the hour arrived for the Jews to be deservedly punished for their evil designs and deeds, the hypocrites of Medina did not raise a finger in their support. \"And,\" says the verse, \"if they had summoned up courage enough to come to the help of the Jews, they certainly would have suffered a most crushing and ignominious defeat.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 9089,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 37:8, 47:24, 57:14-16"
            },
            {
                "id": 11184,
                "topic": "Medinah: <i>Yathrib</i>",
                "verses": "8:31, 9:74, 9:101, 9:120, 17:81, 33:14, 33:61, 63:9"
            }
        ],
        "ar": "لَاَنۡتُمۡ  اَشَدُّ رَہۡبَۃً  فِیۡ  صُدُوۡرِہِمۡ  مِّنَ اللّٰہِ ؕ ذٰلِکَ بِاَنَّہُمۡ  قَوۡمٌ لَّا یَفۡقَہُوۡنَ ﴿۱۴﴾ ",
        "ur": "تم یقیناً اُنکے سینوں میں خوف طاری کرنے کے اعتبار سے اللہ سے زیادہ سخت (دکھائی دیتے) ہو۔ یہ اس وجہ سے ہے کہ وہ ایک ایسی قوم ہیں جو سمجھتے نہیں۔",
        "v5": {
            "text": "Of a truth, they have greater fear of you in their hearts than of Allah.[b] That is because they are a people who are devoid of <i>all</i> reason.",
            "notes": [
                {
                    "ref": "b",
                    "note": "4:78."
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 8513,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: sealed, veiled, rusted, blind, straitened",
                "verses": "53:12, 18:58, 2:8, 2:89, 4:156, 6:26, 6:47, 6:111, 7:101-102, 7:180, 9:87, 9:93, 9:110, 10:75, 11:13, 14:44, 15:98, 16:109, 17:47, 18:29, 22:47, 23:64, 26:14, 30:60, 40:36, 41:6, 42:25, 45:24, 47:17, 47:25, 63:4, 83:15"
            },
            {
                "id": 9089,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 37:8, 47:24, 57:14-16"
            },
            {
                "id": 9466,
                "topic": "Islam: enemies of",
                "verses": "5:34-35, 2:193, 3:120, 7:183, 22:16, 61:8, 88:3-8, 100:10-12"
            },
            {
                "id": 11184,
                "topic": "Medinah: <i>Yathrib</i>",
                "verses": "8:31, 9:74, 9:101, 9:120, 17:81, 33:14, 33:61, 63:9"
            },
            {
                "id": 14956,
                "topic": "Quraysh",
                "verses": "106:2, 2:74, 2:130, 2:218, 3:126, 8:31, 12:93, 21:41, 23:95, 26:215, 27:49, 30:5, 33:10, 48:2, 48:12, 53:21, 54:2, 54:10, 59:3, 60:2, 80:2, 106:5"
            }
        ],
        "ar": "لَا یُقَاتِلُوۡنَکُمۡ جَمِیۡعًا  اِلَّا فِیۡ  قُرًی مُّحَصَّنَۃٍ  اَوۡ مِنۡ  وَّرَآءِ  جُدُرٍ ؕ بَاۡسُہُمۡ بَیۡنَہُمۡ  شَدِیۡدٌ ؕ تَحۡسَبُہُمۡ جَمِیۡعًا وَّ قُلُوۡبُہُمۡ شَتّٰی ؕ ذٰلِکَ بِاَنَّہُمۡ  قَوۡمٌ لَّا یَعۡقِلُوۡنَ ﴿ۚ۱۵﴾ ",
        "ur": "وہ تم سے اکٹھے لڑائی نہیں کریں گے مگر قلعہ بند بستیوں میں یا پھر فصیلوں کے پرلی طرف سے۔ اُن کی لڑائی آپس میں بہت سخت ہے۔ تو انہیں اکٹھا سمجھتا ہے جبکہ ان کے دل پھٹے ہوئے ہیں۔ یہ اس لئے ہے کہ وہ ایک ایسی قوم ہیں جو عقل نہیں کرتے۔",
        "v5": {
            "text": "They will not fight you in a body except in fortified towns or from behind walls. Their fighting among themselves is severe. Thou thinkest them to be united, but their hearts are divided. That is because they are a people who have no sense.[4200]",
            "notes": [
                {
                    "ref": "4200",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means that disbelievers— particularly the Jews and the hypocrites of Medina—seem to present a false facade of unity against Islam, but as they have no common cause to fight for, and as their interests are diverse and divergent, there can possibly exist no real unity among them. There were three parties in Arabia who appeared to be united against the Islamic State—the Jews, the hypocrites of Medina and the pagan Quraish of Mecca. The Quraish found in the rising power of Islam a danger to their autocracy, the hypocrites (of whom ‘Abdullah bin Ubayy was the leader) to their domination in Medina, and the Jews to their organization and racial superiority. Having no common objective their seeming unity had no real basis and it never materialized in time of danger.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 9089,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 37:8, 47:24, 57:14-16"
            },
            {
                "id": 11184,
                "topic": "Medinah: <i>Yathrib</i>",
                "verses": "8:31, 9:74, 9:101, 9:120, 17:81, 33:14, 33:61, 63:9"
            },
            {
                "id": 11483,
                "topic": "Mischief: of disbelievers",
                "verses": "2:74, 3:64, 8:20, 8:74, 10:41, 27:49, 33:61, 44:16"
            },
            {
                "id": 13976,
                "topic": "Pledge",
                "verses": "74:39, 2:284, 3:77, 12:81, 43:51, 52:22"
            }
        ],
        "ar": "کَمَثَلِ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ قَرِیۡبًا ذَاقُوۡا وَبَالَ  اَمۡرِہِمۡ ۚ وَ  لَہُمۡ  عَذَابٌ  اَلِیۡمٌ ﴿ۚ۱۶﴾ ",
        "ur": "(یہ) ان لوگوں کی طرح (ہیں) جو اُن سے تھوڑا عرصہ پہلے اپنے اعمال کا وبال چکھ چکے ہیں اور ان کے لئے دردناک عذاب (مقدر) ہے۔",
        "v5": {
            "text": "<i>Their case is</i> like the <i>case of</i> those who have, a short time before them, tasted the evil consequences of their doings. And for them is a painful punishment.[4201]",
            "notes": [
                {
                    "ref": "4201",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference in the verse may be to the Quraish of Mecca who sustained an ignominious defeat at Badr or to BanuQainuqa‘ who were punished for their mischief and machinations after Badr. They were the first of the three Jewish tribes who broke their pledged word with the Holy Prophet and were banished from Medina one month after the Battle of Badr. They settled in Syria.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 3792,
                "topic": "Attributes of Allah: Rabbul-‘Alamin (Lord of all the worlds)",
                "verses": "1:2, 2:132, 5:29, 6:163, 7:55, 10:11, 26:24, 26:78, 28:31, 32:3, 37:183, 40:65, 41:10, 81:30"
            },
            {
                "id": 7461,
                "topic": "Fear: of Allah, <i>Khashi‘ah</i>",
                "verses": "8:49, 2:151, 5:4, 5:29, 5:45, 7:57, 9:13, 9:18, 9:109, 12:110, 13:22, 14:15, 16:52, 17:58, 20:4, 21:50, 23:3, 23:58, 23:61, 24:53, 33:38, 33:40, 35:19, 35:29-30, 36:12, 39:11, 39:21, 39:24, 49:2, 50:34, 55:47, 67:13, 79:27, 79:41, 79:46, 80:10, 87:11, 98:9"
            },
            {
                "id": 9089,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 37:8, 47:24, 57:14-16"
            }
        ],
        "ar": "کَمَثَلِ الشَّیۡطٰنِ اِذۡ قَالَ  لِلۡاِنۡسَانِ اکۡفُرۡ ۚ فَلَمَّا کَفَرَ  قَالَ  اِنِّیۡ  بَرِیۡٓءٌ مِّنۡکَ  اِنِّیۡۤ  اَخَافُ اللّٰہَ  رَبَّ الۡعٰلَمِیۡنَ ﴿۱۷﴾ ",
        "ur": "شیطان کی مثال کی طرح جب اس نے انسان سے کہا انکار کردے۔ پس جب اس نے انکار کردیا تو کہنے لگا کہ یقیناً میں تجھ سے بری الذمہ ہوں۔ یقیناً میں تو تمام جہانوں کے ربّ، اللہ سے ڈرتا ہوں۔",
        "v5": {
            "text": "<i>Or </i>[a]<i>it is</i> like <i>that of</i> Satan, when he says to man, ‘Disbelieve;’ but when he disbelieves, he says, ‘I have nothing to do with thee; I fear Allah, the Lord of the worlds.’[4202]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:49; 14:23."
                },
                {
                    "ref": "4202",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse mentions one more mark of a hypocrite. When relying upon his seductive promises his victim gets involved in trouble, he leaves him alone, disowning all responsibility for his misfortune.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 18,
        "v_": 17,
        "topics": [
            {
                "id": 9089,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 37:8, 47:24, 57:14-16"
            },
            {
                "id": 9800,
                "topic": "Jaza’: recompense: of disbelievers, Jews, wrongdoers, Satan",
                "verses": "6:147, 2:86, 2:104, 2:207, 3:88, 4:94, 4:135, 5:30, 5:34, 5:61, 6:140, 7:114, 7:153, 7:171, 9:26, 9:82, 9:95, 13:43, 17:64, 17:99, 18:107, 20:128, 39:25, 41:29, 48:17, 68:47"
            }
        ],
        "ar": "فَکَانَ عَاقِبَتَہُمَاۤ  اَنَّہُمَا فِی النَّارِ خَالِدَیۡنِ فِیۡہَا ؕ وَ ذٰلِکَ  جَزٰٓؤُا الظّٰلِمِیۡنَ ﴿٪۱۸﴾ ",
        "ur": "پس اُن دونوں کا انجام یہ ٹھہرا کہ وہ دونوں ہی آگ میں پڑیں گے۔ دونوں اس میں لمبا عرصہ رہنے والے ہوں گے۔ ظالموں کی یہی جزا ہوا کرتی ہے۔",
        "v5": {
            "text": "And the end of both will be that they will both be in the Fire, abiding therein. Such is the reward of the wrongdoers.",
            "notes": null
        }
    },
    {
        "ch": 59,
        "v": 19,
        "v_": 18,
        "topics": [
            {
                "id": 3329,
                "topic": "Attributes of Allah: Al-Khabir (All-Aware)",
                "verses": "6:104, 2:272, 4:36, 4:136, 5:9, 6:19, 6:74, 11:2, 17:18, 17:31, 22:64, 31:17, 33:35, 35:15, 35:32, 42:28, 49:14, 57:11, 58:14, 63:12, 64:9, 66:4, 67:15, 100:12"
            },
            {
                "id": 6853,
                "topic": "Duty: towards Allah",
                "verses": "8:30, 5:101, 9:44, 64:17, 71:4"
            },
            {
                "id": 17531,
                "topic": "Taqwa: fear of God",
                "verses": "2:3, 2:190, 2:197-198, 2:204, 2:213, 2:224, 2:232, 2:234, 2:238, 2:279, 2:283-284, 3:16, 3:51, 3:77, 3:103, 3:131, 3:201, 4:2, 4:10, 4:132, 5:3, 5:5, 5:8-9, 5:12, 5:36, 5:58, 5:89, 5:94, 5:97, 5:113, 6:70, 6:73, 7:27, 7:36, 7:66, 8:2, 8:70, 9:7, 9:108, 9:109, 11:79, 15:70, 20:133, 22:2, 22:33, 22:38, 26:109, 26:133, 26:185, 33:56, 33:71, 43:64, 47:18, 48:27, 49:4, 49:11, 49:13, 57:29, 58:10, 59:8, 60:12, 65:2, 65:11, 74:57, 78:32, 96:13"
            }
        ],
        "ar": "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اتَّقُوا اللّٰہَ  وَ لۡتَنۡظُرۡ  نَفۡسٌ مَّا قَدَّمَتۡ لِغَدٍ ۚ وَ اتَّقُوا اللّٰہَ ؕ اِنَّ اللّٰہَ  خَبِیۡرٌۢ   بِمَا تَعۡمَلُوۡنَ ﴿۱۹﴾ ",
        "ur": "اے وہ لوگو جو ایمان لائے ہو! اللہ کا تقویٰ اختیار کرو اور ہر جان یہ نظر رکھے کہ وہ کل کے لئے کیا آگے بھیج رہی ہے۔ اور اللہ کا تقویٰ اختیار کرو۔ یقیناً اللہ اس سے جو تم کرتے ہو ہمیشہ باخبر رہتا ہے۔",
        "v5": {
            "text": "[b]O ye who believe! fear Allah; and let <i>every</i> soul look to what it sends forth for the morrow. And fear Allah; verily Allah is Well-Aware of what you do.[4203]",
            "notes": [
                {
                    "ref": "b",
                    "note": "4:2; 33:71."
                },
                {
                    "ref": "4203",
                    "note": "<p><strong>Commentary:</strong></p><p>The root cause of all sin is neglect and negligence. The believers here are enjoined to take care of the morrow. And there could be no real moral or spiritual progress without a sure, sincere and true belief in God.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 7659,
                "topic": "Fisq: abhorrence, disobedience",
                "verses": "2:100, 2:283, 3:83, 3:111, 5:4, 5:48, 5:50, 5:60, 5:82, 5:109, 6:122, 6:146, 7:103, 7:146, 9:8, 9:24, 9:53, 9:67, 9:84, 9:96, 24:5, 24:56, 27:13, 28:33, 43:55, 46:36, 49:8, 51:47, 57:17, 57:28, 59:6, 61:6"
            }
        ],
        "ar": "وَ لَا تَکُوۡنُوۡا کَالَّذِیۡنَ نَسُوا اللّٰہَ فَاَنۡسٰہُمۡ  اَنۡفُسَہُمۡ ؕ اُولٰٓئِکَ ہُمُ الۡفٰسِقُوۡنَ ﴿۲۰﴾ ",
        "ur": "اور ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے اللہ کو بھلا دیا تو اللہ نے انہیں خود اپنے آپ سے غافل کردیا۔ یہی بدکردار لوگ ہیں۔",
        "v5": {
            "text": "And be not like those who forgot Allah,[a] so He has caused to forget their own souls. It is they that are the rebellious.[4204]",
            "notes": [
                {
                    "ref": "a",
                    "note": "9:67."
                },
                {
                    "ref": "4204",
                    "note": "<p><strong>Commentary:</strong></p><p>Man forgets God in three ways: (1) He rejects the very belief in the existence of God. (2) He has no real, true or living belief in a Supreme Being before Whom he shall have to render an account of his deeds (3) Forgetfulness. The inevitable and never-failing consequence of consigning God to oblivion is that man gets involved in matters which bring about his moral degradation and spiritual downfall, ending with loss of peace of mind.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 9234,
                "topic": "Inmates of Fire",
                "verses": "2:40, 2:82, 2:218, 2:258, 2:276, 3:117, 5:30, 7:37, 7:45, 7:48, 7:51, 10:28, 13:6, 39:9, 40:7, 40:44, 58:18, 64:11, 74:32"
            },
            {
                "id": 9248,
                "topic": "Inmates of Heaven",
                "verses": "7:43, 2:83, 7:45, 7:47, 7:51, 10:27, 11:24, 25:25, 36:56, 46:15, 46:17, 68:18"
            },
            {
                "id": 13642,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "لَا یَسۡتَوِیۡۤ  اَصۡحٰبُ النَّارِ وَ اَصۡحٰبُ الۡجَنَّۃِ ؕ اَصۡحٰبُ الۡجَنَّۃِ ہُمُ الۡفَآئِزُوۡنَ ﴿۲۱﴾ ",
        "ur": "آگ والے اور جنت والے کبھی برابر نہیں ہوسکتے۔ جنّتی ہی ہیں جو کامیاب ہونے والے ہیں۔",
        "v5": {
            "text": "The inmates of the Fire and the inmates of the Garden are not equal[b]. It is the inmates of the Garden that will triumph.[4205]",
            "notes": [
                {
                    "ref": "b",
                    "note": "38:29; 45:22."
                },
                {
                    "ref": "4205",
                    "note": "<p><strong>Commentary:</strong></p><p>The inmates of the Fire have been mentioned in the preceding verse and the inmates of the Garden in the verse before that. The present verse states that the two parties are not, and never can be, equal.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 22,
        "v_": 21,
        "topics": [
            {
                "id": 2137,
                "topic": "Allah: parables set forth by, <i>Amthal</i>",
                "verses": "13:18, 2:18, 2:27, 2:172, 2:262, 2:265, 7:177, 13:36, 14:19, 14:25-27, 14:46, 16:75-77, 16:113, 18:33, 22:74, 24:36, 25:40, 29:42, 29:44, 30:29, 30:59, 36:14, 39:28, 39:30, 43:9, 47:4, 47:16, 62:6, 66:11-12"
            },
            {
                "id": 10982,
                "topic": "Mankind: Qur’an and",
                "verses": "2:186, 10:58, 14:2, 17:90, 17:107, 18:55, 25:2, 29:44, 39:28, 39:42, 45:21"
            },
            {
                "id": 12171,
                "topic": "Mountains: <i>Jibal</i>",
                "verses": "7:172, 14:47, 16:82, 17:38, 19:91, 19:92, 33:73, 70:10, 101:6"
            },
            {
                "id": 13397,
                "topic": "Parable of: mountain humbled",
                "verses": null
            },
            {
                "id": 15059,
                "topic": "Qur’an: excellence, perfection of, <i>Ummul-Kitab</i>",
                "verses": "2:24, 2:3, 5:4, 6:156, 8:32, 10:38-40, 11:2, 11:14-15, 13:32, 14:25-26, 15:2, 17:89, 18:110, 21:11, 21:25, 25:2, 27:2, 29:52, 38:2, 38:30, 39:24, 43:5, 52:34-35, 73:6"
            },
            {
                "id": 15404,
                "topic": "Reflect: ponder, <i>Tafakkur</i>",
                "verses": "30:9, 2:220, 2:267, 4:83, 6:51, 7:177, 10:25, 13:4, 16:12, 16:45, 16:70, 27:63, 28:44, 30:22, 32:5, 34:47, 38:30, 39:43, 40:59, 45:14, 47:25, 51:50, 56:63"
            }
        ],
        "ar": "لَوۡ اَنۡزَلۡنَا ہٰذَا الۡقُرۡاٰنَ عَلٰی جَبَلٍ لَّرَاَیۡتَہٗ  خَاشِعًا مُّتَصَدِّعًا مِّنۡ خَشۡیَۃِ اللّٰہِ ؕ وَ تِلۡکَ الۡاَمۡثَالُ نَضۡرِبُہَا لِلنَّاسِ لَعَلَّہُمۡ یَتَفَکَّرُوۡنَ ﴿۲۲﴾ ",
        "ur": "اگر ہم نے اِس قرآن کو کسی پہاڑ پر اتارا ہوتا تو تُو ضرور دیکھتا کہ وہ اللہ کے خوف سے عجز اختیار کرتے ہوئے ٹکڑے ٹکڑے ہوجاتا۔ اور یہ تمثیلات ہیں جو ہم لوگوں کے لئے بیان کرتے ہیں تاکہ وہ تفکّر کریں۔",
        "v5": {
            "text": "If We had sent down this Quran on a mountain[c], thou wouldst certainly have seen it humbled and rent asunder for fear of Allah. And these are similitudes that We set forth for mankind that they may reflect.[4206]",
            "notes": [
                {
                    "ref": "c",
                    "note": "13:32."
                },
                {
                    "ref": "4206",
                    "note": "<p><strong>Commentary:</strong></p><p>Metaphorically, the word جبل signifies a big and proud man; the chief or leader of a people. In this sense of the word the verse would mean that the Quran contains such a sublime and powerful Message that it would make the heart of even a proud man melt. Or the verse may signify that the proud pagan Arabs whom no pre-Islamic teaching could wean from their polytheistic beliefs and idolatrous practices and who like a strong rock remained unmoved and firmly wedded to their Bedouin usages unaffected by the erosive influence of the glamour and glitter of the neighbouring Christian civilization, would be humbled before its sublime and powerful Message, and from their stony hearts would gush forth fountains of light and learning.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 1209,
                "topic": "Allah: attributes of, <i>Asma’ul-Husna</i>",
                "verses": "1:1, 1:7, 2:256, 7:181, 17:111, 20:9, 37:160-161, 112:2-5, See also Attributes of Allah"
            },
            {
                "id": 3004,
                "topic": "Attributes of Allah: Al-Ahad (The One, Unique)",
                "verses": "112:2, 2:164, 2:256, 4:172, 5:74, 16:23, 22:35, 37:5"
            },
            {
                "id": 3049,
                "topic": "Attributes of Allah: Al-‘Alim (All-Knowing)",
                "verses": "19:2, 2:116, 2:128, 2:138, 2:159, 2:182, 2:228, 2:245, 2:257, 2:262, 2:269, 2:274, 3:93, 4:12, 4:36, 4:71, 4:171, 6:14, 6:116, 9:15, 9:28, 15:87, 22:60, 24:22, 24:42, 33:41, 33:52, 34:27, 35:39, 35:45, 36:39, 40:3, 57:4, 57:7, 64:12"
            },
            {
                "id": 3529,
                "topic": "Attributes of Allah: Ar-Rahman (The Gracious, Beneficent)",
                "verses": "1:1, 1:3, 12:65, 13:31, 17:111, 19:45, 19:46, 19:59, 19:62, 19:86, 21:113, 25:61, 26:6, 27:31, 36:53, 41:3, 50:34, 55:2, 67:30, 78:39"
            },
            {
                "id": 3693,
                "topic": "Attributes of Allah: ‘Alimul-ghaibi washshahadah (Knower of Unseen and Seen)",
                "verses": "64:19, 5:110, 6:60, 6:74, 9:94, 13:10, 23:93, 32:7, 34:4, 39:47"
            },
            {
                "id": 18236,
                "topic": "Unseen: secret, hidden: Allah alone knows",
                "verses": "2:4, 27:66-67, 2:34, 5:110, 5:117, 6:60, 6:74, 9:78, 9:94, 10:21, 11:124, 13:10, 16:78, 18:27, 23:93, 32:7, 34:4, 34:49, 35:39, 39:47, 49:19, 53:36, 62:9, 64:19, 72:27"
            }
        ],
        "ar": "ہُوَ اللّٰہُ  الَّذِیۡ  لَاۤ  اِلٰہَ  اِلَّا ہُوَ ۚ عٰلِمُ الۡغَیۡبِ وَ الشَّہَادَۃِ ۚ ہُوَ  الرَّحۡمٰنُ الرَّحِیۡمُ ﴿۲۳﴾ ",
        "ur": "وہی اللہ ہے جس کے سوا اور کوئی معبود نہیں۔ غیب کا جاننے والا ہے اور حاضر کا بھی۔ وہی ہے جو بِن مانگے دینے والا، بے انتہا رحم کرنے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "He is Allah, and there is no God beside Him, the Knower of the unseen and the seen.[a] He is the Gracious, the Merciful.[4207]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:74; 9:94; 13:10; 64:19."
                },
                {
                    "ref": "4207",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means that the Quran, before whose powerful Message even tall and firm mountains would crumble and fall, has been revealed by God Whose attributes are inimitable and matchless. He knows everything and nothing is hidden from Him. He provides his creatures, out of His bountiful grace and mercy, and not in return for anything done by them, all the means of their development and progress even before they are born.</p>"
                }
            ]
        }
    },
    {
        "ch": 59,
        "v": 24,
        "v_": 23,
        "topics": [
            {
                "id": 772,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: Glory be to Allah",
                "verses": "12:109, 2:33, 2:117, 3:192, 4:172, 5:117, 6:101, 7:144, 9:31, 10:11, 10:19, 10:69, 16:2, 16:58, 17:2, 17:44, 17:94, 17:109, 19:36, 21:23, 21:27, 21:88, 23:92, 24:17, 25:19, 27:9, 28:69, 30:18, 30:41, 34:42, 36:37, 36:84, 37:160, 37:181, 39:5, 39:68, 43:83, 52:44, 68:30"
            },
            {
                "id": 1209,
                "topic": "Allah: attributes of, <i>Asma’ul-Husna</i>",
                "verses": "1:1, 1:7, 2:256, 7:181, 17:111, 20:9, 37:160-161, 112:2-5, See also Attributes of Allah"
            },
            {
                "id": 1708,
                "topic": "Allah: has no partners",
                "verses": "6:164, 3:65, 3:152, 4:37, 4:49, 6:15, 6:80, 6:82, 6:101, 7:34, 7:191, 10:19, 12:39, 13:17, 13:34, 13:37, 16:2, 16:4, 17:112, 18:43, 18:111, 22:32, 23:60, 23:93, 25:3-4, 28:69, 30:41, 39:68, 40:43, 40:85"
            },
            {
                "id": 3004,
                "topic": "Attributes of Allah: Al-Ahad (The One, Unique)",
                "verses": "112:2, 2:164, 2:256, 4:172, 5:74, 16:23, 22:35, 37:5"
            },
            {
                "id": 3085,
                "topic": "Attributes of Allah: Al-‘Aziz (The Mighty)",
                "verses": "4:57, 2:130, 2:210, 2:221, 2:229, 3:7, 3:19, 4:159, 4:166, 9:40, 9:71, 14:2, 16:61, 22:41, 22:75, 26:192, 27:10, 27:79, 33:26, 34:7, 35:29, 38:10, 38:67, 40:3, 45:3, 46:3, 48:8, 48:20, 59:2, 61:2, 62:2, 64:19"
            },
            {
                "id": 3291,
                "topic": "Attributes of Allah: Al-Jabbar (The Subduer, Compeller)",
                "verses": null
            },
            {
                "id": 3359,
                "topic": "Attributes of Allah: Al-Malik (The Sovereign)",
                "verses": "1:4, 20:115, 22:57, 23:117, 25:27, 54:56, 62:2, 114:3"
            },
            {
                "id": 3379,
                "topic": "Attributes of Allah: Al-Muhaimin (The Protector)",
                "verses": null
            },
            {
                "id": 3406,
                "topic": "Attributes of Allah: Al-Mu’min (Bestower of Security)",
                "verses": null
            },
            {
                "id": 3436,
                "topic": "Attributes of Allah: Al-Mutakabbir (The Exalted)",
                "verses": null
            },
            {
                "id": 3487,
                "topic": "Attributes of Allah: Al-Quddus (The Holy One)",
                "verses": "62:2"
            },
            {
                "id": 3575,
                "topic": "Attributes of Allah: As-Salam (Source of Peace)",
                "verses": null
            }
        ],
        "ar": "ہُوَ اللّٰہُ  الَّذِیۡ  لَاۤ  اِلٰہَ  اِلَّا ہُوَ ۚ اَلۡمَلِکُ الۡقُدُّوۡسُ السَّلٰمُ  الۡمُؤۡمِنُ الۡمُہَیۡمِنُ الۡعَزِیۡزُ  الۡجَبَّارُ  الۡمُتَکَبِّرُ ؕ سُبۡحٰنَ اللّٰہِ عَمَّا  یُشۡرِکُوۡنَ ﴿۲۴﴾ ",
        "ur": "وہی اللہ ہے جس کے سوا اور کوئی معبود نہیں۔ وہ بادشاہ ہے، پاک ہے، سلام ہے، امن دینے والا ہے، نگہبان ہے، کامل غلبہ والا ہے، ٹوٹے کام بنانے والا ہے (اور) کبر یائی والا ہے۔ پاک ہے اللہ اُس سے جو وہ شرک کرتے ہیں۔",
        "v5": {
            "text": "He is Allah, and there is no God beside Him, the Sovereign, the Holy One,[b] the Source of Peace, the Bestower of Security, the Protector, the Mighty, the Subduer, the Exalted. Holy is Allah <i>far</i> above that which they associate <i>with Him</i>.[4208]",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:181; 20:9; 62:2."
                },
                {
                    "ref": "4208",
                    "note": "<p><strong>Commentary:</strong></p><p>God is the King Who is free from every fault, defect, or deficiency. He is the Source of all peace, and the Granter of safety and security. He is Guardian over all, overcoming every power, the Mender of every breakage and the Restorer of every loss; and He is above every need and is the Besought of all.</p>"
                }
            ]
        }
    }
]
