[
    {
        "ch": 37,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[3270]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See1:1."
                },
                {
                    "ref": "3270",
                    "note": "<p><strong>Commentary:</strong></p><p>See. 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 6204,
                "topic": "Debate",
                "verses": "2:112, 3:62, 10:51, 16:126, 22:68, 25:53, 29:47, 38:70, 103:4"
            },
            {
                "id": 13132,
                "topic": "Oaths: <i>yamin</i>: of Allah",
                "verses": "4:66, 15:73, 15:93, 16:57, 16:64, 36:3, 38:2, 43:2-3, 44:2-3, 50:2, 51:2-8, 51:24, 52:2-7, 53:2, 56:76, 68:2, 69:39, 69:40, 70:41, 74:33, 74:35, 75:2-3, 77:2-6, 79:2-6, 81:16-19, 84:17-19, 85:2-4, 86:2, 86:12-13, 89:2-5, 90:2, 90:4, 91:2-8, 92:2-4, 93:2-3, 95:2-4, 100:2, 103:2-3"
            },
            {
                "id": 13196,
                "topic": "Oaths: <i>yamin</i>: Quranic",
                "verses": "52:2-7, 91:2-8"
            },
            {
                "id": 13876,
                "topic": "Philosophy: of oaths",
                "verses": null
            },
            {
                "id": 15960,
                "topic": "Rows: <i>Saff</i>",
                "verses": "61:5, 18:49, 20:65, 78:39, 89:23"
            },
            {
                "id": 16065,
                "topic": "Salah: during journey, war",
                "verses": "4:102-104, 2:240"
            }
        ],
        "ar": "وَ الصّٰٓفّٰتِ  صَفًّا ۙ﴿۲﴾ ",
        "ur": "قطار در قطار صف بندی کرنے والی (فوجوں) کی قسم۔",
        "v5": {
            "text": "By those who range themselves in close ranks,[3271]",
            "notes": [
                {
                    "ref": "3271",
                    "note": "<p><strong>Important Words:</strong></p><p>و (by) means, also; then; while; during; at the same time, together; with; but; however. It is also synonymous with رب(<i>rubba</i>) i.e. frequently; sometimes, perhaps. It is also a particle of swearing meaning, 'by' or 'I swear' or 'I cite as witness.' (Aqrab &amp; Lane).و has been used in the present and the next two verses in the sense of 'by' or 'I swear' or 'I cite as witness.'</p><p>The words الصافات صفا (who range themselves in close ranks) may signify: (1) Muslims standing in close rows behind their Imam in the five daily Prayers, or (2) Muslims who stand in battle array facing the enemy.</p><p>For a collective explanatory note on this and the next two verses see v. 4.</p><p><strong>Commentary:</strong></p><p>In this and the next two verses, God has sworn by certain beings or things or has cited them as witnesses. Ordinarily, when a person takes an oath, his object is to supply the deficiency of insufficient testimony or to add weight or conviction to his assertion. In fact, by so doing he calls God to witness that he speaks the truth, when there is no witness in the case. But such is not the case with the Quranic oaths. When the Quran adopts such a form, the truth of the statement it makes is not sought to be proved by a mere allegation but by a solid argument implied in the oath itself. Sometimes, these oaths refer to the obvious laws of nature and by implication draw attention to what may be inferred from what is obvious. Another object of a Quranic oath is to make a prophecy the fulfilment of which establishes its truth. For a collective note on this and the next verse see v. 4 below.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 6204,
                "topic": "Debate",
                "verses": "2:112, 3:62, 10:51, 16:126, 22:68, 25:53, 29:47, 38:70, 103:4"
            },
            {
                "id": 13132,
                "topic": "Oaths: <i>yamin</i>: of Allah",
                "verses": "4:66, 15:73, 15:93, 16:57, 16:64, 36:3, 38:2, 43:2-3, 44:2-3, 50:2, 51:2-8, 51:24, 52:2-7, 53:2, 56:76, 68:2, 69:39, 69:40, 70:41, 74:33, 74:35, 75:2-3, 77:2-6, 79:2-6, 81:16-19, 84:17-19, 85:2-4, 86:2, 86:12-13, 89:2-5, 90:2, 90:4, 91:2-8, 92:2-4, 93:2-3, 95:2-4, 100:2, 103:2-3"
            }
        ],
        "ar": "فَالزّٰجِرٰتِ  زَجۡرًا ۙ﴿۳﴾ ",
        "ur": "پھر اُن کی جو للکارتے ہوئے ڈپٹنے والیاں ہیں۔",
        "v5": {
            "text": "<i>And</i> They drive away the enemy vigorously,[3272]",
            "notes": [
                {
                    "ref": "3272",
                    "note": "<p><strong>Important Words:</strong></p><p>الزاجرات زجرا (who drive away the enemy vigorously) may signify: (a) Muslims who wage a relentless war against their evil passions; or (b) Muslims who fight and drive away the enemy of Islam vigorously or (c) the custodians of law and order.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 6204,
                "topic": "Debate",
                "verses": "2:112, 3:62, 10:51, 16:126, 22:68, 25:53, 29:47, 38:70, 103:4"
            },
            {
                "id": 6370,
                "topic": "Dhikr: Qur’an as, reminder",
                "verses": "38:2, 3:59, 6:91, 11:121, 15:7, 15:10, 16:45, 20:100, 21:25, 21:51, 29:52, 36:70, 38:9, 38:50, 38:88, 41:42, 43:45, 54:26, 65:11, 68:52-53, 74:32, 77:6, 81:28"
            },
            {
                "id": 13132,
                "topic": "Oaths: <i>yamin</i>: of Allah",
                "verses": "4:66, 15:73, 15:93, 16:57, 16:64, 36:3, 38:2, 43:2-3, 44:2-3, 50:2, 51:2-8, 51:24, 52:2-7, 53:2, 56:76, 68:2, 69:39, 69:40, 70:41, 74:33, 74:35, 75:2-3, 77:2-6, 79:2-6, 81:16-19, 84:17-19, 85:2-4, 86:2, 86:12-13, 89:2-5, 90:2, 90:4, 91:2-8, 92:2-4, 93:2-3, 95:2-4, 100:2, 103:2-3"
            }
        ],
        "ar": "فَالتّٰلِیٰتِ  ذِکۡرًا  ۙ﴿۴﴾",
        "ur": "پھر ذکر بلند کرنے والیوں کی۔",
        "v5": {
            "text": "<i>And</i> they recite the Reminder—<i>the Quran</i>[3273]",
            "notes": [
                {
                    "ref": "3273",
                    "note": "<p><strong>Important Words:</strong></p><p>التالیات ذکرا (who recite the Reminder—the Quran) may refer to Muslims reciting the Quran regularly.</p><p><strong>Commentary:</strong></p><p>The description given in this and the preceding two verses may apply to believers and as such the clause, \"those who range themselves in close rows,\" may signify the believers who stand in rows behind their Imam in the five daily Prayers or those who stand in battle array facing the enemy. The next verse, \"and they drive away the enemy vigorously,\" may refer to the believers who wage a veritable war against their own passions, and keep them under restraint, or to believers who hold the enemy effectively in check. And the words \"and they recite the Reminder—the Quran\" may mean Muslims who recite the Quran and remember God and glorify Him in the day and night Prayers, or even when they are engaged in fighting against the enemy.</p><p>These verses read in conjunction with the verse that follows embody both a prophecy and a statement of fact. As a statement of fact, they signify that there live in all times and among every people a group of righteous and God-fearing Muslims who, by word and deed and by precept and practice, bear testimony to the great truth, viz. إن إلھکم لواحد i.e. God is One.</p><p>As a prophecy, however, the verses signify that though at present the whole of Arabia is sunk deep in idol-worship and moral turpitude but a community of the Faithful will soon be born who not only will themselves glorify God and sing His praises and make the whole country resound with their hosannas but will also succeed in establishing Divine Unity in the land.</p><p>These verses may have yet another interpretation, viz. that if a representative gathering of the learned men of various Faiths were held in a peaceful atmosphere and the basic religious principles were discussed and debated impartially and dispassionately in a calm atmosphere, under the supervision of the custodians of law and order, the inevitable outcome of the deliberations of such a gathering will be the affirmation of the doctrine that \"God is One\".</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 2062,
                "topic": "Allah: no god but He, <i>La ilaha illallah</i>",
                "verses": "40:4, 2:164, 2:256, 3:3, 3:19, 3:63, 3:65, 4:88, 5:74, 6:20, 9:31, 16:3, 16:23, 16:52, 21:26, 22:35, 23:117, 28:71, 40:63"
            },
            {
                "id": 3003,
                "topic": "Attributes of Allah: Al-Ahad (The One, Unique)",
                "verses": "112:2, 2:164, 2:256, 4:172, 5:74, 16:23, 22:35, 59:23-24"
            },
            {
                "id": 3641,
                "topic": "Attributes of Allah: Al-Wahid (The One)",
                "verses": "13:17, 2:134, 2:164, 5:74, 9:31, 16:23, 18:111, 22:35, 38:66, 39:5, 112:2"
            },
            {
                "id": 6204,
                "topic": "Debate",
                "verses": "2:112, 3:62, 10:51, 16:126, 22:68, 25:53, 29:47, 38:70, 103:4"
            }
        ],
        "ar": "اِنَّ   اِلٰـہَکُمۡ   لَوَاحِدٌ ﴿ؕ۵﴾ ",
        "ur": "یقیناً تمہارا معبود ایک ہی ہے۔",
        "v5": {
            "text": "[a]Surely, your God is One,[3274]",
            "notes": [
                {
                    "ref": "a",
                    "note": "5:74; 16:23; 22:35. "
                },
                {
                    "ref": "3274",
                    "note": "<p><strong>Commentary:</strong></p><p>See preceding verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 2153,
                "topic": "Allah: present everywhere",
                "verses": "2:116, 2:143, 26:29, 55:18, 73:10"
            },
            {
                "id": 3802,
                "topic": "Attributes of Allah: Rabbul-Mashariq (Lord of all Light)",
                "verses": "26:29, 55:18, 70:41, 73:10"
            },
            {
                "id": 3813,
                "topic": "Attributes of Allah: Rabbus-Samawate wal-Ard (Lord of Heavens &amp; earth)",
                "verses": "19:66, 13:17, 17:103, 18:15, 21:57, 26:25, 38:67, 43:83, 44:8, 45:37, 51:24, 78:38"
            },
            {
                "id": 7065,
                "topic": "East & West",
                "verses": "73:10, 2:116, 2:143, 2:178, 2:259, 7:138, 19:17, 24:36, 26:29, 43:39"
            }
        ],
        "ar": "رَبُّ السَّمٰوٰتِ وَ  الۡاَرۡضِ وَ مَا بَیۡنَہُمَا  وَ  رَبُّ  الۡمَشَارِقِ ؕ﴿۶﴾ ",
        "ur": "آسمانوں کا بھی ربّ ہے اور زمین کا بھی اور اس کا بھی جو ان دونوں کے درمیان ہے اور تمام مشرقوں کا ربّ ہے۔",
        "v5": {
            "text": "[b]Lord of the heavens and the earth and all that is between them and the Lord of the sun’s risings.[3275]",
            "notes": [
                {
                    "ref": "b",
                    "note": "19:66; 38:67; 44:8; 78:38."
                },
                {
                    "ref": "3275",
                    "note": "<p><strong>Commentary:</strong></p><p>مشارق (Sun’s risings) being the plural of مشرق which means, the place where the sun rises; the words رب المشارق may signify that God is the Lord, the Source and Centre of every kind of light, or the implied reference in the words \"the Lord of sun’s risings\" may be to the spread of Islam first in eastern countries, then from there to other parts of the world.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 779,
                "topic": "Adornment: <i>Zinah</i>: of heavens",
                "verses": "7:32-33, 15:17, 22:24, 41:13, 50:7, 67:6"
            },
            {
                "id": 797,
                "topic": "Adornment: <i>Zinah</i>: of this world",
                "verses": "7:32-33, 28:61, 7:33, 11:16, 16:9, 18:8, 18:29, 18:47, 20:60, 20:88, 24:32, 24:61, 28:80, 33:29, 33:34, 57:21"
            },
            {
                "id": 4178,
                "topic": "Beauty: in physical world, <i>Bahjah</i>, <i>Zinah</i>,",
                "verses": "16:9, 7:32-33, 10:89, 11:16, 16:7, 18:8, 18:29, 18:47, 20:88, 22:6, 27:61, 28:80, 33:29, 41:26, 49:8, 50:7-8, 57:21"
            },
            {
                "id": 8594,
                "topic": "Heaven: <i>Sama’</i>: adorned lower",
                "verses": "15:17, 25:62, 41:13, 50:7, 67:6, 85:2"
            },
            {
                "id": 12857,
                "topic": "Najm: <i>Kaukab</i>, star",
                "verses": "53:2-3, 6:77, 6:98, 7:55, 12:5, 16:13, 16:17, 22:19, 24:36, 41:13, 56:76, 67:6, 77:9, 81:3, 82:3, 86:2-4"
            },
            {
                "id": 13321,
                "topic": "Ornaments",
                "verses": "18:8, 7:149, 10:25, 13:18, 16:7, 16:15, 18:47, 20:88, 24:32, 33:41, 35:13, 43:19"
            }
        ],
        "ar": "اِنَّا زَیَّنَّا السَّمَآءَ  الدُّنۡیَا بِزِیۡنَۃِ ۣالۡکَوَاکِبِ ۙ﴿۷﴾",
        "ur": "یقیناً ہم نے نزدیک کے آسمان کو ستاروں کے ذریعہ ایک زینت بخشی۔",
        "v5": {
            "text": "[a]We have adorned the lowest heaven with an adornment—the planets;[3276]",
            "notes": [
                {
                    "ref": "a",
                    "note": "15:17; 41:13; 67:6."
                },
                {
                    "ref": "3276",
                    "note": "<p><strong>Commentary:</strong></p><p>It is not only the beautiful appearance of planets and stars at night that is meant here. It would be too trivial for a Divine revealed Book to make special mention, merely of the ornamental character of these heavenly bodies. They serve another very useful spiritual purpose. In fact, the verse points to a parallelism between the physical and spiritual realms, viz. that just as physical heaven is sustained by physical planets and stars, so is the spiritual heaven sustained by its spiritual counterparts who are the Prophets and Divine Reformers. Each one of them serves as an ornament for the spiritual heaven, as the stars and planets beautify and embellish the physical heaven.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 9086,
                "topic": "Hypocrites: <i>Munafiqin</i>",
                "verses": "63:2-9, 2:9-21, 2:205-207, 4:64, 4:89, 4:139, 4:141, 4:143, 9:54, 9:64-69, 9:80, 9:84, 9:107-108, 33:2, 33:49, 47:24, 57:14-16, 59:12-18"
            },
            {
                "id": 16211,
                "topic": "Satan: evil, rebellious",
                "verses": "4:61, 4:77, 4:118, 19:45, 22:4, 24:22, 26:222-223"
            },
            {
                "id": 16262,
                "topic": "Satan: no power over pious, believers",
                "verses": "34:22, 15:18, 15:41, 15:43, 16:100-101, 17:66, 58:11"
            }
        ],
        "ar": "وَ  حِفۡظًا مِّنۡ کُلِّ شَیۡطٰنٍ مَّارِدٍ ۚ﴿۸﴾ ",
        "ur": "اور (یہ) حفاظت کے طور پر ہے ہر دھتکارے ہوئے شیطان سے۔",
        "v5": {
            "text": "[b]And have guarded it against all rebellious satans.[3277]",
            "notes": [
                {
                    "ref": "b",
                    "note": "15:18; 41:13; 67:6."
                },
                {
                    "ref": "3277",
                    "note": "<p><strong>Important Words:</strong></p><p>مارد (rebellious) is active participle from مرد which means, he exalted himself; he was insolent and audacious in pride and in acts of disobedience; he was excessively proud or rebellious; he was refractory; he outstripped others in pride or disobedience; مارد therefore means, rebellious, excessively proud, insolently disobedient (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>The analogy between the physical and spiritual systems, which was begun in the preceding verse, is continued in the present one. We are here told that just as each star serves as an ornament for the physical heaven and guards it by gravitation and other means which are yet unknown to man, similarly every Prophet is an ornament for the spiritual heaven, and by appearing at a time when his presence is urgently needed, helps to guard the same. Moreover, every Prophet fights and routs those wicked people who seek to distort the Word of God and frustrate His designs. The word \"satans\" in the verse refers to disbelievers who refuse to obey their Prophet and seek to make spiritual progress independently of him. Against such people the doors of spiritual heaven are firmly barred.</p><p>'Satans' who carry on a wicked campaign against the Word of God are of two categories: (a) Internal enemies of the Muslim Community such as \"the hypocrites,\" etc. They are called شیطان مارد (the rebellious satan) in the Quran and (b) external enemies or disbelievers who are described in the Quran as شیطان رجیم (satan, the rejected). The words شیطان مارد (rebellious satan) may also refer to astrologers and soothsayers who in time of spiritual darkness before the advent of a Divine Reformer, ply their evil trade and to a certain extent succeed in deceiving simple-minded people.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 6866,
                "topic": "Ears: disbelievers do not hear",
                "verses": "2:8, 2:172, 6:26, 7:180, 16:109, 17:47, 18:58, 22:47, 31:8, 41:5, 41:21, 41:45, 71:8"
            }
        ],
        "ar": "لَا یَسَّمَّعُوۡنَ  اِلَی الۡمَلَاِ الۡاَعۡلٰی وَ یُقۡذَفُوۡنَ مِنۡ  کُلِّ  جَانِبٍ ٭ۖ﴿۹﴾ ",
        "ur": "وہ ملاءاعلیٰ کی باتیں نہیں سن سکیں گے اور ہر طرف سے پتھراؤ کئے جائیں گے۔",
        "v5": {
            "text": "[a]They cannot listen to <i>anything</i> from the exalted assembly <i>of angels</i>—and they are pelted from every side,[3278]",
            "notes": [
                {
                    "ref": "a",
                    "note": "26:212-213."
                },
                {
                    "ref": "3278",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that all the tall claims of astrologers and soothsayers that they have access to the secrets of the unknown are false and unfounded. They do not and cannot have access to well-guarded divine secrets (15:10). It further appears from the Quran that none can know the Word of God until it is revealed to a Prophet (72:27-28). If it were possible for \"satans\" to have access to things that are under the special protection of God such as His Word, etc. then its very sanctity and inviolability would have become subject to serious doubts. In fact, divine secrets are God’s specially guarded preserve to which satans can have no access (26:213) and which are made known only to God’s chosen servants and His Elect.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 10,
        "v_": 9,
        "topics": [],
        "ar": "دُحُوۡرًا  وَّ  لَہُمۡ  عَذَابٌ  وَّاصِبٌ ۙ﴿۱۰﴾ ",
        "ur": "اس حال میں کہ دھتکارے ہوئے ہیں اور ان کے لئے چمٹ جانے والا عذاب (مقدر) ہے",
        "v5": {
            "text": "Repulsed, and for them is a perpetual punishment—[3279]",
            "notes": [
                {
                    "ref": "3279",
                    "note": "<p><strong>Important Words:</strong></p><p>دحورا (repulsed) is derived from دحر. They say دحرہ i.e. He (God) drove him away; expelled or banished him; expelled him with ignominy. دحور means, driven away, rejected or cast away (Lane &amp; Aqrab).</p><p>واصب (perpetual) is active participle from وصب which means, it continued; was constant; was fixed; settled or firm. وصب علی الامرmeans, he kept, attended or applied himself constantly perseveringly, or assid-uously to the thing and managed it or conducted it well. واصب therefore would mean, perpetual, constant, permanent (Lane &amp; Aqrab). See also 16:53.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 1639,
                "topic": "Allah: guardian of the Holy Qur’an",
                "verses": "15:10, 5:49, 15:19"
            },
            {
                "id": 7563,
                "topic": "Fire: <i>An-Nar</i>: flame of",
                "verses": "15:19, 72:10"
            },
            {
                "id": 11411,
                "topic": "Meteor: <i>Shihab</i>",
                "verses": "15:19"
            },
            {
                "id": 15022,
                "topic": "Qur’an: collection, protection of",
                "verses": "75:17-18, 4:83, 5:49, 15:2, 15:10, 15:18-19, 26:194, 26:211-213, 27:2, 56:78-79, 85:22-23, 87:7-9"
            }
        ],
        "ar": "اِلَّا مَنۡ خَطِفَ الۡخَطۡفَۃَ فَاَتۡبَعَہٗ شِہَابٌ  ثَاقِبٌ ﴿۱۱﴾ ",
        "ur": "سوائے اُس کے جو کوئی ایک آدھ بات اُچک لے تو اس کا بھی ایک روشن شعلہ تعاقب کرے گا۔",
        "v5": {
            "text": "[b]But he who snatches away <i>something</i> by stealth, there pursues him a piercing flame <i>of fire</i>.[3280]",
            "notes": [
                {
                    "ref": "b",
                    "note": "15:19; 67:6."
                },
                {
                    "ref": "3280",
                    "note": "<p><strong>Important Words:</strong></p><p>ثاقب (piercing) is derived from ثقب. They say ثقب الشیء i.e. he pierced the thing, made a small hole in it. ثقب الکوکب means, the star shone brightly as though it pierced through the darkness. ثقب رأیه means, his judgement was penetrating. ثاقب means a star, a lamp, fire; a flame or a shooting star shining brightly or things piercing through the darkness and dispelling it (Lane &amp; Aqrab).</p><p>For شھاب see 15:19.</p><p><strong>Commentary:</strong></p><p>The words, \"But he who snatches away something by stealth,\" signify that as long as the Word of God is preserved in the heavens it is quite safe and secure against all interference, stealing or snatching, but after it is revealed to a Prophet, \"satans,\" or the enemies of God’s Prophets, seek to misrepresent or misinterpret it by misquoting the Prophet or by tearing a passage out of his revelation and mixing falsehood with it, or they even try to represent the Prophet’s teaching as their own.</p><p>The expression, \"then there pursues him a piercing flame of fire,\" signifies that during the time when there is no Prophet or Divine Reformer in the world, satans, to a certain extent, succeed in hoodwinking simple-minded people, but with the coming of a Prophet or a Divine Reformer their falsehood becomes exposed and people can easily see the truth. شھاب ثاقبmay represent the Prophet of the day or the ever-living Prophet i.e. the Holy Prophet, from among whose followers Divine Reformers continue to bring to naught the wicked designs of \"satans\" seeking to tamper with the teachings of Islam.</p><p>The verse may also be taken as referring to the physical phenomenon of the falling of meteors at the time of the appearance of a Prophet or a great Divine Reformer. In the time of the Holy Prophet, meteors fell in such large numbers that disbelievers thought that both heaven and earth were about to fall asunder (Kathir, under 72:9). From Hadith, it appears that in the time of Jesus also meteors fell in unusually large numbers. With regard to his Second Coming the Gospels say: And there shall be the signs in the sun and in the moon and in the stars (Matt. 24:29). Meteors also fell in exceptionally large numbers in 1885 when Ahmad, the Holy Founder of the Ahmadiyya Movement, was about to announce his claim to be the Promised Messiah and Mahdi. For a detailed discussion of شھاب مبین (bright flame) and شھاب ثاقب(piercing flame) see 15:19.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 5116,
                "topic": "Clay: Tin, <i>Sijjil</i>",
                "verses": "23:13, 3:50, 5:111, 6:3, 7:13, 11:83, 15:75, 17:62, 28:39, 32:8, 38:72, 38:77, 51:34, 105:5"
            },
            {
                "id": 5401,
                "topic": "Creation: <i>Khalq</i>: from clay",
                "verses": "23:13, 6:3, 17:62, 32:8, 38:72"
            },
            {
                "id": 10785,
                "topic": "Man: creation of",
                "verses": "23:13-15, 3:7, 3:60, 4:2, 6:3, 7:12-13, 15:27, 15:29-30, 15:34, 16:5, 18:38, 22:6, 25:55, 30:21, 32:8-10, 35:12, 36:78, 38:72, 39:7, 40:68, 49:14, 53:47, 55:15, 71:15, 71:18, 75:38-40, 76:3, 77:21-24, 86:7, 87:3, 95:5-6, 96:3"
            }
        ],
        "ar": "فَاسۡتَفۡتِہِمۡ  اَہُمۡ اَشَدُّ خَلۡقًا اَمۡ مَّنۡ خَلَقۡنَا ؕ اِنَّا خَلَقۡنٰہُمۡ مِّنۡ طِیۡنٍ لَّازِبٍ ﴿۱۲﴾ ",
        "ur": "پس تُو ان سے پوچھ کیا خَلق کرنے کے لحاظ سے وہ زیادہ مضبوط ہیں یا وہ (خِلقت میں مضبوط تَر ہیں) جنہیں ہم نے پیدا کیا؟ یقیناً ہم نے انہیں ایک چمٹ جانے والی مٹی سے پیدا کیا۔",
        "v5": {
            "text": "So ask them whether it is they who are harder to create, or those <i>others</i> whom We have created? [a]Them We have created of cohesive clay.[3281]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:3; 23:13; 32:8; 38:72."
                },
                {
                    "ref": "3281",
                    "note": "<p><strong>Important Words:</strong></p><p>لازب (cohesive) is active participle from لزب which means, it was or remained fixed, settled, firm or constant; it (mud) cohered, and became hard. لازب means, adhering or adhesive or cohesive clay or mud; being or remaining fixed, settled, firm, or constant (Lane).</p><p>In the word من (whom) the allusion may be to those righteous Companions of the Holy Prophet to whom reference has been made in vv. 2-5 above. In this sense of the word the verse under comment would mean that the doubters and deniers of truth can bear no comparison with those true and noble Companions of the Holy Prophet who have been created of cohesive clay i.e. they are of firm and strong character.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 13,
        "v_": 12,
        "topics": [],
        "ar": "بَلۡ عَجِبۡتَ وَ  یَسۡخَرُوۡنَ ﴿۪۱۳﴾ ",
        "ur": "حقیقت یہ ہے کہ تُو تو (تخلیق پر) عش عش کر اٹھا ہے جبکہ وہ تمسخر اُڑاتے ہیں۔",
        "v5": {
            "text": "Nay, thou dost wonder, and they ridicule.[3282]",
            "notes": [
                {
                    "ref": "3282",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that the coming into being of a company of truly righteous and God-fearing men through the Holy Prophet and the establishment of Islam on a firm footing in Arabia is indeed a marvel to wonder at even by the Prophet himself. The disbelievers, as is their wont, ridicule the possibility ever of such an event taking place.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 14,
        "v_": 13,
        "topics": [],
        "ar": "وَ  اِذَا  ذُکِّرُوۡا لَا  یَذۡکُرُوۡنَ ﴿۪۱۴﴾ ",
        "ur": "اور جب انہیں نصیحت کی جاتی ہے تو وہ نصیحت نہیں پکڑتے۔",
        "v5": {
            "text": "And when they are admonished, they pay no heed.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 15,
        "v_": 14,
        "topics": [],
        "ar": "وَ  اِذَا  رَاَوۡا  اٰیَۃً  یَّسۡتَسۡخِرُوۡنَ ﴿۪۱۵﴾ ",
        "ur": "اور جب بھی وہ کوئی نشان دیکھیں تو مذاق اڑانے لگتے ہیں۔",
        "v5": {
            "text": "And when they see a Sign, they seek to ridicule <i>it</i>.[3283]",
            "notes": [
                {
                    "ref": "3283",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that though the disbelievers will witness many signs yet they will not profit by them, on the contrary, they will mock and jeer at them.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 10711,
                "topic": "Magicians",
                "verses": "7:110, 2:103, 5:111, 6:8, 7:108, 7:113-123, 10:3, 10:77-78, 10:82, 20:64, 20:67-71, 27:14, 28:37, 34:44, 38:5, 40:25, 43:31, 43:50, 46:8, 51:40, 51:53, 61:7, 74:25"
            }
        ],
        "ar": "وَ  قَالُوۡۤا  اِنۡ ہٰذَاۤ   اِلَّا  سِحۡرٌ  مُّبِیۡنٌ ﴿ۚۖ۱۶﴾ ",
        "ur": "اور کہتے ہیں یہ تو محض ایک کھلا کھلا جادو ہے۔",
        "v5": {
            "text": "And they say, [b]‘This is nothing but plain magic.",
            "notes": [
                {
                    "ref": "b",
                    "note": "23:84; 27:69."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 4578,
                "topic": "Bones: resurrection after are turned to dust",
                "verses": "2:260, 56:48, 17:50, 17:99, 23:36, 23:83, 36:79, 37:54, 75:4, 79:11-12"
            },
            {
                "id": 6832,
                "topic": "Dust: bones turned into",
                "verses": "56:48, 13:6, 23:36, 23:83, 27:68, 37:54, 50:4"
            }
        ],
        "ar": "ءَ اِذَا مِتۡنَا وَ کُنَّا تُرَابًا وَّ  عِظَامًا ءَاِنَّا لَمَبۡعُوۡثُوۡنَ ﴿ۙ۱۷﴾ ",
        "ur": "کیا جب ہم مر جائیں گے اور مٹی اور ہڈیاں ہوجائیں گے تو کیا ہم ضرور اٹھائے جانے والے ہیں؟",
        "v5": {
            "text": "[c]What! when we are dead and have become dust and bones, shall we then be raised up <i>again</i>?[3284]",
            "notes": [
                {
                    "ref": "c",
                    "note": "13:6; 27:68; 50:4."
                },
                {
                    "ref": "3284",
                    "note": "<p><strong>Commentary:</strong></p><p>\"Resurrection\" referred to in this verse may mean Resurrection after death or it may mean the great moral transformation brought about by the Holy Prophet. The verse purports to say that when disbelievers are told that they will have to account for their rejection of the teaching of Islam about the next life they say that they cannot believe that such a thing can ever happen, and with respect to the great change that Islam is destined to bring about in the lives of men, their denial, too, is firm and unequivocal.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 18,
        "v_": 17,
        "topics": [],
        "ar": "اَوَ اٰبَآؤُنَا الۡاَوَّلُوۡنَ ﴿ؕ۱۸﴾ ",
        "ur": "اور کیا ہمارے گزشتہ آباء واجداد بھی۔",
        "v5": {
            "text": "And our forefathers of yore <i>also</i>?’",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 19,
        "v_": 18,
        "topics": [],
        "ar": "قُلۡ  نَعَمۡ  وَ  اَنۡتُمۡ  دَاخِرُوۡنَ ﴿ۚ۱۹﴾ ",
        "ur": "تُو کہہ دے ہاں! اس حال میں کہ تم ذلیل ہوگے۔",
        "v5": {
            "text": "Say, ‘Yea; and you will <i>then</i> be abased.’[3285]",
            "notes": [
                {
                    "ref": "3285",
                    "note": "<p><strong>Important Words:</strong></p><p>داخرون (abased) is the plural of داخر which is active participle from دخر (<i>dakhara </i>&amp; <i>dakhira</i>) which means, he was or became abject, mean, contemptible, despicable or abased (Lane).</p><p>The verse replies to the firm denial by disbelievers of the possibility of Resurrection after death or of \"resurrection\" of the morally and spiritually dead Arabs mentioned in the preceding two verses with an even firmer affirmation that such a thing shall certainly come to pass, and, besides being disgraced on the Judgement Day, their pride will be humbled in the dust in this very life.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 20,
        "v_": 19,
        "topics": [],
        "ar": "فَاِنَّمَا ہِیَ زَجۡرَۃٌ  وَّاحِدَۃٌ  فَاِذَا ہُمۡ یَنۡظُرُوۡنَ  ﴿۲۰﴾ ",
        "ur": "پس یقیناً یہ ایک ہی ڈپٹ ہوگی تو اچانک وہ دیکھتے رہ جائیں گے۔",
        "v5": {
            "text": "Then it will be but [a]one shout of reproach, and lo! they will begin to see.[3286]",
            "notes": [
                {
                    "ref": "a",
                    "note": "79:14."
                },
                {
                    "ref": "3286",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse, besides the Judgement Day, may refer to the sudden and swift punishment that will overtake disbelievers. The reference seems to be to the Fall of Mecca when the Meccans were simply flabbergasted at the sudden appearance of the Muslim army at its very gates.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 5816,
                "topic": "Day of Requital: Resurrection, <i>Yaumul-Qiyamah, Yaumud-Din, Yaumul-Akhirah, Yaumul-Ba‘th</i>",
                "verses": "1:4, 2:9, 2:49, 2:86, 2:114, 2:127, 3:78, 3:115, 4:40, 4:142, 5:70, 6:13, 9:18, 11:27, 14:32, 14:43, 15:36, 23:102, 24:3, 24:38, 25:27, 26:83, 26:88, 29:37, 30:57, 33:22, 38:80, 43:66, 44:17, 50:45, 51:13, 60:4, 70:9, 74:9-10, 75:2-3, 82:17-18, 83:11-12, 86:10"
            },
            {
                "id": 11137,
                "topic": "Mecca: <i>Makkah</i>: victory of",
                "verses": "7:99, 28:86, 2:151, 6:116, 9:1-2, 14:49, 34:27, 44:17, 54:8-9, 70:43-45"
            },
            {
                "id": 18938,
                "topic": "Yaumud-Din: Day of Judgment",
                "verses": "1:4, 7:188, 15:36, 26:83, 33:64, 38:79, 51:13, 56:57, 70:27, 74:47, 78:2-3, 79:43, 82:16, 82:18-19, 83:12"
            }
        ],
        "ar": "وَ قَالُوۡا یٰوَیۡلَنَا ہٰذَا یَوۡمُ  الدِّیۡنِ ﴿۲۱﴾ ",
        "ur": "اور وہ کہیں گے اے وائے ہماری ہلاکت! یہ تو جزاسزا کا دن ہے۔",
        "v5": {
            "text": "And they will say, ‘Alas for us! this is the Day of Requital.’",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 22,
        "v_": 21,
        "topics": [
            {
                "id": 5770,
                "topic": "Day of Decision: <i>Yaumul-Fasl</i>",
                "verses": "44:41, 77:14-15, 77:39, 78:18"
            }
        ],
        "ar": "ہٰذَا یَوۡمُ الۡفَصۡلِ الَّذِیۡ کُنۡتُمۡ بِہٖ تُکَذِّبُوۡنَ ﴿٪۲۲﴾ ",
        "ur": "یہ (وہ) فیصلہ کا دن ہے جسے تم جھٹلایا کرتے تھے۔",
        "v5": {
            "text": "<i>God will say</i> [b]‘This is the Day of the <i>final</i> Decision which you used to deny.’[3287]",
            "notes": [
                {
                    "ref": "b",
                    "note": "46:35; 52:15."
                },
                {
                    "ref": "3287",
                    "note": "<p><strong>Commentary:</strong></p><p>It was at the Fall of Mecca that disbelievers realised to their sorrow that that was the day of final decision for which they had waited so long because after the Fall of Mecca within a very short time the whole of Arabia submitted to the inevitable and entered the fold of Islam.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 17158,
                "topic": "Spouse: <i>Zauj</i>: created in pairs",
                "verses": "2:26, 36:37, 11:41, 13:4, 20:54, 23:28, 42:12, 43:13, 51:50, 53:46, 78:9"
            }
        ],
        "ar": "اُحۡشُرُوا الَّذِیۡنَ ظَلَمُوۡا وَ اَزۡوَاجَہُمۡ وَ مَا  کَانُوۡا  یَعۡبُدُوۡنَ ﴿ۙ۲۳﴾ ",
        "ur": "ان لوگوں کو اکٹھا کرو جنہوں نے ظلم کئے اور ان کے ساتھیوں کو بھی اور ان کو بھی جن کی وہ عبادت کیا کرتے تھے۔",
        "v5": {
            "text": "[a]<i>And it will be said to the angels</i>, ‘Assemble those who acted wrongfully, along with their companions, and what they used to worship[3288]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:23; 10:29."
                },
                {
                    "ref": "3288",
                    "note": "<p><strong>Commentary:</strong></p><p>The present and the following several verses describe the condition respectively of believers and disbelievers in this life and the next. With this verse begins a description of the guilty disbelievers and their companions, comrades and associates. They are described as being hauled up and led to their place of punishment. The words \"what they used to worship\" refer to those leaders of disbelief to whom they gave blind and unquestioning obedience.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 24,
        "v_": 23,
        "topics": [],
        "ar": "مِنۡ دُوۡنِ اللّٰہِ  فَاہۡدُوۡہُمۡ  اِلٰی صِرَاطِ الۡجَحِیۡمِ ﴿ٙ۲۴﴾ ",
        "ur": "اللہ کے سوا۔ پس انہیں جہنم کے رستے پر ڈال دو۔",
        "v5": {
            "text": "Beside Allah; and lead them to the path of Hell;",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 25,
        "v_": 24,
        "topics": [],
        "ar": "وَ قِفُوۡہُمۡ   اِنَّہُمۡ  مَّسۡئُوۡلُوۡنَ ﴿ۙ۲۵﴾ ",
        "ur": "اور انہیں ذرا ٹھہراؤ، یقیناً وہ پوچھے جانے والے ہیں۔",
        "v5": {
            "text": "And stop them; for they must be questioned.’[3289]",
            "notes": [
                {
                    "ref": "3289",
                    "note": "<p><strong>Commentary:</strong></p><p>Before being actually punished the guilty will be asked to show the cause why they should not be punished, or, if they had anything to say in defence or extenuation of their guilt, to produce it.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 26,
        "v_": 25,
        "topics": [],
        "ar": "مَا  لَکُمۡ  لَا  تَنَاصَرُوۡنَ ﴿۲۶﴾ ",
        "ur": "(اب) تمہیں کیا ہوگیا ہے کہ (آج) تم ایک دوسرے کی مدد نہیں کرتے۔",
        "v5": {
            "text": "<i>They will be asked, </i>‘What is the matter with you that you help not one another?’[3290]",
            "notes": [
                {
                    "ref": "3290",
                    "note": "<p><strong>Commentary:</strong></p><p>The realisation of utter helplessness of the guilty people to assist each other will be brought home to them.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 27,
        "v_": 26,
        "topics": [],
        "ar": "بَلۡ  ہُمُ  الۡیَوۡمَ  مُسۡتَسۡلِمُوۡنَ ﴿۲۷﴾ ",
        "ur": "بلکہ وہ تو آج (ہر جُرم) تسلیم کرنے والے ہیں۔",
        "v5": {
            "text": "Nay, on that day they will surrender themselves completely.[3291]",
            "notes": [
                {
                    "ref": "3291",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse portrays the complete surrender and submission to Divine judgement of the guilty leaders and also of their beguiled and deceived followers. They will offer no defence but will only indulge in mutual recrimination as the following verses show.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 28,
        "v_": 27,
        "topics": [],
        "ar": "وَ اَقۡبَلَ بَعۡضُہُمۡ عَلٰی بَعۡضٍ یَّتَسَآءَلُوۡنَ ﴿۲۸﴾ ",
        "ur": "اور ان میں سے بعض بعض کی طرف سوال کرتے ہوئے متوجہ ہوں گے۔",
        "v5": {
            "text": "And some of them will address the others, [b]questioning one another.",
            "notes": [
                {
                    "ref": "b",
                    "note": "34:32."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 29,
        "v_": 28,
        "topics": [],
        "ar": "قَالُوۡۤا اِنَّکُمۡ کُنۡتُمۡ تَاۡتُوۡنَنَا عَنِ الۡیَمِیۡنِ ﴿۲۹﴾ ",
        "ur": "وہ کہیں گے کہ یقیناً تم دائیں طرف سے (یعنی دین کی جہت سے ہمیں بہکانے) ہمارے پاس آیا کرتے تھے۔",
        "v5": {
            "text": "They will say, ‘Verily, you used to come to us, from the right.’[3292]",
            "notes": [
                {
                    "ref": "3292",
                    "note": "<p><strong>Important Words:</strong></p><p>الیمین (the right) is derived from یمن. They say یمن الرجل i.e. he came from the right side of the man. یمین means, right hand or right side; good luck; power. They say فلان عندنا بالیمین i.e. such a one holds a good position with us (Aqrab).</p><p><strong>Commentary:</strong></p><p>The verse, besides the meaning given in the text, may also mean: \"you came to us exerting your power and influence and compelling us to obey and follow you.\"</p><p>The words 'the right side' may also signify religion, and the verse would thus mean, \"you masqueraded under the cloak of religion to deceive us.\"</p><p>The pronoun 'they' in the expression \"they will say\" refers to common disbelievers.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 30,
        "v_": 29,
        "topics": [],
        "ar": "قَالُوۡا  بَلۡ  لَّمۡ  تَکُوۡنُوۡا  مُؤۡمِنِیۡنَ ﴿ۚ۳۰﴾ ",
        "ur": "وہ (جواباً) کہیں گے کہ تم بھی تو کسی صورت ایمان لانے والے نہیں تھے۔",
        "v5": {
            "text": "<i>Their associate-gods</i> will answer, [a]‘Nay, you yourselves were not believers.[3293]",
            "notes": [
                {
                    "ref": "a",
                    "note": "34:33."
                },
                {
                    "ref": "3293",
                    "note": "<p><strong>Commentary:</strong></p><p>In this verse the pronoun 'they' in the sentence \"they will answer\" refers to the leaders of disbelief.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 31,
        "v_": 30,
        "topics": [
            {
                "id": 17805,
                "topic": "Transgression: <i>Tagha</i>, <i>‘Udwan</i>",
                "verses": "2:16, 2:195, 2:198, 4:31, 4:154, 4:161, 5:3, 5:40, 5:63, 5:65, 5:69, 6:111, 6:147, 7:34, 7:187, 10:12, 16:91, 17:61, 18:81, 19:70, 23:76, 25:22, 51:54, 53:53, 58:9-10, 67:22, 69:6, 89:12"
            }
        ],
        "ar": "وَ مَا  کَانَ لَنَا عَلَیۡکُمۡ مِّنۡ سُلۡطٰنٍ ۚ بَلۡ  کُنۡتُمۡ  قَوۡمًا طٰغِیۡنَ ﴿۳۱﴾ ",
        "ur": "ہمیں تو تم پر کسی قوی دلیل کی برتری حاصل نہیں تھی بلکہ تم خود ہی حد سے گزرنے والے لوگ تھے۔",
        "v5": {
            "text": "[b]And we had no power over you; but you yourselves were a transgressing people.",
            "notes": [
                {
                    "ref": "b",
                    "note": "14:23; 15:43."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 32,
        "v_": 31,
        "topics": [],
        "ar": "فَحَقَّ عَلَیۡنَا قَوۡلُ رَبِّنَاۤ ٭ۖ اِنَّا  لَذَآئِقُوۡنَ ﴿۳۲﴾ ",
        "ur": "پس ہم پر ہمارے ربّ کا قول صادق آگیا۔ ہم یقیناً (عذاب کا مزا) چکھنے والے ہیں۔",
        "v5": {
            "text": "Now the word of our Lord has been proved true against us that we shall surely taste <i>the punishment</i>.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 33,
        "v_": 32,
        "topics": [
            {
                "id": 5632,
                "topic": "Dallin: astray",
                "verses": "1:7, 2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:28, 13:34, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:5, 22:10, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:72, 38:27, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            }
        ],
        "ar": "فَاَغۡوَیۡنٰکُمۡ   اِنَّا کُنَّا غٰوِیۡنَ ﴿۳۳﴾ ",
        "ur": "پس ہم نے تمہیں گمراہ کیا۔ یقیناً ہم خود بھی گمراہ تھے۔ ",
        "v5": {
            "text": "And we caused you to go astray for we ourselves had gone astray.’[3294]",
            "notes": [
                {
                    "ref": "3294",
                    "note": "<p><strong>Commentary:</strong></p><p>In vv. 30, 31 above the leaders of disbelief had refused to plead guilty to the charge that they had led their followers astray by saying that they had no power or authority over them; in the verse under comment they plead guilty to the charge of misleading them. The seeming contradiction is, in reality, no contradiction. The verse means to say that leaders of disbelief will say to their followers: \"You yourselves chose to follow us, and since we ourselves had gone astray, you could expect nothing better from us. It was a case of blind leading the blind.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 34,
        "v_": 33,
        "topics": [],
        "ar": "فَاِنَّہُمۡ یَوۡمَئِذٍ فِی الۡعَذَابِ مُشۡتَرِکُوۡنَ ﴿۳۴﴾ ",
        "ur": "پس یقیناً وہ (سب) اس دن عذاب میں برابر شریک ہوں گے۔",
        "v5": {
            "text": "Truly, on that day they will <i>all</i> be sharers in the punishment.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 35,
        "v_": 34,
        "topics": [
            {
                "id": 8267,
                "topic": "Guilty: <i>Mujrim</i>",
                "verses": "10:18, 6:148, 7:41, 7:134, 9:66, 10:14, 11:117, 12:111, 14:50, 19:87, 20:75, 20:103, 27:70, 28:79, 30:13, 30:56, 32:13, 36:60, 43:75, 46:26, 55:42, 55:44, 70:12, 77:19"
            }
        ],
        "ar": "اِنَّا کَذٰلِکَ نَفۡعَلُ  بِالۡمُجۡرِمِیۡنَ ﴿۳۵﴾ ",
        "ur": "یقیناً ہم مجرموں سے ایسا ہی سلوک کرتے ہیں۔ ",
        "v5": {
            "text": "Surely, thus do We deal with the guilty.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 36,
        "v_": 35,
        "topics": [],
        "ar": "اِنَّہُمۡ  کَانُوۡۤا  اِذَا  قِیۡلَ  لَہُمۡ  لَاۤ  اِلٰہَ   اِلَّا  اللّٰہُ ۙ یَسۡتَکۡبِرُوۡنَ ﴿ۙ۳۶﴾ ",
        "ur": "یقیناً وہ ایسے تھے کہ جب انہیں کہا جاتا تھا کہ اللہ کے سوا کوئی معبود نہیں تو وہ استکبار کرتے تھے۔",
        "v5": {
            "text": "For when it was said to them, ‘There is no god but Allah,’ they turned away with disdain,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 37,
        "v_": 36,
        "topics": [
            {
                "id": 11317,
                "topic": "Messengers: <i>Rusul</i>: are mocked, opposed, called liars, madmen, sorcerers",
                "verses": "51:53-54, 2:88, 3:185, 6:11, 7:93, 7:110, 14:14, 15:7, 15:12, 15:81, 18:107, 20:64, 25:38, 26:28, 26:35, 26:124, 26:142, 26:154, 26:161, 26:177, 26:186, 34:9, 38:5, 40:25, 41:15, 43:48, 43:50, 44:15, 51:40, 54:10, 68:52"
            },
            {
                "id": 14007,
                "topic": "Poet",
                "verses": "36:70, 2:2, 2:16, 2:74, 4:25, 11:47, 17:82, 21:6, 21:11, 26:225-228, 52:31-32, 69:40-42"
            }
        ],
        "ar": "وَ یَقُوۡلُوۡنَ  اَئِنَّا  لَتَارِکُوۡۤا  اٰلِہَتِنَا لِشَاعِرٍ  مَّجۡنُوۡنٍ ﴿ؕ۳۷﴾ ",
        "ur": "اور کہتے تھے کیا ہم ایک مجنون شاعر کی خاطر اپنے معبودوں کو چھوڑ دیں گے؟",
        "v5": {
            "text": "And said, ‘Shall we give up our gods for a [a]mad poet?’",
            "notes": [
                {
                    "ref": "a",
                    "note": "15:7; 44:15; 68:52."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 38,
        "v_": 37,
        "topics": [
            {
                "id": 17994,
                "topic": "Truth: <i>Haqq</i>: Islam is",
                "verses": "58:22, 9:33, 5:84-85, 10:109, 48:29, 61:10"
            },
            {
                "id": 18008,
                "topic": "Truth: <i>Haqq</i>: Prophet came with",
                "verses": "58:22, 3:87, 2:120, 3:61, 3:63, 4:171, 7:44, 7:54, 10:109, 17:82, 34:50, 35:25"
            }
        ],
        "ar": "بَلۡ جَآءَ بِالۡحَقِّ وَ صَدَّقَ الۡمُرۡسَلِیۡنَ ﴿۳۸﴾ ",
        "ur": "حقیقت یہ ہے کہ وہ تو حق لے کر آیا تھا اور سب رسولوں کی تصدیق کرتا تھا۔",
        "v5": {
            "text": "Nay, he has brought the truth and has testified to the truth of <i>all</i> the Messengers.[3295]",
            "notes": [
                {
                    "ref": "3295",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse constitutes an effective reply to the charge that the Holy Prophet is a poet or a madman. It purports to say that the Prophet fulfils in his person all the prophecies made by the Israelite Prophets about his advent and the Quran contains all that was imperishable and of permanent value in the former revealed scriptures. How could a madman or poet do all this?</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 39,
        "v_": 38,
        "topics": [],
        "ar": "اِنَّکُمۡ  لَذَآئِقُوا  الۡعَذَابِ  الۡاَلِیۡمِ ﴿ۚ۳۹﴾ ",
        "ur": "یقیناً تم دردناک عذاب ضرور چکھنے والے ہو۔",
        "v5": {
            "text": "You shall surely taste the painful punishment.[3296]",
            "notes": [
                {
                    "ref": "3296",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse embodies another argument that the Holy Prophet is not a madman or a poet but a true Messenger of God. It warns disbelievers that they are going to be punished for rejecting his Message, but the rejection of the ravings of a maniac or the meaningless vapourings of a poet can cause no harm to anybody.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 40,
        "v_": 39,
        "topics": [],
        "ar": "وَ مَا تُجۡزَوۡنَ  اِلَّا مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿ۙ۴۰﴾ ",
        "ur": "اور تم کوئی جزا نہیں دیئے جارہے مگر اسی کی جو تم کیا کرتے تھے۔",
        "v5": {
            "text": "[b]And you will be requited only for what you have wrought—",
            "notes": [
                {
                    "ref": "b",
                    "note": "36:55; 45:29."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 41,
        "v_": 40,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            }
        ],
        "ar": "اِلَّا عِبَادَ  اللّٰہِ  الۡمُخۡلَصِیۡنَ ﴿۴۱﴾ ",
        "ur": "اللہ کے مخلص بندوں کا معاملہ الگ ہے۔",
        "v5": {
            "text": "Save the chosen servants of Allah;[3297]",
            "notes": [
                {
                    "ref": "3297",
                    "note": "<p><strong>Commentary:</strong></p><p>From this verse begins a description of the rewards of Paradise that the believers will receive in the next life and also the great Divine boons and blessings that were bestowed upon the righteous Companions of the Holy Prophet in this very life.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 42,
        "v_": 41,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 14675,
                "topic": "Provisions: spiritual",
                "verses": "20:132, 2:198, 38:55, 51:58, 65:12"
            }
        ],
        "ar": "اُولٰٓئِکَ لَہُمۡ  رِزۡقٌ  مَّعۡلُوۡمٌ ﴿ۙ۴۲﴾ ",
        "ur": " یہی وہ لوگ ہیں جن کےلئے معلوم رزق (مقدر) ہے۔",
        "v5": {
            "text": "These will have a known provision;[3298]",
            "notes": [
                {
                    "ref": "3298",
                    "note": "<p><strong>Commentary:</strong></p><p>The words رزق معلوم (a known provision) signify that the Muslims knew beforehand that they would receive Divine favours mentioned in the following verses since they were repeatedly promised those blessings.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 43,
        "v_": 42,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "فَوَاکِہُ ۚ وَ  ہُمۡ  مُّکۡرَمُوۡنَ ﴿ۙ۴۳﴾ ",
        "ur": "طرح طرح کے پھل۔ اس حال میں کہ وہ بہت عزت دیئے جائیں گے۔",
        "v5": {
            "text": "[a]Fruits; and they shall be honoured,[3299]",
            "notes": [
                {
                    "ref": "a",
                    "note": "52:23; 55:53; 56:21."
                },
                {
                    "ref": "3299",
                    "note": "<p><strong>Commentary:</strong></p><p>The word \"fruits\" signifies that the blessings mentioned in the following verses will be the fruit of right beliefs and good actions of the believers.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 44,
        "v_": 43,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13579,
                "topic": "Paradise: <i>Jannah</i>: <i>Jannatun-Na ‘im</i>",
                "verses": "26:86, 5:66, 10:10, 22:57, 31:9, 56:13, 56:90, 68:35, 70:39"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "فِیۡ   جَنّٰتِ  النَّعِیۡمِ ﴿ۙ۴۴﴾ ",
        "ur": "نعمتوں والے باغات میں۔",
        "v5": {
            "text": "[b]In the Gardens of Bliss,",
            "notes": [
                {
                    "ref": "b",
                    "note": "44:53; 68:35; 78:33."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 45,
        "v_": 44,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "عَلٰی  سُرُرٍ  مُّتَقٰبِلِیۡنَ ﴿۴۵﴾ ",
        "ur": "تختوں پر آمنے سامنے بیٹھے ہوئے ہوں گے۔",
        "v5": {
            "text": "[c]<i>Seated</i> on thrones, facing one another.[3300]",
            "notes": [
                {
                    "ref": "c",
                    "note": "56:16-17."
                },
                {
                    "ref": "3300",
                    "note": "<p><strong>Important Words:</strong></p><p>سرر (thrones) or أسرة is the plural of سریر which is derived from سر. They say سرہ i.e. he or it made him happy. سریر means, a couch-frame; a bed-stead; a raised couch; a throne. It also signifies a bier; dominion, authority, sovereignty; comfort or affluence. The Arabs say زال عن سریرہ i.e. he ceased to enjoy authority, power or comfort or affluence (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 46,
        "v_": 45,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "یُطَافُ عَلَیۡہِمۡ  بِکَاۡسٍ مِّنۡ  مَّعِیۡنٍۭ ﴿ۙ۴۶﴾ ",
        "ur": "ان پر چشموں کے بہتے پانی سے بھرے کٹوروں کا دَور چلایا جائے گا۔",
        "v5": {
            "text": "[d]They will be served round with a cup from a flowing fountain,[3300A]",
            "notes": [
                {
                    "ref": "d",
                    "note": "56:19."
                },
                {
                    "ref": "3300A",
                    "note": "<p><strong>Important Words:</strong></p><p>کأس (cup) of which the plural is کؤوس and کأسات means, a drinking cup containing wine or a cup full of wine or wine itself. They say سقاہ کأسا من الذل i.e. he gave him to drink a cup of abasement i.e. he abased him (Lane).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 47,
        "v_": 46,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "بَیۡضَآءَ   لَذَّۃٍ   لِّلشّٰرِبِیۡنَ ﴿ۚۖ۴۷﴾ ",
        "ur": "نہایت شفّاف، پینے والوں کے لئے سراسر لذت۔",
        "v5": {
            "text": "<i>Sparkling</i> white, delicious to the drinkers,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 48,
        "v_": 47,
        "topics": [
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "لَا فِیۡہَا غَوۡلٌ وَّ لَا ہُمۡ عَنۡہَا یُنۡزَفُوۡنَ ﴿۴۸﴾ ",
        "ur": "ان (مشروبات) میں نہ کوئی نشہ ہوگا اور نہ وہ ان کے اثر سے عقل کھو بیٹھیں گے۔ ",
        "v5": {
            "text": "[a]Where in there will be no intoxication, nor will they be exhausted thereby.[3301]",
            "notes": [
                {
                    "ref": "a",
                    "note": "56:20."
                },
                {
                    "ref": "3301",
                    "note": "<p><strong>Important Words:</strong></p><p>غول (intoxication) is derived from غال. They say غاله i.e. he or it destroyed him; or it seized him or took him away unawares. اغتاله الخمرmeans, the wine deprived him of his reason. غولmeans, far extent of a desert; the evil result of headache; headache or intoxication; deprivation of intellectual faculties (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 49,
        "v_": 48,
        "topics": [
            {
                "id": 1079,
                "topic": "‘Ain: beautiful eyes",
                "verses": "7:41, 44:55, 52:21, 56:23-24"
            },
            {
                "id": 10725,
                "topic": "Maknun: preserved",
                "verses": "56:79, 52:25, 56:23-24"
            },
            {
                "id": 13461,
                "topic": "Paradise: <i>Jannah</i>: chaste companions in",
                "verses": "2:26, 3:16, 36:57, 38:53, 44:55, 52:21, 52:25, 55:57, 55:59, 55:71, 55:73, 55:75, 56:18, 56:23-24, 56:35-38, 76:20, 78:34"
            },
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "وَ عِنۡدَہُمۡ  قٰصِرٰتُ الطَّرۡفِ عِیۡنٌ ﴿ۙ۴۹﴾ ",
        "ur": "اور ان کے پاس نظریں جھکائے رکھنے والیاں، فراخ چشم (دوشیزائیں) ہوں گی۔",
        "v5": {
            "text": "[b]And with them will be <i>chaste</i> women, with restrained looks <i>and</i> large beautiful eyes.[3302]",
            "notes": [
                {
                    "ref": "b",
                    "note": "55:57."
                },
                {
                    "ref": "3302",
                    "note": "<p><strong>Important Words:</strong></p><p>عین (women having large beautiful eyes) is the plural of عیناء which means, a woman having large beautiful eyes. It also means a good or beautiful word or saying. ارض عیناء means, green or black earth (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 50,
        "v_": 49,
        "topics": [
            {
                "id": 7088,
                "topic": "Egg: <i>Baidah</i>",
                "verses": null
            },
            {
                "id": 10725,
                "topic": "Maknun: preserved",
                "verses": "56:79, 52:25, 56:23-24"
            },
            {
                "id": 13461,
                "topic": "Paradise: <i>Jannah</i>: chaste companions in",
                "verses": "2:26, 3:16, 36:57, 38:53, 44:55, 52:21, 52:25, 55:57, 55:59, 55:71, 55:73, 55:75, 56:18, 56:23-24, 56:35-38, 76:20, 78:34"
            },
            {
                "id": 13497,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13625,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            }
        ],
        "ar": "کَاَنَّہُنَّ بَیۡضٌ مَّکۡنُوۡنٌ ﴿۵۰﴾ ",
        "ur": "(وہ دمک رہی ہوں گی) گویا وہ ڈھانک کر رکھے ہوئے انڈے ہیں۔",
        "v5": {
            "text": "[c]As though they were sheltered eggs.[3303]",
            "notes": [
                {
                    "ref": "c",
                    "note": "55:59."
                },
                {
                    "ref": "3303",
                    "note": "<p><strong>Commentary:</strong></p><p>History bears testimony to the fact that Muslims were endowed with all the blessings mentioned in the foregoing verses. They had gardens of bliss; they sat on thrones and enjoyed power and dominion; they had all the innocent pleasures of life; they had beautiful chaste women as their spouses and, over and above all this, \"God was well pleased with them and they were well pleased with Him\" (58:23). This was their greatest achievement.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 51,
        "v_": 50,
        "topics": [],
        "ar": "فَاَقۡبَلَ بَعۡضُہُمۡ عَلٰی بَعۡضٍ یَّتَسَآءَلُوۡنَ ﴿۵۱﴾ ",
        "ur": "تو ان میں سے بعض، بعض دوسروں سے سوال کرتے ہوئے متوجہ ہوں گے۔",
        "v5": {
            "text": "Then some of them will address the others, questioning one another.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 52,
        "v_": 51,
        "topics": [],
        "ar": "قَالَ  قَآئِلٌ مِّنۡہُمۡ  اِنِّیۡ کَانَ لِیۡ قَرِیۡنٌ ﴿ۙ۵۲﴾ ",
        "ur": "ان میں سے ایک کہنے والا کہے گا یقیناً میرا ایک ساتھی ہوا کرتا تھا۔",
        "v5": {
            "text": "A speaker from among them will say, “I had a companion,[3304]",
            "notes": [
                {
                    "ref": "3304",
                    "note": "<p><strong>Commentary:</strong></p><p>From this verse begins the description of the state of mind of a dweller of Paradise—a true believer—after he has seen an erstwhile companion of his burning in the fire of Hell. The following verses also describe the conditions of the believers and the disbelievers after they meet their destiny.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 53,
        "v_": 52,
        "topics": [],
        "ar": "یَّقُوۡلُ  اَئِنَّکَ  لَمِنَ  الۡمُصَدِّقِیۡنَ ﴿۵۳﴾ ",
        "ur": "وہ کہا کرتا تھا کیا تم (اس بات کی) تصدیق کرنے والے ہو؟",
        "v5": {
            "text": "Who used to say, ‘Art thou indeed among those who believe <i>it</i> to be true?[3305]",
            "notes": [
                {
                    "ref": "3305",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse shows that the disbeliever in Hell used to scoff and jeer at his companion in the present life for having been a believer.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 54,
        "v_": 53,
        "topics": [
            {
                "id": 4579,
                "topic": "Bones: resurrection after are turned to dust",
                "verses": "2:260, 56:48, 17:50, 17:99, 23:36, 23:83, 36:79, 37:17, 75:4, 79:11-12"
            },
            {
                "id": 6833,
                "topic": "Dust: bones turned into",
                "verses": "56:48, 13:6, 23:36, 23:83, 27:68, 37:17, 50:4"
            }
        ],
        "ar": "ءَ اِذَا مِتۡنَا وَ کُنَّا تُرَابًا وَّ  عِظَامًا  ءَ اِنَّا لَمَدِیۡنُوۡنَ ﴿۵۴﴾",
        "ur": "کہ کیا جب ہم مر جائیں گے اور خاک ہو جائیں گے اور ہڈیاں رہ جائیں گے تو کیا ہم پھر بھی جزا دئیے جانے والے ہیں؟",
        "v5": {
            "text": "[a]‘When we are dead, and have become dust and bones, shall we indeed be requited?’[3306]",
            "notes": [
                {
                    "ref": "a",
                    "note": "13:6; 27:68; 50:4; 56:48."
                },
                {
                    "ref": "3306",
                    "note": "<p><strong>Commentary:</strong></p><p>The disbeliever used to mock at the idea that there was a life after death and that man after having been reduced to dust and ashes would ever come to life again.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 55,
        "v_": 54,
        "topics": [],
        "ar": "قَالَ  ہَلۡ  اَنۡتُمۡ  مُّطَّلِعُوۡنَ ﴿۵۵﴾ ",
        "ur": "وہ کہے گا کیا تم جھانک کے دیکھ سکتے ہو؟",
        "v5": {
            "text": "<i>The speaker will then</i> ask, ‘Will you have a look <i>at him</i>?’[3307]",
            "notes": [
                {
                    "ref": "3307",
                    "note": "<p><strong>Commentary:</strong></p><p>The subject of the verb قال (will ask) is the inmate of Paradise referred to in v. 52 above. He will ask other inmates of Paradise if they would like to have a look at his former disbelieving companion.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 56,
        "v_": 55,
        "topics": [],
        "ar": "فَاطَّلَعَ  فَرَاٰہُ  فِیۡ  سَوَآءِ  الۡجَحِیۡمِ ﴿۵۶﴾ ",
        "ur": "پس اس نے جھانک کر دیکھا تو اس (ساتھی) کو جہنم کے عین درمیان میں پایا۔",
        "v5": {
            "text": "Then he will look and see him in the midst of the Fire.[3308]",
            "notes": [
                {
                    "ref": "3308",
                    "note": "<p><strong>Important Words:</strong></p><p>جحیم (Fire) is derived from جحم. They say جحمت النار i.e. the fire burned; burned brightly or fiercely. جحم العین means, he opened the eyes. جحیم therefore means, a fire burning or blazing or flaming vehemently; a vehemently hot place; any great fire in a pit (Lane &amp; Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 57,
        "v_": 56,
        "topics": [],
        "ar": "قَالَ تَاللّٰہِ   اِنۡ  کِدۡتَّ  لَتُرۡدِیۡنِ ﴿ۙ۵۷﴾ ",
        "ur": " اس نے کہا اللہ کی قسم! قریب تھا کہ تُو مجھے بھی ہلاک کر دیتا۔",
        "v5": {
            "text": "He will say to him, ‘By Allah, thou didst almost cause me to perish.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 58,
        "v_": 57,
        "topics": [
            {
                "id": 8087,
                "topic": "Grace: <i>Fadl</i>: bestowed on believers",
                "verses": "62:11, 2:65, 3:104, 4:84, 4:114, 4:174, 4:176, 5:55, 14:41, 20:123, 24:11, 24:15, 24:21, 24:22, 27:17, 27:41, 34:11, 42:27, 48:30, 49:9, 52:30, 57:22, 59:7, 59:9, 62:5, 68:3"
            },
            {
                "id": 12935,
                "topic": "Ni‘mat: favours",
                "verses": "1:7, 2:41, 2:48, 2:123, 2:151, 2:212, 2:232, 3:104, 3:172, 3:175, 4:70, 5:4, 5:7-8, 5:12, 5:21, 5:111, 8:54, 12:7, 14:7, 14:29, 14:35, 16:19, 16:54, 16:72-73, 16:84, 16:122, 19:59, 26:23, 27:20, 28:18, 31:32, 33:10, 35:4, 39:9, 39:50, 46:16, 48:3, 49:9, 52:30, 54:36, 68:3, 68:50, 93:12"
            }
        ],
        "ar": "وَ لَوۡ لَا نِعۡمَۃُ رَبِّیۡ  لَکُنۡتُ مِنَ الۡمُحۡضَرِیۡنَ ﴿۵۸﴾",
        "ur": "اور اگر میرے ربّ کی نعمت نہ ہوتی تو میں ضرور پیش کئے جانے والوں میں سے ہوتا۔",
        "v5": {
            "text": "And had it not been for the favour of my Lord, I should surely have been of those who are called up <i>before Him</i>.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 59,
        "v_": 58,
        "topics": [
            {
                "id": 10872,
                "topic": "Man: not immortal",
                "verses": "21:35-36, 2:29, 3:186, 20:56, 22:8, 23:101, 29:58, 36:69, 36:79, 40:12, 50:19-20, 55:27-28, 58:7, 71:19"
            }
        ],
        "ar": "اَفَمَا نَحۡنُ بِمَیِّتِیۡنَ ﴿ۙ۵۹﴾ ",
        "ur": "پس کیا ہم مرنے والے نہیں تھے؟",
        "v5": {
            "text": "Is it <i>not so that</i> we are not going to die <i>again</i>,[3309]",
            "notes": [
                {
                    "ref": "3309",
                    "note": "<p><strong>Commentary:</strong></p><p>The believer in Paradise is here mentioned as referring to the great destiny of man—his eternal life. He says that man will not suffer death after his departure from this world. His spiritual journey to Eternity will know no end or retreat. It will be one continuous and eternal progress. This same subject has also been dealt with in 44:57 where it is stated: \"they will not taste death therein, other than the first death. And He will save them from the punishment of the blazing fire.\" The verse under comment may also mean that the believer in Paradise will say to his disbelieving companion in Hell that the latter must have now realized that he was wrong in believing that after having been reduced to dust and bones, man will not be given a new life. He will repeat the words of his companion in the previous life who used to say that there would be no prolonged punishment after death.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 60,
        "v_": 59,
        "topics": [
            {
                "id": 10872,
                "topic": "Man: not immortal",
                "verses": "21:35-36, 2:29, 3:186, 20:56, 22:8, 23:101, 29:58, 36:69, 36:79, 40:12, 50:19-20, 55:27-28, 58:7, 71:19"
            }
        ],
        "ar": "اِلَّا مَوۡتَتَنَا الۡاُوۡلٰی وَ مَا نَحۡنُ بِمُعَذَّبِیۡنَ ﴿۶۰﴾ ",
        "ur": "سوائے ہماری پہلی موت کے اور ہمیں ہرگز عذاب نہیں دیا جائے گا۔",
        "v5": {
            "text": "[a]Save our previous death, and that we are not to be punished?",
            "notes": [
                {
                    "ref": "a",
                    "note": "23:38; 44:36."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 61,
        "v_": 60,
        "topics": [
            {
                "id": 17306,
                "topic": "Success: <i>Fauz</i>, <i>Ghalabah</i>",
                "verses": "23:2, 3:186, 4:14, 4:74, 5:57, 9:1, 9:20, 9:72, 9:89, 9:100, 9:111, 10:10, 24:53, 33:72, 39:62, 40:10, 47:6, 58:23, 59:10, 61:13, 78:32"
            }
        ],
        "ar": "اِنَّ ہٰذَا  لَہُوَ  الۡفَوۡزُ  الۡعَظِیۡمُ ﴿۶۱﴾ ",
        "ur": "یقیناً یہی (ایمان لانے والے کی) ایک بہت بڑی کامیابی ہے۔",
        "v5": {
            "text": "[b]Surely, this is the supreme triumph.[3310]",
            "notes": [
                {
                    "ref": "b",
                    "note": "44:58; 61:13."
                },
                {
                    "ref": "3310",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that man’s greatest achievement and the fulfilment of his highest destiny lies in enjoying eternal life and making incessant and everlasting spiritual progress.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 62,
        "v_": 61,
        "topics": [],
        "ar": "لِمِثۡلِ ہٰذَا فَلۡیَعۡمَلِ الۡعٰمِلُوۡنَ ﴿۶۲﴾ ",
        "ur": "پس چاہئے کہ ایسے ہی مقام (کے حصول) کے لئے سب عمل کرنے والے عمل کریں۔",
        "v5": {
            "text": "For the like of this, then, let the workers work.’[3311]",
            "notes": [
                {
                    "ref": "3311",
                    "note": "<p><strong>Commentary:</strong></p><p>The words of this and the preceding verse may also be taken as having been spoken by God Himself.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 63,
        "v_": 62,
        "topics": [
            {
                "id": 8687,
                "topic": "Hell: <i>Jahannam</i>: conditions in",
                "verses": "19:69, 17:98, 3:107, 3:182, 6:71, 8:51, 10:28, 11:107, 14:17, 14:51, 15:45, 16:30, 18:30, 18:101, 19:72, 21:40, 21:101, 22:20-23, 23:105, 25:35, 26:92, 27:91, 32:21, 38:58, 39:61, 39:72-73, 40:72-73, 44:44-47, 44:49, 47:16, 54:49, 55:45, 56:43-45, 56:53-55, 56:94, 67:8, 67:28, 69:33, 69:37, 76:5, 78:25-26, 88:6-8, 102:7"
            },
            {
                "id": 17864,
                "topic": "Tree: <i>Shajarah</i>: evil, <i>-khabithah</i>",
                "verses": "14:27, 44:44, 56:53"
            },
            {
                "id": 19005,
                "topic": "Zaqqum",
                "verses": "14:27, 44:44-5, 56:53-54"
            }
        ],
        "ar": "اَذٰلِکَ خَیۡرٌ  نُّزُلًا  اَمۡ شَجَرَۃُ  الزَّقُّوۡمِ ﴿۶۳﴾ ",
        "ur": "کیا بطور مہمان نوازی یہ بہتر ہے یا تھوہر کا پودا۔",
        "v5": {
            "text": "Is that better as an entertainment, or [c]the tree of Zaqqum?[3312]",
            "notes": [
                {
                    "ref": "c",
                    "note": "44:44; 56:53."
                },
                {
                    "ref": "3312",
                    "note": "<p><strong>Important Words:</strong></p><p>زقوم (<i>Zaqqum</i>) is derived from زقم. They say زقمه i.e. he swallowed it and devoured it. زقم اللبن means, he drank much milk. زقوم is a dust-coloured tree which has a pungent odour and is bitter and has stinking leaves. The word also means, any deadly food; the food of the people of Hell (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p><i>Zaqqum</i> in the verse under comment denotes the tree of disbelief. The Quran has compared true belief to a good tree which brings forth its fruit at all times (14:25-26) and disbelief to an evil tree—<i>Zaqqum</i>. Taking it in the sense of deadly food, the verse would mean that the fruit of the accursed tree of disbelief is deadly and its eating brings about spiritual death. The word has been used in the same sense and in the same context at two other places in the Quran, viz. 44:44, 45, 46 &amp; 56:53, 54, 55.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 64,
        "v_": 63,
        "topics": [
            {
                "id": 17904,
                "topic": "Trial: Fitnah",
                "verses": "7:156, 2:103, 5:72, 8:29, 8:74, 9:49, 10:86, 17:61, 21:36, 21:112, 22:12, 22:54, 24:64, 25:21, 29:11, 39:50, 54:28, 60:6, 64:16, 74:32"
            },
            {
                "id": 19005,
                "topic": "Zaqqum",
                "verses": "14:27, 44:44-5, 56:53-54"
            }
        ],
        "ar": "اِنَّا جَعَلۡنٰہَا فِتۡنَۃً  لِّلظّٰلِمِیۡنَ ﴿۶۴﴾ ",
        "ur": "یقیناً ہم نے اسے ظالموں کےلئے آزمائش بنایا ہے۔",
        "v5": {
            "text": "Verily, We have made it a trial for the wrongdoers.[3313]",
            "notes": [
                {
                    "ref": "3313",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that the evil tree of disbelief has always proved a great source of mischief for men.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 65,
        "v_": 64,
        "topics": [
            {
                "id": 19005,
                "topic": "Zaqqum",
                "verses": "14:27, 44:44-5, 56:53-54"
            }
        ],
        "ar": "اِنَّہَا شَجَرَۃٌ  تَخۡرُجُ فِیۡۤ  اَصۡلِ الۡجَحِیۡمِ ﴿ۙ۶۵﴾ ",
        "ur": "یقیناً یہ ایک پودا ہے جو جہنم کی گہرائی میں اُگتا ہے۔",
        "v5": {
            "text": "It is a tree that springs forth in the bottom of Hell;[3314]",
            "notes": [
                {
                    "ref": "3314",
                    "note": "<p><strong>Commentary:</strong></p><p>The implication of the verse seems to be that eating of the tree of disbelief leads men to the bottom of Hell.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 66,
        "v_": 65,
        "topics": [
            {
                "id": 16505,
                "topic": "Serpent: <i>Hayyah, Jann, Thu‘ban</i>",
                "verses": "7:108, 7:118, 20:21, 26:33, 27:11, 28:32"
            },
            {
                "id": 19005,
                "topic": "Zaqqum",
                "verses": "14:27, 44:44-5, 56:53-54"
            }
        ],
        "ar": "طَلۡعُہَا کَاَنَّہٗ  رُءُوۡسُ الشَّیٰطِیۡنِ ﴿۶۶﴾ ",
        "ur": "اس کے شگوفے ایسے ہیں جیسے شیطانوں کے سر۔",
        "v5": {
            "text": "The fruit thereof is as though it were the heads of serpents.[3315]",
            "notes": [
                {
                    "ref": "3315",
                    "note": "<p><strong>Commentary:</strong></p><p>The metaphorical description of <i>Zaqqum</i> continues in the present verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 67,
        "v_": 66,
        "topics": [
            {
                "id": 19005,
                "topic": "Zaqqum",
                "verses": "14:27, 44:44-5, 56:53-54"
            }
        ],
        "ar": "فَاِنَّہُمۡ لَاٰکِلُوۡنَ مِنۡہَا فَمَالِـُٔوۡنَ مِنۡہَا الۡبُطُوۡنَ ﴿ؕ۶۷﴾ ",
        "ur": "پس یقیناً وہ اُسی میں سے کھانے والے ہیں۔ پھر اسی سے پیٹ بھرنے والے ہیں۔",
        "v5": {
            "text": "[a]And they shall eat of it and fill <i>their</i> bellies therewith.",
            "notes": [
                {
                    "ref": "a",
                    "note": "56:54."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 68,
        "v_": 67,
        "topics": [
            {
                "id": 18452,
                "topic": "Water: <i>Ma’</i>: as punishment",
                "verses": "38:58, 6:71, 7:51, 10:5, 14:17, 22:20, 40:73, 44:47, 44:49, 47:16, 56:43, 56:55, 56:94, 78:26"
            },
            {
                "id": 18482,
                "topic": "Water: <i>Ma’</i>: sent from heaven",
                "verses": "16:11-12, 2:23, 2:165, 6:100, 7:58, 8:12, 10:25, 13:18, 14:33, 15:23, 16:66, 18:46, 22:6, 22:64, 23:19, 27:61, 30:25, 32:28, 35:28, 38:58, 39:22, 41:40, 43:12, 50:10, 55:45, 78:15, 88:6"
            }
        ],
        "ar": "ثُمَّ  اِنَّ لَہُمۡ عَلَیۡہَا لَشَوۡبًا مِّنۡ حَمِیۡمٍ ﴿ۚ۶۸﴾ ",
        "ur": "پھر یقیناً ان کے لئے اُس (کھانے) کے بعد شدید گرم پانی ملا ہوا مشروب ہوگا۔",
        "v5": {
            "text": "Then will they have in addition to it a mixture of boiling water <i>to drink</i>.[3316]",
            "notes": [
                {
                    "ref": "3316",
                    "note": "<p><strong>Important Words:</strong></p><p>شوبا (mixture) is derived from شاب. They say شاب الشیء i.e. he mixed the thing with water; he adulterated it. شاب الرجل means, he deceived the man and defrauded him, he acted treacher-ously; he deceived in buying or selling. شوب means, anything mixed, mixture; a medley; heat; honey; a piece of dough (Aqrab &amp; Lane).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 69,
        "v_": 68,
        "topics": [
            {
                "id": 15273,
                "topic": "Raja‘: return",
                "verses": "7:151, 2:197, 2:231, 3:73, 7:169, 7:175, 9:83, 9:94, 9:122, 12:47, 12:64, 20:41, 20:87, 20:92, 21:14, 21:59, 21:65, 27:29, 36:51, 31:35, 42:29, 57:21, 63:9, 71:12"
            }
        ],
        "ar": "ثُمَّ   اِنَّ  مَرۡجِعَہُمۡ  لَا۠ اِلَی  الۡجَحِیۡمِ ﴿۶۹﴾ ",
        "ur": "پھر یقیناً جہنم کی طرف ان کو لوٹ کر جانا ہوگا۔",
        "v5": {
            "text": "Then surely their return shall be to Hell.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 70,
        "v_": 69,
        "topics": [],
        "ar": "اِنَّہُمۡ  اَلۡفَوۡا  اٰبَآءَہُمۡ  ضَآلِّیۡنَ ﴿ۙ۷۰﴾ ",
        "ur": "یقیناً انہوں نے اپنے آباءو اجداد کو گمراہ پایا تھا۔",
        "v5": {
            "text": "[b]They indeed found their fathers erring,",
            "notes": [
                {
                    "ref": "b",
                    "note": "7:174."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 71,
        "v_": 70,
        "topics": [],
        "ar": "فَہُمۡ عَلٰۤی  اٰثٰرِہِمۡ  یُہۡرَعُوۡنَ ﴿۷۱﴾ ",
        "ur": "پس انہی کے نقوشِ پا پر وہ بھی دوڑائے جا رہے ہیں۔",
        "v5": {
            "text": "[a]And they hurried on in their footsteps.[3317]",
            "notes": [
                {
                    "ref": "a",
                    "note": "43:24."
                },
                {
                    "ref": "3317",
                    "note": "<p><strong>Important Words:</strong></p><p>For یھرعون (hurried on) see 11:79.</p><p><strong>Commentary:</strong></p><p>Men are generally slaves to old usages, traditions and customs. Time-worn ideas and prejudices die hard. Perhaps the greatest obstacle in the way of acceptance of truth by the people, as repeatedly mentioned in the Quran, is their strong disinclination to accept new ideas. Man is by nature slow to change. This seems to be the significance of this verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 72,
        "v_": 71,
        "topics": [
            {
                "id": 5633,
                "topic": "Dallin: astray",
                "verses": "1:7, 2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:28, 13:34, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:5, 22:10, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:33, 38:27, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            }
        ],
        "ar": "وَ لَقَدۡ ضَلَّ  قَبۡلَہُمۡ  اَکۡثَرُ الۡاَوَّلِیۡنَ ﴿ۙ۷۲﴾ ",
        "ur": "اور یقیناً ان سے قبل پہلی قوموں میں سے بھی اکثر گمراہ ہو چکے تھے۔",
        "v5": {
            "text": "And most of the ancient peoples had erred before them,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 73,
        "v_": 72,
        "topics": [],
        "ar": "وَ لَقَدۡ اَرۡسَلۡنَا فِیۡہِمۡ مُّنۡذِرِیۡنَ ﴿۷۳﴾ ",
        "ur": "جبکہ یقیناً ہم ان میں ڈرانے والے بھیج چکے تھے۔",
        "v5": {
            "text": "And We had sent Warners among them.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 74,
        "v_": 73,
        "topics": [],
        "ar": "فَانۡظُرۡ کَیۡفَ کَانَ عَاقِبَۃُ  الۡمُنۡذَرِیۡنَ ﴿ۙ۷۴﴾ ",
        "ur": "پس دیکھ کہ ڈرائے جانے والوں کا انجام کیسا ہوا۔",
        "v5": {
            "text": "Behold, then; how <i>evil</i> was the end of those who were warned.[3318]",
            "notes": [
                {
                    "ref": "3318",
                    "note": "<p><strong>Commentary:</strong></p><p>The lesson is writ large on the face of history that God’s Messengers appeared among all peoples, that the Divine Message was invariably received with ridicule and mockery, and that the rejecters of truth were always punished. It is to this supreme lesson of history that the attention of disbelievers is repeatedly drawn in the words of the Quran, \"Behold, how evil was the end of those who were warned.\" Yet such is the tragedy of human affairs that disbelievers do not benefit from looking at the fate of their disbelieving predecessors.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 75,
        "v_": 74,
        "topics": [
            {
                "id": 16544,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:82, 37:161, 38:18, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 66:11, 89:30"
            }
        ],
        "ar": "اِلَّا عِبَادَ  اللّٰہِ  الۡمُخۡلَصِیۡنَ ﴿٪۷۵﴾ ",
        "ur": "سوائے اللہ کے خالص کئے ہوئے بندوں کے۔",
        "v5": {
            "text": "Save the chosen servants of Allah.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 76,
        "v_": 75,
        "topics": [
            {
                "id": 3405,
                "topic": "Attributes of Allah: Al-Mujib (Answerer of Prayers)",
                "verses": "11:62, 3:196"
            },
            {
                "id": 9280,
                "topic": "In‘am: favour",
                "verses": "4:70, 1:7, 2:272, 3:137, 11:11, 16:122, 31:21, 44:28, 73:12, 82:14, 89:16"
            },
            {
                "id": 13062,
                "topic": "Noah: <i>Nuh(as)</i>: descendants of",
                "verses": "6:85-87"
            },
            {
                "id": 13088,
                "topic": "Noah: <i>Nuh(as)</i>: prayer of",
                "verses": "71:27-29, 11:35-37, 11:46, 21:77, 23:27, 23:30, 26:119, 54:11"
            },
            {
                "id": 13099,
                "topic": "Noah: <i>Nuh(as)</i>: story of",
                "verses": "7:60-65, 3:34, 10:72-74, 11:26-49, 23:24-31, 25:38, 26:106-121, 51:47, 54:10-17, 71:2-29"
            }
        ],
        "ar": "وَ لَقَدۡ نَادٰٮنَا نُوۡحٌ فَلَنِعۡمَ الۡمُجِیۡبُوۡنَ ﴿۫ۖ۷۶﴾ ",
        "ur": "اور یقیناً ہمیں نوح نے پکارا تو (دیکھو) ہم کیسا اچھا جواب دینے والے ہیں۔ ",
        "v5": {
            "text": "And Noah indeed did cry unto Us, and what excellent answer do We give <i>to prayers</i>![3319]",
            "notes": [
                {
                    "ref": "3319",
                    "note": "<p><strong>Commentary:</strong></p><p>The supreme lesson of history to which reference has been made in the preceding verses and which has been summed up in the last but one verse, viz. that truth ultimately triumphs and its rejecters come to grief, has been exemplified in the lives of Divine Messengers, a brief description of whose life-story begins with this verse and is continued in the following verses. The account of these Prophets begins with the history of the Prophet Noah with whom the foundations of human civilised society were laid. See also 7:60-65 and 11:37-50.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 77,
        "v_": 76,
        "topics": [
            {
                "id": 7380,
                "topic": "Family",
                "verses": "11:46-47, 2:41, 2:197, 2:249, 3:34, 3:36, 7:84, 11:41, 11:82, 12:7, 12:89, 15:66, 20:30, 21:77, 21:85, 26:170-171, 27:50, 28:9, 28:30, 29:33, 38:44, 49:14, 84:10"
            },
            {
                "id": 13062,
                "topic": "Noah: <i>Nuh(as)</i>: descendants of",
                "verses": "6:85-87"
            },
            {
                "id": 13088,
                "topic": "Noah: <i>Nuh(as)</i>: prayer of",
                "verses": "71:27-29, 11:35-37, 11:46, 21:77, 23:27, 23:30, 26:119, 54:11"
            },
            {
                "id": 13099,
                "topic": "Noah: <i>Nuh(as)</i>: story of",
                "verses": "7:60-65, 3:34, 10:72-74, 11:26-49, 23:24-31, 25:38, 26:106-121, 51:47, 54:10-17, 71:2-29"
            }
        ],
        "ar": "وَ نَجَّیۡنٰہُ  وَ اَہۡلَہٗ  مِنَ الۡکَرۡبِ الۡعَظِیۡمِ ﴿۫ۖ۷۷﴾ ",
        "ur": "اور ہم نے اس کو اور اس کے اہل کو بڑی بے چینی سے نجات بخشی۔",
        "v5": {
            "text": "[a]And We saved him and his family from the great distress;[3320]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:77; 26:120; 54:14."
                },
                {
                    "ref": "3320",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference in the words \"great distress\" is to \"Noah’s Flood\".</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 78,
        "v_": 77,
        "topics": [
            {
                "id": 13062,
                "topic": "Noah: <i>Nuh(as)</i>: descendants of",
                "verses": "6:85-87"
            },
            {
                "id": 13099,
                "topic": "Noah: <i>Nuh(as)</i>: story of",
                "verses": "7:60-65, 3:34, 10:72-74, 11:26-49, 23:24-31, 25:38, 26:106-121, 51:47, 54:10-17, 71:2-29"
            }
        ],
        "ar": "وَ جَعَلۡنَا ذُرِّیَّتَہٗ  ہُمُ  الۡبٰقِیۡنَ ﴿۫ۖ۷۸﴾ ",
        "ur": "اور ہم نے اس کی ذریت کو ہی باقی رہنے والا بنادیا۔",
        "v5": {
            "text": "And We made his offspring the only survivors.[3321]",
            "notes": [
                {
                    "ref": "3321",
                    "note": "<p><strong>Commentary:</strong></p><p>As stated in v. 76 above, Noah laid the foundations of human civilization and culture and it is an established fact of history that with the progress of a people in civilization their numbers tend to increase and a corresponding decrease takes place in the numbers of less civilised communities living with them in the same or surrounding lands. The descendants of Noah being more civilised and having more material resources at their disposal seemed to have spread to other lands and subjugated less civilized peoples, who in course of time became absorbed in them and consequently became extinct.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 79,
        "v_": 78,
        "topics": [
            {
                "id": 13099,
                "topic": "Noah: <i>Nuh(as)</i>: story of",
                "verses": "7:60-65, 3:34, 10:72-74, 11:26-49, 23:24-31, 25:38, 26:106-121, 51:47, 54:10-17, 71:2-29"
            }
        ],
        "ar": "وَ تَرَکۡنَا عَلَیۡہِ  فِی الۡاٰخِرِیۡنَ ﴿۫ۖ۷۹﴾ ",
        "ur": "اور ہم نے بعد میں آنے والوں میں اس کا ذکرِخیر باقی رکھا۔",
        "v5": {
            "text": "And We left for him <i>a </i><i>good name</i> among the later generations.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 80,
        "v_": 79,
        "topics": [
            {
                "id": 13056,
                "topic": "Noah: <i>Nuh(as)</i>",
                "verses": "7:60, 11:26-27, 17:4, 23:24, 29:15"
            },
            {
                "id": 13099,
                "topic": "Noah: <i>Nuh(as)</i>: story of",
                "verses": "7:60-65, 3:34, 10:72-74, 11:26-49, 23:24-31, 25:38, 26:106-121, 51:47, 54:10-17, 71:2-29"
            },
            {
                "id": 16031,
                "topic": "Salam: greetings of",
                "verses": "39:74, 4:95, 7:47, 10:11, 10:26, 11:70, 13:25, 14:24, 16:33, 19:16, 19:34, 19:48, 19:63, 25:64, 25:76, 28:56, 33:45, 36:59, 37:110, 37:121, 37:131, 37:182, 43:90, 51:26, 56:27, 56:92"
            }
        ],
        "ar": "سَلٰمٌ  عَلٰی نُوۡحٍ فِی الۡعٰلَمِیۡنَ ﴿۸۰﴾ ",
        "ur": "سلام ہو نوح پر تمام جہانوں میں۔",
        "v5": {
            "text": "Peace be upon Noah among the peoples!",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 81,
        "v_": 80,
        "topics": [
            {
                "id": 9739,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 13099,
                "topic": "Noah: <i>Nuh(as)</i>: story of",
                "verses": "7:60-65, 3:34, 10:72-74, 11:26-49, 23:24-31, 25:38, 26:106-121, 51:47, 54:10-17, 71:2-29"
            }
        ],
        "ar": "اِنَّا کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿۸۱﴾ ",
        "ur": "یقیناً ہم اِسی طرح اچھے کام کرنے والوں کو جزا دیا کرتے ہیں۔",
        "v5": {
            "text": "Thus indeed do We reward those who do good.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 82,
        "v_": 81,
        "topics": [
            {
                "id": 13099,
                "topic": "Noah: <i>Nuh(as)</i>: story of",
                "verses": "7:60-65, 3:34, 10:72-74, 11:26-49, 23:24-31, 25:38, 26:106-121, 51:47, 54:10-17, 71:2-29"
            },
            {
                "id": 16545,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:161, 38:18, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 66:11, 89:30"
            }
        ],
        "ar": "اِنَّہٗ  مِنۡ عِبَادِنَا الۡمُؤۡمِنِیۡنَ ﴿۸۲﴾ ",
        "ur": "بلاشبہ وہ ہمارے مومن بندوں میں سے تھا۔",
        "v5": {
            "text": "He was surely <i>one</i> of Our believing servants.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 83,
        "v_": 82,
        "topics": [
            {
                "id": 4839,
                "topic": "Calamities: <i>‘Adhab</i>: rain and drowning",
                "verses": "23:77-78, 21:77-78, 7:65, 7:137, 10:74, 20:79, 26:121, 26:174, 27:59, 54:12-13, 71:26"
            },
            {
                "id": 6813,
                "topic": "Drown: <i>Gharq</i>: Noah’s people",
                "verses": "23:28, 7:65, 10:74, 11:38, 11:44, 21:78, 25:38, 26:121, 71:26"
            }
        ],
        "ar": "ثُمَّ   اَغۡرَقۡنَا الۡاٰخَرِیۡنَ  ﴿۸۳﴾",
        "ur": "پھر دوسروں کو ہم نے غرق کر دیا۔",
        "v5": {
            "text": "Then We drowned the others.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 84,
        "v_": 83,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 361,
                "topic": "Abraham: <i>Ibrahim(as)</i>: was of Noah’s party",
                "verses": null
            }
        ],
        "ar": "وَ  اِنَّ مِنۡ شِیۡعَتِہٖ  لَاِبۡرٰہِیۡمَ ﴿ۘ۸۴﴾ ",
        "ur": "اور یقیناً اُسی کے گروہ میں سے ابراہیم بھی تھا۔",
        "v5": {
            "text": "And verily of his party was <i>also</i> Abraham;[3322]",
            "notes": [
                {
                    "ref": "3322",
                    "note": "<p><strong>Important Words:</strong></p><p>شیعة (party) is derived from شاع. They say شاع i.e. he followed him and helped him or was his companion. شیعه (<i>shayya’-hu</i>) means, he went out with him to see him off or to accompany him to his abode. شیعة means, a separate or distinct party or sect of men; any people that have combined in or for an affair. شیعة الرجل means, a man’s followers and his helpers. شیع (plural) is applied to any people or party whose affair or case is one, who follow one another’s opinion. اشیاع (which is plural.) means, the likes (Aqrab &amp; Lane).</p><p><strong>Commentary:</strong></p><p>The verse may mean that Abraham was a follower of the Law of Noah or that he belonged to the same category, i.e. the category of Divine Messengers, to which Noah belonged.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 85,
        "v_": 84,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 4739,
                "topic": "Breast: <i>Fu‘ad, Qalb</i>",
                "verses": "6:126, 3:120, 3:155, 7:3, 7:180, 11:13, 15:98, 16:79, 16:107, 20:26, 22:47, 25:33, 26:14, 39:23, 40:20, 40:57, 53:12, 94:2, 100:11"
            },
            {
                "id": 14764,
                "topic": "Pure",
                "verses": "3:39, 4:44, 4:161, 5:7, 16:98, 22:25, 40:65, 45:17, 61:13, 98:3"
            }
        ],
        "ar": "اِذۡ  جَآءَ  رَبَّہٗ  بِقَلۡبٍ  سَلِیۡمٍ ﴿۸۵﴾ ",
        "ur": "(یاد کر) جب وہ اپنے ربّ کے حضور قلبِ سلیم لے کر حاضر ہوا۔",
        "v5": {
            "text": "[a]When he came to his Lord with a pure heart;[3323]",
            "notes": [
                {
                    "ref": "a",
                    "note": "26:90."
                },
                {
                    "ref": "3323",
                    "note": "<p><strong>Important Words:</strong></p><p>سلیم (sound) is derived from سلم which means, he was safe and secure. سلم من عیب او آفة means, he was or became free from defect or safe or secure from calamity. أسلم لله means, he submitted or resigned to God. سلیم therefore means, sound, healthy, safe and free from all defects and impurities; resigned to God’s will (Aqrab). See also 2:113, 209; 4:95 &amp; 10:26.</p><p><strong>Commentary:</strong></p><p>قلب سلیم means, a sound and healthy heart; a heart free from all dross and spiritual maladies; a heart at peace with God and man; a heart fully resigned to the will of the great Creator. Such a noble heart did Abraham really possess.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 86,
        "v_": 85,
        "topics": [
            {
                "id": 272,
                "topic": "Abraham: <i>Ibrahim(as)</i>: falsity of gods and beliefs of people of",
                "verses": "19:43, 6:75, 21:53-55, 26:73-75"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "اِذۡ قَالَ  لِاَبِیۡہِ وَ قَوۡمِہٖ مَاذَا تَعۡبُدُوۡنَ ﴿ۚ۸۶﴾ ",
        "ur": "(پھر) جب اس نے اپنے باپ سے اور اس کی قوم سے کہا وہ ہے کیا جس کی تم عبادت کرتے ہو؟",
        "v5": {
            "text": "[b]When he said to his father and to his people, ‘What is it that you worship?[3324]",
            "notes": [
                {
                    "ref": "b",
                    "note": "19:43; 26:71."
                },
                {
                    "ref": "3324",
                    "note": "<p><strong>Commentary:</strong></p><p>For Abraham’s account and his oration against idolatry, see also 21:52-68.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 87,
        "v_": 86,
        "topics": [
            {
                "id": 247,
                "topic": "Abraham: <i>Ibrahim(as)</i>: contempt of for Satan, idols",
                "verses": "19:45, 21:53, 43:27-28"
            },
            {
                "id": 272,
                "topic": "Abraham: <i>Ibrahim(as)</i>: falsity of gods and beliefs of people of",
                "verses": "19:43, 6:75, 21:53-55, 26:73-75"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 9139,
                "topic": "Idolators: pagans, <i>Mushrikin</i>",
                "verses": "9:3-14, 6:42, 7:186, 7:191, 9:1, 11:55, 26:72, 27:92, 29:66, 39:4, 39:68, 43:22, 53:24, 69:19, 71:24"
            },
            {
                "id": 10470,
                "topic": "Lie: <i>Ifk</i>, <i>Kidhb</i>, fabrication",
                "verses": "24:12-13, 3:76, 3:79, 3:95, 4:51, 5:104, 6:22, 6:94, 6:145, 7:38, 10:18, 10:61, 10:70, 11:19, 16:117, 18:16, 25:5, 29:18, 29:69, 34:44, 37:152, 46:12, 46:29, 58:15, 61:8"
            }
        ],
        "ar": "اَئِفۡکًا  اٰلِہَۃً  دُوۡنَ اللّٰہِ  تُرِیۡدُوۡنَ ﴿ؕ۸۷﴾ ",
        "ur": "کیا اللہ کے سوا، تم سراپا جھوٹ دوسرے معبود چاہتے ہو؟",
        "v5": {
            "text": "A lie—gods beside Allah do you desire?[3325]",
            "notes": [
                {
                    "ref": "3325",
                    "note": "<p><strong>Commentary:</strong></p><p>Man is prone to worship false gods in the form of human beings to whom he attributes Divine powers, such as Jesus, Rama, etc.; or objects of nature such as the sun, the moon and the stars; or inanimate things such as gods hewed out of wood and stone, or his own time-worn customs, usages, prejudices and superstitions, his desires, passions, etc.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 88,
        "v_": 87,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "فَمَا ظَنُّکُمۡ  بِرَبِّ الۡعٰلَمِیۡنَ ﴿۸۸﴾ ",
        "ur": "پس تم نے تمام جہانوں کے ربّ کو کیا سمجھ رکھا ہے۔",
        "v5": {
            "text": "So what is your idea about the Lord of the worlds?’[3326]",
            "notes": [
                {
                    "ref": "3326",
                    "note": "<p><strong>Commentary:</strong></p><p>In these words Abraham rebukes his people for having such a poor conception of God, the Lord of all the worlds as to prefer worship of false gods to His worship.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 89,
        "v_": 88,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "فَنَظَرَ  نَظۡرَۃً  فِی النُّجُوۡمِ ﴿ۙ۸۹﴾ ",
        "ur": "پھر اس نے ستاروں پر ایک نظر ڈالی۔",
        "v5": {
            "text": "Then he cast a glance at the stars,[3327]",
            "notes": [
                {
                    "ref": "3327",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse seems to suggest that the controversy between Abraham and his people about Divine attributes dragged on late into the night, and seeing that the talk served no useful purpose Abraham wanted to cut it short. So he cast a glance at the stars suggesting thereby that the talk had dragged on long and far into the night and it should better be stopped.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 90,
        "v_": 89,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "فَقَالَ  اِنِّیۡ سَقِیۡمٌ ﴿۹۰﴾ ",
        "ur": "اور کہا میں تو یقیناً بیزار ہوگیا ہوں۔ ",
        "v5": {
            "text": "And said, ‘I am indeed <i>feeling</i> unwell.’[3328]",
            "notes": [
                {
                    "ref": "3328",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse may also suggest that Abraham was feeling unwell and in view of the useless nature of the talk that his people were having with him he wanted to avoid it. He therefore told them that they had better leave him alone as he was not feeling well.</p><p>The words انی سقیم may also mean: \"I am sick of your worshipping false gods,\" or \"I am sorely distressed at heart because you worship false gods,\" or \"I hate your worship of false gods.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 91,
        "v_": 90,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "فَتَوَلَّوۡا عَنۡہُ  مُدۡبِرِیۡنَ ﴿۹۱﴾ ",
        "ur": "پس وہ اس سے پیٹھ پھیرتے ہوئے چلے گئے۔",
        "v5": {
            "text": "So they went away from him turning their backs.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 92,
        "v_": 91,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "فَرَاغَ  اِلٰۤی  اٰلِہَتِہِمۡ  فَقَالَ  اَلَا  تَاۡکُلُوۡنَ ﴿ۚ۹۲﴾ ",
        "ur": "پھر وہ نظر بچا کر ان کے معبودوں کی طرف متوجہ ہوا۔ پس پوچھا کیا تم کھاتے نہیں؟ ",
        "v5": {
            "text": "Then he went secretly to their gods and <i>addressing them</i> said, ‘Will you not eat?[3329]",
            "notes": [
                {
                    "ref": "3329",
                    "note": "<p><strong>Important Words:</strong></p><p>راغ (went secretly) means, he turned aside or away or he went this way or that quickly and guilefully; he turned aside to deceive him who was behind him. راغ الی فلان means, he went to such a one secretly. راغ علیه means, he advanced towards him; he turned against him secretly (Aqrab &amp; Lane).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 93,
        "v_": 92,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 16055,
                "topic": "Salah: Allah listens to",
                "verses": "7:1953, 11:62, 40:51, 42:27, 43:19, 46:6, 87:16"
            }
        ],
        "ar": "مَا  لَکُمۡ  لَا تَنۡطِقُوۡنَ ﴿۹۳﴾ ",
        "ur": "تمہیں ہوا کیا ہے کہ تم بولتے نہیں۔",
        "v5": {
            "text": "What is the matter with you that you speak not?’[3330]",
            "notes": [
                {
                    "ref": "3330",
                    "note": "<p><strong>Commentary:</strong></p><p>At different places the Quran has pointed to one of the most distinctive attributes of a living God, viz. that He speaks to His chosen servants and listens to and answers their prayers. It is a dead and defunct deity, fit to be thrown away, that has not the power to speak or listen to and accept the prayers of his votaries. God has revealed Himself throughout the ages to His Elect through His actions and spoken word. Even now He has not ceased to reveal Himself and will never cease to do so. While rebuking the Israelites for taking the calf as their deity the Quran exposes the absurdity of their position in the words: \"Did they not see that it spoke not to them nor guided them\" (7:149). Again in 20:90 Moses is described as bringing home to the Israelites their folly for adopting the calf as their god in the words: <i>Could they not see this simple fact that it returned to them no answer, and had not the power to do them either harm or good</i>. In vv. 21:64 &amp; 66 and in the verse under comment Abraham advances the same argument in repudiation of idol-worship, viz. that the false gods cannot speak. From all these verses it becomes clear that God ceases to be a living God and forfeits all right to our worship and adoration if He ceases to speak to us and does not listen to and accept our prayers. Those who think that God has now given up revealing Himself to His servants are guilty of a colossal mistake. Islam’s greatest superiority over all other religions lies in the fact that it has produced in every age men to whom God has spoken. In our own time He spoke to Ahmad, the Promised Messiah.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 94,
        "v_": 93,
        "topics": [
            {
                "id": 237,
                "topic": "Abraham: <i>Ibrahim(as)</i>: breaks idols",
                "verses": "21:58-9"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 15763,
                "topic": "Right hand",
                "verses": "17:72, 29:49, 39:68, 56:9, 56:28, 56:39, 56:91-92, 69:20, 69:46, 84:8"
            }
        ],
        "ar": "فَرَاغَ  عَلَیۡہِمۡ  ضَرۡبًۢا بِالۡیَمِیۡنِ ﴿۹۴﴾ ",
        "ur": "پھر اس نے اُن کے خلاف مخفی کارروائی کی، داہنے ہاتھ سے ایک کاری ضرب لگاتے ہوئے۔",
        "v5": {
            "text": "[a]Then he began suddenly to strike them with the right hand.[3331]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:59."
                },
                {
                    "ref": "3331",
                    "note": "<p><strong>Commentary:</strong></p><p>The right hand being the symbol of power and strength, the verse signifies that Abraham struck the idols with his full power and broke them into pieces. The word یمین also meaning a vow, the verse may signify that Abraham struck the idols with great force in fulfilment of his vow referred to in \"<i>And by Allah I will certainly plan against your idols after you have gone away and turned your backs</i>\" (21:58).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 95,
        "v_": 94,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "فَاَقۡبَلُوۡۤا  اِلَیۡہِ  یَزِفُّوۡنَ ﴿۹۵﴾ ",
        "ur": "پس وہ (لوگ) اس کی طرف دوڑتے ہوئے آئے۔",
        "v5": {
            "text": "Thereupon <i>the people</i> came towards him hastening.[3332]",
            "notes": [
                {
                    "ref": "3332",
                    "note": "<p><strong>Important Words:</strong></p><p>یزفون (came hastening) is derived from زف. They say زف القوم فی مشیتھم i.e. the people hastened or were quick in going alone. زف الریحmeans, the wind blew violently. زف الطائر means, the bird spread its wings and threw itself (Aqrab).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 96,
        "v_": 95,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "قَالَ  اَتَعۡبُدُوۡنَ  مَا تَنۡحِتُوۡنَ ﴿ۙ۹۶﴾ ",
        "ur": "اس نے (اُن سے) کہا کیا تم ان کی عبادت کرتے ہو جن کو تم (خود) تراشتے ہو؟",
        "v5": {
            "text": "He said, [b]‘Do you worship that which you have <i>yourselves</i> carved out,",
            "notes": [
                {
                    "ref": "b",
                    "note": "21:67-68."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 97,
        "v_": 96,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "وَ اللّٰہُ خَلَقَکُمۡ  وَ مَا تَعۡمَلُوۡنَ ﴿۹۷﴾ ",
        "ur": "حالانکہ اللہ نے تمہیں پیدا کیا ہے اور اسے بھی جو تم بناتے ہو۔",
        "v5": {
            "text": "Whereas Allah has created you and <i>also</i> your handiwork?’[3333]",
            "notes": [
                {
                    "ref": "3333",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse may have one or all the three following interpretations: (1) God has created you and your handiwork, i.e. the idols of stone which you carve out with your own hands. (2) God is your Creator and the Creator of all that you do, i.e. He has created the means and the instruments by which you do your works. (3) God is your Creator but how foolish you are to worship what you make with your own hands.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 98,
        "v_": 97,
        "topics": [
            {
                "id": 242,
                "topic": "Abraham: <i>Ibrahim(as)</i>: cooling of fire for",
                "verses": "21:69-71, 29:25"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "قَالُوا ابۡنُوۡا لَہٗ  بُنۡیَانًا فَاَلۡقُوۡہُ  فِی الۡجَحِیۡمِ ﴿۹۸﴾ ",
        "ur": "انہوں نے کہا اس کے لئے ایک چِتا بناؤ، پھر اسے بھڑکتی ہوئی آگ میں جھونک دو۔",
        "v5": {
            "text": "They said, ‘Build for him a structure and [a]cast him into the fire.’",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:69; 29:25."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 99,
        "v_": 98,
        "topics": [
            {
                "id": 242,
                "topic": "Abraham: <i>Ibrahim(as)</i>: cooling of fire for",
                "verses": "21:69-71, 29:25"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "فَاَرَادُوۡا بِہٖ کَیۡدًا فَجَعَلۡنٰہُمُ  الۡاَسۡفَلِیۡنَ ﴿۹۹﴾ ",
        "ur": "پس انہوں نے اس کے متعلق ایک (ظالمانہ) تدبیر کی تو ہم نے انہیں سخت ذلیل کر دیا۔",
        "v5": {
            "text": "[b]Thus they intended an evil design against him, but We made them most humiliated.[3334]",
            "notes": [
                {
                    "ref": "b",
                    "note": "21:71."
                },
                {
                    "ref": "3334",
                    "note": "<p><strong>Commentary:</strong></p><p>As the enemies of Abraham were frustrated in their plans against him, they had a deep feeling of humiliation.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 100,
        "v_": 99,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "وَ قَالَ  اِنِّیۡ ذَاہِبٌ  اِلٰی رَبِّیۡ سَیَہۡدِیۡنِ ﴿۱۰۰﴾ ",
        "ur": "اور اس نے کہا میں یقیناً اپنے ربّ کی طرف جانے والا ہوں وہ ضرور میری رہنمائی کرے گا۔",
        "v5": {
            "text": "[c]And he said, ‘I am going to my Lord. He will surely guide me.’",
            "notes": [
                {
                    "ref": "c",
                    "note": "19:50; 29:27."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 101,
        "v_": 100,
        "topics": [
            {
                "id": 307,
                "topic": "Abraham: <i>Ibrahim(as)</i>: prayers for a son accepted",
                "verses": "2:129"
            },
            {
                "id": 314,
                "topic": "Abraham: <i>Ibrahim(as)</i>: prays for himself &amp; his progeny",
                "verses": "2:129, 2:125"
            },
            {
                "id": 318,
                "topic": "Abraham: <i>Ibrahim(as)</i>: prayers of",
                "verses": "14:36-42, 2:127-130, 26:86-88, 60:5-6"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            },
            {
                "id": 14101,
                "topic": "Prayers of the Holy Qur’an: Abraham’s",
                "verses": "2:127-130, 2:125, 14:36-42, 26:84-88, 60:5-6"
            },
            {
                "id": 14190,
                "topic": "Prayers of the Holy Qur’an: for self &amp; family",
                "verses": "14:36-42, 3:39, 17:25, 19:5-7, 21:90-91, 25:75, 26:170, 27:20, 40:9-10, 46:16, 71:29"
            },
            {
                "id": 15832,
                "topic": "Righteous: <i>Salihin</i>: prayers of",
                "verses": "3:194-195, 5:85, 12:102, 25:75, 26:84, 32:13, 35:38, 46:16, 63:11"
            }
        ],
        "ar": "رَبِّ ہَبۡ  لِیۡ  مِنَ  الصّٰلِحِیۡنَ ﴿۱۰۱﴾ ",
        "ur": "اے میرے ربّ! مجھے صالحین میں سے (وارث) عطا کر۔",
        "v5": {
            "text": "<i>And he prayed</i>, ‘My Lord, grant me a righteous <i>son</i>.’",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 102,
        "v_": 101,
        "topics": [
            {
                "id": 280,
                "topic": "Abraham: <i>Ibrahim(as)</i>: given glad tidings of birth of Ishmael",
                "verses": null
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 5036,
                "topic": "Children: <i>Ghulam</i>",
                "verses": "3:41, 12:20, 15:54, 18:75, 18:83, 19:8-9, 19:21, 51:29, 52:25"
            },
            {
                "id": 7992,
                "topic": "Glad Tidings: <i>Bushra</i>: to Prophets",
                "verses": "3:40, 3:46, 15:54, 19:8, 19:20, 29:32, 37:113, 51:29"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            }
        ],
        "ar": "فَبَشَّرۡنٰہُ  بِغُلٰمٍ  حَلِیۡمٍ ﴿۱۰۲﴾ ",
        "ur": "پس ہم نے اسے ایک بُردبار لڑکے کی بشارت دی۔",
        "v5": {
            "text": "So We gave him the glad tidings of a forbearing son.[3335]",
            "notes": [
                {
                    "ref": "3335",
                    "note": "<p><strong>Commentary:</strong></p><p>Elsewhere (15:54) the Quran describes Ishmael as غلام علیم i.e. a son endowed with knowledge. It seems that Ishmael was both very forbearing and intelligent and was also possessed of great knowledge.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 103,
        "v_": 102,
        "topics": [
            {
                "id": 254,
                "topic": "Abraham: <i>Ibrahim(as)</i>: dreams of sacrificing Ishmael",
                "verses": null
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 4438,
                "topic": "Biblical History",
                "verses": "17:6-8, 2:103, 2:134, 2:244, 2:260, 4:158, 6:75, 19:17, 21:86, 21:106, 23:51, 61:7, 61:15"
            },
            {
                "id": 6766,
                "topic": "Dream: <i>Ru’ya’, Manam</i>",
                "verses": "6:112, 8:44, 12:5, 12:6, 12:37-38, 12:44-50, 12:101-102, 17:61, 21:6, 37:106, 48:28"
            },
            {
                "id": 8322,
                "topic": "Hagar: <i>Hagirah</i>",
                "verses": "2:130, 2:143, 2:159"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            },
            {
                "id": 11966,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:47, 8:66-67, 10:90, 10:110, 11:12, 11:116, 12:91, 13:25, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:55, 28:81, 29:60, 32:25, 33:36, 34:20, 38:45, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            },
            {
                "id": 13738,
                "topic": "Patience: <i>sabr</i>: sign of a <i>Mu’min</i>",
                "verses": "3:18, 2:178, 3:187, 14:6, 16:127, 21:86, 22:36, 31:32, 33:36, 54:28"
            },
            {
                "id": 15989,
                "topic": "Sacrifice: of Ishmael",
                "verses": null
            },
            {
                "id": 16005,
                "topic": "Safa wa Marwah",
                "verses": "2:159, 2:197, 2:204, 26:215, 111:2"
            },
            {
                "id": 18269,
                "topic": "Valley: <i>Wadi</i>",
                "verses": "14:38, 9:121, 13:18, 20:13, 23:51, 26:142, 26:226, 27:19, 28:31, 46:25, 48:25, 55:47, 79:16-17, 89:10"
            },
            {
                "id": 18308,
                "topic": "Vision: of Ishmael",
                "verses": "50:23"
            }
        ],
        "ar": "فَلَمَّا بَلَغَ مَعَہُ  السَّعۡیَ قَالَ یٰبُنَیَّ  اِنِّیۡۤ اَرٰی فِی الۡمَنَامِ اَنِّیۡۤ  اَذۡبَحُکَ فَانۡظُرۡ مَاذَا تَرٰی ؕ قَالَ یٰۤاَبَتِ افۡعَلۡ مَا تُؤۡمَرُ ۫ سَتَجِدُنِیۡۤ  اِنۡ شَآءَ اللّٰہُ مِنَ الصّٰبِرِیۡنَ ﴿۱۰۳﴾ ",
        "ur": "پس جب وہ اس کے ساتھ دوڑنے پھرنے کی عمرکو پہنچا اس نے کہا اے میرے پیارے بیٹے! یقیناً میں سوتے میں دیکھا کرتا ہوں کہ میں تجھے ذبح کر رہا ہوں، پس غور کر تیری کیا رائے ہے؟ اس نے کہا اے میرے باپ! وہی کر جو تجھے حکم دیا جاتاہے۔ یقیناً اگر اللہ چاہے گا تو مجھے تُو صبر کرنے والوں میں سے پائے گا۔",
        "v5": {
            "text": "And when he was old enough to work with him, he said, ‘O my dear son, I have seen in a dream that I am slaughtering thee. So consider, what thou thinkest <i>of it</i>!’ He replied, ‘O my father, do as thou art commanded; thou wilt find me, if Allah please, steadfast <i>in my faith</i>.[3336]",
            "notes": [
                {
                    "ref": "3336",
                    "note": "<p><strong>Commentary:</strong></p><p>See next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 104,
        "v_": 103,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            }
        ],
        "ar": "فَلَمَّاۤ   اَسۡلَمَا وَ  تَلَّہٗ   لِلۡجَبِیۡنِ ﴿۱۰۴﴾ۚ ",
        "ur": "پس جب وہ دونوں رضامند ہوگئے اور اس نے اُسے پیشانی کے بَل لٹا دیا۔",
        "v5": {
            "text": "And when they both submitted <i>to the Will of God</i>, and he had thrown him down on his forehead,[3337]",
            "notes": [
                {
                    "ref": "3337",
                    "note": "<p><strong>Commentary:</strong></p><p>The Quran and the Bible disagree as to which of his two sons—Ishmael and Isaac—Abraham, in pursuance of God’s command, offered for sacrifice. The Quran says that it was Ishmael, but according to the Bible, it was Isaac. The Bible, speaking of the sacrifice says \"And He said, 'Take now thy son, <i>thine only son</i>, whom thou lovest, even Isaac and get there into the land of Moriah, and offer him there for a burnt offering upon one of the mountains which I tell thee of'\" (Gen. 22:2). The Quran, on the other hand, declares clearly and unequivocally, in the verse under comment, that it was Ishmael who was offered for sacrifice. The Bible, however, contradicts itself in this respect. According to it, Abraham was commanded to offer his only son for sacrifice, but Isaac was at no time his only son. Ishmael was born to Abraham when he was 86 years old while Isaac was born to him when he had reached the very advanced age of 99. Thus for 13 years Ishmael was Abraham’s only son, and, being also his first born, was doubly dear to him. It stands to reason, therefore, that Abraham must have been required by God to offer for sacrifice his nearest and dearest thing which was his only and first born son who was Ishmael.</p><p>Some evangelists have vainly tried to show that, \"Ishmael being of the handmaid, was born after the flesh while Isaac being born of the free woman was by promise\" (Galatians, 4:22, 23). Apart from the fact that Hagar, Ishmael’s mother, belonged to the royal family of Egypt and was no handmaid, Ishmael has repeatedly been mentioned in the Bible as Abraham’s son, exactly as Isaac has been mentioned as his son (Gen. 16:16; 17:23, 25). Moreover, analogous promises were made to Abraham in regard to the future greatness of Ishmael as were made to him about Isaac. The Bible says: \"And as for Ishmael, I have heard thee: Behold, I have blessed him, and will make him fruitful, and will multiply him exceedingly; twelve princes shall he beget, and I will make him a great nation\" (Gen. 17:20). \"And the angel of the Lord said unto her (Hagar) \"I will multiply thy seed exceedingly that it shall not be numbered for multitude.\" (Gen. 16:10, 11). So apart from the substitution in the Bible of Isaac for Ishmael which seems to be deliberate, and of Moriah for Marwah, an hillock which lies in the vicinity of Mecca near which Abraham, in fulfilment of his vision, referred to in the preceding verse, left Ishmael with his mother Hagar while yet a child, there is nothing in the Bible to lend the slightest support to the view that Abraham offered Isaac for sacrifice and not Ishmael.</p><p>Furthermore, the fact that whereas no trace is to be found in the religious ceremonies of Jews and Christians of the supposed sacrifice of Isaac by Abraham, the Muslims, spiritual descendants of Ishmael, commemorate with great fervour his intended sacrifice, by slaughtering every year rams and goats all over the world on the tenth day of <i>Dhul-Hijjah</i>. This universal sacrifice of rams and goats by Muslims on a specific day in commemoration of Abraham’s preparedness to slaughter Ishmael, establishes beyond dispute or doubt that it was Ishmael whom Abraham offered for sacrifice and not Isaac. In a sense Abraham had already fulfilled his vision by leaving Ishmael while yet a child with his mother, Hagar, in the bleak and barren valley of Mecca where at that time there was to be found no sign of life, nor even a blade of grass or a drop of water. That brave act, in fact, had symbolised the sacrifice of Ishmael.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 105,
        "v_": 104,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            }
        ],
        "ar": "وَ  نَادَیۡنٰہُ  اَنۡ  یّٰۤاِبۡرٰہِیۡمُ ﴿۱۰۵﴾ۙ",
        "ur": "تب ہم نے اسے پکارا کہ اے ابراہیم!",
        "v5": {
            "text": "And we called to him: ‘O Abraham,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 106,
        "v_": 105,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 6767,
                "topic": "Dream: <i>Ru’ya’, Manam</i>",
                "verses": "6:112, 8:44, 12:5, 12:6, 12:37-38, 12:44-50, 12:101-102, 17:61, 21:6, 37:103, 48:28"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            },
            {
                "id": 9740,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 12718,
                "topic": "Muhsin: who do good: are rewarded",
                "verses": "3:135, 29:70, 2:59, 2:113, 4:126, 5:86, 6:85, 7:57, 7:162, 12:23, 22:38, 28:15, 31:23, 33:30, 37:111, 37:122, 37:132, 39:35, 77:45"
            }
        ],
        "ar": "قَدۡ صَدَّقۡتَ الرُّءۡیَا ۚ اِنَّا کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿۱۰۶﴾ ",
        "ur": "یقیناً تُو اپنی رؤیا پوری کر چکا ہے۔ یقیناً اسی طرح ہم نیکی کرنے والوں کو جزا دیا کرتے ہیں۔",
        "v5": {
            "text": "‘Thou hast indeed fulfilled the dream.’ Thus indeed do We reward those who do good.[3338]",
            "notes": [
                {
                    "ref": "3338",
                    "note": "<p><strong>Commentary:</strong></p><p>The words \"Thou hast indeed fulfilled the dream\" show that Abraham was not required to fulfil his vision in actual fact but that it was only a practical demonstration of his intention and preparedness to slaughter his son which was desired of him. The vision, as stated above, had already symbolically been fulfilled in Hagar and Ishmael having been left by Abraham in the valley of Mecca which was at that time an arid and barren waste. The leaving behind of a weak and helpless woman with a child, in a place completely devoid of all signs of life and even of water or any other means of subsistence, did indeed constitute a great sacrifice on the part of the noble Patriarch.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 107,
        "v_": 106,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 360,
                "topic": "Abraham: <i>Ibrahim(as)</i>: tried by his Lord",
                "verses": "2:125"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            }
        ],
        "ar": "اِنَّ ہٰذَا لَہُوَ  الۡبَلٰٓـؤُا الۡمُبِیۡنُ ﴿۱۰۷﴾ ",
        "ur": "یقیناً یہ ایک بہت کھلی کھلی آزمائش تھی۔",
        "v5": {
            "text": "That surely was a manifest trial.[3339]",
            "notes": [
                {
                    "ref": "3339",
                    "note": "<p><strong>Commentary:</strong></p><p>It was indeed a supreme trial for Abraham to have left his dear wife and his only son, unprovided for and unprotected, in a place where, humanly speaking, they were sure to perish.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 108,
        "v_": 107,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 9441,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:114, 38:49"
            }
        ],
        "ar": "وَ فَدَیۡنٰہُ  بِذِبۡحٍ عَظِیۡمٍ ﴿۱۰۸﴾ ",
        "ur": "اور ہم نے ایک ذبحِ عظیم کے بدلے اُسے بچا لیا۔",
        "v5": {
            "text": "And We ransomed him with a great sacrifice.[3340]",
            "notes": [
                {
                    "ref": "3340",
                    "note": "<p><strong>Commentary:</strong></p><p>Abraham’s preparedness to sacrifice Ishmael was perpetuated in the Islamic institution of \"Sacrifice\" which forms an integral part of the ceremonies of <i>Hajj</i>. As long as Islam lasts—and it shall last till the end of time—Pilgrimage to Mecca will continue to be performed and on the tenth day of <i>Dhul-Hijjah</i> goats and rams will continue to be slaughtered in hundreds of thousands in Mecca and all over the Muslim world in commemoration of Ishmael’s sacrifice. It is this institution of \"Sacrifice\" that seems to have been referred to in this verse in the words \"And We ransomed him with a great sacrifice\".</p><p>The reference in the verse may also be to the abolition of human sacrifice which seemed to be in vogue in Abraham’s time and to the substitution for it of animal sacrifice.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 109,
        "v_": 108,
        "topics": [
            {
                "id": 281,
                "topic": "Abraham: <i>Ibrahim(as)</i>: good name of",
                "verses": null
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "وَ تَرَکۡنَا عَلَیۡہِ فِی الۡاٰخِرِیۡنَ ﴿۱۰۹﴾ۖ ",
        "ur": "اور ہم نے بعد میں آنے والوں میں اس کا ذکرِخیر باقی رکھا۔",
        "v5": {
            "text": "And We left for him <i>a good name</i> among the succeeding generations—[3341]",
            "notes": [
                {
                    "ref": "3341",
                    "note": "<p><strong>Commentary:</strong></p><p>What greater testimony could there be to Abraham having left behind him a good name than that the followers of the three great religions—Islam, Christianity and Judaism—take pride in ascribing their ancestry to the great Patriarch.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 110,
        "v_": 109,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 16032,
                "topic": "Salam: greetings of",
                "verses": "39:74, 4:95, 7:47, 10:11, 10:26, 11:70, 13:25, 14:24, 16:33, 19:16, 19:34, 19:48, 19:63, 25:64, 25:76, 28:56, 33:45, 36:59, 37:80, 37:121, 37:131, 37:182, 43:90, 51:26, 56:27, 56:92"
            }
        ],
        "ar": "سَلٰمٌ  عَلٰۤی  اِبۡرٰہِیۡمَ ﴿۱۱۰﴾ ",
        "ur": "ابراہیم پر سلام ہو۔",
        "v5": {
            "text": "Peace be upon Abraham!",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 111,
        "v_": 110,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 9741,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 12719,
                "topic": "Muhsin: who do good: are rewarded",
                "verses": "3:135, 29:70, 2:59, 2:113, 4:126, 5:86, 6:85, 7:57, 7:162, 12:23, 22:38, 28:15, 31:23, 33:30, 37:106, 37:122, 37:132, 39:35, 77:45"
            }
        ],
        "ar": "کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿۱۱۱﴾ ",
        "ur": "اسی طرح ہم نیکی کرنے والوں کو جزا دیا کرتے ہیں۔",
        "v5": {
            "text": "Thus do We reward those who do good.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 112,
        "v_": 111,
        "topics": [
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            }
        ],
        "ar": "اِنَّہٗ مِنۡ عِبَادِنَا الۡمُؤۡمِنِیۡنَ ﴿۱۱۲﴾ ",
        "ur": "یقیناً وہ ہمارے مومن بندوں میں سے تھا۔",
        "v5": {
            "text": "Surely, he was <i>one</i> of Our believing servants.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 113,
        "v_": 112,
        "topics": [
            {
                "id": 278,
                "topic": "Abraham: <i>Ibrahim(as)</i>: given glad tidings of birth of Isaac, Jacob",
                "verses": "11:72, 15:54-56, 51:29"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 7993,
                "topic": "Glad Tidings: <i>Bushra</i>: to Prophets",
                "verses": "3:40, 3:46, 15:54, 19:8, 19:20, 29:32, 37:102, 51:29"
            },
            {
                "id": 9428,
                "topic": "Isaac: <i>Ishaq(as)</i>",
                "verses": "19:50-51, 2:134, 2:137, 4:164, 6:85, 11:72, 14:40, 15:54, 21:73-74, 29:28, 38:46, 51:29"
            },
            {
                "id": 15820,
                "topic": "Righteous: <i>Salihin</i>: example of",
                "verses": "49:14, 2:131, 3:40, 3:47, 3:115, 4:70, 4:157, 5:9, 6:70, 6:85-87, 12:37, 16:123, 18:73, 21:73, 21:76, 21:87, 24:24, 28:28, 29:28, 33:33, 41:34, 48:27, 66:13, 103:4"
            }
        ],
        "ar": "وَ بَشَّرۡنٰہُ بِاِسۡحٰقَ نَبِیًّا مِّنَ الصّٰلِحِیۡنَ ﴿۱۱۳﴾ ",
        "ur": "اور ہم نے اسے اسحاق کی بطور نبی خوشخبری دی جو صالحین میں سے تھا۔",
        "v5": {
            "text": "[a]And We gave him the glad tidings of Isaac, a Prophet, <i>and one</i> of the righteous.",
            "notes": [
                {
                    "ref": "a",
                    "note": "11:72; 19:50; 21:73; 29:28."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 114,
        "v_": 113,
        "topics": [
            {
                "id": 324,
                "topic": "Abraham: <i>Ibrahim(as)</i>: Prophethood among descendants of",
                "verses": "21:74, 29:28, 38:46-48, 57:27"
            },
            {
                "id": 348,
                "topic": "Abraham: <i>Ibrahim(as)</i>: story of",
                "verses": "19:42-51, 6:75-85, 11:70-77, 14:36-42, 15:52-61, 21:52-74, 22:27-28, 29:17-28, 51:25-35"
            },
            {
                "id": 4071,
                "topic": "Barakah: <i>blessings</i>: on Prophets",
                "verses": "33:57, 11:49, 19:32, 19:59, 23:30, 25:11, 27:9"
            },
            {
                "id": 9428,
                "topic": "Isaac: <i>Ishaq(as)</i>",
                "verses": "19:50-51, 2:134, 2:137, 4:164, 6:85, 11:72, 14:40, 15:54, 21:73-74, 29:28, 38:46, 51:29"
            },
            {
                "id": 9442,
                "topic": "Ishmael: <i>Isma‘il(as)</i>",
                "verses": "14:38-40, 2:126, 2:128, 2:137, 3:85, 4:164, 6:87, 19:55-56, 21:86, 37:101-108, 38:49"
            },
            {
                "id": 18889,
                "topic": "Wrongdoers: <i>Zalim</i>",
                "verses": "4:76, 3:95, 3:129, 5:46, 6:34, 8:55, 9:23, 11:103, 14:14, 14:43, 18:36, 21:12, 22:46, 22:49, 25:28, 26:11, 29:15, 29:50, 35:33"
            }
        ],
        "ar": "وَ بٰرَکۡنَا عَلَیۡہِ وَ عَلٰۤی  اِسۡحٰقَ ؕ وَ مِنۡ ذُرِّیَّتِہِمَا مُحۡسِنٌ وَّ ظَالِمٌ لِّنَفۡسِہٖ مُبِیۡنٌ ﴿۱۱۴﴾٪ ",
        "ur": "اور اُس پر اور اسحاق پر ہم نے برکت بھیجی اور ان دونوں کی ذریت میں احسان کرنے والے بھی تھے اور اپنے نفس کے حق میں کھلم کھلا ظلم کرنے والے بھی تھے۔",
        "v5": {
            "text": "And We bestowed blessings on him and Isaac. [b]And among their progeny are <i>some</i> who do good and others who clearly wrong themselves.[3342]",
            "notes": [
                {
                    "ref": "b",
                    "note": "57:27."
                },
                {
                    "ref": "3342",
                    "note": "<p><strong>Commentary:</strong></p><p>The words \"We bestowed blessings on him,\" refer to the blessings that God bestowed upon Abraham’s progeny through Ishmael as Isaac has been mentioned separately by name.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 115,
        "v_": 114,
        "topics": [
            {
                "id": 17,
                "topic": "Aaron: <i>Harun(as)</i>: favours of God on",
                "verses": null
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            }
        ],
        "ar": "وَ لَقَدۡ مَنَنَّا عَلٰی مُوۡسٰی وَ ہٰرُوۡنَ ﴿۱۱۵﴾ۚ ",
        "ur": "اور یقیناً ہم نے موسیٰ اور ہارون پربھی احسان کیا تھا۔ ",
        "v5": {
            "text": "[c]And, indeed, We bestowed favours on Moses and Aaron.[3343]",
            "notes": [
                {
                    "ref": "c",
                    "note": "20:31-37; 26:16-17; 28:35."
                },
                {
                    "ref": "3343",
                    "note": "<p><strong>Commentary:</strong></p><p>The greatest Prophet after Abraham, among his descendants through Isaac, was Moses, counterpart of the Holy Prophet who was a descendant of Ishmael.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 116,
        "v_": 115,
        "topics": [
            {
                "id": 17,
                "topic": "Aaron: <i>Harun(as)</i>: favours of God on",
                "verses": null
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            }
        ],
        "ar": "وَ نَجَّیۡنٰہُمَا وَ قَوۡمَہُمَا مِنَ الۡکَرۡبِ الۡعَظِیۡمِ  ﴿۱۱۶﴾ۚ",
        "ur": "اور اُن دونوں کو اور اُن کی قوم کو ہم نے بہت بڑے کرب سے نجات بخشی تھی۔",
        "v5": {
            "text": "[a]And We saved them both and their people from the great distress;[3344]",
            "notes": [
                {
                    "ref": "a",
                    "note": "20:81; 26:66."
                },
                {
                    "ref": "3344",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference to \"great distress\" may be found elsewhere in the Quran (2:50) in the words: And remember the time when we delivered you from Pharaoh’s people who afflicted you with grievous torment, slaying your sons and sparing your women and in that there was a great trial for you from your Lord.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 117,
        "v_": 116,
        "topics": [
            {
                "id": 17,
                "topic": "Aaron: <i>Harun(as)</i>: favours of God on",
                "verses": null
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            }
        ],
        "ar": "وَ نَصَرۡنٰہُمۡ فَکَانُوۡا ہُمُ الۡغٰلِبِیۡنَ ﴿۱۱۷﴾ۚ ",
        "ur": "اور ہم نے ان کی مدد کی۔ پس وہی غالب آنے والے بنے۔",
        "v5": {
            "text": "And We helped them, and it was they who were victorious.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 118,
        "v_": 117,
        "topics": [
            {
                "id": 17,
                "topic": "Aaron: <i>Harun(as)</i>: favours of God on",
                "verses": null
            },
            {
                "id": 4660,
                "topic": "Book: <i>Kitab</i>: revelation sent through Messengers",
                "verses": "5:49, 2:54, 2:214, 3:49, 3:82, 4:163, 6:92, 11:18, 13:2, 19:31, 20:134, 23:50, 25:36, 28:44, 32:24, 35:26, 40:54, 40:71, 41:46, 46:13, 57:26"
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            },
            {
                "id": 17758,
                "topic": "Torah: guidance for Jews",
                "verses": "45:17, 3:4-5, 3:51, 3:66, 3:94, 5:44-45, 5:67, 5:111, 6:92, 6:155, 17:3, 23:50, 28:44, 32:24, 40:54-55, 61:7, 62:6"
            }
        ],
        "ar": "وَ اٰتَیۡنٰہُمَا الۡکِتٰبَ الۡمُسۡتَبِیۡنَ ﴿۱۱۸﴾ۚ ",
        "ur": "اور ہم نے ان دونوں کو ایک روشنی بخش کتاب عطا کی۔",
        "v5": {
            "text": "And We gave them the Book that made <i>things</i> clear;",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 119,
        "v_": 118,
        "topics": [
            {
                "id": 17,
                "topic": "Aaron: <i>Harun(as)</i>: favours of God on",
                "verses": null
            },
            {
                "id": 8231,
                "topic": "Guidance: Allah gives",
                "verses": "20:51, 2:121, 2:186, 2:214, 3:74, 3:102, 4:69, 5:17, 6:36, 6:72, 6:89, 6:150, 7:44, 7:179, 10:10, 10:26, 10:36, 13:28, 13:32, 14:5, 14:13, 16:10, 16:94, 16:122, 19:77, 22:17, 22:38, 24:36, 24:47, 26:63, 26:79, 28:57, 29:70, 31:5-6, 33:5, 35:9, 39:19, 39:24, 39:38, 42:14, 47:18, 48:3, 48:21, 49:18, 64:12, 74:32, 76:4, 93:8"
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            },
            {
                "id": 17256,
                "topic": "Straight Path",
                "verses": "1:6, 2:109, 2:171, 2:214, 2:273, 3:52, 3:102, 4:68-69, 4:176, 5:17, 6:40, 6:88, 6:154, 6:162, 10:26, 11:57, 14:2-3, 16:77, 16:122, 19:37, 19:44, 20:136, 22:55, 23:74-5, 24:47, 36:5, 36:62, 42:53, 43:44, 43:62, 43:65, 46:31, 48:3, 48:21, 67:23"
            }
        ],
        "ar": "وَ ہَدَیۡنٰہُمَا الصِّرَاطَ الۡمُسۡتَقِیۡمَ ﴿۱۱۹﴾ۚ ",
        "ur": "اور دونوں کو ہم نے سیدھے رستے پر چلایا تھا۔",
        "v5": {
            "text": "And We guided them to the right path.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 120,
        "v_": 119,
        "topics": [
            {
                "id": 17,
                "topic": "Aaron: <i>Harun(as)</i>: favours of God on",
                "verses": null
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            }
        ],
        "ar": "وَ تَرَکۡنَا عَلَیۡہِمَا فِی الۡاٰخِرِیۡنَ ﴿۱۲۰﴾ۙ ",
        "ur": "اور ہم نے بعد میں آنے والوں میں ان دونوں کا ذکر ِخیر باقی رکھا۔",
        "v5": {
            "text": "And We left for them <i>a good name</i> among the succeeding generations—[3345]",
            "notes": [
                {
                    "ref": "3345",
                    "note": "<p><strong>Commentary:</strong></p><p>Moses and Aaron are remembered with great respect and affection by Muslims, Christians and Jews alike.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 121,
        "v_": 120,
        "topics": [
            {
                "id": 17,
                "topic": "Aaron: <i>Harun(as)</i>: favours of God on",
                "verses": null
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            },
            {
                "id": 16033,
                "topic": "Salam: greetings of",
                "verses": "39:74, 4:95, 7:47, 10:11, 10:26, 11:70, 13:25, 14:24, 16:33, 19:16, 19:34, 19:48, 19:63, 25:64, 25:76, 28:56, 33:45, 36:59, 37:80, 37:110, 37:131, 37:182, 43:90, 51:26, 56:27, 56:92"
            }
        ],
        "ar": "سَلٰمٌ  عَلٰی مُوۡسٰی وَ ہٰرُوۡنَ ﴿۱۲۱﴾ ",
        "ur": "سلام ہو موسیٰ اور ہارون پر۔",
        "v5": {
            "text": "Peace be on Moses and Aaron!",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 122,
        "v_": 121,
        "topics": [
            {
                "id": 9742,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            },
            {
                "id": 12720,
                "topic": "Muhsin: who do good: are rewarded",
                "verses": "3:135, 29:70, 2:59, 2:113, 4:126, 5:86, 6:85, 7:57, 7:162, 12:23, 22:38, 28:15, 31:23, 33:30, 37:106, 37:111, 37:132, 39:35, 77:45"
            }
        ],
        "ar": "اِنَّا کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿۱۲۲﴾ ",
        "ur": "یقیناً ہم اسی طرح احسان کرنے والوں کو جزا دیا کرتے ہیں۔",
        "v5": {
            "text": "Thus indeed do We reward those who do good.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 123,
        "v_": 122,
        "topics": [
            {
                "id": 12062,
                "topic": "Moses: Musa(as): bestowed favours",
                "verses": "6:155, 2:249"
            }
        ],
        "ar": "اِنَّہُمَا مِنۡ عِبَادِنَا الۡمُؤۡمِنِیۡنَ ﴿۱۲۳﴾ ",
        "ur": "یقیناً وہ دونوں ہمارے مومن بندوں میں سے تھے۔",
        "v5": {
            "text": "Surely, they were both among Our believing servants.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 124,
        "v_": 123,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            }
        ],
        "ar": "وَ  اِنَّ  اِلۡیَاسَ لَمِنَ الۡمُرۡسَلِیۡنَ ﴿۱۲۴﴾ؕ",
        "ur": "اور الیاس بھی یقیناً مُرسلین میں سے تھا۔",
        "v5": {
            "text": "And assuredly Elias <i>also</i> was <i>one</i> of the Messengers,[3346]",
            "notes": [
                {
                    "ref": "3346",
                    "note": "<p><strong>Commentary:</strong></p><p>Elias or Elijah lived about 900 B.C. He was a native of Gilead, a place on the eastern bank of the Jordan. According to the Bible he was taken up to heaven in a whirlwind in a chariot of fire and after him his mantle was taken by Elisha (Jew. Enc. &amp; 1 Kings 17: 1).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 125,
        "v_": 124,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            }
        ],
        "ar": "اِذۡ  قَالَ  لِقَوۡمِہٖۤ   اَلَا  تَتَّقُوۡنَ ﴿۱۲۵﴾ ",
        "ur": "جب اس نے اپنی قوم سے کہا کیا تم تقویٰ اختیار نہیں کرو گے؟",
        "v5": {
            "text": "When he said to his people, ‘Will you not be God-fearing?",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 126,
        "v_": 125,
        "topics": [
            {
                "id": 3341,
                "topic": "Attributes of Allah: Al-Khaliq (The Creator)",
                "verses": "59:25, 6:103, 13:17, 15:87, 23:15, 36:82, 39:63, 40:63, 56:60, 57:5"
            },
            {
                "id": 3698,
                "topic": "Attributes of Allah: Ahsanul-Khaliqin (Best of Creators)",
                "verses": "23:15"
            },
            {
                "id": 3867,
                "topic": "Ba‘l: Pagan deity",
                "verses": null
            },
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            },
            {
                "id": 17437,
                "topic": "Syria",
                "verses": "7:66, 7:74, 7:85, 9:32, 9:42, 9:107, 11:51, 15:77, 20:78, 21:84, 23:51, 25:41, 26:142, 30:5, 34:13, 34:16, 34:19, 59:3, 71:24"
            }
        ],
        "ar": "اَتَدۡعُوۡنَ بَعۡلًا وَّ تَذَرُوۡنَ  اَحۡسَنَ الۡخَالِقِیۡنَ ﴿۱۲۶﴾ۙ ",
        "ur": " کیا تم بعل کو پکارتے ہو اور پیدا کرنے والوں میں سے سب سے بہترکو چھوڑ دیتے ہو۔",
        "v5": {
            "text": "Do you call on Ba‘l, and forsake the Best of creators,[3347]",
            "notes": [
                {
                    "ref": "3347",
                    "note": "<p><strong>Important Words:</strong></p><p>بعلاً is derived from بعل (<i>ba‘ala</i>) which means, he married or he took a wife; or he became a husband. بعل means, husband; wife (بعل like زوج means both a husband and a wife, more generally a husband); lord, master or owner of a thing; a chief; afamily whose maintenance is incumbent upon a person (Lane &amp; Aqrab).</p><p><strong>Commentary:</strong></p><p>Ba‘l was the name of an idol belonging to the people of the Prophet Elijah. These people worshipped the sun. Ba‘l may also stand for the sun-god which belonged to the people of a town in Syria now called Baalbek (Lane).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 127,
        "v_": 126,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            }
        ],
        "ar": "اللّٰہَ  رَبَّکُمۡ وَ رَبَّ اٰبَآئِکُمُ  الۡاَوَّلِیۡنَ ﴿۱۲۷﴾ ",
        "ur": "اللہ کو۔ جو تمہارا بھی ربّ ہے اور تمہارے پہلے آباءواجداد کا بھی۔",
        "v5": {
            "text": "Allah, your Lord and the Lord of your forefathers of old?’",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 128,
        "v_": 127,
        "topics": [
            {
                "id": 528,
                "topic": "Accountability: <i>Hisab</i>: Allah calls to account",
                "verses": "2:226, 2:285, 3:31, 4:41, 6:63, 17:37, 18:50, 19:85, 21:48, 24:40, 28:62, 28:85, 33:6, 41:18, 42:23, 56:87, 58:7, 65:9, 68:40, 75:3, 83:6, 88:27, 99:8-9, 102:9"
            },
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            }
        ],
        "ar": "فَکَذَّبُوۡہُ  فَاِنَّہُمۡ  لَمُحۡضَرُوۡنَ ﴿۱۲۸﴾ۙ ",
        "ur": "پس انہوں نے اس کو جھٹلا دیا اور یقیناً وہ پیش کئے جانے والے ہیں۔",
        "v5": {
            "text": "But they treated him as a liar, and they will surely be brought <i>before God to render an account of their deeds</i>;",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 129,
        "v_": 128,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            }
        ],
        "ar": "اِلَّا عِبَادَ  اللّٰہِ  الۡمُخۡلَصِیۡنَ ﴿۱۲۹﴾ ",
        "ur": "سوائے اللہ کے چنیدہ بندوں کے۔",
        "v5": {
            "text": "Except the chosen servants of Allah.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 130,
        "v_": 129,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            }
        ],
        "ar": "وَ تَرَکۡنَا عَلَیۡہِ  فِی الۡاٰخِرِیۡنَ ﴿۱۳۰﴾ۙ ",
        "ur": "اور ہم نے بعد میں آنے والوں میں اس کا ذکرِخیر باقی رکھا۔ ",
        "v5": {
            "text": "And We left for him <i>a good name</i> among the succeeding generations—",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 131,
        "v_": 130,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            },
            {
                "id": 16034,
                "topic": "Salam: greetings of",
                "verses": "39:74, 4:95, 7:47, 10:11, 10:26, 11:70, 13:25, 14:24, 16:33, 19:16, 19:34, 19:48, 19:63, 25:64, 25:76, 28:56, 33:45, 36:59, 37:80, 37:110, 37:121, 37:182, 43:90, 51:26, 56:27, 56:92"
            }
        ],
        "ar": "سَلٰمٌ  عَلٰۤی  اِلۡ یَاسِیۡنَ ﴿۱۳۱﴾ ",
        "ur": "سلام ہو اِل یاسین پر۔",
        "v5": {
            "text": "Peace be on Elias <i>and his people</i>![3348]",
            "notes": [
                {
                    "ref": "3348",
                    "note": "<p><strong>Commentary:</strong></p><p>إلیاسین (<i>Ilyasin</i>) may be another form of الیاس (<i>Ilyas</i>) as سینین (95:3) is that of سیناء (23:21); or being plural of الیاس it may mean Elijah and his people.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 132,
        "v_": 131,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            },
            {
                "id": 9743,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 12721,
                "topic": "Muhsin: who do good: are rewarded",
                "verses": "3:135, 29:70, 2:59, 2:113, 4:126, 5:86, 6:85, 7:57, 7:162, 12:23, 22:38, 28:15, 31:23, 33:30, 37:106, 37:111, 37:122, 39:35, 77:45"
            }
        ],
        "ar": "اِنَّا کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿۱۳۲﴾ ",
        "ur": "یقیناً ہم اسی طرح احسان کرنے والوں کو جزا دیا کرتے ہیں۔",
        "v5": {
            "text": "Thus indeed do We reward those who do good.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 133,
        "v_": 132,
        "topics": [
            {
                "id": 7097,
                "topic": "Elijah: <i>Ilyas<sup>(as)</sup></i>",
                "verses": "6:86, 38:49"
            }
        ],
        "ar": "اِنَّہٗ  مِنۡ عِبَادِنَا الۡمُؤۡمِنِیۡنَ ﴿۱۳۳﴾ ",
        "ur": "وہ یقیناً ہمارے مومن بندوں میں سے تھا۔",
        "v5": {
            "text": "Surely, he was <i>one</i> of Our believing servants.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 134,
        "v_": 133,
        "topics": [
            {
                "id": 10664,
                "topic": "Lot: <i>Lut(as)</i>: Messenger of Allah",
                "verses": "27:55, 6:87, 21:75, 26:163"
            },
            {
                "id": 10672,
                "topic": "Lot: <i>Lut(as)</i>: story of",
                "verses": "11:78-84, 7:81-85, 15:62-78, 21:72, 26:161-175, 27:55-59, 29:27, 54:34-40"
            }
        ],
        "ar": "وَ  اِنَّ  لُوۡطًا لَّمِنَ الۡمُرۡسَلِیۡنَ ﴿۱۳۴﴾ؕ ",
        "ur": "اور لوط بھی ضرور مُرسلین میں سے تھا۔",
        "v5": {
            "text": "[a]And assuredly Lot, <i>too</i>, was <i>one</i> of the Messengers,[3349]",
            "notes": [
                {
                    "ref": "a",
                    "note": "7:81; 26:161; 29:29."
                },
                {
                    "ref": "3349",
                    "note": "<p><strong>Commentary:</strong></p><p>For Lot see 15:62-78.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 135,
        "v_": 134,
        "topics": [
            {
                "id": 10672,
                "topic": "Lot: <i>Lut(as)</i>: story of",
                "verses": "11:78-84, 7:81-85, 15:62-78, 21:72, 26:161-175, 27:55-59, 29:27, 54:34-40"
            }
        ],
        "ar": "اِذۡ  نَجَّیۡنٰہُ  وَ اَہۡلَہٗۤ   اَجۡمَعِیۡنَ ﴿۱۳۵﴾ۙ ",
        "ur": "جب ہم نے اسے اور اس کے تمام اہل کو نجات بخشی۔",
        "v5": {
            "text": "[b]When We delivered him and all his family,",
            "notes": [
                {
                    "ref": "b",
                    "note": "26:171; 29:33; 51:36."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 136,
        "v_": 135,
        "topics": [
            {
                "id": 10672,
                "topic": "Lot: <i>Lut(as)</i>: story of",
                "verses": "11:78-84, 7:81-85, 15:62-78, 21:72, 26:161-175, 27:55-59, 29:27, 54:34-40"
            }
        ],
        "ar": "اِلَّا  عَجُوۡزًا فِی الۡغٰبِرِیۡنَ ﴿۱۳۶﴾ ",
        "ur": "سوائے پیچھے رہ جانے والوں میں (شامل) ایک بڑھیا کے۔",
        "v5": {
            "text": "[c]Except an old woman <i>who was</i> among those who stayed behind.",
            "notes": [
                {
                    "ref": "c",
                    "note": "7:84; 11:82; 15:61; 27:58."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 137,
        "v_": 136,
        "topics": [
            {
                "id": 10656,
                "topic": "Lot: <i>Lut(as)</i>: people destroyed",
                "verses": "7:85, 11:83, 15:75, 26:173-174, 27:59, 51:34, 54:35, 54:37-39"
            },
            {
                "id": 10672,
                "topic": "Lot: <i>Lut(as)</i>: story of",
                "verses": "11:78-84, 7:81-85, 15:62-78, 21:72, 26:161-175, 27:55-59, 29:27, 54:34-40"
            }
        ],
        "ar": "ثُمَّ  دَمَّرۡنَا الۡاٰخَرِیۡنَ ﴿۱۳۷﴾ ",
        "ur": "پھر ہم نے دوسروں کو ہلاک کر دیا۔",
        "v5": {
            "text": "[d]Then We utterly destroyed the others.[3350]",
            "notes": [
                {
                    "ref": "d",
                    "note": "26:173."
                },
                {
                    "ref": "3350",
                    "note": "<p><strong>Important Words:</strong></p><p>دمرنا (We utterly destroyed) is the intensive form of دمر (<i>damara</i>). They say دمر علیھم i.e. he intruded upon them; he came upon them without per-mission. دمرھم او دمر علیھم (<i>dammara</i>) means, He (God) utterly destroyed them or annihilated them (Aqrab).</p><p><strong>Commentary:</strong></p><p>Both the towns, Sodom and Gomorrah, to which Lot preached his Message were completely destroyed; only the members of Lot’s family, except his wife, were saved.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 138,
        "v_": 137,
        "topics": [
            {
                "id": 10672,
                "topic": "Lot: <i>Lut(as)</i>: story of",
                "verses": "11:78-84, 7:81-85, 15:62-78, 21:72, 26:161-175, 27:55-59, 29:27, 54:34-40"
            }
        ],
        "ar": "وَ اِنَّکُمۡ لَتَمُرُّوۡنَ عَلَیۡہِمۡ مُّصۡبِحِیۡنَ ﴿۱۳۸﴾ ",
        "ur": "اور یقیناً تم صبح کرتے ہوئے اُن (کے مدفن) پر سے گزرتے ہو ۔",
        "v5": {
            "text": "[e]And surely you pass by them in the morning,[3351]",
            "notes": [
                {
                    "ref": "e",
                    "note": "15:77."
                },
                {
                    "ref": "3351",
                    "note": "<p><strong>Commentary:</strong></p><p>See next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 139,
        "v_": 138,
        "topics": [
            {
                "id": 10672,
                "topic": "Lot: <i>Lut(as)</i>: story of",
                "verses": "11:78-84, 7:81-85, 15:62-78, 21:72, 26:161-175, 27:55-59, 29:27, 54:34-40"
            }
        ],
        "ar": "وَ  بِالَّیۡلِ ؕ اَفَلَا  تَعۡقِلُوۡنَ ﴿۱۳۹﴾٪ ",
        "ur": "اور رات کو بھی۔ پس کیا تم عقل نہیں کرتے؟",
        "v5": {
            "text": "And by night. Then why do you not understand?[3352]",
            "notes": [
                {
                    "ref": "3352",
                    "note": "<p><strong>Commentary:</strong></p><p>Sodom and Gomorrah were situated on the highway from Arabia to Syria where the Arab caravans passed by day and night. At another place in the Quran these towns are mentioned as having been situated \"on a road that still exists\" (15:77).</p><p>The present and the preceding verses are full of extreme pathos. The Quraishites of Mecca are told that a great Prophet has come to them. They have rejected him. They know that there had lived in the neighbouring land another Prophet, Lot. His people also rejected him and God utterly destroyed them for their wicked and abominable deeds. The site of their annihilated towns lies on the highway which leads to Syria to which country their (of the Quraishites) caravans frequently pass. Then why do they not take a lesson from the fate that met the people of Lot, and accept their own Prophet—the Holy Prophet Muhammad?</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 140,
        "v_": 139,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            },
            {
                "id": 13046,
                "topic": "Nineveh",
                "verses": "10:99, 30:5, 46:30"
            }
        ],
        "ar": "وَ  اِنَّ یُوۡنُسَ لَمِنَ الۡمُرۡسَلِیۡنَ ﴿۱۴۰﴾ؕ ",
        "ur": "اور یقیناً یونس (بھی) مُرسلین میں سے تھا۔",
        "v5": {
            "text": "[a]And surely Jonah <i>also</i> was <i>one</i> of the Messengers,[3353]",
            "notes": [
                {
                    "ref": "a",
                    "note": "21:88; 68:49."
                },
                {
                    "ref": "3353",
                    "note": "<p><strong>Commentary:</strong></p><p>Jonah, the Prophet, has been mentioned at six places in the Quran. In 4:164 and 6:87-88 he has been reckoned among the Prophets of God. In the present verse he has been spoken of as a Divine Messenger and in 21:88 and 68:49, he has been given the descriptive epithets of ذوالنون (Master of the Fish) and صاحب الحوت (Fellow of the Fish). He was an Israelite Prophet and lived in the 9th century in the reign of Jeroboam II or Jehoahaz. See also 6:88.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 141,
        "v_": 140,
        "topics": [
            {
                "id": 4553,
                "topic": "Boat",
                "verses": "10:23, 11:39, 18:72, 18:80, 29:66, 35:13"
            },
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            },
            {
                "id": 13046,
                "topic": "Nineveh",
                "verses": "10:99, 30:5, 46:30"
            }
        ],
        "ar": "اِذۡ   اَبَقَ  اِلَی الۡفُلۡکِ الۡمَشۡحُوۡنِ ﴿۱۴۱﴾ۙ ",
        "ur": "جب وہ بھری ہوئی کشتی کی طرف فرار ہوا۔",
        "v5": {
            "text": "When he fled to the laden ship;[3354]",
            "notes": [
                {
                    "ref": "3354",
                    "note": "<p><strong>Commentary:</strong></p><p>According to the Bible, Jonah was commissioned by God to go to Nineveh and \"cry against\" it, but, instead, he fled to Tarshish \"from the presence of the Lord\" (Jonah 1:3). The Quran contradicts this Biblical statement as it impugns a Divine Prophet, and, according to the Quran, Divine Prophets are sinless and incapable of disobeying God’s command. It is, therefore, not possible that Jonah should have even conceived of fleeing from the presence of the Omnipresent God. In fact, Jonah, being angry with his people, because they had rejected the Divine Message, fled from them, and not from God. See also 21:88. The whole account of Jonah as given in the Quran may be a description of his spiritual ascension and may be taken in a figurative sense and interpreted accordingly.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 142,
        "v_": 141,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "فَسَاہَمَ فَکَانَ مِنَ الۡمُدۡحَضِیۡنَ ﴿۱۴۲﴾ۚ ",
        "ur": "پھر اس نے قرعہ نکالا تو وہ باہر دھکیل دیئے جانے والوں میں سے ہوگیا۔",
        "v5": {
            "text": "And he cast lots <i>with the crew of the ship</i> and was of the losers.[3355]",
            "notes": [
                {
                    "ref": "3355",
                    "note": "<p><strong>Important Words:</strong></p><p>ساھم (cast lots) is derived from سھم.They say سھمه i.e. he overcame him in the game of shooting arrows. ساھمه means, he shot arrows with him in competition; he cast or drew lots with him. ساھمته فسھمته means, I competed with him in casting lots or in shooting arrows and overcame him therein (Aqrab &amp; Lane).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 143,
        "v_": 142,
        "topics": [
            {
                "id": 7626,
                "topic": "Fish",
                "verses": "7:164, 18:62, 18:64, 68:49"
            },
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "فَالۡتَقَمَہُ  الۡحُوۡتُ وَ ہُوَ  مُلِیۡمٌ ﴿۱۴۳﴾ ",
        "ur": "پس مچھلی نے اسے نگل لیا جب کہ وہ (اپنے آپ کو) ملامت کر رہا تھا۔",
        "v5": {
            "text": "And the fish swallowed him while he was blaming <i>himself</i>.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 144,
        "v_": 143,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "فَلَوۡ لَاۤ  اَنَّہٗ  کَانَ مِنَ الۡمُسَبِّحِیۡنَ ﴿۱۴۴﴾ۙ ",
        "ur": "پس اگر وہ تسبیح کرنے والوں میں سے نہ ہوتا۔",
        "v5": {
            "text": "And had he not been of those who glorify <i>God</i>,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 145,
        "v_": 144,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "لَلَبِثَ فِیۡ  بَطۡنِہٖۤ  اِلٰی یَوۡمِ یُبۡعَثُوۡنَ ﴿۱۴۵﴾ۚؒ ",
        "ur": "تو ضرور وہ اس کے پیٹ میں اس دن تک رہتا جب وہ (لوگ) اٹھائے جائیں گے۔",
        "v5": {
            "text": "He would have surely tarried in its belly till the Day of Resurrection.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 146,
        "v_": 145,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "فَنَبَذۡنٰہُ  بِالۡعَرَآءِ  وَ  ہُوَ  سَقِیۡمٌ ﴿۱۴۶﴾ۚ ",
        "ur": "پس ہم نے اسے ایک کھلے میدان میں اچھال پھینکا جبکہ وہ سخت بیمار تھا۔",
        "v5": {
            "text": "Then We cast him on a bare tract of land, and he was sick;[3356]",
            "notes": [
                {
                    "ref": "3356",
                    "note": "<p><strong>Important Words:</strong></p><p>عراء (bare tract of land) is derived from عری which means, he was or became naked, bare or without clothing. They say عری من العیب i.e. he was or became free from fault, defector blemish. عراء means, a wide or spacious place or tract of land in which nothing is hidden; or the vacant surface of the earth or land or of a wide space of land (Lane).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 147,
        "v_": 146,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "وَ اَنۡۢبَتۡنَا عَلَیۡہِ شَجَرَۃً مِّنۡ یَّقۡطِیۡنٍ ﴿۱۴۷﴾ۚ ",
        "ur": "اور ہم نے اسے ڈھانکنے کے لئے ایک کدو جیسی بیل اُگا دی۔",
        "v5": {
            "text": "And We caused a gourd plant to grow over him.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 148,
        "v_": 147,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "وَ اَرۡسَلۡنٰہُ  اِلٰی مِائَۃِ  اَلۡفٍ اَوۡ یَزِیۡدُوۡنَ ﴿۱۴۸﴾ۚ ",
        "ur": "اور ہم نے اسے ایک لاکھ کی طرف بھیجا بلکہ وہ (تعداد میں) بڑھ رہے تھے،",
        "v5": {
            "text": "And We sent him <i>as a Messenger</i> to a hundred thousand <i>people</i> or more,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 149,
        "v_": 148,
        "topics": [
            {
                "id": 9991,
                "topic": "Jonah: <i>Yunus<sup>(as)</sup></i>",
                "verses": "4:164, 6:87-88, 10:99, 21:88, 68:49-51"
            }
        ],
        "ar": "فَاٰمَنُوۡا  فَمَتَّعۡنٰہُمۡ   اِلٰی حِیۡنٍ ﴿۱۴۹﴾ؕ ",
        "ur": "پس وہ ایمان لے آئے اور ہم نے انہیں ایک مدت تک کچھ فائدہ پہنچایا۔",
        "v5": {
            "text": "[a]And they believed; so We gave them provision for a while.[3357]",
            "notes": [
                {
                    "ref": "a",
                    "note": "10:99."
                },
                {
                    "ref": "3357",
                    "note": "<p><strong>Commentary:</strong></p><p>In the whole history of religion, no people are known to have benefited so much from the warning of impending Divine punishment as did the people of Jonah. When they were warned that they would be visited with punishment if they did not behave and believe in Jonah and did not mend their ways, they at once repented and believed in Jonah with the result that the threatened punishment was averted. This repentance of Jonah’s people, even though belated, so pleased God that they were not only forgiven but their case is held up in the Quran, as an example for disbelievers of all Prophets of God (10:99).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 150,
        "v_": 149,
        "topics": [
            {
                "id": 2611,
                "topic": "Angels: <i>Mala’ikah</i>: not daughters of Allah",
                "verses": "17:41, 43:20"
            },
            {
                "id": 5728,
                "topic": "Daughters: attribute to Allah",
                "verses": "11:79-80, 6:101, 16:58, 43:17, 52:40"
            }
        ],
        "ar": "فَاسۡتَفۡتِہِمۡ  اَلِرَبِّکَ الۡبَنَاتُ وَ لَہُمُ الۡبَنُوۡنَ ﴿۱۵۰﴾ۙ ",
        "ur": "پس تُو ان سے پوچھ کیا تیرے ربّ کے لئے تو بیٹیاں ہیں اور ان کے لئے بیٹے ہیں؟",
        "v5": {
            "text": "[b]Now ask <i>the disbelievers</i> whether thy Lord has daughters, whereas they have sons.[3358]",
            "notes": [
                {
                    "ref": "b",
                    "note": "6:101; 16:58; 43:17; 52:40; 53:22."
                },
                {
                    "ref": "3358",
                    "note": "<p><strong>Commentary:</strong></p><p>After giving a brief history of some of the Prophets in the preceding verses, the <i>Surah</i> proceeds in the present verse to deal with a basic principle of all religions—the repudiation and condemnation of idolatry. Among different peoples <i>Shirk</i>(ascribing Divine powers and attributes to beings and things other than God) has taken different forms. Some people worship forces of nature, others idols of stone, and yet others ascribe Divine powers to angels, believing them to be God’s daughters. It is this form of idolatry which was prevalent among the Arabs and in the Holy Prophet’s time and which has been condemned here.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 151,
        "v_": 150,
        "topics": [
            {
                "id": 5728,
                "topic": "Daughters: attribute to Allah",
                "verses": "11:79-80, 6:101, 16:58, 43:17, 52:40"
            }
        ],
        "ar": "اَمۡ خَلَقۡنَا الۡمَلٰٓئِکَۃَ  اِنَاثًا  وَّ ہُمۡ شٰہِدُوۡنَ ﴿۱۵۱﴾ ",
        "ur": "یا پھر ہم نے فرشتوں کو عورتیں بنایا ہے اور وہ اس پر گواہ ہیں؟",
        "v5": {
            "text": "[a]Did We create the angels females while they were witnesses?",
            "notes": [
                {
                    "ref": "a",
                    "note": "17:41; 37:151; 43:20; 52:40."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 152,
        "v_": 151,
        "topics": [
            {
                "id": 5728,
                "topic": "Daughters: attribute to Allah",
                "verses": "11:79-80, 6:101, 16:58, 43:17, 52:40"
            },
            {
                "id": 10471,
                "topic": "Lie: <i>Ifk</i>, <i>Kidhb</i>, fabrication",
                "verses": "24:12-13, 3:76, 3:79, 3:95, 4:51, 5:104, 6:22, 6:94, 6:145, 7:38, 10:18, 10:61, 10:70, 11:19, 16:117, 18:16, 25:5, 29:18, 29:69, 34:44, 37:87, 46:12, 46:29, 58:15, 61:8"
            }
        ],
        "ar": "اَلَاۤ  اِنَّہُمۡ  مِّنۡ  اِفۡکِہِمۡ  لَیَقُوۡلُوۡنَ ﴿۱۵۲﴾ۙ ",
        "ur": "خبردار! وہ یقیناً اپنی طرف سے افترا کرتے ہوئے (یہ) کہتے ہیں۔",
        "v5": {
            "text": "Now, surely it is <i>one</i> of their fabrications that they say,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 153,
        "v_": 152,
        "topics": [
            {
                "id": 5728,
                "topic": "Daughters: attribute to Allah",
                "verses": "11:79-80, 6:101, 16:58, 43:17, 52:40"
            },
            {
                "id": 10443,
                "topic": "Liar",
                "verses": "3:62, 6:29, 9:43, 9:107, 11:28, 11:94, 12:27, 12:75, 16:87, 16:106, 23:91, 24:8-9, 24:14, 26:224, 27:28, 28:39, 29:4, 29:13, 38:5, 39:4, 40:25, 40:29, 40:38, 54:26-27"
            }
        ],
        "ar": "وَلَدَ اللّٰہُ ۙ وَ  اِنَّہُمۡ  لَکٰذِبُوۡنَ ﴿۱۵۳﴾ ",
        "ur": "(کہ) اللہ نے بیٹا پیدا کیا ہے۔ اور بلاشبہ یہ ضرور جھوٹے لوگ ہیں۔",
        "v5": {
            "text": "‘Allah has begotten <i>children</i>;’ and they are certainly liars.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 154,
        "v_": 153,
        "topics": [
            {
                "id": 5728,
                "topic": "Daughters: attribute to Allah",
                "verses": "11:79-80, 6:101, 16:58, 43:17, 52:40"
            }
        ],
        "ar": "اَصۡطَفَی الۡبَنَاتِ عَلَی الۡبَنِیۡنَ ﴿۱۵۴﴾ؕ ",
        "ur": " کیا اس نے بیٹوں پر بیٹیوں کو ترجیح دی ہے؟",
        "v5": {
            "text": "[b]Has He chosen daughters in preference to sons?[3359]",
            "notes": [
                {
                    "ref": "b",
                    "note": "43:17; 53:22."
                },
                {
                    "ref": "3359",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that all <i>Shirk</i> (idolatry), in whatever form it may be practised, is reprehensible, but to believe that God has preferred daughters to sons (a thing which disbelievers would not like for themselves), is nothing but foolish and condemnable.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 155,
        "v_": 154,
        "topics": [],
        "ar": "مَا  لَکُمۡ ۟  کَیۡفَ تَحۡکُمُوۡنَ ﴿۱۵۵﴾ ",
        "ur": "تمہیں کیا ہو گیا ہے تم کیسے فیصلے کرتے ہو۔",
        "v5": {
            "text": "What is the matter with you? How judge ye?",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 156,
        "v_": 155,
        "topics": [],
        "ar": "اَفَلَا  تَذَکَّرُوۡنَ ﴿۱۵۶﴾ۚ ",
        "ur": "پس کیا تم نصیحت نہیں پکڑتے؟",
        "v5": {
            "text": "Will you not reflect?[3359A]",
            "notes": [
                {
                    "ref": "3359A",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse seems to administer a rebuke to disbelievers in the words, \"Cannot you understand this simple fact that the ascription of Divine powers and attributes to weak human beings, to the forces of nature, to inanimate things or even to angels who themselves have been created by God, offends against reason and is an insult to human intelligence?\"</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 157,
        "v_": 156,
        "topics": [],
        "ar": "اَمۡ  لَکُمۡ  سُلۡطٰنٌ  مُّبِیۡنٌ ﴿۱۵۷﴾ۙ ",
        "ur": "یا تمہارے پاس کوئی غالب (اور) روشن دلیل ہے؟",
        "v5": {
            "text": "[c]Or have you a clear authority?",
            "notes": [
                {
                    "ref": "c",
                    "note": "52:39."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 158,
        "v_": 157,
        "topics": [
            {
                "id": 18089,
                "topic": "Truthful: <i>Sadiq</i>: if you are",
                "verses": "2:178, 2:24, 2:95, 2:112, 3:94, 3:169, 3:184, 6:41, 6:144, 7:71, 7:107, 7:195, 10:39, 10:49, 11:14, 11:33, 15:8, 21:39, 26:155, 26:188, 27:65, 27:72, 28:50, 32:29, 34:30, 36:49, 40:29, 45:26, 46:23, 49:16, 49:18, 56:88, 62:7, 68:42"
            }
        ],
        "ar": "فَاۡتُوۡا بِکِتٰبِکُمۡ  اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۱۵۸﴾ ",
        "ur": "پس اپنی کتاب لاؤ اگر تم سچے ہو۔",
        "v5": {
            "text": "Then produce your Book, if you are truthful.[3360]",
            "notes": [
                {
                    "ref": "3360",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that apart from human reason and intelligence which repudiate all forms of <i>shirk</i> (idolatry), no Divine Book accords the slightest countenance to this most foolish and obnoxious doctrine; on the contrary all of them refute and contradict it in strong and scathing terms.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 159,
        "v_": 158,
        "topics": [
            {
                "id": 9964,
                "topic": "Jinn: a creation of Allah",
                "verses": "11:120, 6:101, 34:42"
            }
        ],
        "ar": "وَ جَعَلُوۡا بَیۡنَہٗ  وَ بَیۡنَ الۡجِنَّۃِ  نَسَبًا ؕ وَ لَقَدۡ عَلِمَتِ الۡجِنَّۃُ  اِنَّہُمۡ لَمُحۡضَرُوۡنَ ﴿۱۵۹﴾ۙ ",
        "ur": "اور انہوں نے اُس کے اور جنوں کے درمیان ایک رشتہ گھڑ لیا۔ حالانکہ جن یقیناً جانتے ہیں کہ وہ بھی ضرور پیش کئے جانے والے ہیں۔",
        "v5": {
            "text": "[a]And they assert a blood relationship between Him and the Jinn while the Jinn <i>themselves</i> know that they will be brought <i>before God for judgement</i>.[3361]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:101."
                },
                {
                    "ref": "3361",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that morally and intellectually disbelievers have become so degraded that they assert blood-relationship between God and evil spirits. What greater folly and blasphemy could there possibly be?</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 160,
        "v_": 159,
        "topics": [
            {
                "id": 766,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: Glory be to Allah",
                "verses": "12:109, 2:33, 2:117, 3:192, 4:172, 5:117, 6:101, 7:144, 9:31, 10:11, 10:19, 10:69, 16:2, 16:58, 17:2, 17:44, 17:94, 17:109, 19:36, 21:23, 21:27, 21:88, 23:92, 24:17, 25:19, 27:9, 28:69, 30:18, 30:41, 34:42, 36:37, 36:84, 37:181, 39:5, 39:68, 43:83, 52:44, 59:24, 68:30"
            },
            {
                "id": 1208,
                "topic": "Allah: attributes of, <i>Asma’ul-Husna</i>",
                "verses": "1:1, 1:7, 2:256, 7:181, 17:111, 20:9, 59:23-25, 112:2-5, See also Attributes of Allah"
            },
            {
                "id": 9964,
                "topic": "Jinn: a creation of Allah",
                "verses": "11:120, 6:101, 34:42"
            }
        ],
        "ar": "سُبۡحٰنَ اللّٰہِ عَمَّا یَصِفُوۡنَ ﴿۱۶۰﴾ۙ ",
        "ur": "پاک ہے اللہ اس سے جو وہ بیان کرتے ہیں۔",
        "v5": {
            "text": "Holy is Allah <i>and free</i> from what they attribute <i>to Him</i>.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 161,
        "v_": 160,
        "topics": [
            {
                "id": 1208,
                "topic": "Allah: attributes of, <i>Asma’ul-Husna</i>",
                "verses": "1:1, 1:7, 2:256, 7:181, 17:111, 20:9, 59:23-25, 112:2-5, See also Attributes of Allah"
            },
            {
                "id": 16546,
                "topic": "Servant: of God",
                "verses": "25:64-77, 1:7, 2:91, 2:187, 2:208, 3:16, 3:21, 3:183, 4:173, 5:119, 6:89, 9:104, 10:108, 12:25, 14:12, 14:32, 15:43, 16:3, 17:6, 17:54, 17:66, 18:103, 19:3, 19:31, 19:64, 20:78, 21:106, 23:110, 25:18, 26:53, 28:83, 29:57, 29:63, 35:29, 35:33, 36:31, 37:75, 37:82, 38:18, 38:46, 39:11, 39:54, 42:24, 42:28, 43:60, 50:12, 66:11, 89:30"
            }
        ],
        "ar": "اِلَّا عِبَادَ  اللّٰہِ  الۡمُخۡلَصِیۡنَ ﴿۱۶۱﴾ ",
        "ur": "اللہ کے چنیدہ بندے (ان باتوں سے) مستثنیٰ ہیں۔",
        "v5": {
            "text": "But the chosen servants of Allah <i>attribute nothing derogatory to Him</i>.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 162,
        "v_": 161,
        "topics": [],
        "ar": "فَاِنَّکُمۡ  وَ مَا  تَعۡبُدُوۡنَ ﴿۱۶۲﴾ۙ ",
        "ur": " پس یقیناً تم اور وہ جِن کی تم عبادت کرتے ہو۔",
        "v5": {
            "text": "Verily, you and what you worship—",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 163,
        "v_": 162,
        "topics": [],
        "ar": "مَاۤ   اَنۡتُمۡ  عَلَیۡہِ  بِفٰتِنِیۡنَ ﴿۱۶۳﴾ۙ ",
        "ur": "تم اس کے خلاف (کسی کو) گمراہ نہیں کرسکو گے۔",
        "v5": {
            "text": "None of you can mislead <i>anyone</i> against Him,[3362]",
            "notes": [
                {
                    "ref": "3362",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that it is only people of the evil spirits’ own ilk that such spirits can mislead. They have no control or influence over godly men. \"Surely thou shalt have no power over My servants.\" says the Quran (15:41). The pronoun ہ in علیه (against Him) refers to God.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 164,
        "v_": 163,
        "topics": [],
        "ar": "اِلَّا  مَنۡ  ہُوَ  صَالِ الۡجَحِیۡمِ ﴿۱۶۴﴾ ",
        "ur": "سوائے اس کے جس نے جہنم میں داخل ہونا ہی ہے۔",
        "v5": {
            "text": "Except <i>only</i> him who shall burn in Hell.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 165,
        "v_": 164,
        "topics": [
            {
                "id": 11001,
                "topic": "Maqam",
                "verses": "55:47, 19:74, 26:58-59, 44:26-27, 44:52, 79:41-42"
            }
        ],
        "ar": "وَ مَا مِنَّاۤ   اِلَّا  لَہٗ  مَقَامٌ  مَّعۡلُوۡمٌ ﴿۱۶۵﴾ۙ ",
        "ur": "اور (فرشتے کہیں گے کہ) ہم میں سے ہر ایک کے لئے ایک معلوم مقام مقرر ہے۔",
        "v5": {
            "text": "<i>Say</i>: ‘There is not one of us but has an appointed station.[3363]",
            "notes": [
                {
                    "ref": "3363",
                    "note": "<p><strong>Commentary:</strong></p><p>The words of this and the next two verses may also be taken to have been spoken by righteous men of God, or the reference may specially be to the righteous men mentioned in the beginning of the <i>Surah</i> or, as some say, to the angels.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 166,
        "v_": 165,
        "topics": [],
        "ar": "وَّ  اِنَّا  لَنَحۡنُ الصَّآفُّوۡنَ ﴿۱۶۶﴾ۚ ",
        "ur": "اور یقیناً ہم صف در صف ہیں۔",
        "v5": {
            "text": "And, verily, we are those who stand ranged in rows.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 167,
        "v_": 166,
        "topics": [
            {
                "id": 719,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:14, 13:16, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 22:78, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 38:19, 39:10, 39:76, 41:38-39, 48:10, 50:40-41, 55:7, 59:25, 61:2, 62:2, 64:2, 87:2, 96:20, 110:4"
            }
        ],
        "ar": "وَ  اِنَّا لَنَحۡنُ الۡمُسَبِّحُوۡنَ ﴿۱۶۷﴾ ",
        "ur": "اور یقیناً ہم تسبیح کررہے ہیں۔",
        "v5": {
            "text": "[a]And we are verily those who glorify <i>God</i>.’",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:31; 21:21; 41:39."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 168,
        "v_": 167,
        "topics": [
            {
                "id": 11167,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:178, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            }
        ],
        "ar": "وَ  اِنۡ  کَانُوۡا  لَیَقُوۡلُوۡنَ ﴿۱۶۸﴾ۙ ",
        "ur": "اور وہ (کفار) تو کہا کرتے تھے۔",
        "v5": {
            "text": "And surely <i>the disbelievers</i> used to say,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 169,
        "v_": 168,
        "topics": [],
        "ar": "لَوۡ  اَنَّ عِنۡدَنَا ذِکۡرًا  مِّنَ الۡاَوَّلِیۡنَ ﴿۱۶۹﴾ۙ ",
        "ur": " کہ اگر ہمارے پاس اوّلین کا کوئی ذکر (پہنچا) ہوتا۔",
        "v5": {
            "text": "‘If we had with us a reminder <i>like that</i> of the people of old,",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 170,
        "v_": 169,
        "topics": [],
        "ar": "لَکُنَّا عِبَادَ اللّٰہِ الۡمُخۡلَصِیۡنَ ﴿۱۷۰﴾ ",
        "ur": "تو یقیناً ہم اللہ کے چنیدہ بندے ہو جاتے۔",
        "v5": {
            "text": "We would surely have been Allah’s chosen servants.’",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 171,
        "v_": 170,
        "topics": [],
        "ar": "فَکَفَرُوۡا بِہٖ فَسَوۡفَ یَعۡلَمُوۡنَ  ﴿۱۷۱﴾",
        "ur": "پس (اب جبکہ) انہوں نے اُس (یعنی اللہ) کا انکار کر دیا تو ضرور وہ (اس کا نتیجہ) جان لیں گے۔",
        "v5": {
            "text": "Yet <i>when it has come to them</i> they disbelieve therein, but they will soon come to know.[3364]",
            "notes": [
                {
                    "ref": "3364",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse implies a warning to disbelievers that they will soon see the evil consequences of their rejection of truth.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 172,
        "v_": 171,
        "topics": [
            {
                "id": 1770,
                "topic": "Allah: He, His Messengers will prevail",
                "verses": "58:22, 5:57, 58:23"
            },
            {
                "id": 10120,
                "topic": "Kalimat: words",
                "verses": "3:46, 2:38, 2:125, 3:40, 3:65, 4:172, 6:35, 6:116, 7:138, 7:159, 8:8, 9:40, 9:74, 10:20, 10:34, 10:65, 10:97, 11:111, 14:25, 14:27, 18:6, 18:28, 18:110, 20:130, 23:101, 31:28, 39:20, 39:72, 40:7, 42:15, 42:22, 43:29, 48:27, 66:13"
            },
            {
                "id": 14548,
                "topic": "Prophets<sup>(as)</sup>: <i>Anbiya’</i>: Allah helps His",
                "verses": "19:52, 40:52"
            }
        ],
        "ar": "وَ لَقَدۡ سَبَقَتۡ کَلِمَتُنَا لِعِبَادِنَا الۡمُرۡسَلِیۡنَ ﴿۱۷۲﴾ۚۖ ",
        "ur": "اور بلاشبہ ہمارے بھیجے ہوئے بندوں کے حق میں ہمارا (یہ) فرمان گزر چکا ہے۔ ",
        "v5": {
            "text": "And surely Our word has gone forth respecting Our servants, the Messengers,[3365]",
            "notes": [
                {
                    "ref": "3365",
                    "note": "<p><strong>Commentary:</strong></p><p>See next verse.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 173,
        "v_": 172,
        "topics": [
            {
                "id": 1770,
                "topic": "Allah: He, His Messengers will prevail",
                "verses": "58:22, 5:57, 58:23"
            },
            {
                "id": 14548,
                "topic": "Prophets<sup>(as)</sup>: <i>Anbiya’</i>: Allah helps His",
                "verses": "19:52, 40:52"
            }
        ],
        "ar": "اِنَّہُمۡ  لَہُمُ  الۡمَنۡصُوۡرُوۡنَ ﴿۱۷۳﴾۪ ",
        "ur": "(کہ) یقیناً وہی ہیں جنہیں نصرت عطا کی جائے گی۔",
        "v5": {
            "text": "[b]That it is certainly they who will be helped;[3365A]",
            "notes": [
                {
                    "ref": "b",
                    "note": "40:52; 58:22."
                },
                {
                    "ref": "3365A",
                    "note": "<p><strong>Commentary:</strong></p><p>In verse 171 above the disbelievers were threatened with punishment if they did not accept the Prophet of God. In the verse under comment they are told that the cause of truth must and does always prevail, as it is an immutable divine law that God’s Messengers never fail in their missions. The history of all religions bears an eloquent testimony to this undeniable fact. Elsewhere the Quran says: \"Most surely We help Our Messengers and those who believe, in the present life and on the day when witnesses will stand forth\" (40:52).</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 174,
        "v_": 173,
        "topics": [],
        "ar": "وَ  اِنَّ جُنۡدَنَا لَہُمُ  الۡغٰلِبُوۡنَ ﴿۱۷۴﴾ ",
        "ur": "اور یقیناً ہمارا لشکر ہی ضرور غالب آنے والا ہے۔",
        "v5": {
            "text": "And that it is Our host that will certainly be victorious.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 175,
        "v_": 174,
        "topics": [],
        "ar": "فَتَوَلَّ عَنۡہُمۡ حَتّٰی حِیۡنٍ ﴿۱۷۵﴾ۙ ",
        "ur": "پس ان سے کچھ عرصہ تک اِعراض کر۔",
        "v5": {
            "text": "So turn thou away from them for a while.[3366]",
            "notes": [
                {
                    "ref": "3366",
                    "note": "<p><strong>Commentary:</strong></p><p>When the truth of a Prophet of God becomes established beyond all doubt and disbelievers are left with no plea or pretext to reject his Message and yet persist in rejecting it, the Prophet is told to leave them alone to be judged by God and treated by Him as He, in His infallible wisdom, may think fit.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 176,
        "v_": 175,
        "topics": [],
        "ar": "وَّ اَبۡصِرۡہُمۡ فَسَوۡفَ یُبۡصِرُوۡنَ ﴿۱۷۶﴾ ",
        "ur": "اور اُنہیں دیکھتا رہ۔ پس وہ بھی عنقریب دیکھ لیں گے۔ ",
        "v5": {
            "text": "And watch them, for they will soon see <i>their own end</i>.[3367]",
            "notes": [
                {
                    "ref": "3367",
                    "note": "<p><strong>Commentary:</strong></p><p>The Holy Prophet is here told to wait till Divine decree decides the fate of disbelievers.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 177,
        "v_": 176,
        "topics": [],
        "ar": "اَفَبِعَذَابِنَا یَسۡتَعۡجِلُوۡنَ ﴿۱۷۷﴾ ",
        "ur": "پھر کیا وہ ہمارے عذاب کی طلب میں جلدی کرتے ہیں؟",
        "v5": {
            "text": "[a]Is it then Our punishment that they seek to hasten on?",
            "notes": [
                {
                    "ref": "a",
                    "note": "22:48; 27:72-73; 29:54."
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 178,
        "v_": 177,
        "topics": [
            {
                "id": 11168,
                "topic": "Meccans",
                "verses": "15:91, 2:151-152, 3:14, 3:128-129, 3:142, 3:162, 3:173, 6:42, 6:136, 7:185-186, 7:196, 8:6, 8:31, 8:34, 8:43, 8:49, 9:28, 14:44, 17:86, 17:92, 17:107, 23:95, 25:41, 27:92, 28:58-59, 29:48, 37:168, 44:11, 54:46, 59:3, 60:2, 67:22, 72:17, 90:4, 109:6, 111:2"
            }
        ],
        "ar": "فَاِذَا نَزَلَ بِسَاحَتِہِمۡ فَسَآءَ صَبَاحُ الۡمُنۡذَرِیۡنَ ﴿۱۷۸﴾ ",
        "ur": "پس جب وہ ان کے آنگن میں اترے گا تو ڈرائے جانے والوں کی صبح بہت بُری ہوگی۔",
        "v5": {
            "text": "But when it descends into their courtyard, it shall be an evil morning to those who were warned.[3368]",
            "notes": [
                {
                    "ref": "3368",
                    "note": "<p><strong>Important Words:</strong></p><p>ساحة (courtyard) means, the court or open area of a house; a part of a house in which there is no building or roof; a wide place among the dwellings of a tribe. The Arabs say عمر الله ساحتک i.e. may God make the courtyard of thy house inhabited with people (Lane).</p><p><strong>Commentary:</strong></p><p>The reference in the verse seems to be to the Fall of Mecca when a Muslim army of ten thousand strong entered its suburbs. That was indeed an evil day for the Meccans. The cup of their mortification and humiliation had become full to the brim, as all their evil designs against Islam had completely failed and it had won a glorious victory over disbelief.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 179,
        "v_": 178,
        "topics": [],
        "ar": "وَ تَوَلَّ عَنۡہُمۡ حَتّٰی حِیۡنٍ ﴿۱۷۹﴾ۙ ",
        "ur": "اور کچھ دیر کے لئے ان سے اعراض کر۔",
        "v5": {
            "text": "So turn thou away from them for a while.[3369]",
            "notes": [
                {
                    "ref": "3369",
                    "note": "<p><strong>Commentary:</strong></p><p>The repetition of this and the next verse signifies that Divine punishment is almost at the doors of the disbelievers.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 180,
        "v_": 179,
        "topics": [],
        "ar": "وَّ  اَبۡصِرۡ  فَسَوۡفَ یُبۡصِرُوۡنَ ﴿۱۸۰﴾ ",
        "ur": "اور دیکھ! پس وہ بھی ضرور دیکھ لیں گے۔",
        "v5": {
            "text": "And watch, for they will soon see.",
            "notes": null
        }
    },
    {
        "ch": 37,
        "v": 181,
        "v_": 180,
        "topics": [
            {
                "id": 767,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: Glory be to Allah",
                "verses": "12:109, 2:33, 2:117, 3:192, 4:172, 5:117, 6:101, 7:144, 9:31, 10:11, 10:19, 10:69, 16:2, 16:58, 17:2, 17:44, 17:94, 17:109, 19:36, 21:23, 21:27, 21:88, 23:92, 24:17, 25:19, 27:9, 28:69, 30:18, 30:41, 34:42, 36:37, 36:84, 37:160, 39:5, 39:68, 43:83, 52:44, 59:24, 68:30"
            }
        ],
        "ar": "سُبۡحٰنَ رَبِّکَ رَبِّ الۡعِزَّۃِ عَمَّا یَصِفُوۡنَ ﴿۱۸۱﴾ۚ ",
        "ur": "پاک ہے تیرا ربّ، ربّ العزّت!اُس سے جو وہ بیان کرتے ہیں۔",
        "v5": {
            "text": "Holy is thy Lord, the Lord of Honour <i>and Power</i>, far above that which they assert.[3370]",
            "notes": [
                {
                    "ref": "3370",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means to say that with the defeat and discomfiture of disbelief the fact has become clearly established that the Great God Who has sent the Holy Prophet is the God of Honour and Power and that His name will now be glorified in the whole of Arabia.</p>"
                }
            ]
        }
    },
    {
        "ch": 37,
        "v": 182,
        "v_": 181,
        "topics": [
            {
                "id": 16035,
                "topic": "Salam: greetings of",
                "verses": "39:74, 4:95, 7:47, 10:11, 10:26, 11:70, 13:25, 14:24, 16:33, 19:16, 19:34, 19:48, 19:63, 25:64, 25:76, 28:56, 33:45, 36:59, 37:80, 37:110, 37:121, 37:131, 43:90, 51:26, 56:27, 56:92"
            }
        ],
        "ar": "وَ  سَلٰمٌ  عَلَی  الۡمُرۡسَلِیۡنَ ﴿۱۸۲﴾ۚ ",
        "ur": "اور سلام ہو سب مُرسلین پر۔",
        "v5": {
            "text": "[a]And peace be upon the Messengers![3371]",
            "notes": [
                {
                    "ref": "a",
                    "note": "27:60."
                },
                {
                    "ref": "3371",
                    "note": "<p><strong>Commentary:</strong></p><p>The reference in the verse is to the Holy Prophet who represents all Prophets and Messengers of God.</p>"
                }
            ]
        }
    }
]
