[
    {
        "ch": 13,
        "v": 1,
        "v_": 0,
        "topics": [],
        "ar": "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾",
        "ur": "اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (اور) بار بار رحم کرنے والا ہے۔",
        "v5": {
            "text": "[a]In the name of Allah, the Gracious, the Merciful.[1612]",
            "notes": [
                {
                    "ref": "a",
                    "note": "See 1:1."
                },
                {
                    "ref": "1612",
                    "note": "<p><strong>Commentary:</strong></p><p>See under 1:1.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 2,
        "v_": 1,
        "topics": [
            {
                "id": 51,
                "topic": "Abbreviations: <i>Alif Lam Mim Ra</i>",
                "verses": null
            },
            {
                "id": 2267,
                "topic": "Allah: revelation through chosen Messengers",
                "verses": "4:164, 2:137, 3:54, 3:85, 4:62, 4:163, 5:16, 5:45, 5:105, 6:20, 6:84-91, 7:204, 10:48, 14:2, 16:37, 35:25, 42:52-53"
            },
            {
                "id": 3849,
                "topic": "Ayah: verses",
                "verses": "8:55, 2:42, 3:114, 8:3, 16:102, 19:59, 22:17, 39:72"
            },
            {
                "id": 4239,
                "topic": "Belief: <i>Iman</i>: those who have no",
                "verses": "2:7-8, 2:14, 4:39, 4:138, 4:151-152, 6:151, 6:159, 7:28, 7:102, 8:56, 10:91-93, 10:97-98, 10:102, 36:8, 40:60, 40:86, 41:45"
            },
            {
                "id": 4652,
                "topic": "Book: <i>Kitab</i>: revelation sent through Messengers",
                "verses": "5:49, 2:54, 2:214, 3:49, 3:82, 4:163, 6:92, 11:18, 19:31, 20:134, 23:50, 25:36, 28:44, 32:24, 35:26, 37:118, 40:54, 40:71, 41:46, 46:13, 57:26"
            },
            {
                "id": 15201,
                "topic": "Qur’an: truth, wisdom &amp; balance in",
                "verses": "10:2, 3:4, 3:61, 3:109, 4:106, 4:167, 4:171, 5:49, 6:92-93, 6:115, 17:82, 17:106, 18:110, 21:11, 23:63, 25:2, 25:34, 31:3-4, 36:3, 38:2, 42:18"
            },
            {
                "id": 18019,
                "topic": "Truth: <i>Haqq</i>: sent down with",
                "verses": "58:22, 3:4, 2:92, 2:177, 2:214, 2:253, 4:106, 5:49, 6:115, 11:18, 11:121, 16:103, 35:32, 39:3, 39:42, 42:18, 45:7"
            }
        ],
        "ar": "الٓـمّٓرٰ ۟ تِلۡکَ اٰیٰتُ الۡکِتٰبِ ؕ وَ الَّذِیۡۤ اُنۡزِلَ اِلَیۡکَ مِنۡ رَّبِّکَ الۡحَقُّ وَ لٰکِنَّ اَکۡثَرَ  النَّاسِ لَا  یُؤۡمِنُوۡنَ ﴿۲﴾",
        "ur": "اَنَا اللّٰہُ اَعلَمُ وَاَرٰی: میں اللہ ہوں۔ سب سے زیادہ جاننے والا ہوں۔ اور میں دیکھتا ہوں۔ یہ کامل کتاب کی آیات ہیں۔ اور جو تیری طرف تیرے ربّ کی طرف سے اُتاراگیا حق ہے لیکن اکثر لوگ ایمان نہیں لاتے۔",
        "v5": {
            "text": "[b]Alif Lam Mim Ra. [c]These are verses of the Book. And that which has been revealed to thee from thy Lord is the truth, but most men believe not.[1613]",
            "notes": [
                {
                    "ref": "b",
                    "note": "See 2:2."
                },
                {
                    "ref": "c",
                    "note": "13:20; 32:3-4."
                },
                {
                    "ref": "1613",
                    "note": "<p><strong>Commentary:</strong></p><p>Whereas chapters 2, 3 &amp; 7 began with the abbreviated letters <i>Alif Lam Mim</i> (chapter 7 beginning with <i>Alif Lam Mim Sad</i>) and chapters 10, 11 &amp; 12 began with the letters <i>Alif Lam Ra</i>, the present <i>Surah</i> which is the 13th in number opens with the letters, <i>Alif Lam Mim Ra</i>. This difference in the abbreviated letters shows that the subject matter of this <i>Surah</i>varies a little from that of the three preceding chapters. These four letters stand for the words انا الله اعلم واری i.e. I am Allah, the All-Knowing, the All-Seeing, the attribute of \"Knowing\" having been added to that of \"Seeing\" referred to in the preceding <i>Surahs</i>. It is obvious that when the attributes of \"knowing\" and \"seeing\" are used about God, they signify much more than what such words mean when used about man. God’s sight and knowledge are unlimited both as regards depth and extensiveness.</p><p>The words, <i>These are verses of the Book</i>, mean: (a) these are verses of the Book which mankind were instinctively expecting to be given; or (b) these are verses of the Book which had been promised in previous Scriptures. It is impossible success-fully to withstand and oppose such a Book.</p><p>The latter part of the verse means that man by nature hankers after true knowledge, but it is surprising that when disbelievers have actually been given a book comprising the truth, they prefer to grope in doubt and darkness rather than accept it.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 3,
        "v_": 2,
        "topics": [
            {
                "id": 1124,
                "topic": "Ajal: <i>Musamma</i>, fixed",
                "verses": "2:232, 11:105, 3:146, 6:3, 6:129, 7:35, 10:50, 11:4, 13:39, 14:11, 15:6, 16:62, 17:100, 20:130, 22:6, 22:34, 29:54, 30:9, 31:30, 35:14, 35:46, 39:43, 40:68, 42:15, 46:4"
            },
            {
                "id": 1519,
                "topic": "Allah: existence of",
                "verses": "2:29, 2:165, 2:187, 6:74, 7:173, 10:7, 10:32, 22:19, 25:3-4, 27:61-67, 30:21-28, 31:11-12, 45:3-7, 87:2-6"
            },
            {
                "id": 1536,
                "topic": "Allah: favours of",
                "verses": "31:32, 2:23, 31:32, 2:23, 6:100, 6:142, 7:55, 13:18, 14:33-35, 15:20-23, 16:6-17, 16:67-70, 16:72-73, 16:79, 16:81-82, 17:21, 20:54-55, 21:32-34, 22:64, 22:66, 23:20-23, 27:62-64, 31:21, 35:13, 35:28, 36:35, 40:62, 40:65, 40:80-81, 43:11-14, 45:13-14, 51:49, 55:17, 56:65, 56:69, 56:72, 67:24, 71:17-21, 77:28, 78:7-17"
            },
            {
                "id": 2228,
                "topic": "Allah: regulates all affairs",
                "verses": "10:32, 2:211, 10:4, 16:2, 22:42, 32:6, 42:54"
            },
            {
                "id": 2423,
                "topic": "Allah: throne of",
                "verses": "20:6, 2:256, 7:55, 9:129, 10:4, 11:8, 17:43, 21:23, 23:87, 23:117, 25:60, 32:5, 40:8, 40:16, 57:5, 69:18, 81:21, 85:16"
            },
            {
                "id": 2893,
                "topic": "‘Arsh: throne of Allah",
                "verses": "10:4, 2:256, 7:55, 9:129, 11:8, 17:43, 20:6, 21:23, 23:87, 23:117, 25:60, 27:27, 32:5, 39:76, 40:16, 43:83, 53:7, 57:5, 69:18, 81:21, 85:16"
            },
            {
                "id": 8647,
                "topic": "Heaven: <i>Sama’</i>: as a roof",
                "verses": "21:33, 2:20, 2:23, 22:66, 31:11, 40:65, 52:6, 78:13, 79:29, 88:19"
            },
            {
                "id": 9610,
                "topic": "Istawa: firmly settled",
                "verses": "2:30, 7:55, 10:4, 20:6, 25:60, 28:15, 32:5, 41:12, 48:30, 53:6-7, 57:5"
            },
            {
                "id": 11535,
                "topic": "Moon",
                "verses": "2:190, 6:78, 6:97, 7:55, 7:131, 10:6, 12:5, 14:34, 16:13, 21:34, 22:19, 25:62, 29:62, 31:30, 35:14, 36:40-41, 39:6, 41:38, 55:6, 71:17, 84:19, 91:3"
            },
            {
                "id": 13941,
                "topic": "Pillars",
                "verses": "104:7-10, 31:11, 89:8"
            },
            {
                "id": 13965,
                "topic": "Planets",
                "verses": "15:17, 21:33, 30:26"
            },
            {
                "id": 16714,
                "topic": "Signs: of creation",
                "verses": "30:21-27, 2:165, 3:191, 6:98, 6:100, 7:59, 10:6-7, 10:68, 13:5, 20:54-55, 21:33, 41:38, 41:40, 42:30, 45:4, 45:6"
            },
            {
                "id": 17364,
                "topic": "Sun: and Moon",
                "verses": "25:62, 2:190, 6:97, 7:55, 10:6, 14:34, 16:13, 21:34, 22:19, 25:46-47, 31:30, 35:14, 36:39-41, 39:6, 41:38, 55:6, 71:17, 75:8-10, 78:14, 84:17-19, 91:2-3"
            }
        ],
        "ar": "اَللّٰہُ الَّذِیۡ رَفَعَ السَّمٰوٰتِ بِغَیۡرِ عَمَدٍ تَرَوۡنَہَا ثُمَّ  اسۡتَوٰی عَلَی الۡعَرۡشِ وَ سَخَّرَ الشَّمۡسَ وَ الۡقَمَرَ ؕ کُلٌّ یَّجۡرِیۡ لِاَجَلٍ مُّسَمًّی ؕ یُدَبِّرُ الۡاَمۡرَ یُفَصِّلُ الۡاٰیٰتِ لَعَلَّکُمۡ بِلِقَآءِ رَبِّکُمۡ تُوۡقِنُوۡنَ ﴿۳﴾ ",
        "ur": "اللہ وہ ہے جس نے آسمانوں کو بغیر ایسے ستونوں کے بلند کیا جنہیں تم دیکھ سکو۔ پھر اس نے عرش پر قرار پکڑا اور سورج اور چاند کو خدمت پر مامور کیا۔ ہر چیز ایک معین مدت تک کے لئے حرکت میں ہے۔ وہ ہر معاملہ کو تدبیر سے کرتا ہے (اور) اپنے نشانات کو کھول کھول کر بیان کرتا ہے تاکہ تم اپنے ربّ سے ملاقات کا یقین کرو۔",
        "v5": {
            "text": "[a]Allah is He Who raised up the heavens without any pillars that you can see. Then He settled Himself on the Throne. [b]And He pressed the sun and the moon into service: each pursues its course until an appointed term. [c]He regulates <i>all</i> affairs. He clearly explains the Signs that you may have a firm belief in the meeting with your Lord.[1614]",
            "notes": [
                {
                    "ref": "a",
                    "note": "31:11."
                },
                {
                    "ref": "b",
                    "note": "7:55; 16:13; 29:62; 31:30; 35:14; 39:6."
                },
                {
                    "ref": "c",
                    "note": "32:6."
                },
                {
                    "ref": "1614",
                    "note": "<p><strong>Commentary:</strong></p><p>The Arabic expression رفع السموات بغیر عمد ترونھا rendered as, <i>Who raised up the heavens without any pillars that you can see</i>, means: (1) you see that the heavens stand without pillars; or (2) the heavens do not stand on any pillars which you may see, i.e. they have supports but you cannot see them. Both these meanings are correct and agree with the sense of the text. If the word عمد (pillars) be taken in its ordinary sense, i.e. in the sense of material columns which bear the weight of other things, then the verse would mean that the heavens stand without the support of pillars. But if the word be taken in the figurative sense, i.e. in the sense of anything that helps to keep another thing in place, then the verse would mean that the heavens or, for that matter, the heavenly bodies do stand on supports but these supports are not visible to the human eye, e.g. the force of gravity, or magnetic power or the special movements of planets or other means which men of science have discovered so far or which may be discovered in future.</p><p>The verse seeks to disabuse the minds of disbelievers of the notion that because the Holy Prophet possessed no material support or means which are considered essential for success, therefore he could not succeed in his mission. The verse says that it is not necessary that all things should have material supports or that these supports should be visible to the human eye. It is, indeed, true that everything must have some sort of prop to support it; but all things need not have the same kind of support. Material things which are the result of man’s handiwork need material supports, for even a small roof cannot stand without walls or pillars. But such is God’s handiwork that heavy stars stand in their places without visible support or without any support which may be called \"a pillar\" in the ordinary sense of the word. Although long ages have passed since this system came into being, yet nothing has gone wrong with it. There lies a world of difference between the way in which God works and the working of man. Man cannot do without support but God can, and this is why He has caused millions of stars to stand in their places without support or at least without visible support. The same divine law operates in the spiritual realm. When God desires to make a man succeed, He needs no material or visible means for it. He works in subtle ways that remain hidden from human gaze till the end is reached; and that which man in his ignorance regards as impossible becomes possible.</p><p>The expression, <i>Then He settled Himself on the Throne</i>, means that just as God first created the celestial bodies without any visible support and then began to manifest His attributes in a perfect manner, similarly in the spiritual world He has brought to perfection the spiritual firmament through the Holy Prophet; and now through the perfect teaching given to him, God’s attributes are going to find their complete manifestation. The word عرش or Throne, for which see 7:55, is used in the Quran to express the bringing to perfection of spiritual or physical laws. The expression is analogous to the ways of worldly monarchs. The rulers and monarchs of this world make their important proclamations \"from the throne.\" To keep up the metaphor the clause, <i>He settled Himself on the Throne</i>, is intended to express the perfect manifestation of Divine attributes, meaning thereby that when a new spiritual heaven and a new earth have come into being, Divine attributes will necessarily find their requisite manifestation. See also 10:4.</p><p>The words, <i>pressed the sun and the moon into service</i>, mean that God has not only caused the heavenly bodies to stand without the support of pillars, but has also subjected them to the service of man. Man’s paid servants may, and indeed sometimes do, shirk their duty, but these heavenly bodies, in obedience to divine laws, serve us with perfect regularity and faithful-ness. What wonder then if God should have enforced the same inexorable law in favour of the Holy Prophet and should have subjected everything to his service?</p><p>The expression, <i>He regulates all affairs</i>, is also intended to signify that God will make all things serve the cause of the Prophet. The whole universe will, as it were, become his servant.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 4,
        "v_": 3,
        "topics": [
            {
                "id": 1519,
                "topic": "Allah: existence of",
                "verses": "2:29, 2:165, 2:187, 6:74, 7:173, 10:7, 10:32, 22:19, 25:3-4, 27:61-67, 30:21-28, 31:11-12, 45:3-7, 87:2-6"
            },
            {
                "id": 1536,
                "topic": "Allah: favours of",
                "verses": "31:32, 2:23, 31:32, 2:23, 6:100, 6:142, 7:55, 13:18, 14:33-35, 15:20-23, 16:6-17, 16:67-70, 16:72-73, 16:79, 16:81-82, 17:21, 20:54-55, 21:32-34, 22:64, 22:66, 23:20-23, 27:62-64, 31:21, 35:13, 35:28, 36:35, 40:62, 40:65, 40:80-81, 43:11-14, 45:13-14, 51:49, 55:17, 56:65, 56:69, 56:72, 67:24, 71:17-21, 77:28, 78:7-17"
            },
            {
                "id": 6884,
                "topic": "Earth: <i>Al-Ard</i>: abode on",
                "verses": "2:30-31, 2:23, 2:37, 4:98, 4:101, 7:25, 11:62, 15:20, 27:62, 40:65, 43:11, 50:8, 51:49, 55:11, 67:16, 71:20, 78:7, 79:31"
            },
            {
                "id": 10306,
                "topic": "Knowledge: <i>‘Ilm</i>: Qur’an for attainment of",
                "verses": "3:191-192, 1:1, 2:147, 2:186, 4:167, 6:98, 6:106, 6:141, 6:149, 7:33, 7:53, 9:11, 10:6-7, 12:77, 15:76, 16:11-17, 35:28-29, 41:4, 45:14"
            },
            {
                "id": 12187,
                "topic": "Mountains: <i>Jibal</i>: created for man",
                "verses": "16:16, 15:20, 21:32, 22:19, 24:44, 27:62, 31:11, 35:28, 41:11, 50:8, 77:28, 78:8, 79:33, 88:20"
            },
            {
                "id": 12900,
                "topic": "Nature",
                "verses": "67:4-5, 18:8"
            },
            {
                "id": 13022,
                "topic": "Night: signs of Allah",
                "verses": "17:13, 3:28, 3:191, 6:14, 6:97, 7:5, 7:55, 7:98, 10:7, 10:68, 14:34, 16:13, 21:34, 22:62, 23:81, 24:45, 25:63, 28:72-74, 31:30, 35:14, 36:38, 36:41, 45:6, 79:30"
            },
            {
                "id": 15215,
                "topic": "Qur’an: truth, scientific facts, history",
                "verses": "51:8-9, 10:93, 16:14, 16:16-17, 16:79, 16:85, 20:54, 21:31-32, 24:25, 41:43, 42:30"
            },
            {
                "id": 15388,
                "topic": "Reflect: ponder, <i>Tafakkur</i>",
                "verses": "30:9, 2:220, 2:267, 4:83, 6:51, 7:177, 10:25, 16:12, 16:45, 16:70, 27:63, 28:44, 30:22, 32:5, 34:47, 38:30, 39:43, 40:59, 45:14, 47:25, 51:50, 56:63, 59:22"
            },
            {
                "id": 15925,
                "topic": "River: on earth",
                "verses": "27:62, 14:33, 16:16, 71:13, 81:7"
            },
            {
                "id": 16314,
                "topic": "Science: embryology",
                "verses": "22:6, 6:96, 23:14-15, 32:9-10, 35:12, 36:37, 39:7, 40:68, 53:46-47, 65:5, 71:15, 75:38-40, 76:3, 77:21-22, 82:7-9, 86:7-8, 96:2-3"
            },
            {
                "id": 16351,
                "topic": "Science: origin, creation",
                "verses": "21:31, 2:23, 2:30, 2:165, 7:55, 10:4, 11:8, 15:20-21, 20:5, 20:54, 25:60, 27:62, 32:5, 41:10-13, 44:39, 57:5, 67:4, 79:28-34, 91:2-7"
            },
            {
                "id": 17155,
                "topic": "Spouse: <i>Zauj</i>: created in pairs",
                "verses": "2:26, 36:37, 11:41, 20:54, 23:28, 37:23, 42:12, 43:13, 51:50, 53:46, 78:9"
            }
        ],
        "ar": "وَ ہُوَ الَّذِیۡ مَدَّ الۡاَرۡضَ وَ جَعَلَ  فِیۡہَا رَوَاسِیَ وَ اَنۡہٰرًا ؕ وَ مِنۡ کُلِّ الثَّمَرٰتِ جَعَلَ فِیۡہَا زَوۡجَیۡنِ اثۡنَیۡنِ یُغۡشِی الَّیۡلَ النَّہَارَ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ  یَّتَفَکَّرُوۡنَ ﴿۴﴾ ",
        "ur": "اور وہی ہے جس نے زمین کو پھیلا دیا اور اس میں پہاڑ اور دریا بنائے اور ہر قسم کے پھلوں میں سے اس نے اس میں دو دو جوڑے بنائے۔ وہ رات سے دن کو ڈھانپ دیتا ہے۔ یقیناً اس میں غور وفکر کرنے والے لوگوں کے لئے نشانات ہیں۔",
        "v5": {
            "text": "And [a]He it is Who spread out the earth and made therein mountains and rivers. And [b]fruit of every kind He made therein in two sexes. [c]He causes the night to cover the day. Therein, verily, are Signs for a people who reflect.[1615]",
            "notes": [
                {
                    "ref": "a",
                    "note": "15:20; 16:16; 21:32."
                },
                {
                    "ref": "b",
                    "note": "36:37; 51:50."
                },
                {
                    "ref": "c",
                    "note": "7:55; 39:6."
                },
                {
                    "ref": "1615",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse points to the law of nature that heaven and earth work in unison and this harmonious co-operation of the celestial and terrestrial bodies is responsible for the successful working of the universe. For instance, when rain falls from heaven the earth brings forth its vegetation which is thus the common result of both heaven and earth. The same law works in the spiritual universe, for just as there is a heaven and an earth in the material world there is also a spiritual heaven and a spiritual earth. Rain and light come down from the spiritual heaven, and the spiritual earth becomes enligh-tened and revived into a new life. Just as good soil cannot fail to yield its treasures after the descent of rain, similarly, unsullied human nature cannot withhold its treasures after the descent of heavenly water which is Divinerevelation. God’s Prophets attract men as a magnet attracts iron. There was therefore, no cause for wonder if Islam spread quickly. The wonder would have been if it had not spread so fast, because then one would have been entitled to ask why the soil did not bring forth its verdure and herbage when rain had fallen at the proper time.</p><p>The verse refers to another important natural law, viz. God has made in the earth mountains which keep water stored up in the form of snow which, on melting, feeds rivers and springs. If the store of snow on the tops of mountains were exhausted, rivers and springs would be dried up and the land would lie dry and desolate. An analogous law operates in the spiritual world. In the spiritual realm certain individuals are like mountains and serve as reser-voirs, storing up the Word of God, while certain other individuals are like rivers and springs which water the world but cannot keep the water stored up. Prophets are the mountains of the spiritual world, while savants and ulema, learned in religious lore, are its rivers and springs, and the common people provide the soil which these rivers and springs, being themselves fed by the melted snow of the mountains, water and make fertile. Should these mountains disappear, there would be no springs and no rivers and the earth would dry up and be ruined.</p><p>Though the present verse refers only to fruits, elsewhere the Quran speaks of God having made pairs—male and female—of all things (36:37; 51:50). This is a truth which of all religious Scriptures the Quran was the first to propound. It is true that even in pre-Islamic days the Arabs had discovered that the date trees were male and female, but they could go no further. It was the Quran that made known to the world the great truth that all fruit-trees, in fact, everything, had male and female. The people could not at first understand it. But now, after a lapse of 1350 years, scientific research has confirmed the Quranic announcement and scientists have begun to discover pairs even in inorganic matter.</p><p>The verse draws our attention to the fact that the law that everything has a pair applies to the human intellect also. Until heavenly light descends on it, man cannot have true knowledge, which is born of a combination of Divinerevelation and human reason. So it is impossible to have true knowledge of God independently of the revelation sent to the Holy Prophet. Similarly, human reason cannot fail to accept the Word of God revealed to the Holy Prophet if it is presented to it in a proper manner.</p><p>The words, <i>He causes the night to cover the day</i>, point to yet another fundamental law of nature that the night serves as a covering for the day, and by pointing to this law the Quran dispels the popular misconception that the light of the Quran could not spread amidst the prevailing im-penetrable veil of darkness. Just as the darkness of night is removed to give place to the light of the day, similarly, the present darkness of sin and iniquity will be followed by the spiritual light of truth and righteousness. Darkness, in fact, possesses no independent existence and a single ray of the sun dispels and dissipates it. The Sun of Islam will now dispel the darkness of unbelief and infidelity.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 5,
        "v_": 4,
        "topics": [
            {
                "id": 1046,
                "topic": "Agriculture: Divine nourishment for spiritual growth",
                "verses": null
            },
            {
                "id": 1519,
                "topic": "Allah: existence of",
                "verses": "2:29, 2:165, 2:187, 6:74, 7:173, 10:7, 10:32, 22:19, 25:3-4, 27:61-67, 30:21-28, 31:11-12, 45:3-7, 87:2-6"
            },
            {
                "id": 1536,
                "topic": "Allah: favours of",
                "verses": "31:32, 2:23, 31:32, 2:23, 6:100, 6:142, 7:55, 13:18, 14:33-35, 15:20-23, 16:6-17, 16:67-70, 16:72-73, 16:79, 16:81-82, 17:21, 20:54-55, 21:32-34, 22:64, 22:66, 23:20-23, 27:62-64, 31:21, 35:13, 35:28, 36:35, 40:62, 40:65, 40:80-81, 43:11-14, 45:13-14, 51:49, 55:17, 56:65, 56:69, 56:72, 67:24, 71:17-21, 77:28, 78:7-17"
            },
            {
                "id": 5309,
                "topic": "Corn: <i>Habbah</i>",
                "verses": "12:44, 2:262, 12:47-50, 16:12, 55:13, 78:16, 80:28"
            },
            {
                "id": 5700,
                "topic": "Date Palms: dates",
                "verses": "36:35, 2:267, 6:100, 6:142, 16:12, 16:68, 17:92, 18:33, 19:26, 23:20, 26:149, 50:10-11, 55:12, 55:69, 59:6, 80:30"
            },
            {
                "id": 7921,
                "topic": "Garden: earthly",
                "verses": "2:66, 2:267, 6:100, 6:142, 18:33, 23:20, 26:135, 34:16, 36:35, 50:10, 55:63, 68:18, 68:21, 71:13"
            },
            {
                "id": 8104,
                "topic": "Grace: <i>Fadl</i>: exaltation",
                "verses": "2:48, 2:123, 2:254, 4:33, 4:35, 4:96, 7:141, 17:22, 17:56, 17:71, 27:16, 45:17"
            },
            {
                "id": 8124,
                "topic": "Grapes: <i>A‘nab</i>",
                "verses": "16:68, 2:220, 6:100, 16:12, 18:33, 36:35, 80:29"
            },
            {
                "id": 10306,
                "topic": "Knowledge: <i>‘Ilm</i>: Qur’an for attainment of",
                "verses": "3:191-192, 1:1, 2:147, 2:186, 4:167, 6:98, 6:106, 6:141, 6:149, 7:33, 7:53, 9:11, 10:6-7, 12:77, 15:76, 16:11-17, 35:28-29, 41:4, 45:14"
            },
            {
                "id": 12487,
                "topic": "Muhammad<sup>(sa)</sup>: lofty stature of",
                "verses": "81:20-22, 4:70, 17:75, 17:80, 20:2, 25:62, 33:22, 33:41, 33:47, 36:2, 36:14, 48:2-3, 53:2-6, 55:4, 68:5, 72:20, 74:2-6, 91:2-7, 94:2-4, 95:2-3, 108:2"
            },
            {
                "id": 12900,
                "topic": "Nature",
                "verses": "67:4-5, 18:8"
            },
            {
                "id": 13525,
                "topic": "Paradise: <i>Jannah</i>: earthly",
                "verses": "2:36, 2:266-267, 6:100, 6:142, 17:92, 18:33, 18:34, 18:36, 18:40, 18:41, 25:9, 26:58, 26:135, 26:148, 34:16, 50:10, 55:47, 68:18, 71:13, 78:17"
            },
            {
                "id": 16715,
                "topic": "Signs: of creation",
                "verses": "30:21-27, 2:165, 3:191, 6:98, 6:100, 7:59, 10:6-7, 10:68, 13:3, 20:54-55, 21:33, 41:38, 41:40, 42:30, 45:4, 45:6"
            }
        ],
        "ar": "وَ فِی الۡاَرۡضِ قِطَعٌ مُّتَجٰوِرٰتٌ وَّ جَنّٰتٌ مِّنۡ اَعۡنَابٍ وَّ زَرۡعٌ وَّ نَخِیۡلٌ صِنۡوَانٌ وَّ غَیۡرُ صِنۡوَانٍ یُّسۡقٰی بِمَآءٍ وَّاحِدٍ ۟ وَ نُفَضِّلُ بَعۡضَہَا عَلٰی بَعۡضٍ فِی الۡاُکُلِ ؕ اِنَّ فِیۡ ذٰلِکَ  لَاٰیٰتٍ  لِّقَوۡمٍ  یَّعۡقِلُوۡنَ ﴿۵﴾ ",
        "ur": "اور زمین میں ایک دوسرے سے مُلحِق خطے ہیں اور انگوروں کے باغات اور کھیتیاں اور کھجور کے درخت بھی، ایک جڑ سے ایک سے زائد کونپلیں نکالنے والے اور ایک جڑ سے زائد کونپلیں نہ نکالنے والے۔ یہ (سب کچھ) ایک ہی پانی سے سیراب کیا جاتا ہے۔ اور ہم نے ان میں سے بعض کو بعض پر پھلوں کے لحاظ سے فضیلت بخشی ہے۔ اس میں یقیناً صاحبِ عقل لوگوں کے لئے نشانات ہیں۔",
        "v5": {
            "text": "[a]And in the earth are <i>diverse</i> tracts, adjoining one another, and gardens of vines, and corn-fields, and date-palms, growing together from one root and others not so growing; they are watered with the same water, [b]yet We make some of them excel others in fruit. Therein are Signs for a people who understand.[1616]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:100; 16:12."
                },
                {
                    "ref": "b",
                    "note": "16:14; 39:22."
                },
                {
                    "ref": "1616",
                    "note": "<p><strong>Important Words:</strong></p><p>متجاورات (adjoining one another) is derived from تجاور which is derived from جاور which again is derived from جار which means, he or it declined or deviated. جاورہ means, he became his neighbour or he lived near him; he confined himself in a mosque, etc., occupying himself in prayer and religious meditation. تجاوروا means, they became mutual neighbours or they lived near together (Lane).</p><p>صنوان (growing together from one root) is the plural of صنو. They say اصنی النخل i.e. the palm-trees had pairs or triplets or more growing together from single roots. صنو means, one of a pair or of three or of more palm-trees or of any trees growing from one root; each being called the صنو of the other. The word also means, a brother by the same father or the same mother. The Holy Prophet is reported to have said, عم الرجل صنو ابیه i.e. the paternal uncle of the man is the صنو of his father (Takmilah fis-Sihah) meaning that the stock of both is one. The Quranic words صنوان و غیر صنوان mean, palm-trees having one root and others having separate roots (Lane).</p><p>الاکل (fruit) is derived from اکل (<i>akala</i>). They say اکله i.e. he ate it. اکل (<i>akl</i>) which is the noun-infinitive means, the act of eating. اکل (<i>ukul</i>) means, what is eaten; any eatable; food; fruit; means of subsistence or ample means of subsistence; worldly good fortune; intelligence; judgement; firmness of intellect (Lane).</p><p><strong>Commentary:</strong></p><p>Disbelievers are told here that they should not think that, because the Holy Prophet is one of them and belongs to the same stock as they, he enjoyed no superiority over them. Do they not see, the verse says, that adjoining tracts of the same land possess different capacities and properties and produce different kinds of produce? A certain tract of land, for instance, grows one thing while the piece adjacent to it cannot grow it. Similarly, trees of one stock or one species growing in the same garden, not unoften, grow fruits of different quality. Why cannot the same thing happen among human beings?</p><p>The expression, <i>they are watered with the same water</i>, signifies that when trees watered with the same water bear fruits vastly different in taste and colour, why cannot the Holy Prophet, even though he lives in the same town and among the same people, excel them, especially when he is nourished in the elixir of Divine revelation and his opponents are brought up under the inspiration of Satan? The words also point to the fact that the same means employed by persons of different capabilities often produce different results. A sword in the hands of a person who does not know its use will be quite a different weapon in the hands of a seasoned and skilful warrior. So the superiority of the Holy Prophet over his opponents lies not only in his superior capacities but also in the way he makes use of the means at his disposal. AbuBakr and ‘Umar were ordinary citizens of Mecca who would have ended their days in oblivion but the magic touch of the Holy Prophet lifted them to the highest pinnacles of usefulness and glory.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 6,
        "v_": 5,
        "topics": [
            {
                "id": 139,
                "topic": "Abide: <i>Baqa</i>: will in Hell",
                "verses": "2:40, 2:82, 2:163, 2:218, 2:258, 2:276, 3:89, 2:117, 4:15, 4:170, 5:81, 6:129, 7:37, 9:17, 9:63, 9:68, 10:28, 16:30, 20:102, 21:100, 23:104, 33:66, 40:77, 43:75, 47:16, 64:11, 72:24"
            },
            {
                "id": 6828,
                "topic": "Dust: bones turned into",
                "verses": "56:48, 23:36, 23:83, 27:68, 37:17, 37:54, 50:4"
            },
            {
                "id": 7602,
                "topic": "Fire: <i>An-Nar</i>: of Hell",
                "verses": "52:14, 2:25, 2:40, 2:81, 2:82, 2:127, 2:168, 2:175-176, 2:202, 2:218, 2:222, 2:258, 3:11, 3:17, 3:25, 3:103, 3:117, 3:132, 3:152, 3:186, 3:192-193, 4:15, 4:31, 5:30, 7:37, 7:39, 8:15, 9:17, 10:9, 11:17, 14:31, 16:63, 18:30, 21:40, 22:20, 23:105, 24:58, 28:42, 29:26, 66:7, 111:4"
            },
            {
                "id": 9229,
                "topic": "Inmates of Fire",
                "verses": "2:40, 2:82, 2:218, 2:258, 2:276, 3:117, 5:30, 7:37, 7:45, 7:48, 7:51, 10:28, 39:9, 40:7, 40:44, 58:18, 59:21, 64:11, 74:32"
            }
        ],
        "ar": "وَ اِنۡ تَعۡجَبۡ فَعَجَبٌ قَوۡلُہُمۡ ءَ اِذَا کُنَّا تُرٰبًا ءَ اِنَّا لَفِیۡ خَلۡقٍ جَدِیۡدٍ ۬ؕ اُولٰٓئِکَ الَّذِیۡنَ  کَفَرُوۡا بِرَبِّہِمۡ ۚ وَ اُولٰٓئِکَ  الۡاَغۡلٰلُ فِیۡۤ  اَعۡنَاقِہِمۡ ۚ وَ اُولٰٓئِکَ اَصۡحٰبُ  النَّارِ ۚ ہُمۡ  فِیۡہَا  خٰلِدُوۡنَ ﴿۶﴾",
        "ur": "اور اگر تو تعجب کرے تو ان کا یہ قول بھی تو بہت عجیب ہے کہ کیا جب ہم مٹی ہو جائیں گے تو کیا ہم ضرور ایک نئی تخلیق میں ڈھالے جائیں گے؟ یہی وہ لوگ ہیں جنہوں نے اپنے ربّ کا انکار کیا اور یہی ہیں وہ جن کی گردنوں میں طوق ہوں گے اور یہی آگ والے لوگ ہیں۔ وہ اس میں لمبا عرصہ رہنے والے ہیں۔",
        "v5": {
            "text": "[a]And if thou dost wonder, then wondrous indeed is their saying: ‘What! when we have become dust, shall we then be in a state of new creation?’ These it is who disbelieve in their Lord; and [b]these it is who shall have shackles round their necks, and they shall be the inmates of the Fire, wherein they shall abide.[1617]",
            "notes": [
                {
                    "ref": "a",
                    "note": "27:68; 37:17; 50:4."
                },
                {
                    "ref": "b",
                    "note": "36:9; 76:5."
                },
                {
                    "ref": "1617",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse purports to say that it is no matter of wonder that God should have granted such miraculous success to the Holy Prophet and should have brought about moral and spiritual reformation through him. What really would be a subject for wonder would be that the world should become corrupt and God should take no steps to reform it or that disbelievers could not rise to a new life after having fallen spiritually. When the water of life comes, death must depart.</p><p>The words, <i>these it is who shall have shackles round their necks, and they shall be the inmates of the Fire</i>, contain a warning that those who despair of the grace of God must burn in the fire of regret and remorse and those who reject and abandon the ways of God in favour of their self-devised plans and schemes, which are like so many shackles round their necks, must come to grief. It is a pity, however, that instead of turning their attention to the propagation of Islam and prayer and spiritual regeneration, present-day Muslims insist on legalizing interest and insurance policies, etc.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 7,
        "v_": 6,
        "topics": [
            {
                "id": 10935,
                "topic": "Mankind: Allah and",
                "verses": "49:14, 1:4, 2:22, 10:93, 12:39, 13:32, 14:53, 17:71, 22:19, 27:74, 30:31, 35:3, 40:58, 40:62, 45:27, 57:26, 114:2-4"
            },
            {
                "id": 15648,
                "topic": "Retribution: and Allah",
                "verses": "7:168, 2:197, 2:212, 3:5, 5:96, 7:127, 8:14, 14:48, 32:23, 39:38, 40:6, 43:26, 44:17, 59:5, 59:8"
            }
        ],
        "ar": "وَ یَسۡتَعۡجِلُوۡنَکَ بِالسَّیِّئَۃِ قَبۡلَ الۡحَسَنَۃِ وَ قَدۡ خَلَتۡ مِنۡ قَبۡلِہِمُ الۡمَثُلٰتُ ؕ وَ اِنَّ رَبَّکَ لَذُوۡ مَغۡفِرَۃٍ  لِّلنَّاسِ عَلٰی ظُلۡمِہِمۡ ۚ وَ اِنَّ رَبَّکَ لَشَدِیۡدُ  الۡعِقَابِ ﴿۷﴾ ",
        "ur": "اور وہ تجھ سے بدی کو بھلائی سے پہلے جلدتر طلب کرتے ہیں۔ جبکہ ان سے پہلے بہت سی عبرتناک مثالیں گزر چکی ہیں۔ اور یقیناً تیرا ربّ لوگوں کے لئے اُن کے ظلم کے باوجود بہت مغفرت والا ہے اور یقیناً تیرا ربّ سزا دینے میں بہت سخت ہے۔",
        "v5": {
            "text": "[a]And they want thee to hasten on the punishment in preference to good, whereas exemplary punishments have <i>already</i> occurred before them. And, [b]verily, thy Lord is full of forgiveness for mankind despite their wrongdoing, and verily, thy Lord is <i>also</i> strict in condign punishment.[1618]",
            "notes": [
                {
                    "ref": "a",
                    "note": "22:48; 29:54-55."
                },
                {
                    "ref": "b",
                    "note": "41:44; 53:33."
                },
                {
                    "ref": "1618",
                    "note": "<p><strong>Important Words:</strong></p><p>المثلات (exemplary punishments) is the plural of المثلة which is derived from مثل. They say مثل فلان فلانا i.e. he became like such a one. مثل بفلان means, he punished such a one in an exemplary manner. مثلة means, calamity; punishment serving as a warning to others; punishment which visited past generations and which served as a warning for others (Aqrab).</p><p>العقاب (condign punishment) is derived from عاقب which is derived from عقب (<i>‘aqaba</i>). They say عقبه i.e. he struck his heel; he came after him (as though at his heels). عاقبه means, he did a thing with him alternately, each taking his turn; he punished him as denoting consequence or retribution. عقب (<i>‘aqib</i>) means, the heel or the hinder part of the human foot. العقاب means, requital or punishment that is awarded as a result of some offence or sin (Lane &amp; Aqrab). Hence in the text it has rightly been rendered as \"condign punishment.\"</p><p><strong>Commentary:</strong></p><p>The verse refers to an evil practice of disbelievers. When they are told that if they do not remove their shackles and do not avail themselves of the guidance of God and if they persist in their wicked ways, they will become like a piece of dry wood, which is thrown into the fire, they hasten to demand where that fire is. So, instead of soliciting God’s mercy these unfortunate people invoke His punishment. The advent of every Prophet of God is attended by both God’s mercy and His punishment but wicked people invariably demand the latter.</p><p>The words, <i>verily, thy Lord is full of forgiveness for mankind despite their wrongdoing</i>, set forth the great truth that the purpose of God in sending Prophets is not to destroy men, but to save them. This is why He continues to forgive them, despite their persistence in wrongdoing. But this repeated forgiveness does not mean that the wicked will never be punished. If they do not give up their evil ways, they will not escape God’s punishment. They will indeed be given every opportunity to reform themselves; but if they persistently refuse to do so, Divine punishment will finally descend on them.</p><p>The words, <i>thy Lord is strict in condign punishment</i>, do not mean that God makes use of severity in inflicting punishment but that the punishment inflicted by God is severer and more painful than that inflicted by men.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 8,
        "v_": 7,
        "topics": [
            {
                "id": 4214,
                "topic": "Belief: <i>Iman</i>: of a righteous",
                "verses": "2:178, 1:5, 2:4-6, 2:63, 2:137-138, 2:166, 2:257, 2:261, 2:286, 3:17, 3:32, 3:54, 3:194, 4:66, 4:137, 4:148, 4:151-153, 5:84, 10:85, 10:100-101, 23:110, 29:47, 45:7, 49:15-16, 72:3, 72:14"
            },
            {
                "id": 11382,
                "topic": "Messengers: <i>Rusul</i>: sent to all peoples",
                "verses": "10:48, 3:34-35, 6:86-88, 14:10, 16:37, 16:85, 17:6, 23:45, 35:25, 57:28"
            },
            {
                "id": 11451,
                "topic": "Miracles: of Holy Prophet<sup>(sa)</sup>",
                "verses": "7:108, 17:91-94, 8:18, 9:25-26, 10:21, 54:2, 85:4"
            },
            {
                "id": 12541,
                "topic": "Muhammad<sup>(sa)</sup>: names of",
                "verses": "61:7, 2:120, 21:108, 33:41, 33:46, 42:49, 53:57, 72:20, 73:2, 73:16, 74:2-3, 88:22-23"
            },
            {
                "id": 14598,
                "topic": "Prophets<sup>(as)</sup>: <i>Anbiya’</i>: sent to all people",
                "verses": "19:52, 35:25, 10:48, 14:10, 16:37, 16:85, 17:6"
            }
        ],
        "ar": "وَ  یَقُوۡلُ  الَّذِیۡنَ  کَفَرُوۡا لَوۡ لَاۤ  اُنۡزِلَ عَلَیۡہِ اٰیَۃٌ  مِّنۡ رَّبِّہٖ ؕ اِنَّمَاۤ  اَنۡتَ مُنۡذِرٌ وَّ  لِکُلِّ  قَوۡمٍ  ہَادٍ ٪﴿۸﴾ ",
        "ur": "اور وہ لوگ جنہوں نے انکار کیاکہتے ہیں ایسا کیوں نہ ہوا کہ اس کے ربّ کی طرف سے اس پر کوئی ایک نشان ہی اتارا جاتا۔ یقیناً تُو محض ایک ڈرانے والا ہے اور ہر قوم کے لئے ایک راہنما ہوتا ہے۔",
        "v5": {
            "text": "[a]And those who disbelieve say, ‘Wherefore has not a Sign been sent down to him from his Lord?’ [b]Thou art, surely, a Warner. And there is a Guide for every people.[1619]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:38; 10:21."
                },
                {
                    "ref": "b",
                    "note": "11:13; 35:24."
                },
                {
                    "ref": "1619",
                    "note": "<p><strong>Important Words:</strong></p><p>انما (surely) is a compound of ان (<i>inna</i>) and ما (<i>ma</i>) and generally gives the sense of \"only.\" Sometimes it is used in the sense of \"verily, certainly or surely\" (Taj). See also 6:110.</p><p><strong>Commentary:</strong></p><p>A study of the Quran makes it clear that whenever disbelievers demand a sign, they invariably mean the sign of punishment, unless the context points to some other meaning. This is why disbelievers are here depicted as saying, <i>Wherefore has not a sign been sent down to him</i>, as if the many signs already shown to them were no signs at all. In reply to this foolish demand they are told that it is clear from the very title of the Prophet—a Warner—that punishment will at last surely overtake disbelievers; but before it comes upon them, they will be given ample opportunities to benefit by the guidance the Prophet has brought because he is also a guide for them.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 9,
        "v_": 8,
        "topics": [
            {
                "id": 11087,
                "topic": "Measure: <i>Qadr</i>: Allah’s",
                "verses": "25:3, 3:28, 3:38, 13:18, 15:22, 23:19, 24:39, 32:6, 36:39, 39:11, 40:41, 41:11, 41:13, 42:28, 43:12, 54:50, 55:8-9, 65:4, 70:5, 77:23, 80:19-20"
            }
        ],
        "ar": "اَللّٰہُ یَعۡلَمُ مَا تَحۡمِلُ کُلُّ اُنۡثٰی وَ مَا تَغِیۡضُ الۡاَرۡحَامُ وَ  مَا تَزۡدَادُ ؕ وَ کُلُّ شَیۡءٍ عِنۡدَہٗ  بِمِقۡدَارٍ ﴿۹﴾",
        "ur": "اللہ جانتا ہے جو ہر مادہ (بطور حمل) اٹھاتی ہے اور (اُسے بھی) جو رِحم کم کرتے ہیں اور جو وہ بڑھاتے ہیں۔ اور ہر چیز اس کے ہاں ایک خاص اندازے کے مطابق ہوتی ہے۔",
        "v5": {
            "text": "[a]Allah knows what every female bears, and what the wombs diminish and what they cause to grow. [b]And with Him everything has a <i>proper</i> measure.[1620]",
            "notes": [
                {
                    "ref": "a",
                    "note": "35:12; 41:48."
                },
                {
                    "ref": "b",
                    "note": "15:22."
                },
                {
                    "ref": "1620",
                    "note": "<p><strong>Important Words:</strong></p><p>تغیض (diminish) is derived from غاض which means, it (water) became scanty and sank into the earth; or it (flow of milk or price of a commodity, etc.) decreased or diminished or became deficient. The Quranic expression ما تغیض الارحام means, the wombs falling short of completion so that the foetus dies. The Arabs say غاض الکرام و فاض اللئام i.e. the generous became few or perished and the mean became many. غاض is also used transitively meaning he made (water, etc.) to become scanty; to decrease or diminish (Lane).</p><p><strong>Commentary:</strong></p><p>In v. 4 we were told that all things in the universe have pairs and that in the spiritual world also some individuals act like males and others like females, the former exercising influence and the latter receiving it. In the verse under comment the Quran intends to point out that in the person of the Holy Prophet there has appeared one who is spiritually a male and that nobody can attain any spiritual rank without receiving his stamp or being influenced by him. The words, <i>Allah knows what every female bears, and what the wombs diminish and what they cause to grow</i>, mean that God knows well the natural capacities and aptitudes of the Holy Prophet’s people, and whether they will accept divine or satanic influence and which influence will grow and which will decline. The verse hints that those who accept the Holy Prophet and receive his stamp will grow and increase in power, influence and numbers, natural capacities and talents, while his opponents will decline and decrease till their physical and spiritual progeny will be destroyed altogether. Taken in the physical sense, the verse means that only God knows what will become of future generations of disbelievers. Their future generations will accept Islam and their females will bear only such children as are destined to become servants of the Holy Prophet. And this proved to be actually the case. By far the greater part of the younger generation of the Meccans, and for that matter of other Arab tribes, accepted the Holy Prophet, to the great chagrin of their fathers whose tyranny and persecution could not prevent them from embracing Islam.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 10,
        "v_": 9,
        "topics": [
            {
                "id": 1174,
                "topic": "Allah: alone knows the unseen",
                "verses": "27:66, 3:30, 3:180, 6:60, 6:74, 9:78, 9:94, 10:21, 11:50, 11:124, 12:103, 16:78, 34:4, 35:39, 72:27, 81:25"
            },
            {
                "id": 3298,
                "topic": "Attributes of Allah: Al-Kabir (the Great)",
                "verses": "4:35, 22:63, 31:31, 34:24, 40:13"
            },
            {
                "id": 3433,
                "topic": "Attributes of Allah: Al-Muta‘al (Most High)",
                "verses": "87:2, 92:21"
            },
            {
                "id": 3688,
                "topic": "Attributes of Allah: ‘Alimul-ghaibi washshahadah (Knower of Unseen and Seen)",
                "verses": "64:19, 5:110, 6:60, 6:74, 9:94, 23:93, 32:7, 34:4, 39:47, 59:23"
            },
            {
                "id": 18225,
                "topic": "Unseen: secret, hidden: Allah alone knows",
                "verses": "2:4, 27:66-67, 2:34, 5:110, 5:117, 6:60, 6:74, 9:78, 9:94, 10:21, 11:124, 16:78, 18:27, 23:93, 32:7, 34:4, 34:49, 35:39, 39:47, 49:19, 53:36, 59:23, 62:9, 64:19, 72:27"
            }
        ],
        "ar": "عٰلِمُ الۡغَیۡبِ وَ الشَّہَادَۃِ  الۡکَبِیۡرُ الۡمُتَعَالِ ﴿۱۰﴾ ",
        "ur": "وہ غیب اور حاضر کا جاننے والا ہے۔ بہت بڑا (اور) بہت رفیع الشان ہے۔\r\n",
        "v5": {
            "text": "[a]<i>He is the</i> Knower of the unseen and the seen, the Incomparably Great, the Most High.[1621]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:74; 9:94; 59:23; 64:19."
                },
                {
                    "ref": "1621",
                    "note": "<p><strong>Important Words:</strong></p><p>الکبیر (the Incomparably Great). See 11:4. The difference between الکبیر (the Incomparably Great) and المتعال (the Most High) is that whereas the former word expresses the greatness of God in relation to human beings, the latter expresses His absolute eminence independently of any relationship with human beings.</p><p><strong>Commentary:</strong></p><p>The verse implies the hint that in order to checkmate and frustrate the plans of the enemy and to achieve success against him it is necessary to know his plans, both open and secret. The adversaries of the Holy Prophet are warned that they have to deal with a Being Who has full knowledge of their plans and Who, being Great, can easily foil and frustrate them. But being also High, His plans to bring about their ruin are hidden from them. How can they then hope to succeed against His Prophet and Messenger?</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 11,
        "v_": 10,
        "topics": [
            {
                "id": 12432,
                "topic": "Muhammad<sup>(sa)</sup>: enemies of,",
                "verses": "8:31, 4:114-116, 6:22, 8:34, 9:61, 23:94-99, 27:49-52"
            },
            {
                "id": 13008,
                "topic": "Night: secret plotting at",
                "verses": "4:82, 4:109, 34:34"
            }
        ],
        "ar": "سَوَآءٌ  مِّنۡکُمۡ مَّنۡ اَسَرَّ الۡقَوۡلَ وَ مَنۡ جَہَرَ بِہٖ وَ مَنۡ ہُوَ مُسۡتَخۡفٍۭ بِالَّیۡلِ وَ سَارِبٌۢ  بِالنَّہَارِ ﴿۱۱﴾ ",
        "ur": "برابر ہے تم میں سے وہ جس نے بات چھپائی اور جس نے بات کو ظاہر کیا اور وہ جو رات کو چھپ جاتا ہے اور دن کو (سرعام) چلتا پھرتا ہے۔",
        "v5": {
            "text": "He among you who conceals <i>his</i> word, and he who utters it openly are equal <i>in His sight</i>; and <i>also</i> he who hides by night, and he who goes forth <i>openly</i> by day.[1622]",
            "notes": [
                {
                    "ref": "1622",
                    "note": "<p><strong>Commentary:</strong></p><p>The enemies of the Holy Prophet employed two kinds of plans to bring about his defeat. Sometimes they publicly threatened him with destruction, and at other times they hatched secret plots against him. Sometimes they attacked him in broad daylight and sometimes they attacked him in the darkness of the night. In reply to all these foul attempts the Quran warns the Prophet’s enemies that by offering opposition to him they are really opposing God. Their overt or covert plans against him cannot succeed because God, Who knows all their secret and open designs, is his Helper and Protector.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 12,
        "v_": 11,
        "topics": [
            {
                "id": 1439,
                "topic": "Allah: does not withdraw favours unless...",
                "verses": "8:54, 2:212, 14:29"
            },
            {
                "id": 2585,
                "topic": "Angels: <i>Mala’ikah</i>: duties of",
                "verses": "16:3, 6:112, 15:9, 35:2, 38:74, 39:76, 42:6"
            },
            {
                "id": 12432,
                "topic": "Muhammad<sup>(sa)</sup>: enemies of,",
                "verses": "8:31, 4:114-116, 6:22, 8:34, 9:61, 23:94-99, 27:49-52"
            },
            {
                "id": 12628,
                "topic": "Muhammad<sup>(sa)</sup>: protection of",
                "verses": "5:68, 8:6, 33:2, 47:14, 52:49, 93:4-5"
            },
            {
                "id": 14852,
                "topic": "Qada’ Qadr: free will",
                "verses": "54:50, 13:28, 3:87, 6:36, 6:126, 13:32-33, 16:94, 16:105, 35:46, 71:5, 74:32, 76:4, 90:11"
            }
        ],
        "ar": "لَہٗ  مُعَقِّبٰتٌ مِّنۡۢ بَیۡنِ یَدَیۡہِ وَ مِنۡ خَلۡفِہٖ  یَحۡفَظُوۡنَہٗ  مِنۡ اَمۡرِ اللّٰہِ ؕ اِنَّ اللّٰہَ  لَا یُغَیِّرُ مَا بِقَوۡمٍ حَتّٰی یُغَیِّرُوۡا مَا بِاَنۡفُسِہِمۡ ؕ وَ  اِذَاۤ   اَرَادَ  اللّٰہُ بِقَوۡمٍ سُوۡٓءًا فَلَا مَرَدَّ  لَہٗ ۚ وَ مَا لَہُمۡ  مِّنۡ  دُوۡنِہٖ مِنۡ  وَّالٍ ﴿۱۲﴾ ",
        "ur": "اُس کے لئے اُس کے آگے اور پیچھے چلنے والے محافظ (مقرر) ہیں جو اللہ کے حکم سے اس کی حفاظت کرتے ہیں۔ یقیناً اللہ کسی قوم کی حالت نہیں بدلتا جب تک وہ خود اُسے تبدیل نہ کریں جو اُن کے نفوس میں ہے۔ اور جب اللہ کسی قوم کے بدانجام کا فیصلہ کر لے تو کسی صورت اس کا ٹالنا ممکن نہیں۔ اور اس کے سوا اُن کے لئے کوئی کار ساز نہیں۔",
        "v5": {
            "text": "For him (the Messenger) is a succession <i>of angels</i> before him and behind him; they guard him by the command of Allah. Surely, [a]Allah changes not the condition of a people until they change that which is in their hearts. And when Allah wishes to punish a people, there is no repelling it, nor have they any helper beside Him.[1623]",
            "notes": [
                {
                    "ref": "a",
                    "note": "8:54."
                },
                {
                    "ref": "1623",
                    "note": "<p><strong>Important Words:</strong></p><p>معقبات (a succession of angels) is the plural of معقب which is derived from عقب (<i>‘aqaba</i>). They say عقبه i.e. he came after him, as though at his heels; or he followed him closely or he succeeded him. عقب بغزاة بعد غزاة (<i>‘aqqaba</i>) means, he followed up one expedition with another. عقب فی الامر means, he went repeatedly to and fro; or he made repeated efforts to accomplish the affair: striving or exerting himself. معقب means, he who or that which comes after another. ملك معقب means, an angel that follows another. المعقبات means, the angels of the night and the day because they succeed one another by turns (the feminine form is used because of the frequency of their doing so, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency as in علامة); utterance of سبحان الله and الحمد لله and الله اکبر repeated after Prayers. معقب also signifies one who makes warring expeditions repeatedly and does not stay with his family after his return; one who seeks after a thing repeatedly, striving or exerting himself; one who puts off or repels the payment of what is due from him (Lane).</p><p><strong>Commentary:</strong></p><p>The pronoun \"him\" in the words \"for him\" in the beginning of the verse refers to the Holy Prophet and the verse means that, like worldly kings, God has appointed body-guards for the Holy Prophet. This meaning is supported by the several unsuccessful attempts that were made on his life and the protection that God vouchsafed to him amidst the many mortal dangers which surrounded him. His life was constantly in danger, both at Mecca and Medina, but he remained safe because he enjoyed Divine protection, being guarded by angels and his own devoted Companions. The word معقباتrendered here as \"a succession of angles\" may refer both to the celestial beings in heaven and to the devoted Companions of the Holy Prophet who so eagerly guarded him with their lives.</p><p>The pronoun \"him\" may also have a wider application, meaning, every person. In this case, the verse would mean that God has appointed guardian angels for the protection of every person. He is exposed every moment to various kinds of dangers; for instance, innumerable harmful germs enter his body with every breath but God has provided the antidote in his very system and the germs very often fail to do him any harm. In diverse other ways also, man is providentially protected from dangers that assail him without his ever knowing of them.</p><p>If applied to disbelievers, the verse would imply a warning to them that if they did not desist from their evil ways, God would withdraw His protection from them and they would perish.</p><p>The words, <i>Allah changes not the condition of a people until they change that which is in their hearts</i>, do not mean that God shows no mercy or favour to the sinful and the wicked. It only means that He does not change His attitude of kindness and benignity to those of His servants who have earned His favour by good works, unless they effect a change in themselves and forsake the path of virtue and take to evil. The verse thus hints that when a people are visited with successive afflictions which drive them to ruin and destruction, that is a sure sign that they have become morally and spiritually degenerate.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 13,
        "v_": 12,
        "topics": [
            {
                "id": 5139,
                "topic": "Cloud: <i>Sahab, ‘Arid, Ghamam</i>",
                "verses": "30:49-51, 2:58, 2:165, 2:211, 7:58, 7:161, 15:23, 24:41, 24:44, 25:26, 27:89, 35:10, 46:25, 52:45"
            },
            {
                "id": 7487,
                "topic": "Fear: <i>Khauf</i>",
                "verses": "106:5, 2:39, 2:63, 2:113, 2:156, 2:263, 2:275, 2:278, 3:171, 5:70, 6:49, 6:52, 7:36, 7:50, 7:57, 7:206, 10:63, 12:58, 13:22, 16:51, 17:58, 24:38, 30:25, 32:17, 43:69, 46:14, 74:54, 76:8"
            }
        ],
        "ar": "ہُوَ  الَّذِیۡ یُرِیۡکُمُ  الۡبَرۡقَ خَوۡفًا وَّ طَمَعًا  وَّ یُنۡشِیٴُ  السَّحَابَ  الثِّقَالَ ﴿ۚ۱۳﴾",
        "ur": "وہی ہے جو تمہیں آسمانی بجلی دکھاتا ہے جس سے کبھی تم خوف اور کبھی طمع میں مبتلا ہوجاتے ہو اور بوجھل بادلوں کو (اونچا) اٹھا دیتا ہے۔",
        "v5": {
            "text": "[a]He it is Who shows you the lightning to inspire fear and hope, and He raises the heavy clouds.[1624]",
            "notes": [
                {
                    "ref": "a",
                    "note": "30:25."
                },
                {
                    "ref": "1624",
                    "note": "<p><strong>Commentary:</strong></p><p>Lightning inspires people both with fear and hope. It inspires fear because sometimes men die of it and embryos and certain plants get hurt. It also brings hope to men, for it heralds fertilizing rain. It also helps to destroy germs of different diseases and thus serves to put an end to epidemics. Similarly, heavy clouds serve a twofold purpose. Very often they come as a mercy, because they bring much-needed rain. But they also cause floods resulting in death and destruction. Disbelievers are told in this verse that they should not feel proud of their possessions and power or of their kith and kin for, like lightning and heavy rain, these things cut both ways. While they are the source of happiness and honour for some, they cause the spiritual undoing of others. The similitude of heavy rain and lightning points to the supreme moral lesson that the primary thing is goodness of heart and not the possession of worldly riches and material prosperity; for, without goodness of heart these things may, instead of proving useful to the people who possess them, prove their ruin.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 14,
        "v_": 13,
        "topics": [
            {
                "id": 702,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:16, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 22:78, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 37:167, 38:19, 39:10, 39:76, 41:38-39, 48:10, 50:40-41, 55:7, 59:25, 61:2, 62:2, 64:2, 87:2, 96:20, 110:4"
            },
            {
                "id": 3835,
                "topic": "Attributes of Allah: Shadidul-Mihal (Severe in Punishment)",
                "verses": null
            },
            {
                "id": 4822,
                "topic": "Calamities: <i>‘Adhab</i>: thunderbolt, <i>Sa‘iqah</i>, <i>Saihah</i>",
                "verses": "23:77-78, 11:68, 2:56, 4:154, 41:14, 41:18, 51:45"
            },
            {
                "id": 6643,
                "topic": "Dispute",
                "verses": "8:7, 2:85, 2:140, 3:21, 3:62, 3:66, 3:153, 4:66, 4:106, 7:72, 8:47, 11:33, 16:5, 18:22, 22:4, 22:9, 22:20, 22:68, 31:21, 40:5-6, 40:36, 40:48, 40:70, 42:17, 42:19, 42:36, 49:11, 53:13"
            }
        ],
        "ar": "وَ یُسَبِّحُ الرَّعۡدُ بِحَمۡدِہٖ  وَ الۡمَلٰٓئِکَۃُ مِنۡ خِیۡفَتِہٖ ۚ وَ یُرۡسِلُ الصَّوَاعِقَ فَیُصِیۡبُ بِہَا مَنۡ یَّشَآءُ  وَ ہُمۡ  یُجَادِلُوۡنَ فِی اللّٰہِ ۚ وَ ہُوَ  شَدِیۡدُ الۡمِحَالِ ﴿ؕ۱۴﴾ ",
        "ur": "اور بجلی کی گھن گرج اس کی حمد کے ساتھ (اس کی) تسبیح کرتی ہے اور فرشتے بھی اس کے خوف سے (تسبیح کر رہے ہوتے ہیں)۔ اور وہ کڑکتی ہوئی بجلیاں بھیجتا ہے اور ان کے ذریعہ جسے چاہے مصیبت میں ڈالتا ہے۔ جبکہ وہ اللہ کے بارہ میں جھگڑ رہے ہوتے ہیں اور وہ گرفت میں بہت سخت ہے۔",
        "v5": {
            "text": "And the thunder glorifies Him with His praise [a]and <i>likewise do</i> the angels for awe of Him; and [b]He sends the thunderbolts, and smites therewith whom He wills, yet they dispute concerning Allah, while He is severe in punishing.[1625]",
            "notes": [
                {
                    "ref": "a",
                    "note": "16:51; 42:6."
                },
                {
                    "ref": "b",
                    "note": "24:44."
                },
                {
                    "ref": "1625",
                    "note": "<p><strong>Important Words:</strong></p><p>محال (punishment) is derived from ماحل which is again derived from محل. They say محل البلد i.e. the town had no rain and became affected with drought and dearth. ماحله means, he devised a plan or hatched a plot against him; he showed enmity towards him, the other doing the same in return. محال means, plan or device; power or might; quarrel or disputation; enmity; punishment or torment; severity; destruction (Aqrab).</p><p><strong>Commentary:</strong></p><p>Disbelievers are here told that they should give up hugging the fond hope that the present afflictions and trials of Muslims (hinted at in the words \"thunders\" and \"thunderbolts\") would bring about the latter’s ruin. Not all lightning is destructive nor are all clouds the source of unmixed good. Their afflictions cannot bring about the ruin of believers. On the contrary, they will bring about their moral and spiritual advancement, for they bring into play their hidden faculties and bring them nearer to God. Thunder and lightning are after all the creation of God and are meant to glorify Him. They cannot therefore, cause the destruction of God’s faithful servants, whom He has promised to protect, for that would be against His glory-fication. So existing thunders and the dark clouds of temporary miseries and tribulations only contribute to the progress and prosperity of the Faithful.</p><p>The verse further points out that thunder and clouds are under the control of God’s angels, who are the first cause, and have been created to serve and advance the cause of God’s Messengers. Why then, should the believers fear the thunder and clouds of adversity that are now bursting upon them? They would only destroy those who seek to frustrate the purpose of God. The words, <i>they dispute concerning Allah</i>, are intended to point out that it is no law of nature that is being discussed here but a prophecy of punishment for disbelievers.</p><p>The words شدید المحال (severe in punishing) may also be rendered as \"strong in planning\" thus hinting that God is not only severe in punishing but it is also impossible to frustrate His plans.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 15,
        "v_": 14,
        "topics": [
            {
                "id": 6141,
                "topic": "Dead, Death: <i>Maut</i>: false gods do not create, are",
                "verses": "16:21-22, 7:192, 25:4, 35:14, 35:41, 46:5"
            },
            {
                "id": 6450,
                "topic": "Disbelief: <i>Kufr</i>: no forgiveness for",
                "verses": "2:7-21, 4:138, 4:169, 32:30, 40:51, 47:35"
            },
            {
                "id": 14065,
                "topic": "Prayer: <i>Du‘a’</i>: of disbeliever",
                "verses": "25:78, 40:51"
            },
            {
                "id": 14070,
                "topic": "Prayer: <i>Du‘a’</i>: of idol-worshipper",
                "verses": "7:195, 46:6"
            },
            {
                "id": 16614,
                "topic": "Shirk: false gods cannot help, harm you",
                "verses": "5:77, 6:72, 10:107, 13:17, 21:67, 22:13, 25:56, 29:18"
            },
            {
                "id": 17978,
                "topic": "Truth: <i>Haqq</i>: is with Allah",
                "verses": "58:22, 6:74, 6:58, 10:31, 10:33, 10:36, 18:45, 20:115, 22:7, 23:117, 24:26, 25:27, 31:31, 33:5, 39:70, 39:76, 40:21, 42:25"
            }
        ],
        "ar": "لَہٗ  دَعۡوَۃُ   الۡحَقِّ ؕ وَ الَّذِیۡنَ  یَدۡعُوۡنَ مِنۡ دُوۡنِہٖ لَا یَسۡتَجِیۡبُوۡنَ لَہُمۡ بِشَیۡءٍ  اِلَّا کَبَاسِطِ کَفَّیۡہِ  اِلَی الۡمَآءِ لِیَبۡلُغَ فَاہُ وَ مَا ہُوَ بِبَالِغِہٖ ؕ وَ مَا دُعَآءُ الۡکٰفِرِیۡنَ  اِلَّا  فِیۡ  ضَلٰلٍ ﴿۱۵﴾ ",
        "ur": "سچّی دعا اُسی سے کی جاتی ہے۔ اور جنہیں وہ اُس کے سوا پکارتے ہیں وہ ان کی کسی بات کا جواب نہیں دیتے ہاں مگر (وہ) اس شخص کی طرح (ہیں) جو اپنے دونوں ہاتھ پانی کی طرف بڑھائے تاکہ وہ اس کے منہ تک پہنچ جائے حالانکہ وہ کسی صورت اس تک پہنچنے والا نہیں۔ اور کافروں کی دعا گمراہی میں بھٹکنے کے سوا اَور کچھ نہیں۔",
        "v5": {
            "text": "Unto Him is the true prayer. [a]And those on whom they call beside Him answer them not at all, except as he <i>is answered</i> who stretches forth his two hands toward water that it may reach his mouth, but it reaches it not. [b]And the prayer of the disbelievers is but a thing wasted.[1626]",
            "notes": [
                {
                    "ref": "a",
                    "note": "35:14; 40:21."
                },
                {
                    "ref": "b",
                    "note": "40:51."
                },
                {
                    "ref": "1626",
                    "note": "<p><strong>Commentary:</strong></p><p>The Quranic expression له دعوة الحق rendered in the text as, <i>Unto Him is the true prayer</i>, may be translated in several ways (1) God alone is worthy of worship; (2) it is praying to God alone that can be useful or beneficial for man; (3) the voice of God alone rises in support of truth i.e. the teaching which is really true and useful for man and is free from defects and untruths can come from God alone; (4) the Voice of God alone must prevail i.e. no one can frustrate God’s purpose and stand in His way; for the word حق (true) also means, that which prevails and becomes established.</p><p>The words, <i>except as he is answered who stretches forth his two hands toward water that it may reach his mouth, but it reaches it not</i>, embody a great principle. Just as he who ascribes lower status to a higher thing remains deprived of its higher benefits, similarly, he who ascribes higher status to a lower thing deprives himself of its true benefits. The man who looks upon a spurious coin as a genuine one will practically suffer as much as he who unwittingly treats a genuine coin as a spurious one. Idolaters think that their gods will answer their prayers and come to their help, but they can never do so.</p><p>In like manner, those who ascribe divine powers to things created by God deprive themselves of even their limited uses. How can those who look upon fire and water as gods think of bringing them under their control? And how can those who look upon Prophets as gods derive from them the real good which they could derive from them by following them as heavenly Messengers?</p><p>The verse thus says that the right way to succeed in life is to put all things in their proper places, to give God the status which is His due and to stars, rivers and mountains the position which they rightly possess. Whereas we should worship God, pray to Him and seek His blessings, we should subject created things to our service and derive those benefits from them which the Wise God has placed in them. That alone is the way of success and true happiness.</p><p>The words, <i>the prayer of the disbelievers is but a thing wasted</i>, mean that all prayers of disbelievers addressed to false deities will prove fruitless.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 16,
        "v_": 15,
        "topics": [
            {
                "id": 703,
                "topic": "Adoration: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify: <i>Sabbih</i>, Praise, Exalt, Pray, Glorify",
                "verses": "7:207, 6:2, 3:192, 3:114, 3:42, 2:31, 20:131, 13:14, 15:99, 17:45, 18:2, 19:12, 19:59, 21:21, 21:23, 22:78, 24:37, 24:42, 25:2, 25:65, 32:16, 34:2, 35:2, 37:167, 38:19, 39:10, 39:76, 41:38-39, 48:10, 50:40-41, 55:7, 59:25, 61:2, 62:2, 64:2, 87:2, 96:20, 110:4"
            },
            {
                "id": 1444,
                "topic": "Allah: dominion extends over everything",
                "verses": "23:89, 3:27, 11:57, 25:3, 36:84, 67:2"
            },
            {
                "id": 1496,
                "topic": "Allah: everything submits to",
                "verses": "2:113, 16:50, 22:19, 55:7"
            },
            {
                "id": 6992,
                "topic": "Earth: <i>Al-Ard</i>: creations on",
                "verses": "15:20, 2:165, 2:169, 3:84, 3:191, 6:39, 10:24, 10:67, 16:16, 16:50, 21:20, 21:32, 22:66, 23:80, 26:8, 27:83, 30:23, 31:11, 31:21, 45:14, 50:8, 64:4, 71:18"
            },
            {
                "id": 7822,
                "topic": "Freedom",
                "verses": "6:108, 6:150, 10:26, 18:30"
            },
            {
                "id": 10377,
                "topic": "Law: Divine",
                "verses": "6:116, 4:29, 6:35, 28:85, 29:20, 30:47, 35:44, 39:56, 46:20, 48:24, 55:34, 57:23"
            },
            {
                "id": 14620,
                "topic": "Prostration: <i>Sajdah</i>",
                "verses": "3:114, 4:103, 7:207, 9:112, 16:50-51, 17:110, 19:59, 22:19, 22:78, 25:61, 27:26-27, 32:16, 38:25, 41:39, 48:30, 53:63, 55:7, 76:27, 84:22, 96:20"
            }
        ],
        "ar": "وَ لِلّٰہِ یَسۡجُدُ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ طَوۡعًا وَّ کَرۡہًا وَّ ظِلٰلُہُمۡ بِالۡغُدُوِّ  وَ الۡاٰصَالِ  ﴿ٛ۱۶﴾",
        "ur": "اور اللہ ہی کو سجدہ کرتے ہیں جو آسمانوں اور زمین میں ہیں خواہ مرضی سے کریں خواہ مجبوری سے، اور ان کے سائے بھی صبح کو بھی اور شاموں (کے اوقات) میں بھی۔",
        "v5": {
            "text": "And to Allah submits whosoever is in the heavens and the earth willingly or unwillingly and <i>likewise do</i> their shadows, in the mornings and the evenings.[1627]",
            "notes": [
                {
                    "ref": "1627",
                    "note": "<p><strong>Important Words:</strong></p><p>ظلال (shadows) is the plural of both ظل (<i>zill</i>) and ظلة (<i>zullah</i>), which are derived from ظل (<i>zalla</i>). They say ظل الیوم i.e. the day became shady. ظل الشیء means, the thing became long or extended. ظلله means, he shaded him. اظله means, it cast its shade upon him; or he took him into his shelter or protection. ظل means, the light of the sun without the rays; shade; blackness of the night; an apparition or phantom or a thing that one sees like a shadow; a covering; might or power of resistance protection or shelter; person or corporeal form or figure which one sees from a distance. The Arabs say السلطان ظل الله فی الارض i.e. the sovereign is God’s means of protection or defence (or His representative) in the earth. In hadith we read الکافر یسجد لغیر الله و ظله یسجد لله ای جسمه i.e. an infidel prostrates himself before deities other than God but his ظل viz. his body, prostrates itself before God (meaning that his body is subject to divine law). ظلة means, anything that shades or covers or protects one (Lane &amp; Bihar).</p><p>الغدو (mornings) is the plural of غدوة meaning, morning or early part of the forenoon (Lane).</p><p>الآصال (evenings) is the plural of اصیل which means, evening; time from the عصر (late afternoon) Prayer to sunset. The word also means, having root or foundation; rooted, fixed, stable or permanent; having lineage or pedigree (Lane).</p><p><strong>Commentary:</strong></p><p>The verse embodies a great truth. It says that all creation whether in the heavens or on the earth obeys or is bound to obey God-made laws of nature, willingly or unwillingly. The tongue must perform the function of tasting and the ear the function of hearing. This obedience to the laws of nature may be called compulsory. But then man is also given a certain freedom of action where he can use his volition and discretion. A hungry man chooses to eat to satisfy his hunger; another man goes about sight-seeing. Both these persons are free in what they do; but even in actions in which they appear to have been granted freedom, they are subject to a certain amount of compulsion, because they must obey God’s laws in whatever they do, willingly or unwillingly. It is to this point that the verse refers.</p><p>Figuratively, the verse also hints at the subtle ways in which God was helping the Holy Prophet. Certain things happened over which the disbelievers had no control but which were meant to help the cause of Islam. The Fall of Mecca, for example, helped to subjugate the whole of Arabia to the Holy Prophet, but the disbelievers could not prevent it. On the other hand, the terms of the Treaty of Hudaibiyyah were dictated by the disbelievers. They thought that these terms would bring disgrace to Muslims and that the cause of Islam would thereby suffer. But the treaty proved a blessing in disguise for the Muslims. Similarly, the Meccans forced the Holy Prophet to flee from Mecca and rejoiced to think that they had succeeded in driving Islam out of its Centre, but by doing so they dug their own grave and laid the foundation of the future prosperity and progress of Islam.</p><p>The words, <i>willingly or unwillingly</i>, may also refer to two classes of men, viz. believers who give willing submission to God and disbelievers who have to obey His laws and do it grudgingly.</p><p>Of the various meanings of ظلال given under Important Words, the word \"shade\" does not obviously apply here because shade, being the absence of light, is a negative thing which cannot be spoken of as submitting to God. But ظلwhich is the singular of ظلال also means, the body or corporeal substance of a thing. In this sense the verse would mean that the bodies of all things are subject to the laws of nature. Even the bodies of disbelievers have perforce to submit to God, though their hearts may rebel against Him. The word ظل also means, figuratively, the representative or follower of a thing or person. In this sense the verse would mean that not only all living things but also their followers and representatives obey the laws of God. Again as ظلال is also the plural of ظلة which means that which covers or shades or protects, the word would also signify \"leaders or rulers of the people.\" Combining all these different senses of the word, the verse would therefore mean that the entire creation as well as leaders of men and their followers are all subject to the laws of God. What is hinted at is that disbelievers should beware of opposing the Holy Prophet because opposition to him means defiance of the whole of creation and of the very laws of nature, which is not possible to do. This interpretation of the verse is supported by 13:42.</p><p>By using the words, <i>in the mornings and the evenings</i>, which are the two times when the shadows of things are longest, the verse emphasizes that, however vast the power of disbelievers may grow, they cannot succeed against the Holy Prophet.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 17,
        "v_": 16,
        "topics": [
            {
                "id": 1055,
                "topic": "Ahad: &amp; Wahid: difference between",
                "verses": null
            },
            {
                "id": 1152,
                "topic": "Allah: alone creates life, causes death",
                "verses": "15:24, 2:29, 22:67, 30:41, 40:12, 40:69, 45:27, 50:44, 53:45"
            },
            {
                "id": 1345,
                "topic": "Allah: created you",
                "verses": "30:41, 2:22, 2:30, 4:2, 6:103, 7:190, 15:29, 15:86, 16:73, 20:56, 21:17, 21:34, 23:13-15, 23:18, 24:46, 27:65, 30:21-22, 35:4, 36:37, 38:72, 39:7, 41:10, 43:13, 46:4, 50:17, 53:46, 55:4, 55:15-16, 59:25, 67:3, 71:15, 87:3, 92:4, 96:3"
            },
            {
                "id": 1691,
                "topic": "Allah: has no partners",
                "verses": "6:164, 3:65, 3:152, 4:37, 4:49, 6:15, 6:80, 6:82, 6:101, 7:34, 7:191, 10:19, 12:39, 13:34, 13:37, 16:2, 16:4, 17:112, 18:43, 18:111, 22:32, 23:60, 23:93, 25:3-4, 28:69, 30:41, 39:68, 40:43, 40:85, 59:24"
            },
            {
                "id": 1833,
                "topic": "Allah: is One",
                "verses": "16:52, 4:172, 7:71, 12:40, 14:49, 17:47, 39:5, 39:46, 40:13, 40:17, 40:85, 60:5, 112:2"
            },
            {
                "id": 3337,
                "topic": "Attributes of Allah: Al-Khaliq (The Creator)",
                "verses": "59:25, 6:103, 15:87, 23:15, 36:82, 37:126, 39:63, 40:63, 56:60, 57:5"
            },
            {
                "id": 3466,
                "topic": "Attributes of Allah: Al-Qahhar (Most Supreme)",
                "verses": "12:40, 6:19, 14:49, 38:66, 39:5, 40:17"
            },
            {
                "id": 3633,
                "topic": "Attributes of Allah: Al-Wahid (The One)",
                "verses": "2:134, 2:164, 5:74, 9:31, 16:23, 18:111, 22:35, 37:5, 38:66, 39:5, 112:2"
            },
            {
                "id": 3808,
                "topic": "Attributes of Allah: Rabbus-Samawate wal-Ard (Lord of Heavens &amp; earth)",
                "verses": "19:66, 17:103, 18:15, 21:57, 26:25, 37:6, 38:67, 43:83, 44:8, 45:37, 51:24, 78:38"
            },
            {
                "id": 4539,
                "topic": "Blind: seeing and not equal",
                "verses": "11:25, 6:51, 35:20, 40:59"
            },
            {
                "id": 5668,
                "topic": "Darkness: spiritual, <i>Zulumat, Lail</i>",
                "verses": "2:18, 2:20, 2:258, 5:17, 6:2, 6:40, 6:60, 6:123, 10:27, 14:2, 14:6, 24:41, 33:44, 35:21, 57:10, 65:12, 93:3"
            },
            {
                "id": 6106,
                "topic": "Dead, Death: <i>Maut</i>: Allah alone causes",
                "verses": "15:24, 2:29, 2:259, 3:157, 6:96, 16:71, 22:67, 30:41, 40:12, 40:69, 45:27, 50:44, 53:45, 57:3"
            },
            {
                "id": 7889,
                "topic": "Friends: <i>Auliya’</i>: of Allah",
                "verses": "43:68, 10:63, 11:21, 11:114, 17:98, 18:51, 18:103, 25:19, 29:42, 39:4, 42:7, 42:10, 42:47, 45:11, 45:20, 60:2, 62:7"
            },
            {
                "id": 10556,
                "topic": "Light: <i>Nur, Diya’</i>",
                "verses": "24:36-37, 2:258, 4:175, 5:16-17, 5:45-47, 6:2, 6:92, 6:123, 7:158, 9:32, 10:6, 14:2, 14:6, 24:41, 33:44, 35:20-21, 39:23, 39:70, 42:53, 57:10, 57:13-14, 57:29, 61:9, 64:9, 65:12, 71:16-17"
            },
            {
                "id": 16615,
                "topic": "Shirk: false gods cannot help, harm you",
                "verses": "5:77, 6:72, 10:107, 13:15, 21:67, 22:13, 25:56, 29:18"
            },
            {
                "id": 16630,
                "topic": "Shirk: negation of",
                "verses": "112:2-3, 6:101, 10:67, 10:69, 12:41, 13:34, 16:53, 17:43, 23:92, 112:4-5"
            }
        ],
        "ar": "قُلۡ مَنۡ رَّبُّ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ قُلِ اللّٰہُ ؕ قُلۡ  اَفَاتَّخَذۡتُمۡ  مِّنۡ  دُوۡنِہٖۤ  اَوۡلِیَآءَ  لَا یَمۡلِکُوۡنَ لِاَنۡفُسِہِمۡ نَفۡعًا وَّ لَا ضَرًّا ؕ قُلۡ ہَلۡ یَسۡتَوِی الۡاَعۡمٰی وَ الۡبَصِیۡرُ ۬ۙ اَمۡ ہَلۡ تَسۡتَوِی الظُّلُمٰتُ وَ النُّوۡرُ ۬ۚ اَمۡ  جَعَلُوۡا لِلّٰہِ  شُرَکَآءَ  خَلَقُوۡا کَخَلۡقِہٖ فَتَشَابَہَ الۡخَلۡقُ عَلَیۡہِمۡ ؕ قُلِ اللّٰہُ خَالِقُ کُلِّ شَیۡءٍ وَّ ہُوَ الۡوَاحِدُ الۡقَہَّارُ ﴿۱۷﴾ ",
        "ur": "تو پوچھ آسمانوں اور زمین کا ربّ کون ہے؟ (اور) کہہ دے کہ اللہ ہی ہے۔ تُو کہہ دے کیا پھر تم اس کے سوا ایسے دوست پکڑ بیٹھے ہو جو خود اپنے لئے بھی نہ نفع کی اور نہ نقصان کی کچھ قدرت رکھتے ہیں؟ تو پوچھ کیا اندھا اور دیکھنے والا برابر ہو سکتے ہیں؟ اور اندھیرے اور روشنی ایک جیسے ہو سکتے ہیں؟ یا کیا انہوں نے اللہ کے سوا ایسے شرکاءبنا رکھے ہیں جنہوں نے اس کی تخلیق کی طرح تخلیق کی ہے پس ان پر تخلیق مشتبہ ہوگئی؟ تُو کہہ دے کہ اللہ ہی ہر چیز کا خالق ہے اور وہ یکتا (اور) صاحبِ جبروت ہے۔",
        "v5": {
            "text": "[a]Say, ‘Who is the Lord of the heavens and the earth?’ Say, ‘Allah.’ Say, ‘Have you then taken beside Him helpers [b]who have no power for good or harm <i>even</i> for themselves?’ Say, [c]‘Can the blind and the seeing be equal? Or, can darkness be equal to light? Or, do they assign to Allah partners who have created the like of His creation so that the <i>two</i> creations appear similar to them?’ Say, ‘Allah <i>alone</i> is the Creator of all things, and He is the One, the Most Supreme.’[1628]",
            "notes": [
                {
                    "ref": "a",
                    "note": "23:87."
                },
                {
                    "ref": "b",
                    "note": "25:4."
                },
                {
                    "ref": "c",
                    "note": "11:25; 35:20."
                },
                {
                    "ref": "1628",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, <i>who have no power for good or harm even for themselves</i>, spoken about false deities point to a strange coincidence. Generally, the lives of all those persons who later came to be worshipped as deities were full of hardship and privation. Jesus, Imam Husain, Rama, etc., all led very hard lives. This fact seems to entail a strong warning to their misguided worshippers that they could expect no benefit or help from those who could not even protect themselves from harm or danger.</p><p>In the words, <i>Can the blind and the seeing be equal</i>?, disbelievers are told that they, being spiritually and morally blind, should not be deceived by their power and their numbers against the Holy Prophet, as even an army of blind men is powerless against one person who has eyes. The Prophet and his followers possess sight, while disbelievers are blind.</p><p>The powerlessness of the disbelievers is further brought home to them in the simile of light and darkness referred to in the words, <i>can darkness be equal to light</i>? Disbelievers are told that as darkness possesses no independent existence, being only the negation of light, it must flee before light. So disbelievers cannot stand against the Holy Prophet. In the last part of the verse disbelievers are challenged to produce anything which they think has been created by their false deities.</p><p>The Quran has used two different words to express the Unity of God, viz. (1) احد and (2) واحد. Whereas the former denotes the absolute Unity of God without relation to any other being, the latter means only \"the first\" or \"the starting point\" and requires a second and a third to follow it. The Divine attribute of واحد (One) is thus intended to show that God is the real \"source\" from which all creation springs. Although none of His creatures is similar to Him in perfection and He is Independent of all, yet everything does point to Him, just as a second or a third thing necessarily points to the first. The attribute واحد (One) has therefore been used here as an evidence of the truth of the previous statement, viz. <i>Allah alone is the Creator of all things</i>. As against this, where the Quran seeks to refute the doctrine of the son-ship of those who have been falsely given that status, it uses the word احد i.e. He Who has ever been One and alone and has begotten no child (112:2).</p><p>The addition of the attribute of \"Most Supreme\" to \"One\" signifies that God does not need the help or assistance of any being for the control and governance of the universe He has brought into existence, because He is not only the source of all things but is also Supreme and Powerful over them. Hence it is useless and absurd for disbelievers to worship their false deities.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 18,
        "v_": 17,
        "topics": [
            {
                "id": 1032,
                "topic": "Agriculture: Allah sends down water for",
                "verses": "6:100, 2:23, 10:25, 14:33, 16:11-12, 16:66, 18:46, 20:54, 22:64, 25:49-50, 27:61, 32:28, 35:28, 39:22, 50:10, 79:32"
            },
            {
                "id": 1537,
                "topic": "Allah: favours of",
                "verses": "31:32, 2:23, 31:32, 2:23, 6:100, 6:142, 7:55, 13:3-5, 14:33-35, 15:20-23, 16:6-17, 16:67-70, 16:72-73, 16:79, 16:81-82, 17:21, 20:54-55, 21:32-34, 22:64, 22:66, 23:20-23, 27:62-64, 31:21, 35:13, 35:28, 36:35, 40:62, 40:65, 40:80-81, 43:11-14, 45:13-14, 51:49, 55:17, 56:65, 56:69, 56:72, 67:24, 71:17-21, 77:28, 78:7-17"
            },
            {
                "id": 2110,
                "topic": "Allah: parables set forth by, <i>Amthal</i>",
                "verses": "2:18, 2:27, 2:172, 2:262, 2:265, 7:177, 13:36, 14:19, 14:25-27, 14:46, 16:75-77, 16:113, 18:33, 22:74, 24:36, 25:40, 29:42, 29:44, 30:29, 30:59, 36:14, 39:28, 39:30, 43:9, 47:4, 47:16, 59:22, 62:6, 66:11-12"
            },
            {
                "id": 7336,
                "topic": "Falsehood: <i>Batil</i>",
                "verses": "17:82, 2:43, 2:189, 3:72, 3:192, 4:30, 5:43, 8:9, 10:83, 21:19, 34:49-50, 38:28"
            },
            {
                "id": 7686,
                "topic": "Flood: deluge",
                "verses": "11:41, 11:44, 11:49, 12:50, 23:28-30, 29:15, 34:17, 54:13, 69:12"
            },
            {
                "id": 8633,
                "topic": "Heaven: <i>Sama’</i>: Sustenance, water, from",
                "verses": "40:14, 2:23, 2:165, 6:7, 6:100, 8:12, 10:32, 11:53, 14:33, 15:23, 16:11, 16:66, 23:19, 27:61, 27:65, 34:25, 51:23, 52:6"
            },
            {
                "id": 11088,
                "topic": "Measure: <i>Qadr</i>: Allah’s",
                "verses": "25:3, 3:28, 3:38, 13:9, 15:22, 23:19, 24:39, 32:6, 36:39, 39:11, 40:41, 41:11, 41:13, 42:28, 43:12, 54:50, 55:8-9, 65:4, 70:5, 77:23, 80:19-20"
            },
            {
                "id": 13313,
                "topic": "Ornaments",
                "verses": "18:8, 7:149, 10:25, 16:7, 16:15, 18:47, 20:88, 24:32, 33:41, 35:13, 37:7, 43:19"
            },
            {
                "id": 13415,
                "topic": "Parable of: truth &amp; falsehood",
                "verses": null
            },
            {
                "id": 17946,
                "topic": "Truth: <i>Haqq</i>",
                "verses": "58:22, 2:43, 2:62, 2:147-148, 3:72, 5:117, 10:77, 12:52, 19:35, 21:19, 21:111, 42:25, 51:20, 70:25, 77:2-7"
            },
            {
                "id": 18262,
                "topic": "Valley: <i>Wadi</i>",
                "verses": "14:38, 9:121, 20:13, 23:51, 26:142, 26:226, 27:19, 28:31, 37:103, 46:25, 48:25, 55:47, 79:16-17, 89:10"
            },
            {
                "id": 18470,
                "topic": "Water: <i>Ma’</i>: sent from heaven",
                "verses": "16:11-12, 2:23, 2:165, 6:100, 7:58, 8:12, 10:25, 14:33, 15:23, 16:66, 18:46, 22:6, 22:64, 23:19, 27:61, 30:25, 32:28, 35:28, 37:68, 38:58, 39:22, 41:40, 43:12, 50:10, 55:45, 78:15, 88:6"
            }
        ],
        "ar": "اَنۡزَلَ مِنَ السَّمَآءِ  مَآءً  فَسَالَتۡ اَوۡدِیَۃٌۢ بِقَدَرِہَا فَاحۡتَمَلَ السَّیۡلُ زَبَدًا رَّابِیًا ؕ وَ مِمَّا یُوۡقِدُوۡنَ عَلَیۡہِ فِی النَّارِ ابۡتِغَآءَ حِلۡیَۃٍ  اَوۡ مَتَاعٍ زَبَدٌ مِّثۡلُہٗ ؕ کَذٰلِکَ یَضۡرِبُ اللّٰہُ الۡحَقَّ وَ الۡبَاطِلَ ۬ؕ فَاَمَّا الزَّبَدُ فَیَذۡہَبُ جُفَآءً ۚ وَ اَمَّا مَا یَنۡفَعُ النَّاسَ فَیَمۡکُثُ فِی الۡاَرۡضِ ؕ  کَذٰلِکَ یَضۡرِبُ اللّٰہُ   الۡاَمۡثَالَ ﴿ؕ۱۸﴾ ",
        "ur": "اس نے آسمان سے پانی اُتارا تو وادیاں اپنے ظرف کے مطابق بہہ پڑیں اور سیلاب نے اوپر آجانے والی جھاگ کو اٹھا لیا۔ اور وہ جس چیز کو آگ میں ڈال کر دہکاتے ہیں تا کہ زیور یا دوسرے سامان بنائیں اس سے بھی اسی طرح کی جھاگ اٹھتی ہے اسی طرح اللہ سچ اور جھوٹ کی تمثیل بیان کرتا ہے۔ پس جو جھاگ ہے وہ تو  بے کار چلی جاتی ہے اور جو انسانوں کو فائدہ پہنچاتا ہے تو وہ زمین میں ٹھہر جاتاہے۔ اسی طرح اللہ مثالیں بیان کرتا ہے۔",
        "v5": {
            "text": "[a]He sends down water from the sky, so that valleys flow according to their measure, and the flood bears <i>on its surface</i> swelling foam. And from that which they heat in the fire, seeking <i>to make</i> ornaments or utensils, <i>comes out</i> a foam similar to it. Thus does Allah illustrate truth and falsehood. Now, as to the foam, it goes away as rubbish, but as to that which benefits men, it stays on the earth. Thus does Allah set forth parables.[1629]",
            "notes": [
                {
                    "ref": "a",
                    "note": "39:22."
                },
                {
                    "ref": "1629",
                    "note": "<p><strong>Important Words:</strong></p><p>جفاء (rubbish) is derived from جفأ (<i>jafa</i>’<i>a</i>) which means, it (valley flowing with water) cast forth froth or foam or particles of rubbish or refuse. جفت القدر means, the cooking-pot cast forth its froth or foam in boiling. Hence جفاء means, what is cast forth in the form of froth or foam or scum or rubbish by a torrent or a cooking-pot. Figuratively, the word also means, anything that is worthless or useless (Lane).</p><p><strong>Commentary:</strong></p><p>The verse has used two very apt illustrations. First, it says that when rain falls and water begins to flow in various directions, then so much foam and froth appears on the surface of the water in places which are quite clean that it seems to cover it altogether.</p><p>But soon the foam subsides and the water is seen rushing along. In the second illustration froth is referred to as appearing on the surface of gold or silver or any other metal when the smith melts it to make ornaments or utensils, but the smith removes the scum and then only pure metal remains behind.</p><p>In the first illustration, truth is compared to water and falsehood to foam which, in the beginning seems to prevail over truth, but in the end it is carried away even as rubbish is swept away by a powerful current of water. In the second illustration, truth is likened to gold or silver which, when melted, brings forth a foamy excretion which is cast away, leaving behind the unmixed metal, pure and bright.</p><p>The parable implies that before the mighty onrush of Islam the foam and froth of false beliefs and practices will disappear. The parable also means that through the Prophets of God a great awakening in the nature of man causes a conflict between his good inclinations and the evil customs and usages to which he has subjected himself. Those whose inner nature is good emerge from this conflict with their wrong ideas and beliefs replaced by right ones.</p><p>The words, <i>so that valleys flow according to their measure</i>, mean that different people benefit by the truth according to their respective capacities for assimilation.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 19,
        "v_": 18,
        "topics": [
            {
                "id": 171,
                "topic": "Abode: in Hell, in fire, <i>Ma’wa</i>, <i>Mathwa</i>",
                "verses": "3:163, 3:152, 3:198, 4:98, 5:73, 6:129, 8:17, 9:73, 9:95, 10:9, 16:30, 17:98, 24:58, 25:67, 29:26, 29:69, 39:33, 39:61, 39:73, 40:77, 41:25, 45:35, 47:13, 57:16, 66:10, 79:40"
            },
            {
                "id": 548,
                "topic": "Accountability: <i>Hisab</i>: everyone responsible for his own actions",
                "verses": "2:226, See also Actions, 2:140, 4:86, 6:53, 6:70, 10:42, 13:41, 23:118, 42:16, 64:5-8, 69:21"
            },
            {
                "id": 5390,
                "topic": "Cradle: <i>Mahd</i>, bed, resting place",
                "verses": "3:47, 2:207, 5:111, 7:42, 19:30, 20:54, 38:57, 43:11, 78:7"
            },
            {
                "id": 8020,
                "topic": "Good Deeds: <i>Hasanat</i>",
                "verses": "2:63, 2:26, 2:83, 2:278, 3:58, 4:58, 4:123, 5:70, 5:94, 7:43, 7:169, 9:120, 11:115, 16:98, 18:89, 19:61, 21:102, 23:52, 23:101, 25:71-72, 27:20, 57:11, 64:10, 65:12, 92:7, 92:10, 103:4"
            },
            {
                "id": 8738,
                "topic": "Hell: <i>Jahannam</i>: for disobedient",
                "verses": "19:69, 2:207, 3:163, 4:15, 4:56, 9:63, 10:8-9, 14:29-30, 21:30, 21:99, 40:61, 40:71-73, 50:27, 72:24"
            },
            {
                "id": 8861,
                "topic": "Hell: <i>Jahannam</i>: wretched abode",
                "verses": "19:69, 2:207, 14:17-18, 14:30, 15:44-45, 18:30, 25:13-14, 25:66-67, 48:7, 67:8, 74:27-30, 78:23, 78:25-26, 88:5"
            },
            {
                "id": 15363,
                "topic": "Reckoning: <i>Hisab</i>: count, accountability",
                "verses": "17:13, 6:53, 6:70, 10:6, 13:22, 13:41, 23:118, 24:40, 26:114, 65:9, 69:21, 69:27, 78:37, 84:9, 88:26-27"
            }
        ],
        "ar": "لِلَّذِیۡنَ اسۡتَجَابُوۡا لِرَبِّہِمُ الۡحُسۡنٰی ؕؔ وَ الَّذِیۡنَ لَمۡ  یَسۡتَجِیۡبُوۡا لَہٗ  لَوۡ  اَنَّ  لَہُمۡ  مَّا فِی الۡاَرۡضِ جَمِیۡعًا وَّ مِثۡلَہٗ  مَعَہٗ لَافۡتَدَوۡا بِہٖ ؕ اُولٰٓئِکَ لَہُمۡ سُوۡٓءُ الۡحِسَابِ ۬ۙ وَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ بِئۡسَ الۡمِہَادُ ﴿٪۱۹﴾ ",
        "ur": "ان لوگوں کے لئے جو اپنے ربّ کی آواز پر لبیک کہتے ہیں بھلائی ہے۔ اور وہ لوگ جو اُسے لبیک نہیں کہتے اگر وہ سب کا سب اُن کا ہو جو زمین میں ہے اور اس کے برابر اور بھی ہو تو وہ اس کو دے کر ضرور اپنی جانیں چھڑانے کی کوشش کریں گے۔ یہ وہ لوگ ہیں جن کے لئے بہت بُرا حساب (مقدر) ہے اور ان کا ٹھکانا جہنّم ہے اور کیا ہی بُرا ٹھکانا ہے۔",
        "v5": {
            "text": "For those who respond to their Lord is <i>eternal</i> good; and as for those who respond not to Him, [a]if they had all that is in the earth and the like of it added thereto, they would <i>readily</i> ransom themselves therewith. It is these that shall have an evil reckoning and their abode is Hell. What a wretched place of rest![1630]",
            "notes": [
                {
                    "ref": "a",
                    "note": "5:37; 39:48."
                },
                {
                    "ref": "1630",
                    "note": "<p><strong>Important Words:</strong></p><p>الحسنی (eternal good) being the feminine of الاحسن means, that which is better; or that which is best; victory; the good, final or ultimate state or condition ordained for the Faithful; Paradise; the view or vision of God (Lane). See also 10:27.</p><p><strong>Commentary:</strong></p><p>The verse says that those who accept the Message of God will finally achieve success and victory and will meet their Lord. Their intellectual powers will become sharpened. On the contrary, those who reject it will decline materially and morally till failure and ruin encompass them and no ransom will save them from the punishment of God.</p><p>The expression, <i>that shall have an evil reckoning</i>, means that the actions of disbelievers will result not to their liking. They will not be able to render a good account of the faculties with which God had endowed them to make spiritual progress but which they abused.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 20,
        "v_": 19,
        "topics": [
            {
                "id": 4546,
                "topic": "Blind: spiritually",
                "verses": "2:16, 2:19, 2:172, 5:72, 47:24"
            }
        ],
        "ar": "اَفَمَنۡ یَّعۡلَمُ اَنَّمَاۤ  اُنۡزِلَ  اِلَیۡکَ مِنۡ رَّبِّکَ الۡحَقُّ کَمَنۡ ہُوَ اَعۡمٰی ؕ اِنَّمَا یَتَذَکَّرُ اُولُوا الۡاَلۡبَابِ ﴿ۙ۲۰﴾ ",
        "ur": "تو کیا وہ جو جانتا ہے کہ جو تیرے ربّ کی طرف سے تیری طرف اتارا گیا ہے حق ہے‘ اس کی طرح ہو سکتا ہے جو اندھا ہو؟ یقیناً نصیحت صرف عقل والے لوگ ہی پکڑتے ہیں۔",
        "v5": {
            "text": "Is he, then, who knows that what has been revealed to thee from thy Lord is the truth, like one who is blind? <i>But</i> only those gifted with understanding will reflect:[1631]",
            "notes": [
                {
                    "ref": "1631",
                    "note": "<p><strong>Important Words:</strong></p><p>الباب (understanding). See 2:180.</p><p><strong>Commentary:</strong></p><p>In this verse we are told that although success lies in following the teachings of the Quran, only those who make proper use of their reasoning faculties can benefit by it. It is noteworthy that as the teachings of Islam make an irresistible appeal to human reason, the Quran constantly exhorts men to make use of their understanding and reasoning faculties.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 21,
        "v_": 20,
        "topics": [
            {
                "id": 1020,
                "topic": "Agreements: <i>‘Ahd</i>",
                "verses": "16:92-3, 2:28, 2:41, 2:178, 3:77-78, 5:2, 6:153, 8:57, 9:4, 9:111, 16:96, 17:35, 23:9, 48:11, 70:33"
            },
            {
                "id": 1295,
                "topic": "Allah: covenant of",
                "verses": "16:92, 6:153, 17:35, 48:11"
            },
            {
                "id": 4360,
                "topic": "Believers: <i>Mu’min</i>: who enjoin good",
                "verses": "22:42, 2:178, 3:18, 3:111, 3:115, 3:135, 7:158, 7:200, 9:112, 23:4, 23:9, 23:62, 24:23, 25:64, 25:73, 26:228, 28:55-56, 32:17, 33:36, 41:35, 57:19, 70:33"
            },
            {
                "id": 5344,
                "topic": "Covenant: <i>Mithaq, ‘Ahd</i>: with Allah",
                "verses": "3:188, 3:78, 2:28, 6:135, 6:153, 13:26, 16:92, 16:96, 33:24, 57:9, 68:40"
            }
        ],
        "ar": "الَّذِیۡنَ یُوۡفُوۡنَ بِعَہۡدِ اللّٰہِ وَ لَا یَنۡقُضُوۡنَ  الۡمِیۡثَاقَ ﴿ۙ۲۱﴾ ",
        "ur": "(یعنی) وہ لوگ جو اللہ کے (ساتھ کئے ہوئے) عہد کو پورا کرتے ہیں اور میثاق کو نہیں توڑتے۔",
        "v5": {
            "text": "[a]Those who fulfil Allah’s pact, and break not the covenant;[1632]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:153; 16:92; 17:35."
                },
                {
                    "ref": "1632",
                    "note": "<p><strong>Commentary:</strong></p><p>In the preceding verse it was pointed out that only those gifted with understanding can benefit by the Quran. In the present verse some marks of the men of understanding are given:</p><p>(1) They are true to the pledge they have made with God. As men of understanding they know that all blessing is from God. So they accept only that which is from God and is useful and reject what is calculated to bring them no benefit. (2) They do not break God’s covenant and subordinate all other things to it. This is indeed a sure mark of those who understand and realize the truth and who are not satisfied with the shell in preference to the kernel; the word لب (the plural of which is الباب), as used in the previous verse, also meaning kernel or pith or choice part.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 22,
        "v_": 21,
        "topics": [
            {
                "id": 4360,
                "topic": "Believers: <i>Mu’min</i>: who enjoin good",
                "verses": "22:42, 2:178, 3:18, 3:111, 3:115, 3:135, 7:158, 7:200, 9:112, 23:4, 23:9, 23:62, 24:23, 25:64, 25:73, 26:228, 28:55-56, 32:17, 33:36, 41:35, 57:19, 70:33"
            },
            {
                "id": 7440,
                "topic": "Fear: of Allah, <i>Khashi‘ah</i>",
                "verses": "8:49, 2:151, 5:4, 5:29, 5:45, 7:57, 9:13, 9:18, 9:109, 12:110, 14:15, 16:52, 17:58, 20:4, 21:50, 23:3, 23:58, 23:61, 24:53, 33:38, 33:40, 35:19, 35:29-30, 36:12, 39:11, 39:21, 39:24, 49:2, 50:34, 55:47, 59:17, 67:13, 79:27, 79:41, 79:46, 80:10, 87:11, 98:9"
            },
            {
                "id": 7488,
                "topic": "Fear: <i>Khauf</i>",
                "verses": "106:5, 2:39, 2:63, 2:113, 2:156, 2:263, 2:275, 2:278, 3:171, 5:70, 6:49, 6:52, 7:36, 7:50, 7:57, 7:206, 10:63, 12:58, 13:13, 16:51, 17:58, 24:38, 30:25, 32:17, 43:69, 46:14, 74:54, 76:8"
            },
            {
                "id": 12947,
                "topic": "Nearness to Allah: <i>Wasal</i>",
                "verses": "5:36, 17:58"
            },
            {
                "id": 15364,
                "topic": "Reckoning: <i>Hisab</i>: count, accountability",
                "verses": "17:13, 6:53, 6:70, 10:6, 13:19, 13:41, 23:118, 24:40, 26:114, 65:9, 69:21, 69:27, 78:37, 84:9, 88:26-27"
            }
        ],
        "ar": "وَ الَّذِیۡنَ یَصِلُوۡنَ مَاۤ  اَمَرَ اللّٰہُ بِہٖۤ  اَنۡ یُّوۡصَلَ  وَ  یَخۡشَوۡنَ  رَبَّہُمۡ وَ یَخَافُوۡنَ سُوۡٓءَ  الۡحِسَابِ ﴿ؕ۲۲﴾ ",
        "ur": "اور وہ لوگ جو اُسے جوڑتے ہیں جسے جوڑنے کا اللہ نے حکم دیا اور اپنے ربّ سے ڈرتے ہیں اور برے حساب سے خوف کھاتے ہیں۔",
        "v5": {
            "text": "And those who join what Allah has commanded to be joined, and fear their Lord, and dread the evil reckoning;[1633]",
            "notes": [
                {
                    "ref": "1633",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse contains a few more signs of \"the men of understanding\" mentioned in v. 20. After fulfilling their covenant with God and establishing a true and real connection with Him, they turn to His creatures and form a true connection with them also, in the manner and to the extent prescribed by God. Thus, after faithfully discharging their duties to God, they fulfil the obligations they owe to His creatures; and for the performance of this double duty and the fulfilment of the twofold covenant, they make use of the means created by Him.</p><p>The expression, <i>fear their Lord</i>, means that after having established a true relationship with God and man, they are ever on their guard lest it should be broken through negligence on their part.</p><p>The verse thus embodies another sign of \"the men of understanding.\" Whereas, on the one hand, they are watchful and anxious lest they should be deprived of the nearness of God after they have once attained it, on the other, they fear lest they should incur the displeasure of God by showing laxity in the performance of their duty to their fellow beings. See also 2:28.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 23,
        "v_": 22,
        "topics": [
            {
                "id": 2380,
                "topic": "Allah: spend in the way of",
                "verses": "2:268, 2:4, 2:196, 2:216, 2:220, 2:246, 2:255, 2:263, 2:265, 2:273, 2:275, 3:93, 8:4, 8:61, 9:20, 9:34, 9:41, 9:99, 9:111, 14:32, 16:76, 22:36, 24:38-39, 28:55, 32:17, 35:30, 42:39, 47:39, 57:8, 57:11, 61:12, 63:11, 64:17-18, 65:8, 73:21"
            },
            {
                "id": 2533,
                "topic": "Alms: <i>Sadaqah</i>: spend secretly and openly",
                "verses": "2:275, 2:272, 14:32, 16:76, 35:30"
            },
            {
                "id": 4329,
                "topic": "Believers: <i>Mu’min</i>: observe prayers",
                "verses": "4:163, 2:4, 2:178, 4:104, 5:56, 8:4, 9:18, 14:32, 17:110, 19:59, 22:36, 22:42, 23:3, 23:10, 24:38, 27:4, 31:5, 32:16, 35:30, 42:39, 70:24, 70:35, 73:21, 98:6"
            },
            {
                "id": 4360,
                "topic": "Believers: <i>Mu’min</i>: who enjoin good",
                "verses": "22:42, 2:178, 3:18, 3:111, 3:115, 3:135, 7:158, 7:200, 9:112, 23:4, 23:9, 23:62, 24:23, 25:64, 25:73, 26:228, 28:55-56, 32:17, 33:36, 41:35, 57:19, 70:33"
            },
            {
                "id": 5656,
                "topic": "Dar: abode, home: <i>‘Aqibatud-Dar</i>",
                "verses": "22:41, 28:38"
            },
            {
                "id": 9705,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:25, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 11895,
                "topic": "Moral Traits: perseverance",
                "verses": "2:154, 2:156"
            },
            {
                "id": 13612,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 13743,
                "topic": "Patience: <i>sabr</i>: reward of",
                "verses": "16:111, 7:138, 11:12, 13:25, 16:43, 16:97, 16:127, 23:112, 25:76, 28:55, 29:60, 41:36, 76:13"
            },
            {
                "id": 14225,
                "topic": "Preaching: repel evil with good",
                "verses": "5:106, 16:126, 23:97, 28:55, 41:35, 103:4"
            },
            {
                "id": 16100,
                "topic": "Salah: rewards of offering",
                "verses": "23:2-3, 2:4, 2:178, 2:278, 4:163, 5:56, 22:42, 70:23-24, 87:15-16"
            },
            {
                "id": 16890,
                "topic": "Sin: <i>Dhanb</i>: redemption of",
                "verses": "4:32, 5:46, 11:115, 16:120, 25:71, 40:10, 53:33"
            }
        ],
        "ar": "وَ الَّذِیۡنَ صَبَرُوا ابۡتِغَآءَ  وَجۡہِ  رَبِّہِمۡ  وَ اَقَامُوا الصَّلٰوۃَ  وَ  اَنۡفَقُوۡا  مِمَّا  رَزَقۡنٰہُمۡ سِرًّا وَّ عَلَانِیَۃً وَّ یَدۡرَءُوۡنَ بِالۡحَسَنَۃِ السَّیِّئَۃَ  اُولٰٓئِکَ  لَہُمۡ  عُقۡبَی الدَّارِ ﴿ۙ۲۳﴾ ",
        "ur": "اور وہ لوگ جنہوں نے اپنے ربّ کی رضا کی خاطر صبر کیا اور نماز کو قائم کیا اور جو کچھ ہم نے ان کو دیا اس میں سے چھپا کر بھی اورعلانیہ بھی خرچ کیا اور جو نیکیوں کے ذریعہ برائیوں کو دور کرتے رہتے ہیں یہی وہ لوگ ہیں جن کے لئے گھر کا (بہترین) انجام ہے۔",
        "v5": {
            "text": "And those who persevere in seeking the favour of their Lord, [a]and observe Prayer, and spend out of that with which We have provided them, secretly and openly, [b]and repel evil with good. It is these who shall have the <i>best</i> reward of the <i>final</i> abode—[1634]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:4; 8:4; 14:32; 27:4."
                },
                {
                    "ref": "b",
                    "note": "41:35."
                },
                {
                    "ref": "1634",
                    "note": "<p><strong>Important Words:</strong></p><p>وجه (favour). See 2:113, 116 &amp; 6:53.</p><p>عقبی الدار (reward of the final abode). عقبی is derived from عقب for which see v. 7. عقبی means, end; the last or latter part or state; consequence, result or issue; recompense or requital or reward; that which is given in exchange for something (Lane).</p><p><strong>Commentary:</strong></p><p>The verse gives four more signs of the men endowed with understanding referred to in v. 20: (1) They observe صبر i.e. they abstain from sin, are steadfast in virtue and do not give way to impatience and wailing, which, as explained under 2:156, is the meaning of this word. They do all this with a view to winning the favour and pleasure of God, and not in the pursuit of any selfish or sectional interest, or from natural weakness i.e. their patience is not born of cowardice, but is due to a desire to please God even when they have the power to take revenge. (2) They observe Prayers regularly and with all the necessary conditions, which means that their connection with God does not lack permanence and constancy. (3) They spend out of what God has given them openly and in secret to meet the needs of the poor and the destitute. (4) They repel evil with good, which means that they do good deeds so that others may imitate their example and forsake evil. They are not content with the mere preaching of good, but themselves set a good example and thus seek to undermine evil. An alternative meaning is that they preach the doing of good, and in this way make evil die and disappear.</p><p>The words, <i>repel evil with good</i>, also mean that men of understanding do \"good\" deeds with the object of removing \"evil\" i.e. they neither insist on retaliation regardless of the nature of the offence or the suitability of the punishment nor do they persist in unqualified forgiveness but follow the course best suited for the eradication of evil. They resort to retaliation if it serves the purpose and to forgiveness if forgiveness is calculated to bring about the desired result. In short, they cut at the very root of \"evil\" by whatever method is \"good\" in the circumstances. The words <i>repel evil with good</i>, may also mean that they do not meet \"evil\" with \"evil,\" but always observe justice and never forsake the path of equity and justice in dealing with evil.</p><p>The word عقبی (reward) is generally used in a good sense. The word الدار (the abode) refers to the next world; for it is the next world that is the real abode of man, the present world being only a temporary place of residence. Hence the expression لھم عقبی الدار means, \"they shall have a good end in the life to come.\"</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 24,
        "v_": 23,
        "topics": [
            {
                "id": 6704,
                "topic": "Door: <i>Bab</i>",
                "verses": "78:20, 2:190, 7:41, 7:162, 12:24, 12:26, 15:44-45, 16:30, 23:78, 38:50-51, 39:72-73, 40:77, 43:35, 54:12, 57:14"
            },
            {
                "id": 11638,
                "topic": "Moral Traits: cooperation",
                "verses": "5:3"
            },
            {
                "id": 13546,
                "topic": "Paradise: <i>Jannah</i>: eternity of",
                "verses": "11:109, 4:58, 7:43, 9:100, 15:49, 18:109, 20:77, 35:36, 44:57"
            },
            {
                "id": 13553,
                "topic": "Paradise: <i>Jannah</i>: families rejoin in",
                "verses": "40:9, 43:71, 52:22"
            },
            {
                "id": 13557,
                "topic": "Paradise: <i>Jannah</i>: <i>Jannate ‘Adn</i>",
                "verses": "9:72, 16:32, 18:32, 19:62, 20:77, 35:34, 38:50-51, 40:9, 61:13, 98:9"
            },
            {
                "id": 13612,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 15439,
                "topic": "Relatives: <i>Aqrabun</i>",
                "verses": "4:2, 2:84, 2:178, 2:181, 2:216, 4:9, 4:12, 4:24, 4:37, 16:91, 17:27, 30:39, 33:7, 40:9, 111:2"
            }
        ],
        "ar": "جَنّٰتُ عَدۡنٍ یَّدۡخُلُوۡنَہَا وَ مَنۡ صَلَحَ مِنۡ اٰبَآئِہِمۡ وَ اَزۡوَاجِہِمۡ وَ ذُرِّیّٰتِہِمۡ وَ الۡمَلٰٓئِکَۃُ یَدۡخُلُوۡنَ عَلَیۡہِمۡ مِّنۡ کُلِّ بَابٍ ﴿ۚ۲۴﴾ ",
        "ur": "(یعنی) دوام کی جنتیں ہیں۔ ان میں وہ داخل ہوں گے اور وہ بھی جو اُن کے آباءو اجداد اور ان کے اَزواج اور ان کی اولادوں میں سے اصلاح پذیر ہوئے۔ اور فرشتے ان پر ہر دروازے سے داخل ہورہے ہوں گے۔",
        "v5": {
            "text": "[a]Gardens of eternity. They shall enter them and <i>also</i> those who are righteous from among their fathers, and their wives and their children. And angels shall enter unto them from every gate, <i>saying</i>:[1635]",
            "notes": [
                {
                    "ref": "a",
                    "note": "40:9."
                },
                {
                    "ref": "1635",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse enunciates a great truth which has been mentioned by the Quran only viz. any good or bad act that a man does is shared by many other persons. The success of a tradesman in his trade or of a farmer in his farming or of an industrialist in his industry is due to the intentional or unintentional cooperation of a good many other individuals. It is for this reason that the Quran has laid down the institution of Zakah and has thereby given to the poor what is due to them in the property of the rich. What is true of a tradesman or an industrialist or an agriculturist is also true of others. Similarly, the wife of a religious missionary who goes to preach in a foreign country is a sharer in his work, for she looks after his children and performs his sundry other duties connected with his household. In the same way his parents and children rightfully have a share in his good work. As, therefore, a man does good works or wins credit with the intentional or unintentional help of his relatives and kinsmen, they all are made to participate proportionately in his rewards, and the Wise and Merciful God has laid down the law that in Heaven all members of the family of a person who has excelled others in virtue, will be placed with him, provided, of course, they have earned a place in Heaven, by their own righteous deeds.</p><p>The words, <i>angels shall enter unto them from every gate</i>, are not here used to point out that there will be many gates of Heaven but that the various classes of good deeds of the believers will, in the next world, be represented as so many gates.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 25,
        "v_": 24,
        "topics": [
            {
                "id": 935,
                "topic": "Afterlife: <i>Akhirah</i>: greetings of peace in",
                "verses": "10:11, 14:24, 15:47, 33:45, 36:59, 39:74, 50:35"
            },
            {
                "id": 6704,
                "topic": "Door: <i>Bab</i>",
                "verses": "78:20, 2:190, 7:41, 7:162, 12:24, 12:26, 15:44-45, 16:30, 23:78, 38:50-51, 39:72-73, 40:77, 43:35, 54:12, 57:14"
            },
            {
                "id": 9706,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:36, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 11953,
                "topic": "Moral Traits: steadfastness",
                "verses": "2:178, 2:250-251, 3:18, 3:121, 3:126, 3:143, 3:187, 3:201, 5:9, 7:127, 7:129, 7:138, 8:47, 8:66-67, 10:90, 10:110, 11:12, 11:116, 12:91, 16:43, 16:97, 16:111, 19:66, 25:21, 25:76, 28:55, 28:81, 29:60, 32:25, 33:36, 34:20, 37:103, 38:45, 39:11, 41:31, 41:36, 42:16, 46:14, 47:32, 68:49, 76:13, 103:4"
            },
            {
                "id": 13481,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:36, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13586,
                "topic": "Paradise: <i>Jannah</i>: peace of",
                "verses": "10:11, 10:26, 14:24, 15:47, 19:63, 36:59, 39:74, 50:35, 56:26-27"
            },
            {
                "id": 13612,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:36, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 13744,
                "topic": "Patience: <i>sabr</i>: reward of",
                "verses": "16:111, 7:138, 11:12, 13:23, 16:43, 16:97, 16:127, 23:112, 25:76, 28:55, 29:60, 41:36, 76:13"
            },
            {
                "id": 16019,
                "topic": "Salam: greetings of",
                "verses": "39:74, 4:95, 7:47, 10:11, 10:26, 11:70, 14:24, 16:33, 19:16, 19:34, 19:48, 19:63, 25:64, 25:76, 28:56, 33:45, 36:59, 37:80, 37:110, 37:121, 37:131, 37:182, 43:90, 51:26, 56:27, 56:92"
            }
        ],
        "ar": "سَلٰمٌ عَلَیۡکُمۡ بِمَا صَبَرۡتُمۡ فَنِعۡمَ عُقۡبَی الدَّارِ ﴿ؕ۲۵﴾ ",
        "ur": "سلام ہو تم پر بسبب اس کے جو تم نے صبر کیا۔ پس کیا ہی اچھا ہے گھر کا انجام۔",
        "v5": {
            "text": "[b]‘Peace be unto you, because you were steadfast; behold how excellent is the reward of the Abode!’[1636]",
            "notes": [
                {
                    "ref": "b",
                    "note": "39:74."
                },
                {
                    "ref": "1636",
                    "note": "<p><strong>Commentary:</strong></p><p>The entering of the angels through every gate, referred to in the preceding verse, signifies that the angels will tell the inmates of Paradise that the latter had entered it through a particular gate on account of a particular good deed done by them and that their different virtues had been represented to them as different gates. By saying, <i>Peace be unto you</i>, as used in the present verse, the angels will remind believers that, as they practised every kind of virtue, they will enjoy every kind and form of peace from every side, the word سلام (peace) being repeated at every gate of Paradise separately.</p><p>The construction of the expression سلام علیکم (peace be unto you) is also intended to signify that the bliss of Paradise will be abiding and permanent because believers were \"steadfast\" i.e. displayed patience constantly and in all circumstances. The verse, therefore, purports to say to believers: \"You stuck to virtue as long as you lived, thus you can rightly be regarded as having performed your duty. It was not in your power to avoid death. You adhered to virtue as long as it was in your power to do so. When, therefore, the hand of death put a stop to your good deeds, it became incumbent on God to grant you perpetual peace and everlasting bliss even as you would have ever continued on the path of virtue if you had lived.\" The verse thus contains an effective answer to the objection, \"How can deeds of limited duration win unlimited reward?\"</p><p>The verse also shows that those who lose heart under trials are not deserving of Paradise. Only those are deserving who maintain their connection with God in all circumstances and persevere in the doing of good deeds till the very end. See also v. 23.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 26,
        "v_": 25,
        "topics": [
            {
                "id": 1427,
                "topic": "Allah: does not love mischief-mongers",
                "verses": "28:78, 2:12-13, 2:28, 2:61, 2:252, 5:33-34, 5:65, 7:57, 7:75, 7:87, 7:104, 7:143, 8:74, 10:82, 11:86, 17:5, 18:95, 26:153, 26:184, 28:5, 28:84, 38:29, 89:13"
            },
            {
                "id": 5345,
                "topic": "Covenant: <i>Mithaq, ‘Ahd</i>: with Allah",
                "verses": "3:188, 3:78, 2:28, 6:135, 6:153, 13:21, 16:92, 16:96, 33:24, 57:9, 68:40"
            },
            {
                "id": 5471,
                "topic": "Curse: <i>La‘nah</i>: on disbelievers, idolaters, wrong-doers",
                "verses": "4:48, 2:89-90, 2:160, 2:162, 4:47, 4:53, 4:94, 4:119, 5:61, 5:79, 7:39, 7:45, 9:68, 11:19, 11:61, 23:42, 23:45, 28:43, 29:26, 33:58, 33:62, 33:65, 33:69, 40:11, 40:53, 47:24, 48:7"
            },
            {
                "id": 5657,
                "topic": "Dar: abode, home: <i>Su’ud-Dar</i>",
                "verses": "22:41, 40:53"
            },
            {
                "id": 6556,
                "topic": "Disorder: <i>Fitnah, Fasad</i>",
                "verses": "7:57, 2:12-13, 2:28, 2:31, 2:61, 2:192, 2:194, 2:206, 2:218, 2:221, 2:252, 3:64, 5:33-34, 5:42, 5:65, 7:75, 7:86, 7:104, 7:128, 7:143, 8:20, 8:26, 8:40, 8:74, 9:47, 9:47, 10:41, 10:82, 11:86, 11:117, 16:89, 17:5, 18:95, 23:72, 26:153, 26:184, 27:9, 28:5, 28:78, 28:84, 30:42, 40:27, 47:23, 89:13"
            },
            {
                "id": 8775,
                "topic": "Hell: <i>Jahannam</i>: for those who disobey Allah, for evil-doers",
                "verses": "19:69, 10:28, 2:82, 2:276, 3:182, 4:11, 4:94, 4:116, 8:38, 11:17, 11:107, 14:16-17, 16:30, 17:19, 19:87, 20:75, 21:99, 23:104-105, 27:91, 38:56-57, 39:61, 39:73, 40:44, 40:77, 43:75, 50:25-26, 54:48-49, 55:44, 71:26, 72:16, 82:15, 85:11, 92:15-16, 101:9-10, 104:3"
            }
        ],
        "ar": "وَ الَّذِیۡنَ یَنۡقُضُوۡنَ عَہۡدَ اللّٰہِ  مِنۡۢ  بَعۡدِ مِیۡثَاقِہٖ وَ یَقۡطَعُوۡنَ  مَاۤ  اَمَرَ اللّٰہُ بِہٖۤ اَنۡ یُّوۡصَلَ وَ یُفۡسِدُوۡنَ فِی الۡاَرۡضِ ۙ اُولٰٓئِکَ لَہُمُ اللَّعۡنَۃُ وَ لَہُمۡ سُوۡٓءُ  الدَّارِ ﴿۲۶﴾ ",
        "ur": "اور وہ لوگ جو اللہ کے عہد کو پختگی سے باندھنے کے بعد توڑ دیتے ہیں اور اُسے قطع کرتے ہیں جس کے جوڑنے کا اللہ نے حکم دیا ہے اور زمین میں فساد کرتے پھرتے ہیں یہی وہ لوگ ہیں جن کے لئے لعنت ہے اوراُن کے لئے بدتر گھر ہوگا۔",
        "v5": {
            "text": "And those who [a]break the covenant of Allah, after having established it and cut asunder what Allah has commanded to be joined, and act corruptly in the earth: on them is the curse <i>of God</i> and they shall have a grievous abode.[1637]",
            "notes": [
                {
                    "ref": "a",
                    "note": "2:28."
                },
                {
                    "ref": "1637",
                    "note": "<p><strong>Commentary:</strong></p><p>Some persons sever ties of kinship; others violate the discipline of their community. Some oppose Divine Messengers, while others show lack of fellow-feeling, and yet others forsake God. All these are different forms of cutting asunder <i>what Allah has commanded to be joined</i>. Such people not only cut asunder what Allah has bidden to be joined but go a step further. <i>They act corruptly in the earth</i> viz. they perpetrate acts of injustice, and even oppose and act inimically towards those with whom they are bidden to establish a firm connection.</p><p>The words, <i>on them is the curse of God</i>, mean, as they cut off their connection with God, therefore they shall be removed far away from Him. The word لعنة (curse) which denotes removal from the presence of God, has not been used here by way of abuse, but only expresses an actual fact. See also 2:89.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 27,
        "v_": 26,
        "topics": [
            {
                "id": 903,
                "topic": "Afterlife: <i>Akhirah</i>: comparison of present life with",
                "verses": "3:15, 3:186, 4:78, 6:33, 7:170, 8:68, 9:38, 10:71, 12:58, 12:110, 14:4, 16:31, 16:42, 16:108, 16:118, 17:22, 28:61, 29:65, 40:40, 47:37, 57:21, 75:21-22"
            },
            {
                "id": 3122,
                "topic": "Attributes of Allah: Al-Basit (Enlarger of provisions)",
                "verses": "2:246, 17:31, 28:83, 29:63, 30:38, 34:37, 39:53, 42:13, 42:28"
            },
            {
                "id": 10511,
                "topic": "Life: <i>Hayat</i>: of this world",
                "verses": "23:113-115, 2:87, 2:201, 2:213, 3:15, 3:186, 4:75, 4:95, 6:30, 6:33, 6:71, 6:131, 7:52, 9:38, 10:8-9, 10:25, 10:65, 11:16, 14:4, 16:108, 17:19, 18:29, 18:46-47, 18:104-105, 20:132, 23:38, 28:61, 29:64, 29:65, 30:8, 31:34, 35:6, 40:40, 41:32, 42:37, 43:36, 45:25, 45:36, 46:36, 47:27, 53:30, 57:21, 76:28, 79:39, 87:17-18"
            },
            {
                "id": 14642,
                "topic": "Provisions: Allah enlarges",
                "verses": "20:132, 17:31, 28:83, 29:63, 30:38, 34:37, 34:40, 39:53, 42:13, 42:28"
            }
        ],
        "ar": "اَللّٰہُ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ  وَ یَقۡدِرُ ؕ وَ فَرِحُوۡا بِالۡحَیٰوۃِ الدُّنۡیَا ؕ وَ مَا الۡحَیٰوۃُ الدُّنۡیَا فِی الۡاٰخِرَۃِ  اِلَّا مَتَاعٌ ﴿٪۲۷﴾ ",
        "ur": "اللہ جس کے لئے چاہے رزق کشادہ کرتا ہے اور تنگ بھی کرتا ہے۔ اور وہ لوگ دنیا کی زندگی پر ہی خوش ہو گئے ہیں اور آخرت میں دنیا کی زندگی کی حقیقت ایک معمولی سامانِ عیش کے سوا کچھ (یاد) نہ رہے گی۔",
        "v5": {
            "text": "[a]Allah enlarges <i>His</i> provision for whomsoever He pleases and straitens <i>it for whomsoever He pleases</i>. And [b]they rejoice in the present life, while the present life is but a<i> temporary</i> enjoyment as compared with that which is to come.[1638]",
            "notes": [
                {
                    "ref": "a",
                    "note": "29:63; 30:38; 39:53."
                },
                {
                    "ref": "b",
                    "note": "10:8."
                },
                {
                    "ref": "1638",
                    "note": "<p><strong>Important Words:</strong></p><p>فی (as compared with) is a particle used in a vast variety of senses. It denotes inclusion or in-being either in relation to place or time, as in the sentences زید فی الدار i.e. Zaid is in the house, and فی ایام معدودات i.e. during a certain number of days. In many instances it may be rendered as \"of\" or \"concerning\" or \"in respect of\" as in اتحاجوننا فی الله i.e. do you argue with us concerning God. It also denotes concomitance and is sometimes synonymous with مع meaning, \"among\" as in ادخلو فی امم i.e. enter you with peoples. It also denotes the assigning of a cause, meaning, \"on account of or because of\" as in the words occurring in a saying of the Prophet ان امرأة دخلت فی النار فی ھرة حبستھا i.e. verily, a woman entered Hell because of a cat she kept confined without food (Muslim, <i>Kitabul-Birr wa</i>s-<i>Silah</i>). It is also synonymous with الی and علی as well as with من and is sometimes used to denote comparison, as in the sentence ما علمی فی بحرہ الا قطرة i.e. my knowledge is but a drop as compared with his knowledge which is like a sea (Aqrab &amp; Lane).</p><p><strong>Commentary:</strong></p><p>The verse disabuses the minds of disbelievers of the wrong notion that by accepting Islam they would lose the material benefits they now enjoy and that the bliss of the next world which it promises is but an imaginary thing. By saying that the prosperity or poverty of this life are in the hands of God, the verse implies a subtle hint that God had already decreed that all this prosperity should be transferred from the enemies of the Holy Prophet to his followers and therefore their acceptance of him would not even entail any worldly loss for them. The verse, however, proceeds to say that if even the acceptance of the Prophet led to some loss of worldly good, it would not matter, for his teachings embody abiding and permanent principles and relate to the everlasting life of the Hereafter compared with which the things of this world are of no account. This is what is expressed in the words, <i>the present life is but a temporary enjoyment as compared with that which is to come</i>. Incidentally, the verse enunciates the great principle that intellectual and mental culture are superior to material progress, which always follows in the wake of intellectual advancement.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 28,
        "v_": 27,
        "topics": [
            {
                "id": 1654,
                "topic": "Allah: guides towards the right path",
                "verses": "16:10, 2:143, 2:214, 2:273, 3:74, 6:40, 6:89, 6:127, 6:154, 7:179, 9:115, 10:26, 10:36, 14:5, 16:94, 17:98, 18:18, 22:17, 24:36, 24:47, 28:57, 29:70, 33:5, 34:7, 35:9, 39:24, 39:38, 42:14, 74:32"
            },
            {
                "id": 2300,
                "topic": "Allah: signs of, <i>Ayatullah</i>",
                "verses": "2:165, 2:212, 3:50, 4:141, 5:3, 6:5, 6:47, 6:127, 7:41, 7:134, 7:204, 10:6-8, 10:16, 10:18, 10:21-22, 10:25, 16:66, 17:13, 17:102, 20:43, 20:48, 20:54-57, 20:73, 27:13, 28:37, 30:20-26, 31:32, 36:34-43, 36:47, 41:38-41, 42:30, 42:33-36, 45:7, 51:38"
            },
            {
                "id": 5591,
                "topic": "Dallin: astray",
                "verses": "1:7, 2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:34, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:5, 22:10, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:33, 37:72, 38:27, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            },
            {
                "id": 8212,
                "topic": "Guidance: Allah gives",
                "verses": "20:51, 2:121, 2:186, 2:214, 3:74, 3:102, 4:69, 5:17, 6:36, 6:72, 6:89, 6:150, 7:44, 7:179, 10:10, 10:26, 10:36, 13:32, 14:5, 14:13, 16:10, 16:94, 16:122, 19:77, 22:17, 22:38, 24:36, 24:47, 26:63, 26:79, 28:57, 29:70, 31:5-6, 33:5, 35:9, 37:119, 39:19, 39:24, 39:38, 42:14, 47:18, 48:3, 48:21, 49:18, 64:12, 74:32, 76:4, 93:8"
            },
            {
                "id": 12289,
                "topic": "Muhammad<sup>(sa)</sup>: and disbelievers",
                "verses": "15:89-98, 2:7, 2:110, 2:119, 2:192, 2:218, 3:33, 3:128, 3:177, 3:197, 4:91, 4:103, 5:42, 5:55, 6:34, 8:31, 9:2, 9:4, 9:32, 9:40, 9:73, 9:123, 10:66, 11:13, 15:3, 16:128, 18:7, 20:134, 22:16, 25:5, 26:4, 27:71, 28:57, 29:51, 35:5, 35:9, 36:77, 41:6, 48:30, 52:34, 66:10, 68:52, 73:11, 93:6, 94:2-4"
            },
            {
                "id": 14848,
                "topic": "Qada’ Qadr: free will",
                "verses": "54:50, 3:87, 6:36, 6:126, 13:12, 13:32-33, 16:94, 16:105, 35:46, 71:5, 74:32, 76:4, 90:11"
            }
        ],
        "ar": "وَ  یَقُوۡلُ الَّذِیۡنَ  کَفَرُوۡا لَوۡ لَاۤ  اُنۡزِلَ عَلَیۡہِ اٰیَۃٌ  مِّنۡ رَّبِّہٖ ؕ قُلۡ  اِنَّ اللّٰہَ  یُضِلُّ مَنۡ یَّشَآءُ وَ یَہۡدِیۡۤ اِلَیۡہِ مَنۡ اَنَابَ ﴿ۖۚ۲۸﴾ ",
        "ur": "اور وہ لوگ جنہوں نے کفر کیا کہتے ہیں کیوں نہ اس پر اس کے ربّ کی طرف سے کوئی ایک نشان ہی اتارا گیا۔ تو کہہ دے یقیناً اللہ جسے چاہتا ہے گمراہ ٹھہراتا ہے اور اپنی طرف (صرف) اسے ہدایت دیتا ہے جو (اس کی طرف) جھکتا ہے۔",
        "v5": {
            "text": "And those who disbelieve say, [a]‘Why is not a Sign sent down to him from his Lord?’ Say, ‘Allah causes to perish those whom He wills and [b]guides to Himself those who turn <i>to Him</i>:[1639]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:38; 10:21; 29:51."
                },
                {
                    "ref": "b",
                    "note": "14:5; 74:32."
                },
                {
                    "ref": "1639",
                    "note": "<p><strong>Commentary:</strong></p><p>In the previous verse, it was said that God straitens His provision for some men if He so pleases. The present verse says that when the attention of disbelievers is drawn to the fact that God possesses the power to deprive men of their sustenance, they hasten to demand that this power of God should come into operation with regard to them so that it may serve as a sign. The Quran answers them by saying that God is already showing signs as a result of which some are being spiritually guided and some made to perish but disbelievers do not benefit by them and demand instead the sign of punishment. Thus, according to them, the signs of mercy and signs of the deep knowledge of God are of no account. With them, the only signs to which they attach any importance are the signs of punishment. But what benefit could they derive from the signs of destructive punishment when no opportunity would be left for them to accept guidance after they had been destroyed? The tragic truth is that most people become deserving of punishment on account of their sins, and this is why they do not benefit by the signs of guidance. God therefore decrees and decides the destruction of such people. For an explanation of the word یضل see note on v. 34.</p><p>As the words, <i>Allah causes to perish those whom He wills</i>, might give rise to the doubt that God brings destruction on men arbitrarily, the Quran rightly adds, <i>and guides to Himself those who turn to Him</i>, meaning that God does not destroy men arbitrarily but it is His immutable law that He guides those who are desirous of turning to Him and destroys only those who seek to turn away from Him and refuse to accept His guidance.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 29,
        "v_": 28,
        "topics": [
            {
                "id": 2233,
                "topic": "Allah: remembrance of",
                "verses": "2:153, 2:204, 3:192, 4:104, 7:206, 8:46, 10:13, 24:38, 26:228, 29:46, 33:42, 39:10, 43:37, 57:17, 62:10-11, 63:10, 73:9"
            },
            {
                "id": 8528,
                "topic": "Heart: <i>Sadr, Fu’ad, Qalb</i>: tranquility of, peace of",
                "verses": "53:12, 48:19, 2:249, 2:261, 3:127, 5:114, 8:11, 9:26, 9:40, 16:107, 48:5, 48:27"
            },
            {
                "id": 9632,
                "topic": "Itminan: satisfaction",
                "verses": "2:261, 3:127, 4:104, 5:114, 8:11, 10:8, 16:107, 16:113, 17:96, 22:12, 89:28"
            },
            {
                "id": 15503,
                "topic": "Remember: Allah",
                "verses": "2:153, 2:199, 2:201, 2:204, 2:232, 2:240, 3:42, 3:192, 4:104, 5:8, 5:12, 5:21, 7:70, 7:75, 7:206, 8:46, 18:25, 20:15, 20:43, 24:38, 26:228, 29:46, 33:22, 33:36, 33:42, 35:4, 39:24, 43:14, 57:17, 62:11, 63:10, 73:9, 76:26, 87:16"
            }
        ],
        "ar": "اَلَّذِیۡنَ اٰمَنُوۡا وَ تَطۡمَئِنُّ قُلُوۡبُہُمۡ بِذِکۡرِ اللّٰہِ ؕ اَلَا بِذِکۡرِ اللّٰہِ تَطۡمَئِنُّ الۡقُلُوۡبُ ﴿ؕ۲۹﴾ ",
        "ur": "(یعنی) وہ لوگ جو ایمان لائے اور ان کے دل اللہ کے ذکر سے مطمئن ہو جاتے ہیں۔ سنو! اللہ ہی کے ذکر سے دل اطمینان پکڑتے ہیں۔",
        "v5": {
            "text": "‘Those who believe, and whose hearts find comfort in the remembrance of Allah. Aye! It is in the remembrance of Allah that hearts can find comfort;[1640]",
            "notes": [
                {
                    "ref": "1640",
                    "note": "<p><strong>Commentary:</strong></p><p>This beautiful verse embodies a great and extremely natural truth. The more the people of the world gain the paltry goods of this life, the greater becomes the hunger and the consequent burning of their heart. But as for those who seek God, the more they turn to Him, the greater is their peace of mind. This shows that search after God is the innermost yearning of human nature and the real goal of man’s life, and that when that goal is attained man begins to enjoy perfect peace of mind, for then he rests, as it were, in the very lap of the All-Knowing and All-Powerful God, Maker and Controller of the universe. Would the people of the world had realized this great secret of happiness!</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 30,
        "v_": 29,
        "topics": [
            {
                "id": 6247,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:39, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4, 97:2-5"
            }
        ],
        "ar": "اَلَّذِیۡنَ  اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ  طُوۡبٰی لَہُمۡ  وَ حُسۡنُ  مَاٰبٍ ﴿۳۰﴾ ",
        "ur": "وہ لوگ جو ایمان لائے اور نیک اعمال بجا لائے ان کے لئے بہت پاکیزہ مقام اور بہت ہی عمدہ لوٹنے کی جگہ ہے۔",
        "v5": {
            "text": "[a]Those who believe and do good works—happiness shall be theirs, and an excellent place of return.’[1641]",
            "notes": [
                {
                    "ref": "a",
                    "note": "30:16; 18:31,108; 68:35; 98:8-9."
                },
                {
                    "ref": "1641",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means that the believers will enjoy the blessings and favours of God in a greater measure than even that conceived by man. Happy shall be their final abode and happy indeed is he whose end is happy.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 31,
        "v_": 30,
        "topics": [
            {
                "id": 3514,
                "topic": "Attributes of Allah: Ar-Rahman (The Gracious, Beneficent)",
                "verses": "1:1, 1:3, 12:65, 17:111, 19:45, 19:46, 19:59, 19:62, 19:86, 21:113, 25:61, 26:6, 27:31, 36:53, 41:3, 50:34, 55:2, 59:23, 67:30, 78:39"
            },
            {
                "id": 12646,
                "topic": "Muhammad<sup>(sa)</sup>: revelations",
                "verses": "53:3-13, 2:100, 3:45, 4:164, 5:68, 6:20, 10:3, 11:13, 12:4, 14:5, 16:124, 17:40, 18:28, 21:109, 29:46, 34:51, 35:32, 38:71, 42:4"
            },
            {
                "id": 15675,
                "topic": "Revelation: to Holy Prophet<sup>(sa)</sup>",
                "verses": "3:45, 6:20, 6:51, 7:204, 10:3, 11:13, 12:4, 16:124, 18:28, 20:115, 21:46, 29:46, 33:3, 34:51, 35:32, 38:71, 39:66, 41:7, 42:4, 42:53, 43:44, 46:10, 53:5, 72:2"
            },
            {
                "id": 17560,
                "topic": "Tawakkul ‘Alallah: trust in Allah",
                "verses": "3:123, 3:160-161, 4:82, 4:133, 4:172, 5:12, 5:24, 7:90, 8:3, 8:50, 8:62, 9:51, 9:129, 10:72, 10:85-86, 11:57, 11:89, 11:124, 12:68, 14:12-13, 16:43, 16:100, 25:59, 26:218, 27:80, 29:60, 33:4, 33:49, 39:39, 42:11, 58:11, 60:5, 64:14, 65:4, 67:30"
            }
        ],
        "ar": "کَذٰلِکَ اَرۡسَلۡنٰکَ فِیۡۤ  اُمَّۃٍ قَدۡ خَلَتۡ مِنۡ قَبۡلِہَاۤ اُمَمٌ لِّتَتۡلُوَا۠ عَلَیۡہِمُ الَّذِیۡۤ اَوۡحَیۡنَاۤ  اِلَیۡکَ وَ ہُمۡ یَکۡفُرُوۡنَ بِالرَّحۡمٰنِ ؕ قُلۡ ہُوَ  رَبِّیۡ  لَاۤ  اِلٰہَ   اِلَّا ہُوَ ۚ عَلَیۡہِ  تَوَکَّلۡتُ وَ  اِلَیۡہِ  مَتَابِ  ﴿۳۱﴾",
        "ur": "اسی طرح ہم نے تجھے ایک ایسی اُمّت میں بھیجا جس سے پہلے کئی اُمتیں گزر چکی تھیں تاکہ تُو اُن پر وہ تلاوت کرے جو ہم نے تیری طرف وحی کیا حالانکہ وہ رحمان کا انکار کر رہے ہیں۔ تو کہہ دے وہ میرا ربّ ہے۔ کوئی معبود اس کے سوا نہیں۔ اُسی پر میں توکل کرتا ہوں اور اسی کی طرف میرا عاجزانہ جھکنا ہے۔",
        "v5": {
            "text": "Thus have We sent thee to a people, before whom other peoples have passed away, that thou mayest recite to them what We have revealed to thee, yet [b]they disbelieve in the Gracious <i>God</i>. Say, ‘He is my Lord; there is no God but He. In Him do I put my trust and towards Him is my return.’[1642]",
            "notes": [
                {
                    "ref": "b",
                    "note": "25:61."
                },
                {
                    "ref": "1642",
                    "note": "<p><strong>Commentary:</strong></p><p>The previous two verses spoke of the people to whom God grants perfect peace of mind and who enjoy a truly happy end. By the words, <i>Thus have We sent thee</i>, the Quran means to suggest that God has raised the Holy Prophet so that he may, by his noble teaching and noble example, produce men of this type.</p><p>The verse draws the attention of disbelievers to God’s attribute of الرحمن (the Gracious) in a very striking manner. It says that whereas disbelievers demand immediate punishment, God continues to delay and postpone it. It is His attribute of <i>Ar-Rahman</i> which is at the root of this postponement, and yet disbelievers say that He is not <i>Ar-Rahman</i>. If God had not been <i>Ar-Rahman</i> they would have met their destruction long before.</p><p>The question also arises here, how could the Holy Prophet raise a stone-hearted people like the Arabs to the high standard of moral and spiritual excellence mentioned in the preceding verse? In reply to this natural misgiving, the Holy Prophet is bidden to say, \"It is not my work, but God’s. In Him do I put my trust, and to Him will I repeatedly turn for help till this object is attained.\" The verse also draws our attention to the great spiritual lesson that real reformation, which is the purification of the heart, is brought about only through trust in God and constantly turning to Him in prayer. Those who seek to reform the hearts of men by physical and material means can never succeed. Material means can at best reform the exterior of men. It is only spiritual means that can engender conviction and purity of heart. This is why the so-called cultured and enlightened nations of the West have, in spite of their best efforts, failed to present that high standard of morality and spirituality to which the Holy Prophet raised his Companions, notwithstanding his utter lack of material resources.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 32,
        "v_": 31,
        "topics": [
            {
                "id": 1392,
                "topic": "Allah: does not compel in matters of faith",
                "verses": "10:100, 2:257, 5:49, 6:150, 11:119, 16:10, 16:107, 18:30, 42:9"
            },
            {
                "id": 5182,
                "topic": "Compulsion in Faith: <i>Ikrah fid-Din</i>",
                "verses": "2:257, 2:191, 2:194, 5:49, 5:93, 6:150, 7:89, 8:40, 9:6, 10:100, 11:119, 16:10, 18:21, 18:30, 22:39, 22:41, 25:58, 26:5, 50:46, 76:4, 90:11, 95:6, 109:7"
            },
            {
                "id": 8213,
                "topic": "Guidance: Allah gives",
                "verses": "20:51, 2:121, 2:186, 2:214, 3:74, 3:102, 4:69, 5:17, 6:36, 6:72, 6:89, 6:150, 7:44, 7:179, 10:10, 10:26, 10:36, 13:28, 14:5, 14:13, 16:10, 16:94, 16:122, 19:77, 22:17, 22:38, 24:36, 24:47, 26:63, 26:79, 28:57, 29:70, 31:5-6, 33:5, 35:9, 37:119, 39:19, 39:24, 39:38, 42:14, 47:18, 48:3, 48:21, 49:18, 64:12, 74:32, 76:4, 93:8"
            },
            {
                "id": 10936,
                "topic": "Mankind: Allah and",
                "verses": "49:14, 1:4, 2:22, 10:93, 12:39, 13:7, 14:53, 17:71, 22:19, 27:74, 30:31, 35:3, 40:58, 40:62, 45:27, 57:26, 114:2-4"
            },
            {
                "id": 12174,
                "topic": "Mountains: <i>Jibal</i>: chieftains, tribes",
                "verses": "18:48, 19:91, 20:106, 21:80, 27:89, 34:11, 38:19, 52:11, 77:11, 78:21, 81:4"
            },
            {
                "id": 14329,
                "topic": "Promise: to disbelievers, to hypocrites",
                "verses": "2:81, 7:136, 9:68, 9:77, 11:66, 14:45, 15:44, 19:79, 21:98, 21:110, 22:73, 23:84, 26:207, 27:69, 33:13, 35:41, 36:53, 36:64, 43:84, 51:61, 54:47, 70:43, 70:45, 72:25-26, 73:19"
            },
            {
                "id": 14419,
                "topic": "Prophecies in the Holy Qur’an: about: the Holy Qur’an",
                "verses": "3:8, 2:42, 2:90, 2:102, 15:10, 24:36-38, 26:197, 96:5"
            },
            {
                "id": 14853,
                "topic": "Qada’ Qadr: free will",
                "verses": "54:50, 13:28, 3:87, 6:36, 6:126, 13:12, 16:94, 16:105, 35:46, 71:5, 74:32, 76:4, 90:11"
            },
            {
                "id": 15044,
                "topic": "Qur’an: excellence, perfection of, <i>Ummul-Kitab</i>",
                "verses": "2:24, 2:3, 5:4, 6:156, 8:32, 10:38-40, 11:2, 11:14-15, 14:25-26, 15:2, 17:89, 18:110, 21:11, 21:25, 25:2, 27:2, 29:52, 38:2, 38:30, 39:24, 43:5, 52:34-35, 59:22, 73:6"
            }
        ],
        "ar": "وَ لَوۡ اَنَّ  قُرۡاٰنًا سُیِّرَتۡ بِہِ الۡجِبَالُ اَوۡ قُطِّعَتۡ بِہِ  الۡاَرۡضُ اَوۡ کُلِّمَ  بِہِ الۡمَوۡتٰی ؕ بَلۡ  لِّلّٰہِ الۡاَمۡرُ جَمِیۡعًا ؕ اَفَلَمۡ  یَایۡـَٔسِ الَّذِیۡنَ  اٰمَنُوۡۤا  اَنۡ  لَّوۡ  یَشَآءُ اللّٰہُ لَہَدَی النَّاسَ جَمِیۡعًا ؕ وَ لَا یَزَالُ الَّذِیۡنَ کَفَرُوۡا تُصِیۡبُہُمۡ بِمَا صَنَعُوۡا قَارِعَۃٌ  اَوۡ  تَحُلُّ قَرِیۡبًا مِّنۡ دَارِہِمۡ حَتّٰی یَاۡتِیَ  وَعۡدُ  اللّٰہِ ؕ اِنَّ  اللّٰہَ  لَا یُخۡلِفُ  الۡمِیۡعَادَ ﴿٪۳۲﴾ ",
        "ur": "اور اگر قرآن ایسا ہوتا کہ اس سے پہاڑ چلائے جا سکتے یا اس سے زمین پھاڑی جا سکتی یا اس کے ذریعہ مُردوں سے کلام کیا جاسکتا (تو بھی وہ شک کرتے)۔ حقیقت یہ ہے کہ فیصلہ تمام تر اللہ ہی کا ہوتا ہے۔ پس کیا وہ لوگ جو ایمان لائے ہیں اس بات سے باخبر نہیں ہوئے کہ اگر اللہ چاہتا تو سب کے سب انسانوں کو ہدایت دے دیتا؟ اور وہ لوگ جو کافر ہوئے انہیں ان کی کارگزاریوں کے سبب سے (دلوں کو) کھٹکھٹانے والی ایک آفت پہنچتی رہے گی یا وہ (تنبیہ) ان کے گھروں کے قریب نازل ہوگی یہاں تک کہ اللہ کا وعدہ آپہنچے۔ یقیناً اللہ وعدہ خلافی نہیں کرتا۔",
        "v5": {
            "text": "And if there were a Quran by which mountains could be moved or by which the earth could be cut asunder or by which the dead could be spoken to, <i>they would not believe in it</i>. [a]Nay, the matter rests entirely with Allah. Have not the believers <i>yet</i> come to know that, if Allah had enforced <i>His</i> will, He could have surely guided all mankind? And as for those who disbelieve, [b]disaster shall not cease to befall them for what they have wrought or to alight near their home, until the promise of Allah comes to pass. Surely, Allah fails not in <i>His</i> promise.[1643]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:155; 30:5."
                },
                {
                    "ref": "b",
                    "note": "22:56."
                },
                {
                    "ref": "1643",
                    "note": "<p><strong>Important Words:</strong></p><p>الجبال (mountains) is the plural of الجبل (the mountain). Figuratively, the wordجبل means: (1) chief of a tribe or community; (2) a learned man towering above those around him; (3) great hardship or calamity (Aqrab).</p><p>قطعت (be cut asunder) is formed from قطع (<i>qatta</i>‘<i>a</i>) which is derived from قطع (<i>qata</i>‘<i>a</i>), the former being the intensified form of the latter. They say قطع الشیء i.e. he cut the thing; or he cut it asunder. قطع النھر means, he crossed or went across the river. قطع الطیر means, the birds migrated or journeyed from colder regions to warmer ones. قطعه بالحجة means, he silenced him in argument (Aqrab).</p><p>یایئس (come to know) is derived from یئس which means (1) he despaired of the thing; (2) he knew. An Arab would say قد یئست انك رجل صدق i.e. I have known that thou art a good man. The clause افلم یایئس الذین آمنوا means, have not the believers yet come to know? The expression یئست المرأة means, the woman became barren i.e. despaired of bearing children (Lane &amp; Aqrab).</p><p>قارعة (disaster) is derived from قرع. They say قرع الباب i.e. he knocked at the door. قرع الرجل means, he beat the man. قرعه امرmeans, the affair came on him all of a sudden. القارعة means, great calamity; sudden calamity; the Day of Resurrection or of Judgement; an army marching forth quickly and striking the enemy quickly (Aqrab &amp; Taj).</p><p><strong>Commentary:</strong></p><p>The words, And if there were a Quran by which mountains could be moved or by which the earth could be cut asunder or by which the dead could be spoken to, they would not believe in it, do not mean that the Quran does not possess these qualities but that even when these wonderful attributes of the Quran were demonstrated, disbelievers would not believe. A construction similar to the one used in this verse occurs in a saying of the Holy Prophet who is reported to have said, لو کان الایمان معلقا بالثر یا لنا له رجل من ابناء فارس i.e. if faith were to ascend to the Pleiades, a man from among the sons of Persia would bring it back (Bukhari, Kitabut-Tafsir). This hadith does not mean that faith would not ascend to the Pleiades, or that a man from among the sons of Persia would not bring it back. On the contrary, it is a prophecy which foretold the disappearance of faith from the earth and its restoration in the latter days by a man from among the children of Persia. Incidentally, it may be noted here that this great prophecy was fulfilled by the appearance of Ahmad,the Promised Messiah, whose family was of Persian origin. But to revert to the subject. A description of the great powers and qualities of the Quran as given in the present verse also implies the hard-heartedness and uncompromising hostility of disbelievers to the divine truth.</p><p>Taken literally, the expression, <i>by which mountains could be moved</i>, would mean that the Quran contains prophecies of earthquakes of such severity as will virtually remove parts of mountains from their places. The Quran does indeed predict great upheavals (<i>Surah</i> 99).</p><p>Figuratively, the word \"mountain\" may mean, great hardships and difficulties. In this sense, the description in the verse fitly applies to the Quran, because it solves all political, social, economic, moral and spiritual problems in a way that no other religious Scripture does. The word also means \"learned men\" among a people, or their \"chiefs.\" According to this meaning of the word also, the description is quite applicable to the Quran, for with its advent, the old leaders of the people and the learned among them disappeared. The system of government underwent a complete transformation and hereditary kingship was replaced by <i>Khilafat</i> i.e. a representative form of government. The old learning, which was founded on superstition and capricious fear, was superseded by one based on experiment, observation and a knowledge of the properties of things. The Quran abounds in verses exhorting men to make use of reason and reflection rather than indulge in superstitious notions, and enjoins them to make a close study of the objects of nature. The whole universe, says the Quran, has been created for the benefit of man, who is repeatedly urged to compel it into his service. The Quran, in short, abrogated the old order of things and inculcated a new approach to the various human problems.</p><p>The expression, <i>by which the earth could be cut asunder</i>, figuratively means that the Quran would speedily spread throughout the earth. Literally, the expression means that portions of land would be cut off from enemy territory and would pass into the possession of the believers. Both these things were fulfilled as predicted by the Quran, for it spread very quickly throughout the world, and whole countries fell into Muslim hands.</p><p>The words, <i>by which the dead were spoken to</i>, mean that dead and by-gone people should bear witness to the truth of the Quran, that is to say, the righteous forefathers of the living generation should testify to its Divine origin. This was also fulfilled. In the Old and the New Testaments, the \"People of the Book\" have evidence of the righteous men of old bearing witness to the truth of the Holy Prophet, yet they rejected that evidence. \"The dead being spoken to\" may also mean the appearance of the dead in dreams and visions and their bearing witness to the truth of the heavenly Messenger, but evil-minded people reject this evidence also. Both these things happened not only in the time of the Holy Prophet but also in the case of Ahmad, the Promised Messiah. The word \"dead\" also applies to the spiritually dead. The word has been used in this sense in the Quran (8:25). In this sense, the verse would mean that by means of the Quran those spiritually dead will not only be quickened into a new life, but will also be made to speak words of wisdom and will preach the Message of the Quran to the world.</p><p>The words, <i>the matter rests entirely with Allah</i>, mean that though these things may appear impossible, yet they will surely come to pass, because the Almighty God with Whom \"the matter rests entirely\" and to Whom nothing is impossible has Himself foretold their occurrence. To this Almightiness of God the attention of disbelievers is pointedly drawn in the words, <i>Have not the believers yet come to know that if Allah had enforced His will, He could have surely guided all mankind</i>? In the following sentence even the time is specified when these things will come to pass. The words, <i>disaster shall not cease to befall them for what they have wrought or to alight near their home, until the promise of Allah comes to pass</i>, mean, that calamity after calamity shall continue to befall the Meccans, and they shall suffer reverses one after another, till the prophecy relating to the utter destruction of their power is fulfilled. This prophecy met its fulfilment in a wonderful manner. In spite of the many signs the disbelievers had witnessed and the many reverses they had suffered at the hands of Muslims, they refused to see the truth till at the head of ten thousand devoted followers or, to use the words of the Bible, \"ten thousand saints,\" the Holy Prophet marched towards Mecca and encamped \"near their home,\" and with his triumphant entry into that city the power of pagan Arabia was completely broken and its glory departed forever and all vestige of unbelief and idolatry disappeared from the country.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 33,
        "v_": 32,
        "topics": [
            {
                "id": 2002,
                "topic": "Allah: Messengers of are mocked",
                "verses": "36:31, 6:11, 9:64-5, 15:12, 21:42, 26:7, 39:49, 43:8"
            },
            {
                "id": 14853,
                "topic": "Qada’ Qadr: free will",
                "verses": "54:50, 13:28, 3:87, 6:36, 6:126, 13:12, 16:94, 16:105, 35:46, 71:5, 74:32, 76:4, 90:11"
            },
            {
                "id": 15563,
                "topic": "Respite: opponent of Prophets",
                "verses": "7:196, 10:72, 11:56, 22:45"
            }
        ],
        "ar": "وَ لَقَدِ اسۡتُہۡزِیٴَ بِرُسُلٍ مِّنۡ قَبۡلِکَ فَاَمۡلَیۡتُ لِلَّذِیۡنَ  کَفَرُوۡا ثُمَّ   اَخَذۡتُہُمۡ ۟ فَکَیۡفَ کَانَ عِقَابِ ﴿۳۳﴾ ",
        "ur": "اور یقیناً تجھ سے پہلے رسولوں سے بھی تمسخر کیا گیا۔ پس میں نے انہیں، جنہوں نے کفر کیا، کچھ مہلت دی پھر میں نے انہیں پکڑ لیا۔ پس میری سزا کیسی (عبرتناک) تھی؟",
        "v5": {
            "text": "And surely, [a]Messengers have been mocked at before thee; but [b]I granted respite to those who disbelieved. Then I seized them and how <i>terrible</i> was <i>My</i> punishment![1644]",
            "notes": [
                {
                    "ref": "a",
                    "note": "36:31."
                },
                {
                    "ref": "b",
                    "note": "22:45."
                },
                {
                    "ref": "1644",
                    "note": "<p><strong>Commentary:</strong></p><p>To the repeated objection of the opponents of the Holy Prophet as to why punishment was not sent down upon them immediately, they are told that, as the sending down of punishment is postponed in order that disbelievers may have time to think and accept truth, the respite granted to them was no novel thing. The opponents of all the Prophets were given such respite with the same object in view, and former Prophets were also mocked at because of the delay in punishment, but that in no way injured their cause. The objection would have been justified if disbelievers had escaped punishment altogether; or if, when at last it came, it was not exemplary; or if its delay, during the intervening period, in any way, proved detrimental to the cause of truth. The postponement only served to fulfil its noble object for it afforded those, who were good at heart and were destined to believe, an opportunity to ponder over the truth and accept it.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 34,
        "v_": 33,
        "topics": [
            {
                "id": 1692,
                "topic": "Allah: has no partners",
                "verses": "6:164, 3:65, 3:152, 4:37, 4:49, 6:15, 6:80, 6:82, 6:101, 7:34, 7:191, 10:19, 12:39, 13:17, 13:37, 16:2, 16:4, 17:112, 18:43, 18:111, 22:32, 23:60, 23:93, 25:3-4, 28:69, 30:41, 39:68, 40:43, 40:85, 59:24"
            },
            {
                "id": 5592,
                "topic": "Dallin: astray",
                "verses": "1:7, 2:109, 2:199, 3:70, 3:91, 3:165, 4:117, 4:120, 4:137, 5:13, 5:61, 5:78, 5:106, 6:40, 6:57, 6:75, 6:78, 6:117-118, 6:126, 6:141, 6:145, 7:39, 7:61, 7:150, 7:180, 7:187, 9:37, 9:115, 10:89, 10:109, 12:9, 13:28, 14:5, 14:28, 14:37, 15:40, 15:57, 16:26, 16:38, 16:94, 16:126, 17:16, 17:49, 17:73, 17:98, 18:18, 18:52, 18:105, 20:80, 20:86, 20:93, 22:5, 22:10, 23:107, 25:10, 25:18, 25:30, 25:35, 25:43, 26:21, 26:87, 26:92, 26:95, 26:100, 27:93, 30:30, 31:7, 33:37, 33:68, 35:9, 36:63, 37:33, 37:72, 38:27, 39:24, 39:38, 39:42, 40:35, 42:45, 45:24, 53:3, 53:31, 56:52, 60:2, 68:8, 71:28, 74:32, 83:33"
            },
            {
                "id": 6441,
                "topic": "Disbelief: <i>Kufr</i>: deluded, misled",
                "verses": "2:7-21, 2:109, 3:168, 3:178, 6:123, 6:131, 9:23"
            },
            {
                "id": 9165,
                "topic": "Idolators: pagans, <i>Mushrikin</i>: their gods produce nothing, are helpless, dead",
                "verses": "9:3-14, 7:192-196, 6:72, 10:19, 10:35, 10:107, 16:21-22, 20:90, 21:23-25, 22:74, 28:72, 29:18, 29:42, 30:41, 35:14, 35:41, 43:19, 46:5-6"
            },
            {
                "id": 13985,
                "topic": "Plot: Plan, <i>Makar</i>",
                "verses": "3:55, 4:109, 6:124, 7:100, 7:124, 8:31, 10:22, 12:6, 13:43, 14:47, 16:27, 16:46, 27:51-52, 34:34, 35:11, 35:44, 40:46, 52:43, 71:23"
            },
            {
                "id": 16631,
                "topic": "Shirk: negation of",
                "verses": "112:2-3, 6:101, 10:67, 10:69, 12:41, 13:17, 16:53, 17:43, 23:92, 112:4-5"
            }
        ],
        "ar": "اَفَمَنۡ ہُوَ قَآئِمٌ عَلٰی کُلِّ نَفۡسٍۭ بِمَا کَسَبَتۡ ۚ وَ جَعَلُوۡا لِلّٰہِ شُرَکَآءَ ؕ قُلۡ سَمُّوۡہُمۡ ؕ اَمۡ تُنَبِّـُٔوۡنَہٗ بِمَا لَا یَعۡلَمُ فِی الۡاَرۡضِ اَمۡ بِظَاہِرٍ مِّنَ الۡقَوۡلِ ؕ بَلۡ زُیِّنَ لِلَّذِیۡنَ کَفَرُوۡا مَکۡرُہُمۡ وَ صُدُّوۡا عَنِ  السَّبِیۡلِ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ  فَمَا لَہٗ  مِنۡ ہَادٍ ﴿۳۴﴾ ",
        "ur": "پس کیا وہ جو ہر نفس پر نگران ہے کہ اس نے کیا کمایا (برحق محاسبہ کا اہل نہیں؟)۔ اور انہوں نے اللہ کے شریک ٹھہرائے ہیں۔ تو کہہ دے ان کے نام تو گنواؤ۔ یا کیا پھر تم اُسے ایسی بات سے آگاہ کرو گے جس کا وہ ساری زمین میں کوئی علم نہیں رکھتا؟ یا (یہ) محض دکھاوے کی باتیں ہیں؟ حقیقت یہ ہے کہ جن لوگوں نے کفر کیا اُن کے لئے اُن کے فریب خوبصورت بنا دیئے گئے۔ اور وہ (ہدایت کی) راہ سے روک دئے جائیں گے۔ اور جسے اللہ گمراہ قرار دے دے اسے ہدایت دینے والا کوئی نہیں۔",
        "v5": {
            "text": "Will then He, Who stands over every soul <i>to note</i> what it earns, <i>let them go unpunished</i>? Yet, [a]they ascribe partners to Allah. Say, ‘Name them.’ Would you inform Him of what He does not know in the earth? Or, is it <i>a mere</i> empty saying? Nay, but the design of the disbelievers has been made to appear beautiful in their eyes, and they have been kept back from the <i>right</i> way. And [b]he whom Allah lets go astray shall have no guide.[1645]",
            "notes": [
                {
                    "ref": "a",
                    "note": "6:101; 10:67; 13:17."
                },
                {
                    "ref": "b",
                    "note": "17:98; 39:24, 37."
                },
                {
                    "ref": "1645",
                    "note": "<p><strong>Commentary:</strong></p><p>The words, <i>Who stands over every soul to note what it earns</i>, contain another reason why God delays punishment. The argument is that as God is keeping close watch over every soul and nothing, however remote and secret, is hidden from His knowledge and He is also All-Powerful, He needs no hurry to punish the disbelievers; for if only punishment were the object, He could bring the offenders to book whenever He liked. The postponement of punishment is not therefore a thing to be scoffed or wondered at. The wonder rather is that disbelievers do not ponder over the fact that they are offenders against God’s Kingdom and yet they do not fear His punishment and desire to hasten it.</p><p>The words, <i>they ascribe partners to Allah</i>, mean that if disbelievers pondered over their own beliefs and actions they would readily discover that they were sinning against God by ascribing co-partners to Him and have therefore rightly incurred His displeasure.</p><p>The simple words, <i>Say, Name them</i>, embody a mighty argument against <i>shirk</i>. Idolaters are called upon to describe what function their gods perform. The word \"name\" in the verse does not mean personal name but attributive name, for the personal names of some of the gods have been given in the Quran itself (71:24). The demand that idolaters should name the functions of their gods is such as cannot fail to bring home to them the absurdity of their beliefs. Suppose, for instance, the idolaters say about one of their gods that his function or attribute is that he can or does bestow children. Now the possession of such a power by a god would imply that he has control not only over the birth of children but over numberless other things which have direct or indirect bearing on geniture. Thus, in order to bestow children, the god to whom this attribute is ascribed must have control over diet and medicinal drugs and must have control over even the working of man’s physical system. He must also have knowledge of hidden things so that he may know the genital defects of the parents and also know what medicine will suit the special circumstances of the case. Besides, he must be able to impart the knowledge of hidden things to others. For instance, he must be able to inspire the physician or the patient as to what medicine and what food will remove the defect. In short, until a god possesses an all-comprehensive knowledge and unlimited powers, he will not be able to perform even one single function. On the other hand, if it be supposed that each and every god possesses all the powers required for his special function, then the existence of so many gods would become superfluous, besides being a potential source of discord and disorder; for in that case each one of these gods would be the Supreme Being, a position which is impossible to imagine.</p><p>The words, <i>Name them</i>, may also be an expression of contempt, meaning that the gods of the disbelievers are so worthless that even the mention of their names would put them to shame.</p><p>The words, <i>Would you inform Him of what He does not know in the earth</i>?, contain yet another powerful argument against <i>shirk</i>. If there had been any other gods, argues the verse, the fact ought to have been made known by God Himself through a Prophet or through angels, or the alleged co-partners of God should themselves have made that announcement, but no such communication or announcement has ever been known to exist. Hence, the verse takes idolaters to task by telling them that by ascribing co-partners to God they presume to inform Him of something of which He Himself has no knowledge.</p><p>The expression, <i>or</i> <i>is it a mere empty saying</i>?, means that idolaters say these things only with their tongues and have no real faith in them. The verse asks disbelievers whether they really believe in what they allege. In this way, an appeal has been made to human nature, which often proves a very successful way of bringing home the truth.</p><p>It often happens that when a man commits a fraud or imposture in order to procure worldly advantage, he himself gradually falls a prey to his own imposture which, by and by, begins to appear attractive to him. Thus man’s design is made to look fair to him not by God, but by man himself. Some men ascribe divine powers to certain creatures, not because they really believe them to be gods beside Allah, but to impose upon simple-minded people and to cheat them of their possessions. But, as time goes on, their own trick begins to appeal to them, and they become the dupes of their own fraud. This is the significance of the words, <i>Nay, but the design of the disbelievers has been made to appear beautiful in their eyes</i>.</p><p>The expression, <i>and they have been kept back from the right way</i>, signifies that when a man severs his connection with God, he becomes involved in <i>shirk</i>, whether hidden or visible. Man cannot remain without a companion. When he leaves God, the inevitable result is that he begins to seek the support of petty things, which gradually gives rise to <i>shirk</i>.</p><p>Here the Quran differs from the students of comparative religion. According to the latter, polytheism preceded the belief in one God. According to the Quran the reverse is true, and history supports the Quran. We see that Muslims and Jews were worshippers of one God in the beginning, but afterwards many of them virtually reverted to polytheism and idolatry. The case of Christians is still worse. They were first believers in the Unity of God but took to deifying Jesus afterwards and the whole community became stuck in the quagmire of <i>shirk</i>. Why should we not assume that the same was the case with the peoples of remote antiquity?</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 35,
        "v_": 34,
        "topics": [
            {
                "id": 967,
                "topic": "Afterlife: <i>Akhirah</i>: punishment in",
                "verses": "16:28, 2:86-87, 5:34, 17:11, 22:10, 27:6, 33:58, 34:9, 39:27, 41:17, 46:36, 57:21, 68:34, 79:47"
            }
        ],
        "ar": "لَہُمۡ عَذَابٌ فِی الۡحَیٰوۃِ الدُّنۡیَا وَ لَعَذَابُ الۡاٰخِرَۃِ اَشَقُّ ۚ وَ مَا لَہُمۡ مِّنَ اللّٰہِ  مِنۡ  وَّاقٍ ﴿۳۵﴾ ",
        "ur": "ان کے لئے دنیا کی زندگی میں عذاب ہے اور آخرت کا عذاب سخت تر ہے اور اللہ سے انہیں بچانے والا کوئی نہیں۔",
        "v5": {
            "text": "[a]For them is a punishment in the present life; and, surely, the punishment of the Hereafter is harder, and they will have no defender against Allah.",
            "notes": [
                {
                    "ref": "a",
                    "note": "39:27; 68:34."
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 36,
        "v_": 35,
        "topics": [
            {
                "id": 2117,
                "topic": "Allah: parables set forth by, <i>Amthal</i>",
                "verses": "13:18, 2:18, 2:27, 2:172, 2:262, 2:265, 7:177, 14:19, 14:25-27, 14:46, 16:75-77, 16:113, 18:33, 22:74, 24:36, 25:40, 29:42, 29:44, 30:29, 30:59, 36:14, 39:28, 39:30, 43:9, 47:4, 47:16, 59:22, 62:6, 66:11-12"
            },
            {
                "id": 6482,
                "topic": "Disbelief: <i>Kufr</i>: punishment of a",
                "verses": "2:7-21, 2:25, 2:40, 2:91, 2:105, 2:127, 2:176, 3:11, 3:23, 3:57, 3:92, 3:132, 3:142, 4:19, 4:38, 4:57, 4:141, 4:152, 4:162, 5:11, 5:87, 6:31, 6:111, 7:51, 8:15, 8:37, 9:26, 9:49, 9:68, 14:3, 16:28, 17:9, 18:103, 18:107, 21:40, 22:20, 22:73, 29:55, 33:65-66, 34:34, 35:37, 36:64-65, 38:28, 39:33, 39:72, 41:51, 48:14, 67:7, 70:2-3, 76:5, 98:7"
            },
            {
                "id": 9707,
                "topic": "Jaza’: recompense: of believers, of righteous",
                "verses": "78:37, 2:63, 2:113, 2:263, 2:278, 3:145-146, 3:149, 3:172-173, 3:180, 3:196, 4:68, 4:75, 4:101, 4:115, 4:147, 4:163, 5:10, 5:86, 6:84, 6:91, 6:136, 7:44, 7:171, 8:29, 9:22, 9:120-21, 10:5, 10:27, 11:116, 12:23, 12:57-58, 12:89, 12:91, 13:23, 13:25, 16:32, 16:42, 16:97, 17:10, 18:3, 18:31-32, 18:47, 18:89, 20:77, 24:39, 25:16, 27:90, 28:15, 28:38, 28:55, 28:81, 29:8, 29:28, 29:59, 30:46, 32:18, 33:25, 33:30, 33:32, 33:36, 33:45, 34:5, 34:38, 35:8, 35:34, 36:12, 37:81, 37:106, 37:111, 37:122, 37:132, 39:11, 39:35, 39:36, 39:75, 41:9, 42:27, 46:15, 47:36, 48:11, 48:30, 49:4, 53:32, 53:42, 54:36, 55:61, 56:29, 57:8, 57:12, 57:19-20, 57:28, 64:16, 65:6, 67:13, 68:4, 73:21, 76:13, 76:23, 77:44, 84:26, 95:7, 98:9"
            },
            {
                "id": 12843,
                "topic": "Nahr: flowing streams",
                "verses": "2:26, 3:16, 85:12, 98:9"
            },
            {
                "id": 13389,
                "topic": "Parable of: garden for believers",
                "verses": null
            },
            {
                "id": 13482,
                "topic": "Paradise: <i>Jannah</i>: description of",
                "verses": "76:12-23, 2:26, 3:134, 7:43-44, 9:72, 13:25, 15:46-49, 16:31-32, 18:32, 18:108-109, 19:62-63, 22:24, 25:17, 25:25, 25:76-77, 29:59, 30:16, 34:38, 35:34-36, 36:56-60, 37:41-50, 38:50-53, 39:21, 39:35, 40:41, 41:32, 42:23-28, 43:71-74, 44:52-56, 47:16, 50:36, 52:23, 52:24, 52:28, 55:47-78, 56:13-38, 57:22, 65:12, 69:22-25, 76:6-7, 77:42-43, 78:32-37, 83:25-29, 88:11-17"
            },
            {
                "id": 13613,
                "topic": "Paradise: <i>Jannah</i>: rewards of, for the righteous men and women, the martyrs, the <i>muhajirun</i>, the patient, those who fear Allah, the penitent",
                "verses": "18:32, 2:26, 3:16, 3:134, 3:196, 3:199, 4:14, 4:58, 5:66, 5:120, 7:44, 9:72, 9:100, 9:111, 10:10, 10:27, 11:109, 13:23-25, 15:46-49, 16:33, 19:61-63, 21:102-104, 23:2-12, 25:76-77, 26:91, 32:20, 35:33-34, 35:36, 36:26-27, 37:42-50, 39:21, 40:41, 41:31-33, 43:69-74, 46:14-15, 47:5-7, 47:16, 48:18, 50:32-36, 52:18-28, 55:47-59, 55:63-79, 56:12-39, 56:89-90, 57:13, 57:22, 59:21, 61:12-13, 66:9, 66:12, 74:40-41, 76:6-7, 76:12-23, 77:42-5, 78:32-37, 82:14, 83:23, 83:26-29, 88:9-17, 89:28-31"
            },
            {
                "id": 14299,
                "topic": "Promise: of Allah",
                "verses": "24:56, 2:269, 3:153, 4:96, 5:10, 8:8, 9:72, 9:111, 18:49, 19:62, 19:88, 21:102, 21:104-105, 23:36, 25:16-17, 28:62, 30:7, 33:23, 34:31, 38:54, 39:75, 41:31, 46:17, 47:16, 48:22, 48:30, 50:33, 51:23, 57:11, 85:3"
            },
            {
                "id": 15835,
                "topic": "Righteous: <i>Salihin</i>: rewarded",
                "verses": "3:126, 3:134-135, 3:173, 3:180, 7:157, 7:170-171, 7:197, 9:4, 9:123, 11:116, 15:46, 16:32, 19:86, 22:24, 25:16, 25:71, 26:91, 29:8, 29:10, 29:28, 29:59, 30:16, 30:45-46, 34:5, 35:8, 38:50, 39:62, 39:74-75, 41:9, 41:19, 43:36, 44:52-57, 45:20, 45:31, 47:3, 47:16, 47:18, 47:37, 49:4, 50:32, 51:16, 52:18, 54:55, 64:10, 65:12, 68:51, 77:42, 78:32-37, 83:23, 98:8"
            }
        ],
        "ar": "مَثَلُ الۡجَنَّۃِ الَّتِیۡ وُعِدَ الۡمُتَّقُوۡنَ ؕ تَجۡرِیۡ مِنۡ  تَحۡتِہَا الۡاَنۡہٰرُ ؕ اُکُلُہَا دَآئِمٌ وَّ ظِلُّہَا ؕ تِلۡکَ عُقۡبَی الَّذِیۡنَ اتَّقَوۡا ٭ۖ وَّ عُقۡبَی الۡکٰفِرِیۡنَ النَّارُ ﴿۳۶﴾ ",
        "ur": "اس جنت کی مثال جس کا متقیوں سے وعدہ کیا گیا ہے (یہ ہے) کہ اس کے دامن میں نہریں بہتی ہیں، اُس کا پھل دائمی ہے اور اُس کا سایہ بھی۔ یہ ان لوگوں کا انجام ہے جنہوں نے تقویٰ اختیار کیا جبکہ کافروں کا انجام آگ ہے۔",
        "v5": {
            "text": "[b]The similitude of the Heaven promised to the God-fearing is that through it flow streams: its fruit is everlasting, and <i>so is</i> its shade. That is the reward of those who are righteous; and the reward of the disbelievers is Fire.[1646]",
            "notes": [
                {
                    "ref": "b",
                    "note": "2:26; 4:58; 47:16."
                },
                {
                    "ref": "1646",
                    "note": "<p><strong>Commentary:</strong></p><p>The idea underlying the word جنة generally rendered as Heaven but literally meaning garden, is not that of a land covered with trees, but of the trees themselves that give shade and cover the land. Thus the sentence تجری من تحت الانھار (through it flow streams) means that streams will flow under the trees of the gardens. This is intended to point not only to the proximity of water but also to the fact that the inmates of Heaven will be the owners and masters of the streams referred to. The word نھر (stream) properly signifies \"water running with ease and unrestrictedly,\" which points to the unhampered and unimpeded progress of believers in Heaven. The word نھر (stream) also symbolizes the vastness of the works of believers, for it is only to water vast areas and not a few acres of land that streams or canals are constructed. Thus the word نھر (stream) implies the fact that the works of believers are and should be wide in their range and the scope of their vision unrestricted. It should be remembered that in the description of Paradise, trees stand for believers’ faith while streams symbolize their works. Just as trees without water become withered and dry, similarly, faith unaccompanied by good works is a dead formality.</p><p>The plural form انھار (streams) has been used in order to point to the fact that believers’ good works are of diverse kinds and versatile nature. This is why they will take the form of not one stream but of many. There will be a particular channel of running water representing a corresponding good work of man, reminding the inmates of Heaven that the different streams of Heaven represent their own many good works.</p><p>The words, <i>its fruit is everlasting and so is its shade</i>, signify that the fruits of Heaven will see no autumn, no season of decay, nor even of dormancy. Thus there will be no interruption in the boons and blessings of Paradise. \"Fruit\" and \"shade\" stand respectively for inward and outward blessings and imply that believers will enjoy all kinds of blessings in Heaven, both external and internal.</p><p>The words, <i>the reward of the disbelievers is Fire</i>, mean that as disbelievers paid no heed to their spiritual or moral welfare and only copied and imitated others and lived, as it were, not for themselves but for others, so they will have fire for their reward, which benefits others but burns itself.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 37,
        "v_": 36,
        "topics": [
            {
                "id": 1693,
                "topic": "Allah: has no partners",
                "verses": "6:164, 3:65, 3:152, 4:37, 4:49, 6:15, 6:80, 6:82, 6:101, 7:34, 7:191, 10:19, 12:39, 13:17, 13:34, 16:2, 16:4, 17:112, 18:43, 18:111, 22:32, 23:60, 23:93, 25:3-4, 28:69, 30:41, 39:68, 40:43, 40:85, 59:24"
            }
        ],
        "ar": "وَ الَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَفۡرَحُوۡنَ بِمَاۤ اُنۡزِلَ اِلَیۡکَ وَ مِنَ الۡاَحۡزَابِ مَنۡ یُّنۡکِرُ بَعۡضَہٗ ؕ قُلۡ اِنَّمَاۤ  اُمِرۡتُ اَنۡ اَعۡبُدَ اللّٰہَ  وَ لَاۤ   اُشۡرِکَ بِہٖ ؕ اِلَیۡہِ  اَدۡعُوۡا وَ  اِلَیۡہِ  مَاٰبِ ﴿۳۷﴾",
        "ur": "اور جن لوگوں کو ہم نے کتاب دی وہ اس سے جو تیری طرف اتارا جاتا ہے خوش ہوتے ہیں۔ اورمتفرق گروہوں میں سے بعض ایسے ہیں جو اس کے بعض حصوں کا انکار کردیتے ہیں۔ تُو کہہ دے کہ یقیناً مجھے یہی حکم دیا گیا ہے کہ میں اللہ کی عبادت کروں اور اس کا کوئی شریک نہ ٹھہراؤں۔ اسی کی طرف میں بلاتا ہوں اور اسی کی طرف میرا لوٹنا ہے۔",
        "v5": {
            "text": "And [a]those to whom We have given the Book rejoice in what has been revealed to thee. And [b]of the <i>different</i> parties there are some who deny a part thereof. Say, [c]‘I am only commanded to worship Allah and not to set up equals to Him. Unto Him do I call, and unto Him is my return.’[1647]",
            "notes": [
                {
                    "ref": "a",
                    "note": "28:53."
                },
                {
                    "ref": "b",
                    "note": "2:86."
                },
                {
                    "ref": "c",
                    "note": "18:111; 39:12; 72:21."
                },
                {
                    "ref": "1647",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse shows that some of the \"People of the Book\" had accepted Islam while the Holy Prophet was yet in Mecca. The words, <i>rejoice in what has been revealed to thee</i>, most probably refer to Negus, the Abyssinian King and some of his people who, in their hearts, had become Muslims. But as their faith had not yet become publicly known, the words used about them are not \"they believe\" but simply \"they rejoice.\"</p><p>The words, <i>to whom We have given the Book, </i>may also refer to Muslims, who naturally rejoiced to hear the glad tidings of their final triumph.</p><p>By the word احزاب (parties) is meant all those people to whom a Prophet is sent and who do not accept him. In the verse under comment the people referred to are the Jews, Christians and all other disbelievers, as the Holy Prophet has been sent to all the nations of the earth.</p><p>The words, <i>a part thereof</i>, have been used because disbelievers denied or disapproved of only those parts of the Quran which disagreed with their own Scriptures or their own beliefs. With regard to the remaining parts, they had no disagreement with them.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 38,
        "v_": 37,
        "topics": [
            {
                "id": 2795,
                "topic": "Arabic",
                "verses": "12:3, 16:104, 20:114, 26:196, 39:29, 41:4, 41:45, 42:8, 43:4, 46:13, 50:31"
            },
            {
                "id": 7861,
                "topic": "Friends: <i>Auliya’</i>: Allah is Friend, Protector, <i>Waliyy</i>",
                "verses": "43:68, 2:258, 2:121, 3:69, 3:123, 4:46, 4:124, 4:174, 5:56, 6:15, 6:52, 6:71, 6:128, 7:156, 7:197, 9:74, 12:102, 18:27, 32:5, 33:18, 34:42, 42:10, 42:29, 45:20"
            },
            {
                "id": 13233,
                "topic": "Obey: do not, disbelievers, evil, hypocrites",
                "verses": "3:150, 3:101, 6:117, 6:122, 18:29, 25:53, 33:2, 33:49, 68:9, 68:11, 76:25, 96:20"
            },
            {
                "id": 15173,
                "topic": "Qur’an: revelation of",
                "verses": "2:186, 12:3, 16:104, 17:107, 20:5, 20:114, 25:33-34, 26:194-197, 39:29, 41:4, 42:8, 43:4, 44:4-5, 46:13, 76:24, 97:2"
            }
        ],
        "ar": "وَ کَذٰلِکَ اَنۡزَلۡنٰہُ حُکۡمًا عَرَبِیًّا ؕ وَ لَئِنِ اتَّبَعۡتَ اَہۡوَآءَہُمۡ بَعۡدَ مَا جَآءَکَ مِنَ الۡعِلۡمِ ۙ مَا لَکَ مِنَ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا  وَاقٍ ﴿٪۳۸﴾ ",
        "ur": "اور اسی طرح ہم نے اُسے ایک فصیح و بلیغ حکم کے طور پر اُتارا ہے۔ اور اگر تو ان کی خواہشات کی پیروی کرے بعد اس کے کہ تیرے پاس علم آچکا ہے تو تجھے اللہ کی طرف سے کوئی دوست اور کوئی بچانے والا نہ ملے گا۔",
        "v5": {
            "text": "And thus [d]have We revealed it as a clear judgement. And [e]if thou follow their evil desires after the knowledge that has come to thee, thou shalt have no friend nor defender against Allah.[1648]",
            "notes": [
                {
                    "ref": "d",
                    "note": "12:3; 20:114; 43:4."
                },
                {
                    "ref": "e",
                    "note": "2:121,146; 42:16."
                },
                {
                    "ref": "1648",
                    "note": "<p><strong>Important Words:</strong></p><p>عربیا (clear). See 12:3.</p><p><strong>Commentary:</strong></p><p>That the Quran has been revealed in the Arabic tongue is not the idea that is meant to be expressed in this verse, for that language is spoken by the Arabs. The real idea lies in the deeper significance of the word عربیا viz. the Quran has been invested with a vastness of meaning which is beyond human power.</p><p>The words, if thou follow their evil desires, after the knowledge that has come to thee, thou shalt have no friend nor defender against Allah, may be taken as addressed either to the reader or to the Holy Prophet. In the latter case, the verse would be taken as expressing the Majesty and Independence of God. The Prophet was only a flute through which the sweet and majestic voice of God was being sounded. Away from the mouth of God it becomes silent and is no better than a piece of wood.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 39,
        "v_": 38,
        "topics": [
            {
                "id": 368,
                "topic": "Abrogation: <i>Naskh</i>: message is only by Divine command",
                "verses": "57:5"
            },
            {
                "id": 1125,
                "topic": "Ajal: <i>Musamma</i>, fixed",
                "verses": "2:232, 11:105, 3:146, 6:3, 6:129, 7:35, 10:50, 11:4, 13:3, 14:11, 15:6, 16:62, 17:100, 20:130, 22:6, 22:34, 29:54, 30:9, 31:30, 35:14, 35:46, 39:43, 40:68, 42:15, 46:4"
            },
            {
                "id": 4638,
                "topic": "Book: <i>Kitab</i>: repository of Divine laws and decrees",
                "verses": "57:23, 2:136, 4:25, 8:69, 8:76, 9:36, 15:5, 17:59, 30:57, 33:7, 35:12"
            },
            {
                "id": 6248,
                "topic": "Decree",
                "verses": "9:106, 2:110, 2:118, 3:48, 3:146, 4:48, 5:2, 6:3, 8:45, 8:69, 9:118, 10:97, 11:44, 11:61, 11:74, 11:77, 11:83, 11:95, 11:102, 12:22, 13:30, 15:5, 15:61, 16:2, 16:34, 19:22, 19:36, 19:72, 19:73, 20:119, 22:5, 27:58, 33:38-39, 34:15, 35:37, 36:39, 36:71, 39:43, 40:69, 40:79, 40:86, 41:13, 48:16, 51:10, 54:13, 57:15, 58:22, 59:4, 97:2-5"
            },
            {
                "id": 11376,
                "topic": "Messengers: <i>Rusul</i>: sent men as",
                "verses": "12:110, 16:44, 21:8"
            },
            {
                "id": 13849,
                "topic": "Permission: Leave, <i>Idhn</i>: of Allah",
                "verses": "64:12, 2:98, 2:103, 2:214, 2:222, 2:250, 2:252, 2:256, 3:50, 3:146, 3:153, 3:167, 4:65, 5:17, 5:111, 7:59, 8:67, 10:4, 10:101, 11:106, 14:2, 14:12, 14:24, 14:26, 22:66, 33:47, 34:13, 35:33, 42:52, 58:11, 59:6, 97:5"
            },
            {
                "id": 14554,
                "topic": "Prophets<sup>(as)</sup>: <i>Anbiya’</i>: are mere mortals",
                "verses": "19:52, 21:8-9, 14:11-12, 17:94, 18:111, 19:59, 21:35, 25:8, 25:21"
            },
            {
                "id": 14839,
                "topic": "Qada’ Qadr: fixed term",
                "verses": "54:50, 34:31, 3:146, 6:3, 7:35, 10:50, 16:62, 20:130, 23:44, 29:54, 42:15, 65:4, 72:26, 77:23"
            },
            {
                "id": 17175,
                "topic": "Spouse: <i>Zauj</i>: mate",
                "verses": "2:26, 4:2, 2:36, 2:103, 2:231, 2:233, 2:235, 2:241, 4:13, 4:21, 7:20, 7:190, 16:73, 20:118, 21:91, 23:6-7, 24:7, 25:75, 26:167, 30:22, 33:5, 33:7, 33:29, 33:38, 33:53, 33:60, 36:57, 39:7, 58:2, 60:12, 64:15, 66:2, 66:4, 66:6"
            },
            {
                "id": 18761,
                "topic": "Wives",
                "verses": "30:22, 2:188, 2:206, 2:224, 4:4-5, 4:22-26, 4:35, 4:128-131, 23:7, 24:7, 33:5, 64:15, 70:30-31"
            }
        ],
        "ar": "وَ لَقَدۡ اَرۡسَلۡنَا رُسُلًا مِّنۡ قَبۡلِکَ وَ جَعَلۡنَا لَہُمۡ  اَزۡوَاجًا وَّ ذُرِّیَّۃً ؕ وَ مَا کَانَ لِرَسُوۡلٍ اَنۡ یَّاۡتِیَ بِاٰیَۃٍ  اِلَّا بِاِذۡنِ اللّٰہِ ؕ لِکُلِّ  اَجَلٍ  کِتَابٌ ﴿۳۹﴾ ",
        "ur": "اور ہم نے یقیناً تجھ سے پہلے بہت سے رسول بھیجے اور ہم نے ان کے لئے بیویاں بنائیں اور ذرّیّت بھی۔ اور کسی رسول کے لئے یہ ممکن نہیں کہ کوئی ایک آیت بھی اللہ کے اِذن کے بغیر لا سکے۔ اور ہر مقدر وقت کے لئے ایک نوشتہء تحریر ہے۔",
        "v5": {
            "text": "And, indeed, We sent Messengers before thee, and We gave them wives and children. And [a]it is not possible for a Messenger to bring a Sign save by the command of Allah. For every term there is a <i>divine</i> decree.[1649]",
            "notes": [
                {
                    "ref": "a",
                    "note": "14:12; 40:79."
                },
                {
                    "ref": "1649",
                    "note": "<p><strong>Commentary:</strong></p><p>Disbelievers objected that the Holy Prophet had come without any worldly resources. The verse under comment replies to this objection by stating that earlier Prophets were also without any worldly resources. They, like him, had their physical needs and requirements. They, too, had wives and children whom they had to support and look after and had their duties to perform. Yet in spite of all the impediments and obstacles in their way and in spite of their physical needs and requirements and of the absence of material resources, they succeeded and triumphed. So shall the Holy Prophet.</p><p>The verse also makes it clear that signs of punishment are certainly shown to disbelievers but not at the time and in the form in which they demand them. The form and time of signs are determined by God alone, for they are shown only \"by the command of Allah.\"</p><p>It may be asked here what, if God raised Messengers for the reformation of man, prevented Him from delegating to these Messengers the power of punishment, particularly when He knew that Signs would be demanded of them by their opponents and also when even earthly governments invest their officials with certain magisterial powers? Again, if God had invested His Prophets with the power to punish the people, it would have at least this advantage that the people would have feared and respected them and dared not oppose them. The Quran answers this question in the words, <i>For every term there is a divine decree</i>, which means that, as it is God Who determines the nature and form of each punishment and the time of its occurrence and He alone, being All-Knowing, knows in what form and at what time the sending down of a certain punishment will prove beneficial to the people, the power of punishing cannot be delegated to any other person. For if that delegation can at all be fair and useful, it must be accompanied by the delegation of many other divine powers, which is simply unthinkable. The infliction of punishment, therefore, could not be entrusted to the Prophets or to anybody else.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 40,
        "v_": 39,
        "topics": [
            {
                "id": 14824,
                "topic": "Qada’ Qadr: Allah’s Will prevails",
                "verses": "54:50, 24:44, 3:155, 6:59, 9:51, 10:20, 11:57, 11:111, 12:42, 15:5, 16:105, 31:35, 32:6, 33:39, 41:46, 41:48, 59:4, 64:12"
            }
        ],
        "ar": "یَمۡحُوا اللّٰہُ مَا یَشَآءُ وَ یُثۡبِتُ ۚۖ وَ عِنۡدَہٗۤ   اُمُّ   الۡکِتٰبِ ﴿۴۰﴾ ",
        "ur": "اللہ جو چاہے مٹا دیتا ہے اور قائم بھی رکھتا ہے اور اس کے پاس تمام نوشتوں کا منبع ہے۔",
        "v5": {
            "text": "[a]Allah effaces what He wills and establishes <i>what He wills</i>, and with Him is [b]the source of <i>all</i> commandments.[1650]",
            "notes": [
                {
                    "ref": "a",
                    "note": "42:25."
                },
                {
                    "ref": "b",
                    "note": "13:40."
                },
                {
                    "ref": "1650",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse lays down two laws relating to punishment: (<i>a</i>) God either cancels the punishment partially or wholly; or (<i>b</i>) He lets it stand, as decreed. So punishment never comes unless it is fully deserved, nor is it ever in excess of the offence. It may, however, be less than what it should be or it may be altogether remitted. This dual law is invariably observed in all heavenly punishments.</p><p>The words, <i>with Him is the source of all commandments</i>, mean: (<i>a</i>) God alone knows the root cause of all commandments or the wisdom underlying them, so it is by His guidance alone that the right way may be known. (<i>b</i>) All the commandments of Shari‘ah are based on Divine attributes, so the source of the law lies with God. The latter meaning makes it clear that moral and spiritual perfection is impossible of attainment unless one imitates and imbibes Divine attributes and conforms his conduct to them. Indeed, it is extremely difficult to define good or bad morals by human standards or in the light of human actions. Virtue is nothing but imitation of Divine attributes, and vice its antithesis. This definition is calculated to solve all those difficulties which philosophers of Ethics have to face in defining \"virtue\" and \"vice\" or good and bad morals. (<i>c</i>) That God alone knows the purpose of Divine commandments, therefore the punishment for their violation should also lie in His hands. He alone knows who should be punished and who not; for an opponent today may become a staunch supporter tomorrow.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 41,
        "v_": 40,
        "topics": [
            {
                "id": 549,
                "topic": "Accountability: <i>Hisab</i>: everyone responsible for his own actions",
                "verses": "2:226, See also Actions, 2:140, 4:86, 6:53, 6:70, 10:42, 13:19, 23:118, 42:16, 64:5-8, 69:21"
            },
            {
                "id": 2642,
                "topic": "Angels: <i>Mala’ikah</i>: take away the souls of men, <i>Tawaffa</i>",
                "verses": "22:6, 4:98, 5:118, 16:29, 16:33, 32:12, 6:61-62, 7:38, 8:51, 10:47, 10:105, 12:102, 16:71, 39:43, 40:68, 40:78, 47:28"
            },
            {
                "id": 6192,
                "topic": "Dead, Death: <i>Maut</i>: <i>Tawaffa</i>, caused,",
                "verses": "22:6, 2:235, 2:241, 3:56, 3:194, 4:16, 4:98, 5:118, 32:12, 6:61, 6:62, 7:38, 7:127, 8:51, 10:47, 10:105, 12:102, 16:29, 16:33, 16:71, 39:43, 40:68, 40:78, 47:28"
            },
            {
                "id": 14378,
                "topic": "Prophecy: fulfilment of",
                "verses": "6:68, 6:116, 40:78-79"
            },
            {
                "id": 15365,
                "topic": "Reckoning: <i>Hisab</i>: count, accountability",
                "verses": "17:13, 6:53, 6:70, 10:6, 13:19, 13:22, 23:118, 24:40, 26:114, 65:9, 69:21, 69:27, 78:37, 84:9, 88:26-27"
            }
        ],
        "ar": "وَ  اِنۡ مَّا نُرِیَنَّکَ بَعۡضَ الَّذِیۡ نَعِدُہُمۡ  اَوۡ نَتَوَفَّیَنَّکَ فَاِنَّمَا عَلَیۡکَ الۡبَلٰغُ وَ عَلَیۡنَا  الۡحِسَابُ  ﴿۴۱﴾",
        "ur": "اوراگر ہم تجھے ان اِنذاری وعدوں میں سے کچھ دکھا دیں جو ہم ان سے کرتے ہیں یا تجھے وفات دے دیں تو (ہر صورت) تیرا کام صرف کھول کھول کر پہنچا دینا ہے اور حساب ہمارے ذمہ ہے۔",
        "v5": {
            "text": "And [a]whether We make thee see <i>the fulfilment of</i> some of the things with which We threaten them or <i>whether</i> We make thee die, <i>it makes little difference</i>, for [b]on thee lies only the delivery <i>of the Message</i>, and on Us the reckoning.[1651]",
            "notes": [
                {
                    "ref": "a",
                    "note": "10:47; 40:78."
                },
                {
                    "ref": "b",
                    "note": "21:45."
                },
                {
                    "ref": "1651",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse purports to say that when the object of signs of punishment is the reformation and reclamation of the people, the postponement or cancellation of some of them cannot reasonably be criticized. The real object of the advent of the Prophets is to deliver the Divine Message to men, and the fulfilment or postponement or revocation of a prophecy is only a secondary thing, being subordinate to this supreme purpose. It should, therefore, occasion no surprise if, in harmony with the fulfilment of this purpose and of the Divine decree, a prophecy is cancelled or revoked, particularly when all people have to appear before God on the Day of Reckoning when the whole truth will come to light. This verse is important inasmuch as it lays down a fundamental divine principle about signs of punishment. To think that as signs of punishment proceed from God they must always happen as foretold is simply absurd and, besides clashing with the Divine attribute of mercy, belies the very purpose for which Prophets of God are raised.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 42,
        "v_": 41,
        "topics": [
            {
                "id": 3825,
                "topic": "Attributes of Allah: Sari‘ul-Hisab (Quick to Reckon)",
                "verses": "3:200, 2:203, 3:20, 5:5, 14:52, 24:40, 40:18"
            },
            {
                "id": 9518,
                "topic": "Islam: triumph of",
                "verses": "110:2-4, 9:33, 17:82, 21:45, 78:19-21"
            }
        ],
        "ar": "اَوَ لَمۡ  یَرَوۡا اَنَّا نَاۡتِی الۡاَرۡضَ نَنۡقُصُہَا مِنۡ اَطۡرَافِہَا ؕ وَ اللّٰہُ یَحۡکُمُ  لَا مُعَقِّبَ لِحُکۡمِہٖ ؕ وَ ہُوَ  سَرِیۡعُ  الۡحِسَابِ ﴿۴۲﴾ ",
        "ur": "کیا انہوں نے غور نہیں کیا کہ یقیناً ہم زمین کو اس کے کناروں سے گھٹائے چلے آرہے ہیں۔ اور اللہ ہی فیصلہ کرتا ہے۔ اس کے فیصلہ کو ٹالنے والا کوئی نہیں اور وہ حساب (لینے) میں بہت تیز ہے۔",
        "v5": {
            "text": "Do they not see that [b]We are visiting the land, reducing it from its outlying borders? And Allah judges; there is none to reverse His judgement. And He is swift at reckoning.[1652]",
            "notes": [
                {
                    "ref": "b",
                    "note": "21:45."
                },
                {
                    "ref": "1652",
                    "note": "<p><strong>Commentary:</strong></p><p>This verse strongly refutes those critics of the Holy Prophet who allege that he showed no sign.</p><p>Do they not see, says the verse, that God is gradually reducing and curtailing the land from its sides? Is not that a sign of the triumph of Islam? It is making inroads into every home and into all sections and stations of society—the high and the low, the rich and the poor, the slave and the master. Is not this a sign sufficient to convince all fair-minded critics? The word الارض (land) may also refer to \"the land of Arabia,\" in which case the verse would mean that Islam is fast spreading throughout the length and breadth of Arabia. As the expression اتی الله according to Arabic usage also means the visitation of God with punishment (see 2:211 &amp; 16:27), the words, <i>We are visiting the land</i>, <i>reducing</i> <i>it</i>, may mean that the punishment of God is already slowly but surely coming down on all sections of the people.</p><p>The words, <i>swift at reckoning</i>, do not mean that, God is hasty in punishing disbelievers but that, when He decides to call the offenders to account, He does it quickly and nothing can prevent Him from doing so.</p>"
                }
            ]
        }
    },
    {
        "ch": 13,
        "v": 43,
        "v_": 42,
        "topics": [
            {
                "id": 9792,
                "topic": "Jaza’: recompense: of disbelievers, Jews, wrongdoers, Satan",
                "verses": "6:147, 2:86, 2:104, 2:207, 3:88, 4:94, 4:135, 5:30, 5:34, 5:61, 6:140, 7:114, 7:153, 7:171, 9:26, 9:82, 9:95, 17:64, 17:99, 18:107, 20:128, 39:25, 41:29, 48:17, 59:18, 68:47"
            },
            {
                "id": 13986,
                "topic": "Plot: Plan, <i>Makar</i>",
                "verses": "3:55, 4:109, 6:124, 7:100, 7:124, 8:31, 10:22, 12:6, 13:34, 14:47, 16:27, 16:46, 27:51-52, 34:34, 35:11, 35:44, 40:46, 52:43, 71:23"
            }
        ],
        "ar": "وَ قَدۡ مَکَرَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ فَلِلّٰہِ الۡمَکۡرُ  جَمِیۡعًا ؕ یَعۡلَمُ  مَا تَکۡسِبُ کُلُّ نَفۡسٍ ؕ وَ سَیَعۡلَمُ  الۡکُفّٰرُ  لِمَنۡ  عُقۡبَی الدَّارِ ﴿۴۳﴾ ",
        "ur": "اور یقیناً ان سے پہلے لوگوں نے بھی مکر کئے تھے۔ پس ہر مکر کلیّۃً اللہ ہی کے اختیار میں ہے۔ وہ جانتا ہے جو ہر جان کماتی ہے۔ اور ضرور انکار کرنے والے جان لیں گے کہ گھر کا (بہترین) انجام کس کا ہے۔",
        "v5": {
            "text": "And those who were before them [a]did <i>also</i> devise plans but all <i>effective</i> devising of plans belongs to Allah. He knows what every soul earns; and the disbelievers shall soon know [b]whose will be the final reward of <i>this</i> abode.[1653]",
            "notes": [
                {
                    "ref": "a",
                    "note": "3:55; 8:31; 14:47; 27:51."
                },
                {
                    "ref": "b",
                    "note": "28:38."
                },
                {
                    "ref": "1653",
                    "note": "<p><strong>Commentary:</strong></p><p>The verse means that God knows the plans that disbelievers devise to frustrate the purpose and programme of the Holy Prophet, but they are not aware of the plans which God has devised to bring about their fall. Therefore, it is only when they face destruction that they will know who was destined to succeed in the end.</p><p>The words, <i>the disbelievers shall soon know whose will be the final reward of this abode</i>, not only signify that believers will certainly succeed in the end, which is not distant, but also hint that some leaders of disbelief will live to see Islam triumph, and this is exactly what happened.</p><p>The words, <i>He knows what every soul earns</i>, mean that since God is All-Knowing all the secret designs of the enemies of Islam are known to Him and so no plan or stratagem can frustrate His purpose.</p>"
                }
            ]
        }
    }
]
